{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 94,
  "globalPageIndex": 892,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-480/SA-480M (ASTM A480/ A480M) ASME BPVC.II.A-2025 \n13. Finish for Plates \n13.1 The types of finish available on plates are: \n13.1.1 Hot-rolled or Cold-rolled, and Annealed or Heat \nTreated-Scale not removed, an intermediate finish. Use of \nplates in this condition is generally confined to heat-resisting \napplications. Scale impairs corrosion resistance. \n13.1.2 Hot-rolled or Cold-rolled, and Annealed or Heat \nTreated, and Blast Cleaned or Pickled-Condition and finish \ncommonly preferred for corrosion-resisting and most heat­\nresisting applications, essentially a No. 1 finish. \n13.1.3 Hot-rolled or Cold-rolled, and Annealed or Heat \nTreated, and Su,face Cleaned and Polished-Polish finish is \ngenerally No. 4 finish. \n13.1.4 Hot-rolled or Cold-rolled, and Annealed or Heat \nTreated, and Descaled, and Temper Passed-Smoother finish \nfor specialized applications. \n13.1.5 Hot-rolled or Cold-rolled, and Annealed or Heat \nTreated, and Descaled; and Cold-rolled, and Annealed or Heat \nTreated, and Descaled, and Optionally Temper Passed­\nSmooth finish with greater freedom from surface imperfections \nthan in 13.1.4. \n14. Edges for Cold-rolled Strip \n14.1 The types of edges available on strip products are: \n14.1.1 No. 1 Edge-A rolled edge, either round or square as \nsp1ecified. \n14.1.2 No. 3 Edge-An edge produced by slitting. \n14.1.3 No. 5 Edge-An approximately square edge pro­\nduced by rolling or filing after slitting. \n15. Heat Treatment \n15.1 The heat treatments shown in this section are to be \nfollowed unless otherwise specified in the applicable material \nspecification. Heat treatment thermal cycles shall be separate \nfrom other thermal processing cycles; for example, in-process \nthermal cycles are not permitted as a substitute for the separate \nannealing cycle. \n15.2 Austenitic Types: \n15.2.1 The austenitic types shall be annealed in accordance \nwith Table Al.2. \n15.2.2 The material shall be annealed to meet the mechani­\ncal property requirements of the applicable material specifica­\ntion unless otherwise stated in the material specification. \n15.2.3 Except as indicated in Table Al.2, Series 300, \nXM-15, N08800, S30415, S30815, S31725, S31726, and \nS32615 austenitic chromium-nickel steels, when specified on \nthe purchase order, shall be capable of meeting the test for \nresistance to intergranular corrosion specified in 18.2. \n15.2.4 For grades stabilized with titanium or niobium, refer \nto Note 5. \nNoTE 5-Solution-annealing temperatures above 1950 °P [1066 °C] \ncan impair the resistance to intergranular corrosion after subsequent \nexposure to sensitizing conditions in the stabilized grades, types 309Cb, \n309HCb, 310Cb, 310HCb, 316Ti, 316Cb, 321, 321H, 347, 347H, 348, \n348H, S21640, S31740, S33425, S35140, S35135, and S35125. When \nintergranular corrosion is of concern, the purchaser should specify the \ncorrosion test of 18.2 (to be conducted on sensitized specimens). The \nmanufacturer is permitted, if necessary, use a lower temperature resolution \nanneal or a stabilization anneal after a high temperature solution anneal in \norder to meet corrosion test requirements. Consideration should be given \nto the corrosive media before using a stabilization anneal at less than \n1800 °P [982 °C], as such treatment is not equally effective for all media. \n15.2.5 For the stabilized H types, it is noted that the heat \ntreatment requirements shown in Table Al.2 differ as a \nfunction of whether the material was cold worked or hot \nfinished. \n15.2.6 The chromium-manganese-nickel types (201, 202, \nS20103, S20400, S20153, S21800, S21640, XM-11, XM-17, \nXM-18, XM-19, XM-29, and XM-31) shall be solution an­\nnealed to meet the mechanical property requirements of the \napplicable material specification and to exhibit adequate resis­\ntance to intergranular corrosion (see 18.2). For S20161, the \nheat treatment is specified in Table Al.2. For S21640, see Note \n5. \n15.2.6.1 Note that some of these types contain high carbon \ncontent that can adversely affect resistance to intergranular \ncorrosion. \n15.3 Duplex Types-The duplex types shall be solution \nannealed in accordance with Table Al.2. \n15.4 Martensitic and Ferritic Types: \n15.4.1 The chromium steels (S32803, 400 Series, S40945, \nS~1045, S41050, S41500, S43932, S44400, S44537, S44635, \nS44660, S44700, S44735, S44800,XM-27, andXM-33) shall \nbe heat treated in such a manner as to satisfy all the require­\nments for mechanical and bending properties specified in the \napplicable material specification and ( except for 400 Series, \nS41050, and S41500) to provide for adequate resistance to \nintergranular attack. \n790 \n15.4.2 For S41500, heat to 1750 °F [955 °C] minimum, air \ncool to 200 °F [93 °C] or lower prior to any optional interme­\ndiate temper and prior to final temper. The final temper shall be \nbetween 1050 °F and 1150 °F [566 °C and 621 °C]. \n16. Number of Tests \n16.1 Unless otherwise specified by the applicable material \nspecification or by agreement between the seller and the \npurchaser to perform a greater number of tests, the following \nnumber of tests are to be performed. \n16.1.1 In the case of plate, sheet, and strip produced in coil \nform, two or more hardness tests ( one from each end of the \ncoil); one bend test, when required; one permeability test, when \nrequired; and one or more tension tests shall be made on \nspecimens taken from each coil. If the hardness difference \nbetween the two ends of the coil exceeds 5 HRB, or equivalent, \nor if the material is temper rolled, tensile properties must be \ndetermined on both coil ends. \n16.1.2 In the case of plate, sheet, or strip produced in cut \nlengths, one tension test; two tension tests if the material is \ntemper rolled (one tension test for single piece lots); one bend \ntest when required, and one or more hardness tests shall be \nmade on each 100 or less pieces of the same heat and nominal \nthickness rolled separately or continuously and heat treated \nwithin the same operating period, either as a lot or continu­\nously. \nNO'IE 6--The term continuously, as applied to heat treatment is meant \nto describe a heat-treating operation in which one cut length follows ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0892.json",
  "tabulaTablesCsv": "tables_tabula/page-0892.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0892.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6155,
  "bestTextAlphaRatio": 0.71,
  "noteOcrPath": "note_ocr/page-0892.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0892.txt",
  "noteOcrHighDpiCount": 1,
  "noteOcrHighDpiNotes": [
    "Note 5—Solution-annealing temperatures above 1950 °F [1066 °C]"
  ]
}