{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 696,
  "globalPageIndex": 696,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-376/SA-376M ASME BPVC.II.A-2025 \nS6. Ultrasonic Test \nS6.1 Each piece of pipe may be ultrasonically tested to \ndetermine its soundness throughout the entire length of the \npipe. Each piece shall be ultrasonically tested in a circumfer­\nential direction in such a manner that the entire piece is \nscanned by the ultrasonic beam. The calibration standard shall \nbe prepared from a section of pipe which has two notches, one \nin the inside surface and one in the outside smface. The notches \nshall be at least 1 ½-in. [38-mm] long and have a depth of 3 % \nof the wall thickness, or 0.004 in. [0.102 mm], whichever is the \ngreater. Any pipe showing an ultrasonic indication of greater \namplitude than the amplitude of the indication from the \ncalibration standard shall be subject to rejection. \nS7. Hot Ductility Test for Indicating Weldability \nS7 .1 A high-temperature ductility test may be made upon \neach heat of mate1ial supplied in heavy-wall pipe sections. An \nappropriate specimen shall be heated to an initial temperature, \ncooled 100 °P [50 °C], then subjected to a tension test, and \nshall show a minimum reduction of area of 60 %. The initial \ntemperature is that temperature 50 °P [30 °C] below the \ntemperature at which material exhibits zero ductility. Rejection \nof material shall not be based upon this test. \nS8. Retests \nS8.l Upon the purchaser's request, retests shall be made \nfrom sections of material removed from any part of the pipe. \nFailure to meet the requirements stated in this specification \nshall be cause for rejection. \nS9. Stabilization Heat Treatment \nS9.1 Subsequent to the solution anneal required in 5.4, \nGrades TP321, TP321H, TP347, TP347H, TP348, and TP348H \nshall be given a stabilization heat treatment at a temperature \nlower than that used for the initial solution annealing heat \ntreatment. The temperature of stabilization heat treatment shall \nbe at a temperature as agreed upon between the purchaser and \nvendor. \nS10. Intergranular Corrosion Test \nS 10.1 When specified, material shall pass intergranular \ncorrosion tests conducted by the manufacturer in accordance \nwith Practices A262, Practice E. \nNoTE S 10.1-Practice E requires testing on the sensitized condition for \nlow carbon or stabilized grades, and on the as-shipped condition for other \ngrades. \nSI0.2 A stabilization heat treatment in accordance with \nSupplementary Requirement S9 may be necessary and is \npermitted in order to meet this requirement for the grades \ncontaining titanium or columbium, particularly in their H \nversions. \n646 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0696.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2555,
  "bestTextAlphaRatio": 0.762
}