{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 625,
  "globalPageIndex": 1423,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-841/SA-841M \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall not apply unless specified in the order. \nA list of standardized supplementary requirements for use at the option of the purchaser are included \nin Specification A20/A20M. Several of those that are considered suitable for use with this \nspecification are listed in this section by title. Other tests may be performed by agreement between the \nsupplier and the purchaser. \nS 1. Vacuum Treatment, \nS2. Product Analysis, \nS3. Simulated Post-Weld Heat Treatment of Mechanical \nTest Coupons, \nS5. Charpy V-Notch Impact Test, \nS6. Drop Weight Test (for Material 0.625 in. [16 mm] and \nOver in Thickness), \nS7. High-Temperature Tension Test, \nS8. Ultrasonic Examination in accordance with Specifica­\ntion A435/A435M, \nS9. Magnetic Particle Examination, \nS 10. Charpy V-Notch Test Curve, \nS 11. Ultrasonic Examination in accordance with Specifica­\ntion A577/A577M, \nS12. Ultrasonic Examination in accordance with Specifica-\ntion A578/A578M, \nS13. NDT Temperature Determination, \nS17. Vacuum Carbon-Deoxidized Steel, \nS18. Unspecified Elements, and \nS19. Restricted Chemical Requirements. \nADDITIONAL SUPPLEMENTARY REQUIREMENTS \nAlso listed are additional supplementary requirements suitable for use with this specification. \nS55. Longitudinal Charpy Impact Energy Absorption Re­\nquirement \nS55.1 Longitudinal Charpy V-notch tests shall be made in \naccordance with Specification A20/A20M. Unless the test \ntemperature is specified in the purchase order, the tests shall be \nconducted at -320°F [-195°C] and the average absorbed \nenergy for each set of three full size specimens shall be 25 ft-lb \n[34 JJ or more, and the individual test value of not more than \none specimen may be below 25 ft-lb [34 J], but in no case \nbelow 20 ft-lb [27 J]. \nS56. Transverse Charpy Impact Energy Absorption Re­\nquirement \nS56.1 Transverse Charpy V-notch tests shall be made in \naccordance with Specification A20/A20M. Unless the test \ntemperature is specified in the purchase order, the tests shall be \nconducted at -320°F [-195°CJ and the average absorbed \nenergy for each set of three full size specimens shall be 20 ft-lb \n[27 J] or more, and th.e individual test value of not more than \none specimen may be below 20 ft-lb [27 J], but in no case \nbelow 15 ft-lb [20 JJ. \nS64. Heat Treatment Parameters for Grad G \nS64.1 Except for the TMR-I-T process, the plates shall be \ncooled directly after rolling without being allowed to cool \nbelow 1025°F [550°CJ. Quenching hardening shall be initiated \nfrom a temperature within the range from 1025 to 1490°F [550 \nto 810°C]. \nS64.2 Subsequent to quenching, the plates shall be tem­\npered within the range from 1030 to 1155°F [555 to 625°C], \nholding at that temperature for a minimum of 30 min/in. [1.2 \nmin/mm] of thickness but for not less than 15 min, and then \ncooling at a rate of not less than 300°F/h [165°C/h], either in \nair or by quenching in water, to ambient temperature. \nS64.3 Prior to the tempering treatment, the plates may be \nsubjected to an intermediate heat treatment (Note S64.1) \nconsisting of heating to a temperature in the range from 1185 \nto 1310°F [640 to 710°C], holding at that temperature for a \nminimum of 1 hr/in. [2.4 min/mm] of thickness, but in no case \nless than 15 min, and then water-quenching to below 300°F \n[150°C] in the case of plate thicknesses of more than 5/s in. [16 \nmm]; or cooling in air or water-quenching in the case of plate \nthickness of 5/s in. [16 mm] and under. \nNOTE S64.1-The intermediate heat treatment is for the purpose of \nenhancing elongation and notch-toughness and for reducing susceptibility \nto strain-aging embrittlement and temper embrittlement. It may be \nperformed at the option of the material manufacturer or may be specified \nby the purchaser. \nS64.4 Heat treatment temperatures and times shall be re­\nported in accordance with Section 19 of Specification A20/ \nA20M. \nS77. Carbon Equivalent Limit \nS77.1 The carbon equivalent, on heat analysis, shall not \nexceed the limits listed in this section when based on the \nfollowing equation: \nCE= C+Mn/6+(Cr+Mo+V)l5+(Cu+Ni)l15% \n[Grade A] \nt = 2 in. [50 mm] and under in thickness \nt > 2 in. [50 mm] in thickness \n[Grade BJ \nt = 2 in. [50 mm] and under in thickness \nt > 2 in. [50 mm] In thickness \n1361 \n0.40% \n0.45% \n0.45 % \n0.50% ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-1423.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4373,
  "bestTextAlphaRatio": 0.711
}