{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 528,
  "globalPageIndex": 528,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-325 ASME BPVC.11.A-2025 \ndip, mechanically deposited, Zinc/Aluminum Corrosion Pro­\ntective Coating, or no preference. \n4.3.2 When hot-dip is specified, the fasteners shall be \nzinc-coated by the hot-dip process and the coating shall \nconform to the coating weight/thickness and performance \nrequirements of Specification F2329. \n4.3.3 When mechanically deposited is specified, the fasten­\ners shall be zinc-coated by the mechanical deposition process \nand the coating shall conform to the coating weight/thickness \nand performance requirements of Class 55 of Specification \nB695. \n4.3.4 When Zinc/Aluminum Corrosion Protective Coating \nis specified, the coating shall conform to the coating weight/ \nthickness and performance requirements of Grade 3 of Speci­\nfication Fl136. \n4.3.5 When no preference is specified, the supplier shall \nfurnish either a hot-dip zinc coating in accordance with \nSpecification F2329, a mechanically deposited zinc coating in \naccordance with Specification B695, Class 55, or a Zinc/ \nAluminum Corrosion Protective Coating in accordance with \nSpecification F1136, Grade 3. Threaded components (bolts and \nnuts) shall be coated by the same zinc-coating process and the \nsupplier's option is limited to one process per item with no \nmixed processes in a lot. \n4.4 Lubrication-When zinc-coated nuts are ordered with \nthe bolts, the nuts shall be lubricated in accordance with \nSpecification A563, Supplementary Requirement Sl, to mini­\nmize galling. \n4.5 Secondary Processing: \n4.5.1 If any processing, which can affect the mechanical \nproperties or performance of the bolts, is performed after the \ninitial testing, the bolts shall be retested for all specified \nmechanical properties and performance requirements affected \nby the reprocessing. \n4.5.2 When the secondary process is heat treatment, the \nbolts shall be tested for all specified mechanical prope1ties. Hot \ndip zinc-coated bolts shall be tested for all specified mechani­\ncal prope1ties and rotational capacity. If zinc-coated nuts are \nrelubricated after the initial rotational capacity tests, the \nassemblies shall be retested for rotational capacity. \n5. Chemical Composition \n5.1 Type 1 bolts shall be plain carbon steel, carbon boron \nsteel, alloy steel or alloy boron steel at the manufacturer's \noption, conforming to the chemical composition specified in \nTable 1. \n5.2 Type 3 bolts shall be weathering steel and shall conform \nto one of the chemical compositions specified in Table 2. The \nselection of the chemical composition, A, B, C, D, E, or F, shall \nbe at the option of the bolt manufacturer. See Guide G 101 for \nmethods of estimating the atmospheric corrosion resistance of \nlow alloy steels. \n5.3 Product analyses made on finished bolts representing \neach lot shall conform to the product analysis requirements \nspecified in Tables 1 and 2, as applicable. \n476 \nTABLE 1 Chemical Requirements for Type 1 Bolts \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nBoron \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nAlloying Elements \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nBoron \nAlloying Elements \nCarbon Steel \nHeat \nAnalysis \n0.30-0.52 \n0.60 \n0.040 \n0.050 \n0.15-0.30 \nProduct \nAnalysis \n0.28-0.55 \n0.57 \n0.048 \n0.058 \n0.13-0.32 \nCarbon Boron Steel \nHeat Product \nAnalysis \n0.30--0.52 \n0.60 \n0.040 \n0.050 \n0.10-0.30 \n0.0005-0.003 \nHeat \nAnalysis \n0.30-0.52 \n0.60 \n0.035 \n0.040 \n0.15-0.35 \nA \nAlloy Steel \nAnalysis \n0.28-0.55 \n0.57 \n0.048 \n0.058 \n0.08-0.32 \n0.0005-0.003 \nProduct \nAnalysis \n0.28-0.55 \n0.57 \n0.040 \n0.045 \n0.13--0.37 \nA \nAlloy Boron Steel \nHeat Product \nAnalysis \n0.30--0.52 \n0.60 \n0.035 \n0.040 \n0.15-0.35 \n0.0005-0.003 \nA \nAnalysis \n0.28-0.55 \n0.57 \n0.040 \n0.045 \n0.13-0.37 \n0.0005-0.003 \nA \nA Steel, as defined by the American Iron and Steel Institute, shall be considered \nto be alloy when the maximum of the range given for the content of alloying \nelements exceeds one or more of the following limits: Manganese, 1.65 %; silicon, \n0.60 %; copper, 0.60 % or in which a definite range or a definite minimum quantity \nof any of the following elements is specified or required within the limits of the \nrecognized field of constructional alloy steels: aluminum, chromium up to 3.99 %, \ncobalt, columbium, molybdenum, nickel, titanium, tungsten, vanadium, zirconium, \nor any other alloying elements added to obtain a desired alloying effect. \n5 .4 Heats of steel to which bismuth, selenium, tellurium, or \nlead has been intentionally added shall not be permitted for \nbolts. \n5.5 Compliance with 5.4 shall be based on certification that \nheats of steel having any of the listed elements intentionally \nadded were not used to produce the bolts. \n5.6 Chemical analyses shall be performed in accordance \nwith Test Methods, Practices, and Terminology A751. \n6. Mechanical Properties \n6.1 Hardness-The bolts shall conform to the hardness \nspecified in Table 3. \n6.2 Tensile Properties: \n6.2.1 Except as permitted in 6.2.1.1 for long bolts and \n6.2.1.2 for short bolts, sizes 1.00 in. and smaller having a \nnominal length of 2¼D and longer, and sizes larger than 1.00 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0528.json",
  "tabulaTablesCsv": "tables_tabula/page-0528.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0528.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5235,
  "bestTextAlphaRatio": 0.7068
}