{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 665,
  "globalPageIndex": 665,
  "width": 601.08,
  "height": 845.28,
  "text": "ASME BPVC.11.A-2025 SA-370 \nEJ \nDIMENSIONS \nDimensions, in. \nSpecimen No. \nA B C D \n1 ½±0.D15 \n2 ¾ ± 0.031 \n111,s approximately \n1 approximately \n2 ± 0.005 \n2 ± 0.005 \n4 ± 0.005 \n2 ± 0.005 \n4 ± 0.005 \n2 ± 0.010 \n4 ± 0.015 \n8 ± 0.020 \n1 ± 0.003 \n2¼ min \n2¼min \n4½min \n2¼min \n4½ min \n2¼min \n4½min \n3 1± 0.062 \n4 1½ ± .125 \n1 ½ approximately \n2 approximately \n9 min \n5 ¼ ± .002 % approximately 1 ¼ min \nNorn I-Cross-sectional area may be calculated by multiplying A and t. \nNorn 2-The dimension t is the thick11ess of the test specimen as provided for in the applicable material specifications. \nNoTE 3-The reduced section shall be parallel within 0.010 in. and may have a gradual taper in width from the ends toward the center, with the ends \nnot more than 0.010 in. wider than the center. \nNorn 4-The ends of the specimen shall be symmetrical with the center line of the reduced section within 0.10 in. \nNorn 5-Metric equivalent: 1 in. = 25.4 mm. \nNorn 6-Specimens with sides parallel throughout their length are permitted, except for referee testing, provided: (a) the above tolerances are used; \n(b) an adequate number of marks are provided for determination of elongation; and (c) when yield strength is determined, a suitable extensometer is used. \nIf the fracture occurs at a distance of less than 2A from the edge of the gripping device, the tensile properties determined may not be representative of \nthe material. If the properties meet the minimum requirements specified, no further testing is required, but if they are less than the minimum requirements, \ndiscard the test and retest. \nNorn ?-Specimen 5 is intended for testing specimens removed from an in-service product. Specimen 5 shall not be used for conformance testing of \nnew product. Acceptance criteria for elongation values obtained from 1 in. gauge length specimens shall be determined by agreement between the \nresponsible parties. \nFIG. A2.3 Dimensions and Tolerances for Longitudinal Strip Tension Test Specimens for Tubular Products \nA \nFIG. A2.4 Location of Transverse Tension Test Specimens in \nRing Cut from Tubular Products. \nthrough the pressure line under the control of a suitable valve. \nAn accurately calibrated pressure gauge serves to measure oil \npressure. Any air in the system is removed through the bleeder \nline. As the oil pressure is increased, the rubber gasket expands \nwhich in turn stresses the specimen circumferentially. As the \npressure builds up, the lips of the rubber gasket act as a seal to \nprevent oil leakage. With continued increase in pressure, the \nring specimen is subjected to a tension stress and elongates \naccordingly. The entire outside circumference of the ring \nspecimen is considered as the gauge length and the strain is \nmeasured with a suitable extensometer which will be described \nlater. When the desired total strain or extension under load is \nreached on the extensometer, the oil pressure in pounds per \nsquare inch is read and by employing Barlow's formula, the \nunit yield strength is calculated. The yield strength, thus \ndetermined, is a true result since the test specimen has not been \n613 \n3\"Mln \nRad 1\" Min \nNorn 1-The dimension t is the thickness of the test specimen as \nprovided for in the applicable material specifications. \nNorn 2-The reduced section shall be parallel within 0.010 in. and may \nhave a gradual taper in width from the ends toward the center, with the \nends not more than 0.010 in. wider than the center. \nNorn 3-The ends of the specimen shall be symmetrical with the center \nline of the reduced section within 0.10 in. \nNorn 4-Metric equivalent: 1 in. = 25.6 mm. \nFIG. A2.5 Transverse Tension Test Specimen Machined From \nRing Cut from Tubular Products \ncold worked by flattening and closely approximates the same \ncondition as the tubular section from which it is cut. Further, \nthe test closely simulates service conditions in pipe lines. One \ntesting machine unit may be used for several different sizes of \npipe by the use of suitable rubber gaskets and adapters. \nNorn A2.3-Barlow's formula may be stated two ways: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0665.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4078,
  "bestTextAlphaRatio": 0.7401
}