{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 408,
  "globalPageIndex": 408,
  "width": 625.68,
  "height": 863.76,
  "text": "SA-249 /SA-249M ASME BPVC.II.A-2025 \nSpecification for \nWelded Austenitic Steel Boiler, Superheater, Heat­\nExchanger, and Condenser Tubes \n1. Scope \n1.1 This specification covers nominal-wall-thickness \nwelded tubes and heavily cold worked welded tubes made from \nthe austenitic steels listed in Table 1, with various grades \nintended for such use as boiler, superheater, heat exchanger, or \ncondenser tubes. \n1.2 Grades TP304H, TP309H, TP309HCb, TP310H, \nTP310HCb, TP316H, TP321H, TP347H, and TP348H are \nmodifications of Grades TP304, TP309S, TP309Cb, TP310S, \nTP310Cb, TP316, TP321, TP347, and TP348, and are intended \nfor high-temperature service such as for superheaters and \nreheaters. \n1.3 The tubing sizes and thicknesses usually furnished to \nthis specification are 1/s in. [3.2 mm] in inside diameter to 12 in. \n[304.8 mm] in outside diameter and 0.015 to 0.320 in. [0.4 to \n8.1 mm], inclusive, in wall thickness. Tubing having other \ndimensions may be furnished, provided such tubes comply \nwith all other requirements of this specification. \n1.4 Mechanical property requirements do not apply to \ntubing smaller than 1/s in. [3.2 mm] in inside diameter or 0.015 \nin. [0.4 mm] in thickness. \n1.5 Optional supplementary requirements are provided and, \nwhen one or more of these are desired, each shall be so stated \nin the order. \n1.6 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.7 The following safety hazards caveat pertains only to the \ntest method described in the Supplementary Requirements of \nthis specification. This standard does not purport to address all \nof the safety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. A \nspecific warning statement is given in Supplementary Require­\nment S7, Note S7.1. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n356 \n2. Referenced Documents \n2.1 ASTM Standards: \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA480/ A480M Specification for General Requirements for \nFlat-Rolled Stainless and Heat-Resisting Steel Plate, \nSheet, and Strip \nAl016/Al016M Specification for General Requirements for \nFerritic Alloy Steel, Austenitic Alloy Steel, and Stainless \nSteel Tubes \nE112 Test Methods for Determining Average Grain Size \nE213 Practice for Ultrasonic Testing of Metal Pipe and \nTubing \nE273 Practice for Ultrasonic Testing of the Weld Zone of \nWelded Pipe and Tubing \nE527 Practice for Numbering Metals and Alloys in the \nUnified Numbering System (UNS) ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0408.json",
  "tabulaTablesCsv": "tables_tabula/page-0408.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0408.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3390,
  "bestTextAlphaRatio": 0.754
}