{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 741,
  "globalPageIndex": 741,
  "width": 601.08,
  "height": 845.28,
  "text": "ASME BPVC.II.A-2025 SA-409 /SA-409M \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified in the \npurchase order. The purchaser may specify a different frequency of test or analysis than is provided \nin the supplementary requirement. Subject to agreement between the purchaser and manufacturer, \nretest and retreatment provisions of these supplementary requirements may also be modified. \nSl. Product Analysis \nS 1.1 At the request of the purchaser a product analysis of \none coupon representing finished sheet or plate from each heat \nshall be made by the pipe manufacturer. The drillings for \nproduct analysis may be taken from shear crop or test speci­\nmens. The results of product analysis shall conform to the \nrequirements in Table 1 and shall be reported to the purchaser. \nS2. Radiographic Examination \nS2.1 Weld soundness shall be determined through radio­\ngraphic examination made in accordance with requirements as \nagreed upon between the pipe manufacturer and purchaser. \nS3. Corrosion Requirements \nS3.l Boiling Nitric Acid Test-Except for Grade TP321, \ncoupons representing finished pipe made of nonmolybdenum­\nbearing material (0.50 % and less molybdenum) shall meet the \nrequirement of the boiling nitric acid test conducted according \nto Practice C of Practices A262. The condition of the test \nspecimens and the corrosion rates are as follows: Type 347 and \nType 348 shall be tested in the sensitized condition (heated for \n1 h at 1240 °F [675 °C]) and the rate of penetration shall not \nexceed 0.0020 in. [0.05 mm]/month. All other \nnonmolybdenum-bearing types, except for Grade TP321, \nshown in Table 1 shall be tested in the annealed and unsensi­\ntized condition and the rate of penetration shall not exceed \n0.0015 in. [0.04 mm]/month. \nS3.2 Acidified Copper Sulfate Test-Coupons representing \nfinished pipe made of molybdenum-bearing material and Type \n321 (over 0.50 % molybdenum) shall meet the requirements of \nthe copper-copper sulfate-sulfuric acid test (intergranular cor­\nrosion test) conducted in accordance with Practice E of \nPractices A262. The condition of the test specimen is as \nfollows: All molybdenum-bearing types shown in Table 1 shall \nbe tested in the annealed and unsensitized condition. Type 321 \nshall be tested in the sensitized condition (heated for 1 h at \n1240 °F [675 °C]). All specimens shall meet the requirements \nof the prescribed bend test. \nS4. Ferrite Control of Weld Deposits \nS4.l The ferrite content of the deposited weld metal in any \nlength of pipe may be determined. The procedural details \npertaining to this subject (that is, welding, plate and weld \ndeposit chemistry, testing equipment and method, number and \nlocation of test sites, and ferrite control limits) shall be a matter \nfor agreement between the purchaser and the manufacturer. \nSS. Stabilizing Heat Treatment \nS5.1 Subsequent to the heat treatment required in 5.3, \nGrades TP321, TP347, and TP348 shall be given a stabilization \nheat treatment at a temperature lower than that used for the \ninitial solution annealing heat treatment. The temperature of \nstabilization heat treatment shall be at a temperature as agreed \nupon between the purchaser and vendor. \nS6 Intergranular Corrosion Test \nS6.1 When specified, material shall pass intergranular cor­\nrosion tests conducted by the manufacturer in accordance with \nPractices A262, Practice E. \nNoTE S6.1-Practice E requires testing on the sensitized condition for \nlow carbon or stabilized grades, and on the as-shipped condition for other \ngrades. \nS6.2 A stabilization heat treatment in accordance with \nSupplementary Requirement S5 may be necessary and is \npermitted in order to meet this requirement for the grades \ncontaining titanium or columbium. \nS7. ASME Section III or Section VIII, Division 1, Code \nConstruction \nS7 .1 All products furnished under this SA specification are \nintended for application under the rules of Section III or for \napplication under the rules of Section VIII-1. Furnishing of \nsuch products is limited to manufacturers who hold the \nappropriate ASME Certification Mark. Weld procedures, \nwelders, and welding machine operators shall be qualified in \naccordance with ASME Boiler and Pressure Vessel Code, \nSection IX. \nS7 .2 The product shall meet all applicable requirements of \nSection III or Section VIII, Division 1, if applicable, including \nthose requirements pertaining to heat treatment and butt welds. \nAuthorized inspection at the point of manufacture and appli­\ncation of the appropriate Certification Mark is required. \nS7.3 The applicable ASME partial data report form, signed \nby an authorized inspector, and a ce1tified mill test report shall \nbe furnished for each lot of pipe. The term \"lot\" applies to all \npipe of the same mill heat of material and wall thickness which \nis heat treated in one furnace charge. For pipe which is not heat \ntreated or which is heat treated in a continuous furnace, a lot \nshall consist of each 200 ft [61 m] or fraction thereof of all pipe \nof the same null heat of material and wall thickness, subjected \nto the same heat treatment. For pipe which is heat treated in a \nbatch-type furnace which is automatically controlled within a \n50 °F range and is equipped with recording pyrometer so that \nthe heating records are available, a lot may be defined the same \nas for continuous furnaces. \n691 \nS7.4 Each length of pipe shall be marked in such a manner \nas to identify each such piece with the \"lot\" and the represen­\ntative certified mill test report. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0741.json",
  "tabulaTablesCsv": "tables_tabula/page-0741.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0741.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5585,
  "bestTextAlphaRatio": 0.778
}