{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 301,
  "globalPageIndex": 301,
  "width": 604.32,
  "height": 847.68,
  "text": "ASME BPVC.II.A-2025 SA-194/SA-194M \nF1940 Test Method for Process Control Verification to \nPrevent Hydrogen Embrittlement in Plated or Coated \nFasteners \nF1941/F1941M Specification for Electrodeposited Coatings \non Mechanical Fasteners, Inch and Metric \nF2329/F2329M Specification for Zinc Coating, Hot-Dip, \nRequirements for Application to Carbon and Alloy Steel \nBolts, Screws, Washers, Nuts, and Special Threaded \nFasteners \n2.2 ASME Standards: \nB 1.1 Unified Screw Threads \nB 1.2 Gages and Gaging for Unified Inch Screw Threads \nB 1.13M Metric Screw Threads \nB 18.2.2 Square and Hex Nuts \nB 18.2.4.6M Metric Heavy Hex Nuts \n3. Terminology \n3.1 Definitions of Terms Specific to This Standard: \n3.1.1 Austenitic Grades-All grades with a prefix of \"8\" or \n\"9.\" \n3.1.2 Ferritic Grades-Grades 1, 2, 2H, 2HM, 3, 6, 6F, 7, \n7M, 43, and 16. \n3.1.3 Lot-Unless otherwise specified (see Discussion \nbelow), a lot is the quantity of nuts of a single nominal size and \ngrade produced by the same manufacturing process. \n3.1.3.1 Discussion-When Supplementary Requirement S5 \nis invoked on the purchase order, the following definitions of a \nlot shall apply: \n3.1.3.2 For Grade 8 Nuts-The quantity of all the nuts of a \nsingle nominal diameter and grade made from the same heat of \nsteel and made by the same manufacturing process. \n3.1.3.3 For All Other Grade Nuts-(see 8.2 and \n8.1.2.1)-All the nuts of a single nominal diameter and grade \nmade from the same heat number and heat treated in the same \nbatch if batch-type heat treating equipment is used or heat \ntreated in the same continuous run of not more than 8 h under \nthe same conditions if continuous-type heat treating equipment \nis used. \n3.1.4 Type: \n3.1.4.1 For Grade 8 Nuts-Variations within the grade \ndesignated by a letter and differentiated by chemistry and by \nmanufacturing process. \n3.1.4.2 For Grade 6 Nuts-Variations within the grade \ndesignated by the letter F as differentiated by chemical addi­\ntions made for machineability. \n3.1.5 Series-The dimensional relationship and geometry of \nthe nuts as described in ASME B 18.2.2 for inch nuts or ASME \nB 18.2.4.6M for metric nuts. \n4. Ordering Information \n4.1 The inquiry and order for bolting material and bolting \ncomponents under this specification shall include the following \nas required to describe the items adequately: \n4.1.1 Specification designation, year date, ·and grade, issue \ndate and revision letter, \n4.1.2 Quantity, number of pieces, \n4.1.3 Dimensions (see Section 9), \n4.1.4 Options in accordance with 8.2.2.1, 9.1, 9.2, 10.3, and \n12, and \n4.1.5 Supplementary Requirements, if any. \n4.2 Coatings-Coatings are prohibited unless specified by \nthe purchaser (see Supplementary Requirements S7 and S8). \nWhen coated nuts are ordered, the purchaser should take \nspecial care to ensure that Appendix X2 is thoroughly under­\nstood. \n4.3 See Supplementary Requirement S3 for nuts to be used \nin low temperature applications (Specification A320/A320M). \n4.4 Proof Load Testing-See Supplementary Requirement \nS9 for proof load testing of nuts manufactured to dimensions \nand configurations other than those covered in Tables 3 and 4. \n5. Common Requirements \n5.1 Bolting material and bolting components supplied to \nthis specification shall conform to the requirements of Speci­\nfication A962/ A962M, of which nuts are considered bolting \ncomponents, as are bolts, studs, screws, and washers intended \nfor use in special service applications. These requirements \ninclude test methods, finish, thread dimensions, marking, \ncertification, optional supplementary requirements, and others. \nFailure to comply with the requirements of Specification \nA962/A962M constitutes nonconformance with this specifica­\ntion. In case of conflict between the requirements of this \nspecification and Specification A962/ A962M, this specification \nshall prevail. \n6. Manufacture (Process) \n6.1 Stainless steels for all types of Grade 6 and 8 nuts shall \nbe made by one of the following processes: \n6.1.1 Electric- furnace ( with separate degassing and refining \noptional), \n6.1.2 Vacuum induction furnace, or \n6.1.3 Either of the above followed by electroslag remelting, \nor consumable-arc remelting. \n6.2 The steel producer shall exercise adequate control to \neliminate excessive unhomogeneity, nonmetallics, pipe, \nporosity, and other defects. \n6.3 Grades 1 and 2 nuts shall be hot or cold forged, or shall \nbe machined from hot-forged, hot-rolled, or cold-drawn bars. \n6.3.1 All Grade 1 and 2 nuts shall be stress-relieved at a \ntemperature of at least 1000 °F [538 °C] after forming or \nmachining from bar with the following exceptions: \n6.3.1.1 Nuts made by hot forging. \n249 \n6.3.1.2 Nuts machined from hot-forged or hot-rolled bar. \n6.3.1.3 Nuts machined from hot-forged/hot-rolled and cold-\nfinished (max 10 % reduction in area) bar. \n6.3.1.4 Nuts machined from cold-drawn and annealed (min \n1000 °F [538 °C]) bar. \n6.3.2 Grade 1 and 2 nuts made by hot forging or by \nmachining from hot-forged or hot-rolled bars need not be stress \nrelieved. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0301.json",
  "tabulaTablesCsv": "tables_tabula/page-0301.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0301.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5055,
  "bestTextAlphaRatio": 0.728
}