{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 369,
  "globalPageIndex": 369,
  "width": 597.72,
  "height": 842.88,
  "text": "ASME BPVC.II.A-2025 SA-231/SA-231M \npercentage of elements prescribed in Table 3. This analysis \nshall be made from a test specimen preferably taken during \nthe pouring of the cast or heat. When requested, this shall \nbe reported to the purchaser and shall conform to the \nrequirements of Table 3. \n5.3 Product Analysis (formerly Check Analysis) - An \nanalysis may be made by the purchaser from finished wire \nrepresenting each cast or heat of steel. The chemical com­\nposition thus determined, as to elements required or \nrestricted, shall conform to the product ( check) analysis \nrequirements specified in Table 5 of Specification A 752. \n5.4 For referee purposes, Test Methods, Practices, and \nTerminology A 751 shall be used. \n6. Mechanical Properties \n6.1 Annealed and Cold Drawn - When purchased in \nthe annealed and cold-drawn condition, the wire shall have \nbeen given a sufficient amount of cold working to meet the \npurchaser's coiling requirements and shall be in a suitable \ncondition to respond properly to heat treatment. In special \ncases the hardness, if desired, shall be stated in the pur­\nchase order. \n6.2 Oil Tempered - When purchased in the oil-tem­\npered condition, the tensile strength and minimum percent \nreduction of area, sizes 2.50 mm or 0.105 in. and coarser, \nof the wire shall conform to the requirements as shown in \nTable 1 or Table 2. \n6.2.1 Number of Tests - One test specimen shall be \ntaken for each ten coils, or fraction thereof, in a lot. Each \ncast or heat in a given lot shall be tested. \n6.2.2 Location of Tests - Test specimens shall be \ntaken from either end of the coil. \n6.2.3 Test Method - The tension test shall be made \nin accordance with Test Methods and Definitions A 370. \n6.3 Wrap Test: \n6.3.1 Oil tempered or cold drawn wire 4.00 mm or \n0.162 in. and smaller in diameter shall wind on itself as \nan arbor without breakage. Larger diameter wire up to and \nincluding 8.00 mm or 0.312 in. in diameter shall wrap \nwithout breakage on a mandrel twice the wire diameter. \nThe wrap test is not applicable to wire over 8.00 mm or \n0.312 in. in diameter. \n6.3.2 Number of Tests - One test specimen shall be \ntaken for each ten coils, or fraction thereof, in a lot. Each \ncast or heat in a given lot shall be tested. \n6.3.3 Location of Test - Test specimens shall be \ntaken from either end of the coil. \n6.3.4 Test Method - The wrap test shall be made \nin accordance with Supplement IV of Test Methods and \nDefinitions A 370. \n7. Metallurgical Properties \n7.1 Surface Condition: \n7.1.1 The surface of the wire as received shall be \nfree of rust and excessive scale. No serious die marks, \nscratches, or seams may be present. Based upon examina­\ntion of etched end specimen, seams shall not exceed 3.5% \nof the wire diameter, or 0.25 mm or 0.010 in., whichever \nis the smaller as measured on a transverse section. \n7.1.2 Number of Tests - One test specimen shall be \ntaken for each ten coils, or fraction thereof, in a lot. Each \ncast or heat in a given lot shall be tested. \n7.1.3 Location of Test - Test specimens shall be \ntaken from either or both ends of the coil. \n7.1.4 Test Method - The surface shall be examined \nafter etching in a solution of equal parts of hydrochloric \nacid and water that has been heated to approximately 80° C. \nTest ends shall be examined using lOX magnification. Any \nspecimen which shows questionable seams of borderline \ndepth shall have a transverse section taken from the \nunetched area, properly mounted and polished and exam­\nined to measure the depth of the seam. \n8. Dimensions and Permissible Variations \n8.1 The permissible variations in the diameter of the \nwire shall be as specified in Table 4 or Table 5. \n317 \n9. Workmanship and Appearance \n9.1 Annealed and Cold Drawn -The wire shall not be \nkinked or improperly cast. To test for cast, a few convolu­\ntions of wire shall be cut loose from the coil and placed \non a flat surface. The wire shall lie flat on itself and not \nspring up nor show a wavy condition. \n9.2 Oil Tempered- The wire shall be uniform in quality \nand temper and shall not be wavy or crooked. \n9.3 Each coil shall be one continuous length of wire \nproperly coiled. Welds made prior to cold drawing are \npermitted. If unmarked welds are unacceptable to the pur­\nchaser, special arrangements should be made with the man­\nufacturer at the time of the purchase. \n9.4 Appearance - The surface shall be smooth and free \nof defects such as seams, pits, die marks, and other defects \ntending to impair the use of the wire for springs. Any \nadditional surface requirements must be negotiated at the \ntime of entry of the order. \n10. Retests \n10.1 If any test specimen exhibits obvious defects or \nshows the presence of a weld, it may be discarded and \nanother specimen substituted. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0369.json",
  "tabulaTablesCsv": "tables_tabula/page-0369.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0369.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4787,
  "bestTextAlphaRatio": 0.7454
}