{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 876,
  "globalPageIndex": 1674,
  "width": 615.48,
  "height": 794.4,
  "text": "(25) \nASME BPVC.II.A-2025 \nTable 11-200-2 \nFerrous Material Specifications Acceptable for BPVC Construction (Including Acceptable \nnon-ASTM Editions) \nASME Material \nSpecifications \nSA/AS-1548 \nSA/CSA-G40.21 \nSA/EN 10025-2 \nSA/EN 10028-2 \nSA/EN 10028-3 \nSA/EN 10028-4 \nSA/EN 10028-7 \nSA/EN 10088-2 \nSA/EN 10088-3 \nSA/EN 10216-2 \nSA/EN 10217-1 \nSA/EN 10222-2 \nSA/GB 713 \nSA/IS 2062 \nSA/ISO 898-1 \nLatest \nAdopted \n[Note [1]) \n2008 \n(R2018) \n2013 \n(R2018) \n2019 \n2017 \n2017 \n2017 \n2016 \n2014 \n2014 \nAll Acceptable Editions \nDescription [Note (2)) [Note (3)), [Note (4)) \nIdentical except for steelmaking process, marking, chemical 2008 \ncomposition, and test reports as shown in the specification. Appendix \n\"Interchangeability of Strength Grades\" does not apply. \nIdentical except for marking, chemical composition, controlled and 2004 through 2013(R2018) \nnormalized rolling, and test reports as shown in the specification. \nIdentical except for marking, chemical composition, resurfacing by \nwelding, and test reports as shown in the specification. \nIdentical except for general requirements, marking, delivery condition, 2003 through 2017 \nchemical composition, tension test, impact test sampling, \nsteelmaking process, quality, and test reports as shown in the \nspecification. For Grade 13CrMo4-5, other acceptable editions are \nlimited to 2009 and later. For other acceptable editions prior to \n2017, plate thickness shall not be greater than 250 mm. \nIdentical except for general requirements, marking, chemical \ncomposition, impact test sampling, steelmaking process, quality, and \ntest reports as shown in the specification. For other acceptable \neditions prior to 2017, plate thickness of Grades P460NH, P460NL1, \nand P460NL2, shall not be greater than 100 mm. \nIdentical except for general requirements, marking, chemical \ncomposition, tension, impact tests, steelmaking process, surface \nimperfections, repair welding, and test reports as shown in the \nspecification. \n2003 through 2017 \n2003 through 2017 \nIdentical except for marking, heat treatment and test reports, as shown 2000 through 2016 \nin the specification. For the latest adopted edition, heat treatment \nshall be per the Tables of Annex A; for other acceptable editions prior \nto 2007, heat treatment shall be per the Tables of Annex B. For other \nacceptable editions prior to 2016, plate thickness of Grades \nX2CrNi12 and X6CrNiTi12, shall not be greater than 25 mm. \nIdentical except for marking, dimensions, delivery condition, 2005 through 2014 \nresurfacing by welding, extent of testing, and test reports as shown in \nthe specification. \nIdentical except for marking, dimensions, test/inspection documents, 2005 through 2014 \nrepair welding, heat treatment, and surface quality as shown in the \nspecification. \n2013 Identical except for marking and test reports as shown in the 2002+A2:2007 through 2013 \n+Al:2019 +Al:2019 specification. \n2019 \n2017 \nIdentical except for material, inspection, marking, resurfacing by \nwelding, and test reports as shown in the specification. \nIdentical except for general requirements, marking, chemical \n+Al:2021 composition, mechanical properties, resurfacing by welding, and test \nreports as shown in the specification. \n2017+A1:2021 \n2014 Identical except for chemical composition, marking, controlled rolling, ... \nheat treatment, and test reports as shown in the specification. \n2011 \n2013 \nIdentical except for chemical composition, marking, mechanical \nproperty limits, delivery condition, repair qualification, and test \nreports as shown in the specification. \nIdentical except for heat treatment, marking and certification as shown \nin the specification. \n1620 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1674.json",
  "tabulaTablesCsv": "tables_tabula/page-1674.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1674.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3684,
  "bestTextAlphaRatio": 0.7068
}