{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 122,
  "globalPageIndex": 122,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-20/SA-Z0M ASME BPVC.II.A-2025 \nA736/A736M Specification for Pressure Vessel Plates, Low­\nCarbon Age-Hardening Nickel-Copper-Chromium­\nMolybdenum-Columbium (Niobium) Alloy Steel \nA 737 / A 737M Specification for Pressure Vessel Plates, High­\nStrength, Low-Alloy Steel \nA738/A738M Specification for Pressure Vessel Plates, Heat­\nTreated, Carbon-Manganese-Silicon Steel, for Moderate \nand Lower Temperature Service \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA770/A770M Specification for Through-Thickness Tension \nTesting of Steel Plates for Special Applications \nA832/A832M Specification for Pressure Vessel Plates, Alloy \nSteel, Chromium-Molybdenum-Vanadium \nA841/A841M Specification for Steel Plates for Pressure \nVessels, Produced by Thermo-Mechanical Control Pro­\ncess (TMCP) \nA844/A844M Specification for Steel Plates, 9 % Nickel \nAlloy, for Pressure Vessels, Produced by the Direct­\nQuenching Process \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA1017/A1017M Specification for Pressure Vessel Plates, \nAlloy Steel, Chromium-Molybdenum-Tungsten \nE21 Test Methods for Elevated Temperature Tension Tests of \nMetallic Materials \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE112 Test Methods for Determining Average Grain Size \nE208 Test Method for Conducting Drop-Weight Test to \nDetermine Nil-Ductility Transition Temperature of Fer­\nritic Steels \nE709 Guide for Magnetic Particle Testing \n2.2 American Society of Mechanical Engineers Code: \nASME Boiler and Pressure Vessel Code, Section IX \n2.3 U.S. Federal Standard: \nFed. Std. No. 123 Marking for Shipment (Civil Agencies) \n2.4 Automotive Industry Action Group Standard: \nB 1 Bar Code Symbology Standard \n3. Terminology \n3.1 Definitions of Terms Specific to This Standard: \n3.1.1 as-rolled-for plates, the condition of a plate that has \nbeen hot-rolled and will not be or has not yet been heat treated. \n3.1.1.1 Discussion-The term as-rolled by itself is not \nmeant to refer to plates that have been hot-rolled using control­\nrolling (CR), direct quench (DQT), thermo-mechanical control \nrolling (TMCP), recrystalization control rolling (RCR), or any \nsimilar methods that ate intended to produce a set of properties \nthat are not normally achievable were they not employed. The \nterm as-rolled is to be distinguished from the established term \n70 \nplate-as-rolled that does not define the actual condition of a \nplate, but defines the singular product of a slab or ingot that has \nbeen hot-rolled \n3.1.2 coil-hot-rolled steel in coil form for processing into \nfinished plates. \n3.1.3 exclusive-when used in relation to ranges, as for \nranges of thicknesses in the tables of permissible variations in \ndimensions, the term is intended to exclude only the greater \nvalue of the range. Thus, a range from 60 to 72 in. [1500 to \n1800 mm] exclusive includes 60 in. [1500 mm], but does not \ninclude 72 in. [1800 mm]. \n3.1.4 heat treatment terms-see 3.1.11, and Terminology \nA941. \n3.1.5 hot forming-a forming operation producing penna­\nnent deformation, performed after the plate has been heated to \nthe temperature required to produce grain refinement. \n3.1.6 hot-rolled (hot rolling)-for plates, the process de­\nscribed for a plate that has been rolled from a slab or ingot \nwhose starting temperature is suitably above the recrystalliza­\ntion temperature of the metal to be rolled. \n3.1.6.1 Discussion-Hot-rolled may be used in conjunction \nwith any rolling process to more effectively describe a specific \ncondition, for example; hot-rolled as-rolled; hot-rolled control­\nrolled, etc. \n3.1.7 manufacturer-the organization that directly controls \nthe conversion of steel ingots or slabs, by hot rolling, into \nplate-as-rolled or into coil; and for plates produced from \nplate-as-rolled, the organization that directly controls, or is \nresponsible for, one or more of the operations involved in \nfinishing the plates. Such finishing operations include leveling, \ncutting to length, testing, inspection, conditioning, heat treat­\nment (if applicable), packaging, marking, loading for shipment, \nand certification. \n3.1.7.1 Discussion-The finishing operations need not be \ndone by the organization that did the hot rolling of the plate. \nFor plates produced from coil, see also 3.1.2. \n3.1.8 mill edge-the normal edge produced by rolling be­\ntween horizontal finishing rolls. A mill edge does not conform \nto any definite contour. Mill edge plates have two mill edges \nand two trimmed edges. \n3.1.8.1 Discussion-Mill edge plates may at times be side­\ntrimmed on one or both sides at the discretion of the manu­\nfacturer. \n3.1.9 plate identifier-the alpha, numeric, or alphanumeric \ndesignation used to identify the plate. \n3.1.10 plates-flat hot-rolled steel, ordered to thickness or \nweight and typically to width and length, commonly available \nby size as follows: \nWidth, in. [mm] \nOver 8 [200] \nOver 48 [1200] \nThickness, in. [mm] \nover 0.229 [6.0 mm and over] \nover 0.179 [4.6 mm and over] \n3.1.10.1 Discussion-Steel plates are available in various \nthickness, width, and length combinations dependent upon \nequipment and processing capabilities of various manufactur­\ners and processors. Historic limitations of a plate based upon \ndimensions (thickness, width, and length) do not take into ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0122.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5397,
  "bestTextAlphaRatio": 0.7541
}