{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 681,
  "globalPageIndex": 1479,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-962/SA-962M \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall be applied only when specified by \nthe purchaser in the purchase order or contract. The specified supplementary requirements shall be \ncompleted prior to shipment of the product. \nSSO. Product Marking \nS50.1 Grade and manufacturer's identification symbols \nshall be applied to one end of studs and to the heads of bolts of \nall sizes. If the available area is inadequate, the grade symbol \nmay be marked on one end and the manufacturer's identifica­\ntion symbol marked on the other end. \nSSl. Stress Relieving \nS51.1 A stress relieving operation shall follow straightening \nafter heat treatment. The minimum stress relieving temperature \nshall be 100 °F [55 °C] below the tempering temperature. Tests \nfor mechanical properties shall be performed after stress \nrelieving. \nSS2. Heat Analysis \nS52.1 An analysis of each remelt ingot shall be made by the \nsteel manufacturer to determine the percentages of those \nelements specified in the individual product specification. The \nchemical analysis thus determined shall conform to the require­\nments of the individual product specification. \nSS3. Sequential or Continuous Strand Casting \nS53.l When multiple heats of the same chemical compo­\nsition range are sequentially strand cast, the heats shall be \nseparated by an established procedure such that intermix \nmaterial shall not be supplied. \nSS4. Bolting for Dynamic Service \nS54.1 Bolting for dynamic service shall be examined for \nsurface discontinuities and decarburization. \nS54.2 Surface Discontinuities: \nS54.2.1 The surface discontinuities shall conform to Speci­\nfication F788 and the additional limitations in S54.2.2. \nS54.2.2 Thread lap inspection shall be performed in accor­\ndance with Specification F788 Supplementary Requirement \nS50. The threads shall have no laps at the root, or on the flanks \ninitiating or extending below the pitch line. \nS54.2.3 Quench cracks of any depth, any length, or in any \nlocation are not permitted. \nS54.2.4 Folds at the junction of the head and the shank are \nnot permitted. \nS54.3 Decarburization: \nS54.3.l Decarburization tests shall be conducted as follows, \nwith the same number of tests as the tension test: \nS54.3.2 Section the thread area longitudinally through the \naxis, and mount and polish the cut face in accordance with \nPractice E3. Use either optical or microhardness measurements \nfor decarburization. In case of dispute, the microhardness \nmethod shall be used. \nS54.3.3 For optical measurement, etch the metallographic \nsection in 4 % Nital. Examine the surface of the etched sample \nunder a microscope at 1 OOx using a measuring eyepiece \ngraduated in 0.001 in. [0.03 mm] increments, or on a ground \nglass screen or photomicrograph. There shall be no gross \ndecarburization (clearly defined ferrite grains), and the depth of \npartial decarburization (light etching zone) anywhere below the \npitch line shall be less than 5 % of the nominal thread height. \nS54.3.4 For microhardness measurement, make hardness \ntests in accordance with Test Method E384 on unetched \nmetallographic sections using either a DPH 136° indenter and \na 200-gf load, or a Knoop indenter and a 200-gf load. Take \nmeasurements at the minor diameter on the thread crest \nbisector to determine the base metal hardness. On the same or \nan adjacent thread, take measurements within 0.003 in. [0.08 \nmm] of the flank surface at the pitch line, and 0.003 in. [0.08 \nmm] below the thread root. These two hardness readings shall \nbe equal to or greater than the base metal hardness minus 30 \nDPHorKHN. \nSSS. Magnetic Particle Examination \nS55.1 The wet fluorescent magnetic particle examination \nmethod shall be applied to 100 % of the lot in accordance with \nPractice E1444/E1444M. Acceptance criteria shall be in accor­\ndance with S57. \nSS6. Liquid Penetrant Examination \nS56.1 The fluorescent liquid penetrant examination method \nshall be applied to 100 % of the lot in accordance with Practice \nE1417/E1417M. Acceptance criteria shall be in accordance \nwith S57. \nSS7. Acceptance Criteria \nS57.1 Only indications, which have a dimension greater \nthan 1/16 in., shall be considered relevant. A linear indication is \none having a length greater than three times the width. A \nrounded indication is one of circular or elliptical shape with a \nlength equal to or less than three times the width. All surfaces \nexamined shall be free of the following: \nS57 .1.1 Relevant linear indications; \nS57.l.2 Relevant rounded indications greater than 3/16 in.; \nand, \nS57.l.3 Four or more relevant rounded indications in a line \nseparated by 1/16 in. or less, edge to edge. \nSSS. Positive Material Identification Examination \nS58.l Bolting shall receive Positive Material Identification \nto ensure that the purchaser is receiving bolting of the correct \nmaterial grade prior to shipment of the bolting. This examina­\ntion is a method to assure that no material grade mix-up has \nhappened during manufacturing and marking of bolting. \nS58.2 Bolting shall receive a Positive Material Identifica­\ntion examination by Guide B1916. \nS58.3 The quantity examined shall be 100 % of the bolting. \n1421 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1479.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5242,
  "bestTextAlphaRatio": 0.7615
}