{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 126,
  "globalPageIndex": 126,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-20/SA-Z0M ASME BPVC.II.A-2025 \nprocedure qualification test plates and the weld repaired plate \nshall be subjected to the thermal heat treatment as specified by \nthe purchaser. \n9.4.7 In addition, repair welds shall meet the requirements \nof the construction code specified by the purchaser. \n10. Test Methods \n10.1 All tests shall be conducted in accordance with Test \nMethods and Definitions A370. \n10.2 Yield strength shall be determined by either the 0.2 % \noffset method or the 0.5 % extension under load method, unless \notherwise stated in the applicable product specification. \n10.3 Rounding Procedures-For purposes of determining \nconformance with the applicable product specification, a cal­\nculated value shall be rounded to the nearest 1 ksi [5 MPa] for \ntensile and yield strengths, and to the nearest unit in the \nright-hand place of figures used in expressing the limiting \nvalue for other values, in accordance with the rounding method \ngiven in Practice E29. \n11. Tension Tests \n11.1 Number of Test Coupons: \n11.1.1 Plates Produced from As-Rolled Plates-For other \nthan quenched and tempered plates, one tension test coupon \nshall be taken from each plate-as-rolled. Two tension test \ncoupons shall be taken from each quenched and tempered \nplate, as heat treated. If plates are furnished by the manufac­\nturer or processor in accordance with 11.4.2 and qualified by \nusing test specimens taken from heat-treated test coupons \n(including normalized, normalized and tempered, and \nquenched and tempered), one tension test coupon shall be \ntaken from each plate-as-rolled (see Terminology A941 for the \ndefinition of plate-as-rolled). \n11.1.2 Plates Produced from Coil and Furnished without \nHeat Treatment or with Stress Relieving Only-Except as \nallowed by 11.1.2.1 and 11.1.4, a minimum of three tension \ncoupons shall be taken from each coil as follows: \n11.1.2. l The first test coupon shall be taken immediately \nprior to the first plate to be qualified to the applicable product \nspecification, the second test coupon shall be taken from the \napproximate center lap, and the third test coupon shall be taken \nimmediately after the last plate to be qualified to the applicable \nproduct specification. If, during decoiling, the amount of \nmaterial decoiled is less than that required to reach the next \nstandard test location, a test for qualification of that particular \nportion of the coil shall be made from a test coupon taken from \na location adjacent to the innermost portion decoiled. \n11.1.2.2 All plates between any two test locations that meet \nthe requirements of the applicable product specification are \nacceptable. \n11. l.2.3 All plates between a test location that fails to meet \nthe requirements of the applicable product specification and an \nadjacent test location that meets the requirements of the \napplicable product specification are rejectable, except that the \nprocessor has the option to malce other tests after cutting back \nthe coil in either direction. \n11.1.3 Plates Produced from Coil and Furnished Heat \nTreated by Other than Stress Relieving-For other than \n74 \nquenched and tempered plates, one tension test coupon shall be \ntaken from each coil. Two tension test coupons shall be taken \nfrom each quenched and tempered plate, as heat treated. \n11.1.4 Plates Produced from Coil and Qualified Using Test \nSpecimens Taken from Test Coupons Heat Treated by Other \nthan Stress Relieving-One tension test coupon shall be taken \nfrom each coil. \n11.2 Orientation of Test Specimens-The longitudinal axis \nof the tension test specimens shall be transverse to the final \nrolling direction of the plate. \n11.3 Location of Test Coupons-Tension test coupons shall \nbe taken from a corner of the plate. For quenched and tempered \nplates, the two tension test coupons shall be taken from \nopposite ends of the plate. \n11.4 Tests from Heat-Treated Plates: \n11.4.1 If heat treatment is performed by the manufacturer or \nprocessor, the test specimens shall be taken from the plate in \nthe heat-treated condition or from full-thickness coupons \nsimultaneously heat treated with the plate. \n11.4.2 If heat treatment is to be performed by the fabricator, \nthe plates shall be accepted on the basis of tests made on test \nspecimens taken from full-thickness coupons heat treated in \naccordance with the requirements specified in the applicable \nproduct specification or the purchase order. If the heat­\ntreatment temperatures are not specified, the manufacturer or \nprocessor shall heat treat the coupons under conditions it \nconsiders appropriate. The purchaser shall be informed of the \nprocedure followed in heat treating the specimens. \n11.4.3 If approved by the purchaser, the procedures of \n11.4.2 may be implemented on plates heat treated by the \nmanufacturer or processor, except that for plates that are \nquenched and tempered, all testing required the specification or \nthe purchase order must be performed after plate heat \ntreatment, in accordance with 11.1.1 and 11.4.4, and the results \nreported. \n11.4.4 For plates that are heat treated with a cooling rate \nfaster than still-air cooling from the austenitizing temperature, \none of the following shall apply in addition to other require­\nments specified herein: \n11.4.4.1 The gage length of the tension test specimen shall \nbe talcen at least IT from any as-heat treated edge, where Tis \nthe thickness of the plate, and shall be at least ½ in. [12.5 mm] \nfrom flame-cut or heat-affected-zone surfaces. \n11.4.4.2 A steel thermal buffer pad, 1 Tby lTby at least 3T, \nshall be joined to the plate edge by a partial penetration weld \ncompletely sealing the buffered edge prior to heat treatment. \n11.4.4.3 Thermal insulation or other thermal barriers shall \nbe used during the heat treatment adjacent to the plate edge \nwhere the test specimens are to be removed. It shall be \ndemonstrated that the cooling rate of the tension test specimen \nis no faster than, and not substantially slower than, that attained \nby the method described in 11.4.4.2. \n11 .4.4.4 When test coupons cut from the plate but heat \ntreated separately are used, the coupon dimensions shall be not \nless than 3T by 3T by T and each tension test specimen cut \nfrom it shall meet the requirements of 11.4.4.1. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0126.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6275,
  "bestTextAlphaRatio": 0.7721
}