{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 386,
  "globalPageIndex": 386,
  "width": 643.8,
  "height": 878.28,
  "text": "SA-234/SA-234M (ASTM A234/A234M) ASME BPVC.II.A-2025 \n11.2 All fittings of Grade WP9 l Type 1 and Type 2 and \nWP115 shall be hardness tested and shall have a hardness of \n190 HBW-250 HBW. \n11.3 When additional hardness testing of the fittings is \nrequired, see Supplementary Requirement S57 in Specification \nA960/A960M. \n12. Hydrostatic Tests \n12.1 See Specification A960/A960M. \n13. Nondestructive Examination \n13.1 For WP91 Type 1 and Type 2 and WP92 fittings, one of \nthe following examinations, as found in the Supplementary \nRequirements of Specification A960/A960M, shall be per­\nformed: S52 Liquid Penetrant Examination, S53 Magnetic \nParticle Examination, S62 Ultrasonic Test, or S72 Nondestruc­\ntive Electromagnetic (Eddy-Current) Test. \n14. Dimensions \n14.1 Butt-welding fittings and butt-welding short radius \nelbows and returns purchased in accordance with this specifi­\ncation shall conform to the dimensions and tolerances given in \nthe latest revision of ASME B16.9. Steel socket-welding and \nthreaded fittings purchased in accordance with this specifica­\ntion shall conform to the sizes, shapes, dimensions, and \ntolerances specified in the latest revision of ASME Bl6.11, \nMSS-SP-79, or MSS-SP-83. Swage(d) Nipples, Bull Plugs, \nand Integrally Reinforced Forged Branch Outlet Fittings pur­\nchased in accordance with this specification shall conform to \nthe sizes, shapes, dimensions, and tolerances specified in the \nlatest revision of MSS-SP-95 or MSS-SP-97. \n14.2 Fittings of size or shape differing from these standards, \nbut meeting all other requirements of this specification may be \nfurnished in accordance with Supplementary Requirement S58 \nin Specification A960/ A960M. \n15. Surface Finish, Appearance, and Corrosion \nProtection \n15.1 The requirements of Specification A960/A960M apply. \n16. Repair by Welding \n16.1 See Specification A960/A960M. \n16.2 In addition to the requirements for weld repair of \nSpecification A960/ A960M, weld repairs to WP91 Type 1 and \nType 2 fittings shall meet the requirements of 7.3.1. \n16.3 In addition to the requirements for weld repair of \nSpecification A960/ A960M, weld repairs to WP24 fittings \nshall meet the requirements of 9.5. The recommended preheat \nand interpass temperature ranges are 200 to 400 °F [95 to 205 \n0 C]. Weld repairs to WP24 fittings shall be post weld heat \ntreated at 1350 to 1470 °F [730 to 800 °C], except that preheat \nand post weld heat treatment are not required for WP24 fittings \nwhose section thickness does not exceed 0.500 in. [12.7 mm]. \n17. Inspection \n17.1 See Specification A960/A960M. \n17 .2 Other tests, when required by agreement, shall be made \nfrom material of the lots covered in the order. \n18. Rejection and Rehearing \n18.1 Material that fails to conform to the requirements of \nthis specification may be rejected. Rejection should be reported \nto the producer or supplier promptly in writing. In case of \ndissatisfaction with the results of the tests, the producer or \nsupplier may make claim for a rehearing. \n18.2 Fittings that develop defects in shopworking or appli­\ncation operations may be rejected. Upon rejection, the manu­\nfacturer shall be notified promptly in writing. \n19. Certification \n19 .1 Test reports are required for all fittings covered by this \nspecification. Each test report shall meet the requirements for \ncertification in A960/ A960M as well as include the following \ninformation specific to this specification: \n19.1.1 Chemical analysis results, Section 9 (Table 1), re­\nported results shall be to the same number of significant figures \nas the limits specified in Table 1 for that element. \n19.1.2 Tensile property results, Section 10 (Table 2), report \nthe yield strength and tensile strength in ksi [MPa] and \nelongation in percent, \n19.1.3 Hardness results, Section 11, \n19 .1.4 Type heat treatment, if any, Section 8, \n19.1.5 Seamless or welded, \n19.1.6 Starting material, specifically pipe, plate, etc., \n334 \n19.1.7 Statement regarding radiographic or ultrasonic \nexamination, Section 7.3, and \n19.1.8 Any supplementary testing required by the purchase \norder. \n20. Product Marking \n20.1 In addition to marking requirements of A960iA960M, \nthe following marking requirements shall apply: \n20.1.1 Butt-welding fittings shall be marked with the fitting \ndesignation for marking in accordance with Annex Al. \n20.1.2 Butt-welding fittings containing welds that have been \nultrasonically examined instead of radiography shall be marked \nU after heat identity. \n20.1.3 Threaded or socket-welding fittings shall be marked \nwith the pressure class and fitting designation for marking in \naccordance with Annex Al. Plugs and bushings furnished to \nASME B16.ll requirements are not required to be marked. \n20.1.4 When agreed upon between the purchaser and \nmanufacturer, and specified in the order, the markings shall be \npainted or stenciled on the fitting or stamped on a metal or \nplastic tag which shall be securely attached to the fitting. \n20.1.5 WP91 material shall additionally be marked with the \nappropriate Type. \n20.2 Bar Coding-In addition to the requirements in 20.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. The bar coding system, if applied at \nthe discretion of the supplier, should be consistent with one of \nthe published industry standards for bar coding. If used on ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0386.json",
  "tabulaTablesCsv": "tables_tabula/page-0386.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0386.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5432,
  "bestTextAlphaRatio": 0.7349
}