{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 199,
  "globalPageIndex": 997,
  "width": 626.4,
  "height": 803.04,
  "text": "ASME BPVC.II.A-2025 SA-530/SA-530M \n13.4 No jointers are permitted unless otherwise agreed \nupon. \n14. Standard Weight \n14.1 A system of standard pipe sizes has been approved by \nthe American National Standards Institute as ASME B36.10 \nand B36.19. These standard sizes do not prohibit the produc­\ntion and use of other sizes of pipe produced to the various \nspecifications referenced to this Specification. \n14.2 For nonstandard sizes of pipe, the calculated weight \nper foot, shall be determined from the following equation: \nW=C(D-t)t (1) \nwhere: \nC = 10.69 [0.0246615], \nW = weight, lb/ft [kg/m], \nD = specified or calculated (from specified inside diameter \nand wall thickness) outside diameter, in. [mm], and \nt = specified wall thickness, in. (to 3 decimal places) [mm \nto 2 decimal places]. \nNam 2-The weights given in the American National Standards and \nthe calculated weights given by Eq 1 are based on the weights for carbon \nsteel pipe. The weight of pipe made of ferritic stainless steels may be \nabout 5 % less, and that made of austenitic stainless steel about 2 % \ngreater than the values given. \n15. Ends \n15.1 Unless otherwise specified, the pipe shall be furnished \nwith plain ends. All burrs at the ends of the pipe shall be \nremoved. \n16. Straightness \n16.1 The finished pipe shall be reasonably straight. \n18. Retests \n18.1 If the results of the mechanical tests of any group or lot \ndo not conform to the requirements specified in the individual \nspecification, retests may be made on additional lengths of pipe \nof double the original number from the same group or lot, each \nof which shall conform to the requirements specified. Only one \nretest of any group or lot will be permitted. Nonconformance \nwill be cause for the rejection of the group or lot. \n18.2 Any individual length of pipe that meets the test \nrequirements is acceptable. Individual lengths that do not \n. conform to the test requirements may be resubmitted for test \nprovided the reason for nonconformance is established and the \nnonconforming portion removed. \n19. Retreatment \n19.1 If individual lengths of pipe selected to represent any \ngroup or lot fail to conform to the test requirements, the group \nor lot represented may be reheat treated and resubmitted for \ntest. The manufacturer may reheat treat the pipe, but not more \nthan twice, except with the approval of the purchaser on the \nbasis of satisfactory metallurgical evidence that the cause of \nfailure of the test is curable and the quality of the material is \nsatisfactory. \n20. Test Specimens \n20.1 Test specimens shall be taken from the ends of as-heat \ntreated finished pipe prior to any forming operations, or being \ncut to length. They shall be smooth on the ends and free from \nburrs and flaws, except for specimens for the flattening test \nwhen made from crop ends. \n20.2 Specimens cut either longitudinally or transversely \nshall be acceptable for the tension test. \n20.3 If any test specimen shows flaws or defective \nmachining, the specimen may be discarded and another sub­\nstituted. \n21. Flattening Test Requirements \n16.2 For metal-arc welded pipe, the maximum deviation \nfrom a 10-ft [3.0-m] straightedge placed so that both ends are \nin contact with the pipe shall be 1/s in. [3.2 mm]. For metal-arc \nwelded pipe with lengths shorter than 10 ft [3.0 m], this \nmaximum deviation shall be pro-rated with respect to the ratio \nof the actual length to 10 ft [3.0 m]. 21.1 Seamless and Centrifugally Cast Pipe-A section of \npipe not less than 2½ in. [63 mm] in length shall be flattened \n-------:1~7;;-.--;R;:;:-e-p-a~ir-;-by~W;;:e-;l-;di;--.n-g---------------rold--between .. parallel plates in two stens. During the first step, \nwhich is a test for ductility, no cracks or breaks on the inside, \n17 .1 Repair by welding of defects in seamless pipe (includ- outside, or end surfaces, except as provided for in 21.3.4, shall \ning centrifugally cast and forged and bored) and of plate occur until the distance between the plates is less than the value \ndefects in welded pipe and, when specifically stated by the of H calculated as follows: \nproduct specification weld seam defects in welded pipe, shall \nbe permitted subject to the approval of the purchaser and with \nthe further understanding that the composition of the deposited \nfiller metal shall be suitable for the composition being welded. \nDefects shall be thoroughly chipped or ground out before \nwelding and each repaired length shall be reheat treated or \nstress relieved as required by the applicable specification. Each \nlength of repaired pipe shall be tested hydrostatically as \nrequired by the product specification. \n17 .2 Repair welding shall be performed using procedures \nand welders or welding operators that have been qualified in \naccordance with the ASME Boiler and Pressure Vessel Code, \nSection IX. \n897 \nH= (1 + e)tl(e + t/D) (2) \nwhere: \nH = distance between flattening plates, in. [mm], \nt = specified wall thickness, in. [mm], \nD = specified or calculated (from the specified inside diam­\neter and wall thickness) outside diameter, in. [mm], and \ne = deformation per unit length ( constant for a given grade \nof steel; 0.07 for medium carbon steel (maximum \nspecified carbon 0.19 % or greater), 0.08 for ferritic \nalloy steel, 0.09 for austenitic steel, and 0.09 for \nlow-carbon steel (maximum specified carbon 0.18 % or \nless)). ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0997.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5381,
  "bestTextAlphaRatio": 0.7447
}