{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 792,
  "globalPageIndex": 1590,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-1016/SA·1016M ASME BPVC.II.A-2025 \nbottom of imperfections shall be visible and the profile shall be \nrounded and faired-in. \n33.1.14 No weld repair by the manufacturer is permitted. \n33.1.15 Preservation shall be level A or commercial, and \npacking shall be level A, B, or commercial, as specified. Level \nA preservation and level A or B packing shall be in accordance \nwith MIL-STD-163 and commercial preservation and packing \nshall be in accordance with Practices A700 or Practice D3951. \n34. Keywords \n34.1 alloy steel tube; austenitic stainless steel; duplex stain­\nless steel; ferritic stainless steel; ferritic/austenitic stainless \nsteel; heavily cold-worked steel tube; seamless steel tube; \nstainless steel tube; steel tube; welded steel tube \nANNEXES \nAl. REQUIREMENTS FOR THE INTRODUCTION OF NEW MATERIALS \nAl .1 New materials may be proposed for inclusion in \nspecifications referencing this Specification of General Re­\nquirements subject to the following conditions: \nAl.1.1 Application for the addition of a new grade to a \nspecification shall be made to the chair of the subcommittee \nthat has jurisdiction over that specification. \nA 1.1.2 The application shall be accompanied by a statement \nfrom at least one user indicating that there is a need for the new \ngrade to be included in the applicable specification. \n• Al.1.3 The application shall be accompanied by test data as \nrequired by the applicable specification. Test data from a \nminimum of three test lots, as defined by the specification, each \nfrom a different heat, shall be furnished. \nAl.1.4 The application shall provide recommendations for \nall requirements appearing in the applicable specification. \nAl. 1.5 The application shall state whether the new grade is \ncovered by patent. \nA2. REQUIREMENTS FOR THE INTRODUCTION OF MATERIALS FROM OTHER A0l OR B02.07 SPECIFICATION \nA2.1 Wrought materials that are already covered by another \nA0l or B02.07 specification may be proposed for inclusion in \nspecifications referencing this specification of general require­\nments subject to the following conditions: \nA2. l .1 Application for the addition of a grade that is already \ncovered in another A0l or B02.07 specification shall be made \nto the chair of the subcommittee that has jurisdiction over that \nspecification. \nA2.l.2 The chemical requirements, the specified mechani­\ncal properties, and the heat treatment requirements of the grade \nbeing added shall be the same as those for the grade in the A0l \nor B02.07 specification in which the grade is presently covered. \nA2. l .3 The application shall provide recommendations for \nall requirements appearing in the applicable specification. \nA2.1 .4 The application shall state whether or not the grade \nis covered by patent. \n1536 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1590.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2770,
  "bestTextAlphaRatio": 0.7718
}