{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 445,
  "globalPageIndex": 1243,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-703/SA-703M \n16.4 A manufacturer's certification printed from or used in \nelectronic form from an electronic data interchange (EDI) \ntransmission shall be regarded as having the same validity as a \ncounterpart printed in the certifier's facility, provided it con­\nforms to any existing EDI agreement between the purchaser \nand the supplier. \n17. Product Marking \n17 .1 Castings shall be marked for material identification \nwith grade symbols (WCB, WC9, CF8M, and so forth). In \naddition, heat numbers, or serial numbers that are traceable to \nheat numbers, shall be marked on all pressure-containing \ncastings individually weighing 50 lb [22. 7 kg] or more. \nPressure-containing castings weighing less than 50 lb [22.7 kg] \nshall be marked with either the heat number or a lot number \nthat will identify the casting as to the month in which it was \npoured. Marking shall be in such position as not to injure the \nusefulness of the casting. \n17 .2 On castings for which impact property requirements \nare specified, stamped markings using low-stress stamps shall \nbe on a raised pad when such pad can be made a part of the \ncastings. \n17.3 Castings shall be marked with the manufacturer's \nidentification or symbol except when other provisions have \nbeen made between the manufacturer and purchaser. \n18. Keywords \n18.1 castings; general requirements; pressure containing; \nsteel \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall be applied only when specified by the purchaser. Details of the \nsupplementary requirements shall be agreed upon between the manufacturer and purchaser. The \nspecified tests shall be performed by the manufacturer prior to shipment of the castings. \nSl. Unspecified Elements \nS 1. 1 Limits may be established for elements not specified \nfor the grade ordered by agreement between the manufacturer \nand purchaser. The results of the analysis for the agreed-upon \nelements shall be reported. \nS2. Destruction Tests \nS2.1 Purchaser may select representative castings from each \nheat, and cut up and etch, or otherwise prepare, the sections for \nexamination for internal defects. Should injurious defects be \nfound that evidence unsound steel or faulty foundry technique, \nall the castings made from that particular pattern, heat, and heat \ntreatment charge may be rejected. All the rejected castings, \nincluding those cut up, shall be replaced by the manufacturer \nwithout charge. \nS3. Bend Test \nS3.1 One bend test shall be made from a test coupon from \neach heat in accordance with Test Methods and Definitions \nA370, and shall be machined to a 1 by ½-in. [25 by 13-mm] \nsection with corners rounded to a radius not over 1/16 in. \n[1.6 mm]. When material is ordered to an M-suffix (SI units) \nproduct standard, the bend test requirements shall be in \naccordance with Test Methods A1058. \nS3.2 The specimen shall withstand being bent longitudi­\nnally at room temperature through an angle of 90° about a pin, \nthe diameter of which shall be the specimen thickness for \ncarbon steels, and 1 in. [25 mm] for other steels. The specimen \nshall show no cracks on the outside of the bent portion of the \nspecimen. \nS3.3 Bend test specimens may be cut from heat-treated \ncastings instead of from test specimens when agreed upon \nbetween manufacturer and purchaser. \nS3.4 If any test specimen shows defective machining or \ndevelops flaws, it may be discarded and another specimen \nsubstituted from the same heat. \nS4. Magnetic Particle Inspection \nS4.1 Castings shall be examined for surface and near­\nsurface discontinuities by magnetic particle inspection. The \nexamination shall be in accordance with Guide E709, and types \nand degrees of discontinuities considered shall be judged by \nReference Photographs E125. Extent of examination, time of \nexamination, and basis for acceptance shall • be agreed upon \nbetween the manufacturer and purchaser. A specification which \nmay be used as a basis for such agreement is MSS SP 53. \nS4.2 Personnel performing the examination shall be quali­\nfied in accordance with an acceptable written practice. \nS5. Radiographic Inspection \nS5.1 Castings shall be examined for internal defects by \nmeans of X-rays or gamma rays. The procedure shall be in \naccordance with Guide E94/E94M, and types and degrees of \ndiscontinuities considered shall be judged by Reference Radio­\ngraphs E446, E186, or E280. Extent of examination and basis \nfor acceptance shall be agreed upon between the manufacturer \nand purchaser. A specification that may be used as a basis for \nsuch agreement is MSS SP 54. \nS5.2 Radiographic examination of castings may be per­\nformed before or after any heat treatment. \nS5.3 Personnel performing the examination shall be quali­\nfied in accordance with an acceptable written practice. \nS6. Liquid Penetrant Inspection \nS6. l Castings shall be examined for surface discontinuities \nby means of liquid penetrant inspection. The examination shall \nbe in accordance with Practice E165/El65M. Areas to be \ninspected, time of inspection, methods and types of liquid \n1157 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1243.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5072,
  "bestTextAlphaRatio": 0.7752
}