{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 641,
  "globalPageIndex": 641,
  "width": 619.08,
  "height": 858.72,
  "text": "ASME BPVC.II.A-2025 SA-370 \nDIMENSIONS \nStandard Specimens Subsize Specimen \nPlate-type, \n1 ½-in. (40 mm) Wide \n8-in. (200 mm) 2-in. (50 mm) Sheet-type, ½ ¼-in. (6 mm) Wide Gauge Length Gauge Length in. (12.5 mm) Wide \nin. mm in. mm in. mm in. mm \nG-Gauge length 8.00 ± 0.01 200 ± 0.25 2.000 ± 0.005 50.0 ± 0.10 2.000 ± 0.005 50.0 ± 0.10 1.000 ± 0.003 25.0 ± 0.08 \n(Notes 1 and 2) \nW-Width 1½+¼ 40 +3 1½+¼ 40+3 0.500 ± 0.010 12.5 ± 0.25 0.250 ± 0.002 6.25 ± 0.05 \n(Notes 3, 5, and 6) -¼ -6 -¼ -6 \nT-Thickness Thickness of Material (Note 7) \nR-Radius of fillet, min ½ 13 ½ 13 ½ 13 ¼ 6 \n(Note4) \nL-Overall length, min 18 450 8 200 8 200 4 100 \n(Notes 2 and 8) \nA-Length of 9 225 2¼ 60 2¼ 60 1¼ 32 \nreduced section, min \n8--Length of grip section, min 3 75 2 50 2 50 1¼ 32 \n(Note 9) \nC-Width of grip section, approxi- 2 50 2 50 ¾ 20 % 10 \nmate \n(Note 4, Note 10, and Note 11) \nNoTE 1-For the 1½-in. (40 mm) wide specimens, punch marks for measuring elongation after fracture shall be made on the flat or on the edge of \nthe specimen and within the reduced section. For the 8-in. (200 mm) gauge length specimen, a set of nine or more punch marks 1 in. (25 mm) apart, \nor one or more pairs of punch marks 8 in. (200 mm) apart may be used. For the 2-in. (50 IIlln) gauge length specimen, a set of three or more punch marks \n1 in. (25 IIlln) apart, or one or more pairs of punch marks 2 in. (50 mm) apart may be used. \nNoTE 2-For the ½-in. (12.5 mm) wide specimen, punch marks for measuring the elongation after fracture shall be made on the flat or on the edge \nof the specimen and within the reduced section. Either a set of three or more punch marks 1 in. (25 mm) apart or one or more pairs of punch marks 2 in. \n(50 mm) apart may be used. \nNoTE 3-For the four sizes of specimens, the ends of the reduced section shall not differ in width by more than 0.004, 0.004, 0.002, or 0.001 in. (0.10, \n0.10, 0.05, or 0.025 mm), respectively. Also, there may be a gradual decrease in width from the ends to the center, but the width at either end shall not \nbe more than 0.015 in., 0.015 in., 0.005 in., or 0.003 in. (0.40, 0.40, 0.10, or 0.08 mm), respectively, larger than the width at the center. \nNoTE 4--For each specimen type, the radii of all fillets shall be equal to each other with a tolerance of 0.05 in. (1.25 mm), and the centers of curvature \nof the two fillets at a particular end shall be located across from each other (on a line perpendicular to the centerline) within a tolerance of 0.10 in. \n(2.5 mm). \nNoTE 5-For each of the four sizes of specimens, narrower widths (W and C) may be used when necessary. In such cases, the width of the reduced \nsection should be as large as the width of the material being tested permits; however, unless stated specifically, the requirements for elongation in a product \nspecification shall not apply when these narrower specimens are used. If the width of the material is less than W, the sides may be parallel throughout \nthe length of the specimen. \nNoTE 6--The specimen may be modified by making the sides parallel throughout the length of the specimen, the width and tolerances being the same \nas those specified above. When necessary, a narrower specimen may be used, in which case the width should be as great as the width of the material being \ntested permits. If the width is 1 ½ in. (38 mm) or less, the sides may be parallel throughout the length of the specimen. \nNoTE 7-The dimension Tis the thickness of the test specimen as provided for in the applicable product specification. Minimum nominal thickness \nof 1 to 1 ½-in. ( 40 mm) wide specimens shall be 3/16 in. (5 mm), except as permitted by the product specification. Maximum nominal thickness of ½-in. \n(12.5 mm) and ¼-in. (6 mm) wide specimens shall be 1 in. (25 mm) and ¼ in. (6 mm), respectively. \nNoTE 8-To aid in obtaining axial loading during testing of ¼-in. (6 mm) wide specimens, the overall length should be as large as the material will \npermit. \nNoTE 9-It is desirable, if possible, to make the length of the grip section large enough to allow the specimen to extend into the grips a distance equal \nto two thirds or more of the length of the grips. If the thickness of ½-in. (13 mm) wide specimens is over 3 /s in. (10 mm), longer grips and correspondingly \nlonger grip sections of the specimen may be necessary to prevent failure in the grip section. \nNoTE 10-For standard sheet-type specimens and subsize specimens, the ends of the specimen shall be symmetrical with the center line of the reduced \nsection within 0.01 and 0.005 in. (0.25 and 0.13 mm), respectively, except that for steel if the ends of the ½-in. (12.5 mm) wide specimen are symmetrical \nwithin 0.05 in. (1.0 mm), a specimen may be considered satisfactory for all but referee testing. \nNoTE 11-For standard plate-type specimens, the ends of the specimen shall be symmetrical with the center line of the reduced section within 0.25 in. \n(6.35 mm), except for referee testing in which case the ends of the specimen shall be symmetrical with the center line of the reduced section within 0.10 in. \n(2.5 mm). \nFIG. 3 Rectangular Tension Test Specimens \n589 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0641.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5147,
  "bestTextAlphaRatio": 0.6631,
  "noteOcrPath": "note_ocr/page-0641.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 7—The dimension T is the thickness of the test specimen as provided for in the applicable product specification. Minimum nominal thickness"
  ]
}