{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 269,
  "globalPageIndex": 1067,
  "width": 623.28,
  "height": 800.52,
  "text": "ASME BPVC.11.A-Z0ZS SA-564/SA-564M \n3.1.9 Preparation for delivery (Specification \nA 484/ A 484M), \n3.1.10 Special requirements (refer to 7.4 and 8.3), \n3.1.11 Marking requirements (Specification \nA 484/ A 484M), and \n3.1.12 ASTM designation and date of issue if other \nthan that currently published. \n3.2 If possible, the intended use of the item should be \ngiven on the purchase order especially when the item is \nordered for a specific end use or uses. \nNOTE 3 -A typical ordering description is as follows: 5000 lb [2270 kg] \nType 630, Solution-Annealed Cold Finished Centerless Ground, l½ in. \n[38.0 mm] round bar, 10 to 12 ft [3.0 to 3.6 m] in length, ASTM A 564 \ndated ___ . End use: valve shafts. \n4. General Requirements \n4.1 In addition to the requirements of this specification, \nall requirements of the current edition of Specifications \nA 484/ A 484M shall apply. Failure to comply with the \ngeneral requirements of Specification A 484/ A 484M con­\nstitutes nonconformance with this specification. \n5. Materials and Manufacture \n5.1 Heat Treatment and Condition: \n5.1.1 Material of types other than XM-16, XM-25, \nand Type 630 shall be furnished in the solution-annealed \ncondition, or in the equalized and oven-tempered condition, \nas noted in Table 2, unless otherwise specified by the \npurchaser. \n5.1.1.1 Types 630, XM-16, and XM-25 may be \nfurnished in the solution-annealed or age-hardened con­\ndition. \n5.1.2 Type UNS S46910 shall be funished in solu­\ntton-annealed-contlitiorr per-Tab-le--2-,or-solutcion-anne--aleEl­\nand cold-worked condition per Table 3, or aged-hardened \ncondition per Table 4. \n5.1.3 Reforging stock shall be supplied in a condition \nof heat treatment to be selected by the forging manufac­\nturer. \n5.2 Shapes may be subjected to either Class A or \nClass C preparation as specified on the purchase order. \n5.2.1 Class A consists of preparation by grinding for \nthe removal of imperfections of a hazardous nature such \nas fins, tears, and jagged edges provided the underweight \ntolerance is not exceeded and the maximum depth of grind­\ning at any one point does not exceed 10% of the thickness \nof the section. \n5.2.2 Class C consists of preparation by grinding for \nthe removal of all visible surface imperfections provided \nthe underweight tolerance is not exceeded and the maxi­\nmum depth of grinding at any one point does not exceed \n10% of the thickness of the section. \n6. Chemical Composition \n6.1 Each alloy covered by this specification shall con­\nform to the chemical requirements specified in Table 1. \n6.2 Methods and practices relating to chemical analysis \nrequired by this specification shall be in accordance with \nTest Methods, Practices, and Terminology A 751. \n7. Mechanical Properties Requirements \n7 .1 The material, as represented by mechanical test \nspecimens, shall conform to the mechanical property \nrequirements specified in Table 2 or Table 3 and shall be \ncapable of developing the properties in Table 4 when heat \ntreated as specified in 5 .1. \n7.2 Samples cut from bars for forging stock shall con­\nform to the mechanical properties of Table 2 and Table 4 \nwhen heat treated as specified in Table 2 and Table 4. \n7.3 The yield strength shall be determined by the offset \nmethod as described in the current edition of Test Methods \nand Definitions A 370. The limiting permanent offset shall \nbe 0.2% of the gage length of the specimen. \n7.4 The impact requirement shall apply only when \nspecified in the purchase order. When specified, the mate­\nrial, as represented by impact test specimens, shall be capa­\nble of developing the impact property requirements \nspecified in Table 4 when heat treated in accordance \nwith 5.1. \n7.5 Longitudinal impact requirements are not applica­\nble to bars less than¾ in. (16.9 mm) diameter or size or \n_Jlat~les~than ¾ in. (16.9 mm) thick. \n967 \n7.6 Tensile and impact requirements in the transverse \n(through thickness) direction are not applicable to bars less \nthan 3 in. [7 5 mm] diameter in size or flats less than 3 in. \n[75 mm] thick. \n7.7 Material tensile tested and, when specified, impact \ntested in the transverse (through thickness) direction and \nmeeting the requirements shown in Table 4 need not be \ntested in the longitudinal direction. \n8. Number of Tests \n8.1 At least one room temperature tension test and one \nor more hardness tests shall be made on each lot. \n8.2 One or more hardness tests and at least one tension \ntest shall be made from each lot on test samples heat ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1067.json",
  "tabulaTablesCsv": "tables_tabula/page-1067.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1067.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4498,
  "bestTextAlphaRatio": 0.7341
}