{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 664,
  "globalPageIndex": 664,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-370 ASME BPVC.II.A-2025 \naccurate or appropriate for the purpose. \nA2.2.2 Longitudinal Strip Test Specimens: \nA2.2.2.1 As an alternative to the use of full-size longitudi­\nnal test specimens or longitudinal round test specimens, \nlongitudinal strip test specimens, obtained from strips cut from \nthe tubular product as shown in Fig. A2.2 and machined to the \ndimensions shown in Fig. A2.3 are used. For welded structural \ntubing, such test specimens shall be from a location at least 90° \nfrom the weld; for other welded tubular products, such test \nspecimens shall be from a location approximately 90° from the \nweld. Unless otherwise required by the product specification, \nthe gauge length shall conform to dimension C in Fig. A2.3. \nThe test specimens shall be tested using grips that are flat or \nhave a surface contour corresponding to the curvature of the \ntubular product, or the ends of the test specimens shall be \nflattened without heating prior to the test specimens being \ntested using flat grips. The test specimen shown as specimen 4 \nin Fig. 3 shall be used, unless the capacity of the testing \nequipment or the dimensions and nature of the tubular product \nto be tested makes the use of specimen nos. 1, 2, or 3 necessary. \nNorn A2.2-An exact formula for calculating the cross-sectional area \nof specimens of the type shown in Fig. A2.3 taken from a circular tube is \ngiven in Test Methods ES/ESM. \nA2.2.2.2 The width should be measured at each end of the \ngauge length to determine parallelism and also at the center. \nThe thickness should be measured at the center and used with \nthe center measurement of the width to determine the cross­\nsectional area. The center width dimension should be recorded \nto the nearest 0.005 in. (0.127 mm), and the thickness \nmeasurement to the nearest 0.001 in. \nA2.2.3 Transverse Strip Test Specimens: \nA2.2.3.1 In general, transverse tension tests are not recom­\nmended for tubular products, in sizes smaller than 8 in. in \nnominal diameter. When required, transverse tension test \nspecimens may be taken from rings cut from ends of tubes or \npipe as shown in Fig. A2.4. Flattening of the specimen may be \ndone either after separating it from the tube as in Fig. A2.4 (a), \nor before separating it as in Fig. A2.4 (b), and may be done hot \nor cold; but if the flattening is done cold, the specimen may \nsubsequently be normalized. Specimens from tubes or pipe for \nwhich heat treatment is specified, after being flattened either \nhot or cold, shall be given the same treatment as the tubes or \nNorn 1-The edges of the blank for the specimen shall be cut parallel \nto each other. \nFIG. A2.2 Location of Longitudinal Tension-Test Specimens in \nRings Cut From Tubular Products \npipe. For tubes or pipe having a wall thickness of less than ¾ \nin. (19 mm), the transverse test specimen shall be of the form \nand dimensions shown in Fig. A2.5 and either or both smfaces \nmay be machined to secure uniform thickness. Specimens for \ntransverse tension tests on welded steel tubes or pipe to \ndetermine strength of welds, shall be located perpendicular to \nthe welded seams with the weld at about the middle of their \nlength. \nA2.2.3.2 The width should be measured at each end of the \ngauge length to determine parallelism and also at the center. \nThe thickness should be measured at the center and used with \nthe center measurement of the width to determine the cross­\nsectional area. The center width dimension should be recorded \nto the nearest 0.005 in. (0.127 mm), and the thickness \nmeasurement to the nearest 0.001 in. (0.025 mm). \nA2.2.4 Round Test Specimens: \nA2.2.4.1 When provided for in the product specification, the \nround test specimen shown in Fig. 4 may be used. \nA2.2.4.2 The diameter of the round test specimen is mea­\nsured at the center of the specimen to the nearest 0.001 in. \n(0.025 mm). \nA2.2.4.3 Small-size specimens proportional to standard, as \nshown in Fig. 4, may be used when it is necessary to test \nmaterial from which the standard specimen cannot be prepared. \nOther sizes of small-size specimens may be used. In any such \nsmall-size specimen, it is important that the gauge length for \nmeasurement of elongation be four times the diameter of the \nspecimen (see Note 5, Fig. 4). The elongation requirements for \nthe round specimen 2-in. gauge length in the product specifi­\ncation shall apply to the small-size specimens. \nA2.2.4.4 For transverse specimens, the section from which \nthe specimen is taken shall not be flattened or otherwise \ndeformed. \n612 \nA2.2.4.5 Longitudinal test specimens are obtained from \nstrips cut from the tubular product as shown in Fig. A2.2. \nA2.3 Determination of Transverse Yield Strength, Hydrau­\nlic Ring-expansion Method \nA2.3.l Hardness tests are made on the outside surface, \ninside surface, or wall cross-section depending upon product­\nspecification limitation. Surface preparation may be necessary \nto obtain accurate hardness values. \nA2.3.2 A testing machine and method for determining the \ntransverse yield strength from an annular ring specimen, have \nbeen developed and described in A2.3.3 - 9.1.2. \nA2.3.3 A diagrammatic vertical cross-sectional sketch of \nthe testing machine is shown in Fig. A2.6. \nA2.3.4 In determining the transverse yield strength on this \nmachine, a sh01t ring (commonly 3 in. (76 mm) in length) test \nspecimen is used. After the large circular nut is removed from \nthe machine, the wall thickness of the ring specimen is \ndetermined and the specimen is telescoped over the oil resistant \nrubber gasket. The nut is then replaced, but is not turned down \ntight against the specimen. A slight clearance is left between \nthe nut and specimen for the purpose of permitting free radial \nmovement of the specimen as it is being tested. Oil under \npressure is then admitted to the interior of the rubber gasket ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0664.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5856,
  "bestTextAlphaRatio": 0.7563,
  "noteOcrPath": "note_ocr/page-0664.txt",
  "noteOcrCount": 2,
  "noteOcrNotes": [
    "Note A2.2—An exact formula for calculating the cross-sectional area",
    "Note 1—The edges of the blank for the specimen shall be cut parallel"
  ]
}