{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 517,
  "globalPageIndex": 1315,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-770/SA-770M \nto the plate surface and often slightly outside the heat-affected \nzone. Lamellar tearing generally has a step-like appearance \nconsisting of \"terraces\" (cracks running parallel to the plate \nsurface) and \"walls\" (cracks which connect the individual \nterraces). The tearing may remain completely subsurface or \nappear at plate edges or at weld toes. \nXl.3 Inclusions \nXl.3.1 The step-like cracking characteristic of lamellar \ntearing is usually considered to result from small elongated \nnonmetallic inclusions that are normally present in the steel. \nStrains in the through-thickness direction can cause individual \ninclusions to fractures or decohere from the surrounding steel \nmatrix, thus initiating a void. Further strain can cause the \nremaining metallic ligaments to shear or rupture, resulting in \nthe step-like fracture appearance. \nXl.3.2 A high or concentrated inclusion content in the steel \nproduces planar regions of poor ductility parallel to the steel \nsurface. On the other hand, a reduction in the magnitude and \nconcentration of these inclusions to a low level tends to \npreclude any easy fracture path along the low ductility inclu­\nsions and the steel exhibits improved ductility in a through­\nthickness direction. \nXl.3.3 The extent of nonmetallic inclusions depends on the \ntype of steel. In silicon semikilled or fully killed steels, these \ninclusions are primatily oxides (present as silicates) and \nsulfides (present as manganese sulfides). For aluminum-silicon \nkilled steels, these inclusions are primarily sulfides (manganese \nsulfides). To improve the through-thickness ductility and thus \nthe resistance of the steel to lamellar tearing, it is necessary to \nreduce the level of the nonmetallic inclusions. To provide a \nhigh resistance to lamellar tearing may require the use of \nspecial steel-making processes that can reduce the oxygen and \nsulfur contents in the steel to very low levels. \nXl.4 Steel Manufacturing Processes \nXl.4.1 Special steel-making processes are available for \nimproving the through-thickness ductility. The more common \nprocesses, used singly or in combination, are: (J) low sulfur \npractices; (2) inclusion shape control; (3) electroslag or \nvacuum arc remelting; atld (4) vacuum degassing. The steel­\nmaking processes are not all intended for the same purpose, but \nwill improve the through-thickness ductility to various degrees \ndepending on the process used. \nXl.5 Through-Thickness Ductility Requirements \nXl.5.1 Susceptibility to lamellar tearing depends on many \nfactors (for example, restraint, welding conditions, etc.) and, \nconsequently a specific through-thickness ductility require­\nment does not provide a guarantee against lamellar tearing. The \nmost widely accepted method of measuring the material \nductility factor of susceptibility to lamellar tearing is the \nreduction of area of a round tension test specimen oriented \nperpendicular to the rolled surface of a plate. \nX2. TESTING PARAMETERS AFFECTING REDUCTION OF AREA VALUES \nX2.1 Variability of Through-Thickness Properties \nX2.1.1 Through-thickness tension test results, and in par­\nticular the reduction of area determination as provided for in \nthis specification, are subject to substantially greater scatter \nthan would normally be expected from standard tension tests of \na plate in the longitudinal or transverse direction. This scatter \nof test results is due in part to the inherent variability of the \ndistribution of the nonmetallic inclusions discussed in Xl.3. \nFor example, those nonmetallic inclusions that form during the \nsolidification phase of the steelmaking process tend to occur \nwith a higher frequency in the area of final solidification. \nX2.l.2 Test specimen design may also have an effect on the \ntest results. Some of these factors are discussed in X2.2. \nOperator technique will also be a factor in increasing scatter, \nparticularly in the measurement of the final diameter of the test \nspecimen. Because of the effect of inclusions on the fracture \nprocess, the appearance of the final fracture may be quite \ndifferent than the classical cup-cone fractures common to \nlongitudinal and transverse tension testing. For those materials \nwith approximately 20 % reducti.on of area, the final diatneter \nmeasurement may require a substantial amount of judgment on \nthe part of the test operator. \nX2.1.3 In view of the potential variability of the through­\nthickness reduction of area test results, it is recognized that two \ntests per plate are not sufficient to fully characterize the \nthrough-thickness ductility of that plate. The number of tests \nand test positions have not been established that would provide \na good estimate of both the meat1 and the variability of \nthrough-thickness tensile reduction of values of a plate. There­\nfore, an average value requirement is not included in this \nspecification. The intent of this specification is to qualify a \nplate according to the described testing procedures using only \na minimum value requirement. The potential variability of the \ntest results also increases the possibility that subsequent testing \nof a steel plate qualified according to this specification may \nproduce results that do not meet the specified acceptance \nstandard. \nX2.2 Effects of Test Specimen Design \nX2.2.1 Two main factors considered in the selection of test \nspecimen geometry were the diameter and the slenderness \nratio. It is generally accepted that there is a diameter effect on \nreduction-of-area values such that a smaller diameter specimen \ngenerally yields a higher average reduction in area value. It is \nalso accepted that smaller diameter test specimens will tend to \ngive greater variability to the resulting reduction in area values. \nBecause these relationships between the test specimen diam­\neter and the average and variability of the test result have not \nbeen satisfactorily quantified at this time, the same minimum \nrequirement has been applied to all test specimen diameters. \nX2.2.2 The slenderness ratio (reduced section length/ \nreduced section diameter) is lmown to affect the reduction in \n1249 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1315.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6150,
  "bestTextAlphaRatio": 0.8036
}