{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 506,
  "globalPageIndex": 1304,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-751 ASME BPVC.II.A-2025 \nTest Methods and Practices for \nChemical Analysis of Steel Products \nINTRODUCTION \nThese test methods and practices were prepared to answer the need for a single document that would \ninclude all aspects of obtaining and reporting the chemical analysis of steel, stainless steel, and related \nalloys. Such subjects as definitions of terms and product (check) analysis variations (tolerances) \nrequired clarification. Requirements for sampling, meeting specified limits, and treatment of data \nusually were not clearly established in product specifications. \nIt is intended that these test methods and. practices will contain all requirements for the \ndetermination of chemical composition of steel, stainless steel, or related alloys so that product \nspecifications will need contain only special modifications and exceptions. \n1. Scope \n1.1 These test methods and practices cover definitions, \nreference methods, practices, and guides relating to the chemi­\ncal analysis of steel, stainless steel, and related alloys. They \ninclude both wet chemical and instrumental techniques. \n1.2 Directions are provided for handling chemical \nrequirements, product analyses, residual elements, and refer­\nence standards, and for the treatment and reporting of chemical \nanalysis data. \n1.3 These test methods and practices apply only to those \nproduct standards which include these test methods and \npractices, or parts thereof, as a requirement. \n1.4 In cases of conflict, the product specification require­\nments shall take precedence over the requirements of these test \nmethods and practices. \n1.5 Attention is directed to ISO/IEC 17025 when there may \nbe a need for information on criteria for evaluation of testing \nlaboratories. \n1.6 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE50 Practices for Apparatus, Reagents, and Safety Consid­\nerations for Chemical Analysis of Metals, Ores, and \nRelated Materials \nE60 Practice for Analysis of Metals, Ores, and Related \nMaterials by Spectrophotometry \nE322 Test Method for Analysis of Low-Alloy Steels and \nCast Irons by Wavelength Dispersive X-Ray Fluorescence \nSpectrometry (Withdrawn 2021) \nE350 Test Methods for Chemical Analysis of Carbon Steel, \nLow-Alloy Steel, Silicon Electrical Steel, Ingot Iron, and \nWrought Iron \nE352 Test Methods for Chemical Analysis of Tool Steels and \n1234 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1304.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3186,
  "bestTextAlphaRatio": 0.7979
}