{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 97,
  "globalPageIndex": 895,
  "width": 621.72,
  "height": 799.2,
  "text": "ASME BPVC.II.A-2025 SA-480/SA-480M (ASTM A480/A480M) \n22. Inspection \n22.1 Inspection of the material by the purchaser's represen­\ntative at the producing plant shall be made as agreed upon \nbetween the purchaser and the seller as part of the purchase \norder. \n22.2 Unless otherwise specified in the contract or purchase \norder, (1) the seller is responsible for the performance of all the \ninspection and test requirements in this specification, (2) the \nseller is permitted to use own or other suitable facilities for the \nperformance of the inspection and testing, and (3) the pur­\nchaser shall have the right to perform any of the inspection and \ntests set forth in this specification. The manufacturer shall \nafford the purchaser's inspector all reasonable facilities neces­\nsary to satisfy the inspector that the material is being furnished \nin accordance with the specification. Inspection by the pur­\nchaser shall not interfere unnecessarily with the manufacturer. \n23. Rejection \n23.1 Unless otherwise specified, any rejection based on tests \nmade in accordance with this specification shall be reported to \nthe seller within 60 working days from the receipt of the \nmaterial by the purchaser. \n23.2 Material that shows injurious imperfections as de­\nscribed in Section 10 subsequent to its acceptance at the \npurchaser's works will be rejected and the seller shall be \nnotified. \n24. Rehearing \n24.1 Samples tested in accordance with this specification \nthat represent rejected material shall be retained for three \nweeks from the date of the notification to the seller of the \nrejection. In case of dissatisfaction with the results of the test, \nthe seller is permitted to make claim for a rehearing within that \ntime. \n25. Packaging, Marking, and Loading \n25.1 For Commercial Procurement: \n25.1.1 Marking-Unless otherwise specified in the appli­\ncable material specification or the purchase order, marking \nshall be conducted as follows: \n25.1.1.1 Sheet, strip, and plate shall be marked on one face, \nin the location indicated below with the specification designa­\ntion number, type of steel (type or UNS designation), material \nidentification number, and the name or mark of the manufac­\nturer. For sheet, strip, and plate whose length and width \ndimensions are both less than 24 in., each piece shall be \nmarked with the type of steel and material identification \nnumber. The specification and designation number, and name \nor mark of the manufacturer shall be marked on the piece(s) or \nattached to the item or bundle. The characters shall be of such \nsize as to be clearly legible. The marking shall be sufficiently \nstable to withstand normal handling. Unless otherwise speci­\nfied by the purchaser, the marking, at the producers option, is \npermitted to be done with (J) marking fluid (if a specific \nmaximum impurity limit of designated elements in the marking \nfluid is required by the purchaser, it shall be so stated on the \npurchase order), (2) low-stress blunt-nosed continuous or \nlow-stress blunt-nosed-interrupted-dot die stamp, (3) a vibra­\ntory tool with a minimum tip radius of 0.005 in. [0.1 mm], or \n(4) electrochemical etching. \n25.1.1.2 Flat sheet, strip in cut lengths, and plate shall be \nmarked in two places near the ends or shall be continuously \nline marked along one edge. For flat sheet, strip in cut lengths, \nand plate whose length and width dimensions are both less than \n48 in., it is permitted to mark such pieces in only one place. \n25.1.1.3 Sheet, strip, and plate in coil form shall be marked \nnear the outside end of the coil. The inside of the coil shall also \nbe marked or shall have a tag or label attached and marked with \nthe information of 25.1.1.1. \n25.1.1.4 Material less than¼ in. [6.4 mm] in thickness shall \nnot be marked with die stamps. \n25.1.1.5 The manufacturer's test identification number shall \nbe legibly stamped on each test specimen, if to be shipped to \nthe customer. \n25.1.1.6 Material that conforms completely with the re­\nquirements of two types of steel within the ordering specifica­\ntion is permitted to be marked as both types of steel provided \nthat the manufacturer is certifying the material as meeting the \nrequirements of each of the types of steel. Such marking, if \nused, shall be part of the same marking as used for a single type \nof steel, or shall be a separate but similar marking immediately \nadjacent to the marking used for a single type of steel. \n25. 1.1 .7 The AIAG primary metals identification tag (AIAG \nB-5) is permitted to be used as an auxiliary method of \nidentification in cases where a bar-coded identification tag is \ndesired. Use of this method shall be by agreement between \npurchaser and supplier. \n25.1.2 Packaging and Loading-Unless otherwise speci­\nfied in the applicable material specification or the purchase \norder, packaging, and loading shall be in accordance with the \nprocedures recommended by Practices A700. \n25.2 For U.S. Government Procurement: \n25.2.1 When specified in the contract or order, and for direct \nprocurement by or direct shipment to the government, marking \nfor shipment shall be in accordance with Fed. Std. No. 123. \n793 \n26. Keywords \n26.1 austenitic stainless steel; duplex stainless steel; ferritic \nstainless steel; martensitic stainless steel; stainless steel; stain­\nless steel plate; stainless steel sheet; stainless steel strip ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0895.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5378,
  "bestTextAlphaRatio": 0.7648
}