{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 400,
  "globalPageIndex": 1198,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-672/SA-672M ASME BPVC.U.A-2025 \nTABLE 1 Plate Specification \nPipe Grade Type of Steel \nASTM Specification \nNo. Grade \nA45 plain carbon A285/A285M A \nA50 plain carbon A285/A285M B \nA55 plain carbon A285/A285M C \nB60 plain carbon, killed A515/A515M 60 \nB 65 plain carbon, killed A515/A515M 65 \nB70 plain carbon, killed A515/A515M 70 \nC55 plain carbon, killed, fine grain A516/A516M 55 \nC60 plain carbon, killed, fine grain A516/A516M 60 \nC65 plain carbon, killed, fine grain A516/A516M 65 \nC70 plain carbon, killed, fine grain A516/A516M 70 \nD70 manganese-silicon- A537/A537M Cl-1 \nnormalized \nD80 manganese-silicon-Q&TA A537/A537M Cl-2 \nH 75 manganese-molybdenum- A302/A302M A \nnormalized \nH 80 manganese-molybdenum- A302/A302M B, C or D \nnormalized \nJ 80 manganese-molybdenum- A533/A533M Cl-1 8 \nQ&TA \nJ 90 manganese-molybdenum- A533/A533M Cl-2 8 \nQ&TA \nJ 100 manganese-molybdenum- A533/A533M Cl-3 8 \nQ&TA \nL 65 molybdenum A204/A204M A \nL 70 molybdenum A204/A204M B \nL 75 molybdenum A204/A204M C \nN 75 manganese-silicon A299/A299M A \nA Q&T = quenched and tempered. \n8 Any grade may be furnished. \n6. General Requirements \n6.1 Material furnished to this specification shall conform to \nthe applicable requirements of the current edition of Specifi­\ncation A530/A530M unless otherwise provided herein. \n7. Chemical Composition \n7.1 Product Analysis of Plate-The pipe manufacturer shall \nmake an analysis of each mill heat of plate material. The \nproduct analysis so determined shall meet the requirements of \nthe plate specification to which the material was ordered. \n7 .2 Product Analysis of Weld-The pipe manufacturer shall \nmake an analysis of the finished deposited weld material from \neach 500 ft [150 m] or fraction thereof. Analysis shall conform \nto the welding procedure for deposited weld metal. \n7.3 Analysis may be taken from the mechanical test speci­\nmens. The results of the analyses shall be reported to the \npurchaser. \n7 .4 If the analysis of one of the tests specified in 7 .1 or 7 .2 \ndoes not conform to the requirements specified, analyses shall \nbe made on additional pipes of double the original number \nfrom the same lot, each of which shall conform to the \nrequirements specified. Nonconforming pipe shall be rejected. \n8. Mechanical Properties \n8.1 Tension Test: \n8.1.1 Requirements-Transverse tensile properties of the \nwelded joint shall meet the minimum requirements for ultimate \ntensile strength of the specified plate material. In addition for \nGrades Dxx, Hxx, Jxx, and Nxx in Classes 3x, 4x, and 5x \ntransverse tensile properties of the base plate, shall be deter­\nmined on specimens cut from the heat-treated pipe. These \nproperties shall meet the mechanical test requirements of the \nplate specification. \n8.1.2 Number of Tests-One test specimen shall be made to \nrepresent each lot of finished pipe. \n8.1.3 Test Specimen Location and Orientation-The test \nspecimens shall be taken transverse to the weld at the end of \nthe finished pipe and may be flattened cold before final \nmachining to size. \n8.1.4 Test Method-The test specimen shall be made in \naccordance with QW-150 in Section IX of the ASME Boiler \nand Pressure Vessel Code. The test specimen shall be tested at \nroom temperature in accordance with Test Methods and Defi­\nnitions A370. \n8.2 Transverse-Guided-Weld-Bend Tests: \n8 .2.1 Requirements-The bend test shall be acceptable if no \ncracks or other defects exceeding 1/s in. [3 mm] in any direction \nare present in the weld metal or between the weld and the base \nmetal after bending. Cracks that originate along the edges of \nthe specimen during testing, and that are less than \n¼ in. [6 mm] measured in any direction shall not be consid­\nered. \n8.2.2 Number of Tests-One test (two specimens) shall be \nmade to represent each lot of finished pipe. \n8.2.3 Test Specimen Location and Orientation-Two bend \ntest specimens shall be taken transverse to the weld at the end \nof the finished pipe. As an alternative by agreement between \nthe purchaser and the manufacturer, the test specimens may be \ntaken from a test plate of the same material as the pipe, the test \nplate being attached to the end of the cylinder and welded as a \nprolongation of the pipe longitudinal seam. \n8.2.4 Test Method-The test requirements of Test Methods \nand Definitions A370, paragraph A2.5.l.7 shall be met. For \nwall thickness over 3/s in. [10 mm] but less than¾ in. [19 mm] \nside-bend tests may be made instead of the face and root-bend \ntests. For wall thicknesses ¾ in. [19 mm] and over both \nspecimens shall be subjected to the side-bend test. \n8.3 Pressure Test-Classes X2 and X3 pipe shall be tested in \naccordance with Specification A530/A530M, Hydrostatic Test \nRequirements. \n9. Radiographic Examination \n9 .1 The full length of each weld of Classes X 1 and X2 shall \nbe radiographically examined in accordance with and meet the \nrequirements of the ASME Boiler and Pressure Vessel Code, \nSection VIII, paragraph UW-51. \n9.2 Radiographic examination may be performed prior to \nheat treatment. \n10. Rework \n10.1 Elimination of Suiface Impeifections-Unacceptable \nsurface imperfections shall be removed by grinding or machin­\ning. The remaining thickness of the section shall be no less than \n1108 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1198.json",
  "tabulaTablesCsv": "tables_tabula/page-1198.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1198.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5237,
  "bestTextAlphaRatio": 0.7248
}