{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 701,
  "globalPageIndex": 1499,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-985/SA-985M \nSUPPLEMENTARY REQUIREMENTS \nThe following standardized supplementary requirements are for use when desired by the \npurchaser and when allowed by and listed in the individual specifications. They shall not \napply unless specified in the order, in which event the specified tests shall be made by the \nmanufacturer before shipment of the castings. \nS1. Unspecified Elements \nS1.1 Limits may be established for elements not speci­\nfied for the grade ordered by agreement between the manu­\nfacturer and purchaser. The results of the analysis for the \nagreed upon elements shall be reported. \nS2. Destruction Tests \nS2.1 Purchaser may select representative castings from \neach heat and cut up and etch, or otherwise prepare, the \nsections for examination for internal defects. Should injuri­\nous defects be found that evidence unsound steel or faulty \nfoundry technique, all of the castings made from that partic­\nular pattern, heat, and heat treatment charge may be \nrejected. All other rejected castings, including those cut \nup, shall be replaced by the manufacturer without charge. \nS3. Bend Test \nS3.1 One bend test shall be made from a test coupon \nfrom each master heat in accordance with Test Methods \nand Definitions A 370, and shall be machined to 1 by ½ in. \n[25 by 13 mm] section with corners rounded to a radius \nnot over ½ 6 in. [1.6 mm]. \nS3.2 The specimen shall withstand being bent longitu­\ndinally at room temperature through an angle of 90° about \na pin, the diameter of which shall be the specimen thiclmess \nfor carbon steels, and 1 in. [25 mm] for other steels. The \nspecimen shall show no cracks on the outside of the bent \nportion of the specimen. \nS3.3 Bend test specimens may be cut from heat-treated \ncastings instead of from test bars when agreed upon \nbetween manufacturer and purchaser. \nS3.4 If any test specimen shows defective machining or \ndevelops flaws, it may be discarded and another specimen \nsubstituted from the same heat. \nS4. Magnetic Particle Inspection \nS4.1 Castings shall be examined for surface and near­\nsurface discontinuities by magnetic particle inspection. The \nexamination shall be in accordance with Guide E 709, and \ntypes and degrees of discontinuities considered shall be \njudged by the Reference Photographs E 125. Extent of \nexamination, time of examination, and basis for acceptance \nshall be agreed upon between the manufacturer and pur­\nchaser. Specification, which may be used as a basis for \nsuch agreement, are Specifications A 903/ A 903M and \nMSS SP 53. \nS4.2 Personnel performing the examination shall be \nqualified in accordance with an acceptable written practice. \nS5. Radiographic Inspection \nS5.1 Castings shall be examined for internal defects \nby means of X rays or gamma rays. The procedure shall \nbe in accordance with Guide E 94 and types and degrees \nof discontinuities considered shall be judged by Reference \nRadiographs E 186, E 192, E 280, or E 446. Extent of \nexamination and basis for acceptance shall be agreed upon \nbetween the manufacturer and purchaser. A specification \nthat may be used as a basis for such agreement is MSS \nSP 54. \nS5.2 Radiographic examination of castings may be per­\nformed before or after any heat treatment. \nS5.3 Personnel performing the examination shall be \nqualified in accordance with an acceptable written practice. \nS6. Liquid Penetrant Inspection \nS6.1 Castings shall be examined for surface discontinu­\nities by means ofliquid penetrant inspection. The examina­\ntion shall be in accordance with Test Method E 165. Areas \nto be inspected, time of inspection, methods and types of \nliquid penetrants to be used, developing procedure, and \nbasis for acceptance shall be agreed upon between the \nmanufacturer and purchaser. A specification, which may \nbe used as a basis for such agreement, is A 903 / A 903M. \nS6.2 Personnel performing the examination shall be \nqualified in accordance with an acceptable written practice. \nS7. Ultrasonic Inspection \nS7.1 Castings shall be examined for internal defects \nby means of ultrasonic inspection. The inspection proce­\ndure shall be in accordance with Practice A 609 / A 609M. \n1443 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1499.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4176,
  "bestTextAlphaRatio": 0.772
}