{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 658,
  "globalPageIndex": 1456,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-960 /SA-960M ASME BPVC.II.A-2025 \nS78. Requirements for Carbon Steel Products for Concen­\ntrated Hydrofluoric Acid Service \nS78.l The maximum carbon equivalent based on heat \nanalysis shall be as follows: \nMaximum section thickness less than or equal \nto 1 in. \nMaximum section thickness greater than 1 in. \nCE maximum = 0.43 \nCE maximum = 0.45 \nS78.2 Determine the carbon equivalent (CE) as follows: \nCE = C + Mn/6 + (Cr + Mo + V)/5 + (Ni + Cu)/15 \nS78.3 Vanadium and Niobium maximum content based on \nheat analysis shall be: \nMaximum Vanadium = 0.02 wt % \nMaximum Niobium = 0.02 wt % \nMaximum Vanadium plus Niobium = 0.03 wt % \n(Note Niobium = Columbium) \nS78.4 The maximum composition based on heat analysis of \nNi+ Cu shall be 0.15 wt%. \nS78.5 The minimum C content based on heat analysis shall \nbe 0.18 wt%. The maximum C content shall be as specified in \nthe appropriate material specification. \nS78.6 Repair welds shall not be made with E60XX elec­\ntrodes. Use of E70XX electrodes is recommended and the \nresulting weld chemistry should meet the same chemistry \ncriteria as the base metal as listed above. \nS78. 7 In addition to the requirements of product marking of \nthe specification, an \"HF\" stamp or marking shall be provided \non each component to identify that component complies with \nthis supplementary requirement. \nS79 Pressure Equipment Directive-Mechanical Testing \nS79.1 Charpy impact testing shall be done at the lowest \nscheduled operating temperature, but not higher than 68 °F [20 \noc]. \nS79.2 The frequency of impact testing shall be the same as \nthat specified in the product specification for the tension test, \nwith three individual Charpy test specimens for each required \ntension test. \nS79.3 The minimum impact absorption energy for the \nCharpy test specimen shall be at least 20 ft-lb [27 J]. \nS79.4 The minimum elongation in the tension test shall be \nmeasured on a gauge length of five times the diameter of the \ntest specimen, and shall not be less than 14 %. \nS79.5 Impact and tension test results shall be included in the \nproduct certification. \nANNEXES \n(Mandatory Information) \nAl. REQUIREMENTS FOR THE INTRODUCTION OF NEW MATERIALS \nAl.I New materials may be proposed for inclusion in \nspecifications referencing this specification of general require­\nments subject to the following conditions: \nAl.LI Application for the addition of a new grade to a \nspecification shall be made to the chair of the subcommittee \nthat has jurisdiction over that specification. \nAl.1.2 The application shall be accompanied by a statement \nfrom at least one user indicating that there is a need for the new \ngrade to be included in the applicable specification. \nAl.1.3 The application shall be accompanied by test data as \nrequired by the applicable specification. Test data from a \nminimum of three test lots, as defined by the specification, each \nfrom a different heat, shall be furnished. \nAl.1.4 The application shall provide recommendations for \nall requirements appearing in the applicable specification. \nAl.1.5 The application shall state whether the new grade is \ncovered by patent. \n1398 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1456.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3126,
  "bestTextAlphaRatio": 0.7514
}