{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 324,
  "globalPageIndex": 1122,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-587 ASME BPVC.II.A-2025 \nworks that concern the manufacture of the pipe ordered. The \nmanufacturer shall afford the inspector, without charge, all \nreasonable facilities to satisfy the inspector that the material is \nbeing furnished in accordance with this specification. All tests \nand inspection shall be made prior to shipment. \n14.2 When inspection at the place of manufacture has been \nwaived by customer, the manufacturer shall furnish a statement \nthat the material has been tested and has met all the require­\nments of this specification. A certificate or report shall be made \navailable to customer when all the requirements of this \nspecification have been met. When Supplementary Require­\nment S 1 is furnished, certificates or reports furnished shall bear \nthe notation \"S-1.\" \n15. Rejection \n15.1 Each length of pipe received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of this specification based on the inspection and \ntest method as outlined in the specification, the length may be \nrejected and the manufacturer shall be notified. Disposition of \nrejected pipe shall be a matter of agreement between the \nmanufacturer and the purchaser. \n15.2 Pipe found in fabrication or in installation to be \nunsuitable for the intended use, under the scope and require­\nments of this specification, may be set aside and the manufac­\nturer notified. Such pipe shall be subject to mutual investiga­\ntion as to the nature and severity of the deficiency and the \nforming or installation, or both, conditions involved. Disposi­\ntion shall be a matter for agreement. \n16. Product Marking \n16.1 Each length of pipe NPS 1 ½ and larger shall be legibly \nmarked by either stenciling or stenciling and light die marking. \nThe die marking shall include the manufacturer's logo or \nsymbol and the stenciling shall include the name or brand of \nthe manufacturer, size, heat number, and the specification \nnumber. Such marking shall be applied starting within 8 in. \n(203 mm) of the end of each length. \n16.2 For NPS under 1 ½ the markings prescribed in 16.1 \nmay be applied to tags and securely attached to the bundle, \nbale, or other unit, prepared for shipment. \n16.3 A tag shall be securely attached to each bundle of pipe \nshipped indicating the name of the manufacturer, size, wall \nthickness, length, and specification. \n16.4 Bar Coding-In addition to the requirements in 16.1, \n16.2, and 16.3, bar coding is acceptable as a supplemental \nidentification method. The purchaser may specify in the order \na specific bar coding system to be used. \n17. Packaging \n17 .1 The manufacturer, at his option, will box, crate, carton, \nor package in secured lifts, or bundle to ensure safe delivery. \nSpecial packaging requiring extra operations other than those \nnormally used by the manufacturer must be specified on the \norder. \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the supplementary requirements described below may be included in the purchaser's \norder or contract. When so included, a supplementary requirement shall have the same force as if it \nwere in the body of the specification. Supplementary requirements details not fully described shall be \nagreed upon between the purchaser and the supplier, but shall not negate any of the requirements in \nthe body of the specification. \nSl. Hydrostatic Testing \nS1.1 Hydrostatic testing shall be in accordance with Speci­\nfication A530/A530M. When this supplement is furnished the \npipe shall be marked \"S-1.\" \nS2. Galvanizing \nS2.1 Galvanizing shall be in accordance with Specification \nA53/A53M, except that the rate of application shall be 1.3 \nminimum to 1.7 maximum oz per f. \nS3. Surface Coatings \nS3.1 All surfaces shall be coated, the exterior with a hard \ndrying lacquer, and the interior with a suitable rust inhibitor. \n1028 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1122.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3838,
  "bestTextAlphaRatio": 0.7744
}