{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 656,
  "globalPageIndex": 1454,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-960/SA-960M ASME BPVC.II.A-2025 \nshall be used unless the material to be tested is of insufficient \nthickness, in which case the largest obtainable standard subsize \nimpact specimens shall be used. When the size or shape of the \nfinished fittings is insufficient to permit obtaining the smallest \nstandard subsize impact specimens, an impact test by the fitting \nmanufacturer will not be required. \n13. Hydrostatic Test Requirements \n13 .1 Parts manufactured under this specification shall be \ncapable of passing a hydrostatic test compatible with the rating \nof the specified matching pipe of equivalent material. Such a \ntest shall be conducted only when specified in the purchase \norder or when the hydrostatic test Supplementary Requirement \nis invoked by the purchaser. \n14. Rework \n14.1 When one or more representative test specimens or \nretest specimens do not conform to the requirements specified \nin the product specification for the tested characteristic, the lot \nof material represented by the test specimen may be reworked \naccording to the following requirements. \n14.1.1 If previously tested in the untreated condition, the \nproduct may be reworked by heat treatment, and subsequently \nretested, in accordance with the product specification. \n14.1.2 If previously tested in the heat treated condition, the \nproduct may be reworked by reheat treatment, and subse­\nquently retested, in accordance with the product specification. \n15. Surface Finish, Appearance, and Corrosion \nProtection \n15.1 The parts shall conform to the dimensions, tolerances \nand finish as specified in the purchaser's order and to the \nindividual ASTM product specification. \n15.2 The finished parts shall be cleaned to remove all scale \nand processing compounds prior to the final surface examina­\ntion. The cleaning process shall not injure the surface finish, \nmaterial properties, or the metallurgical structure. \n15.2.1 The surface finish shall allow the detection of imper­\nfections that can be disclosed by visual inspection. \n15.2.2 The cleaned parts shall be protected to prevent \nrecontamination. \n15.2.2.1 Exterior and interior surfaces of carbon, low, and \nintermediate alloy steel fittings shall have a corrosion protec­\ntive coating. Unless otherwise specified by the purchaser, the \ntype of surface protection shall be at the option of the \nmanufacturer. \n15.2.2.2 Stainless steel and nickel alloy fittings need not be \ncoated. Unmachined surfaces of stainless steel fittings shall be \npassivated by exposure to an acid bath, or electropolished. \n15.2.3 Protective coatings on parts subsequently subjected \nto socket welds or butt welds shall be suitable for welding \nwithout removal of the coating. Threaded fittings shall be \ncapable of installation without the removal of the coating. \n15.2.4 When specified in the purchase order, parts may be \nfurnished in the as-formed condition. \n15.3 Fittings supplied under this specification shall be \nexamined visually. Selected typical surface discontinuities \nshall be explored for depth. Unless otherwise specified in the \npurchase order, the following shall apply. \n15.3.1 Fittings conforming to ASME B16.9, MSS-SP-43, \nand MSS-SP-95 shall be free of surface discontinuities that \npenetrate more than 5 % of the specified nominal wall \nthickness, except as defined in 15.3.3 and 15.3.4. Fittings \nconforming to ASME B16.11, MSS-SP-79, MSS-SP-83, and \nMSS-SP-97 shall be free of surface discontinuities that pen­\netrate more than 5 % of the actual wall thickness at the point of \ninterest, or 1/16 in. [1.6 mm], whichever is less, except as \ndefined in 15.3.4. Fittings conforming to MSS-SP-75 shall be \nfree of surface discontinuities that penetrate more than 6½ % \nof the specified nominal wall thickness. \n15.3.2 Surface discontinuities deeper than 5 % of the speci­\nfied nominal or actual wall thickness as applicable, except as \ndefined in 15.3.3 and 15.3.4, shall be removed by the manu­\nfacturer by machining or grinding to sound metal, and the \nrepaired areas shall blend smoothly into the contour of the \nfinished fitting. Surface discontinuities on fittings conforming \nto MSS-SP- 75 shall be removed or repaired in accordance with \nthe requirements of that standard. Except for fittings conform­\ning to MSS-SP-75, the wall thickness at all points shall be at \nleast the specified minimum wall thickness, or 87½ % of the \nspecified nominal wall thickness and the diameters shall be \nwithin the limits specified in the applicable dimensional \nstandards. \n15.3.3 Surface checks (fish scale) deeper than 1/64 in. [0.4 \nmm] shall be removed. \n15.3.4 Mechanical marks deeper than 1/16 in. [1.6 mm] shall \nbe removed. \n15.3.5 When the removal of a surface discontinuity reduces \nthe wall thickness below the specified minimum wall thickness \nat any point, the fitting shall be subject to rejection or to repair \nas provided in Section 16, or in accordance with MSS-SP- 75 \nfor fittings conforming to that standard. \n16. Repair by Welding \n16.1 The purchaser may require the supplier to submit \nproposed weld repairs for approval by invoking the appropriate \nSupplementary Requirement in the purchase order. \n16.2 If the purchaser does not require prior approval of the \nproposed weld repairs, these repairs shall be permitted at the \ndiscretion of the supplier. All weld repairs shall be performed \nin accordance with the following limitations and requirements. \n16.2.1 The welding procedure, welders and operators shall \nbe qualified in accordance with Section IX of the ASME Boiler \nand Pressure Vessel Code. The composition of the weld deposit \nshall be compatible with the composition of the material being \nwelded. \n16.2.2 Defects shall be completely removed prior to weld­\ning by machining, chipping or grinding to sound metal. \nRemoval of these defects shall be verified by magnetic particle \nexamination in accordance with Guide E709 or liquid penetrant \ninspection in accordance with Test Method E165/E165M, as \napplicable. \n16.2.3 After repair welding, the welded area shall be ma­\nchined or ground smooth to the original contour and shall be \ncompletely free of defects as verified by magnetic particle \n1394 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1454.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6177,
  "bestTextAlphaRatio": 0.7703
}