{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 62,
  "globalPageIndex": 62,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \nNoTE 5-Unless otherwise specified, structural products are normally \nfurnished in the as-rolled condition and are subjected to visual inspection \nby the manufacturer or processor. Non-injurious surface or internal \nimperfections, or both, may be present in the structural product as \ndelivered and the structural product may require conditioning by the \npurchaser to improve its appearance or in preparation for welding, coating, \nor other further operations. \nMore restrictive requirements may be specified by invoking supplemen­\ntary requirements or by agreement between the purchaser and the supplier. \nStructural products that exhibit injurious defects during subsequent \nfabrication are deemed not to comply with the applicable product \nspecification. (See 17 .2.) Fabricators should be aware that cracks may \ninitiate upon bending a sheared or burned edge during the fabrication \nprocess; this is not considered to be a fault of the steel but is rather a \nfunction of the induced cold-work or the heat-affected zone. \nThe conditioning requirements in 9.2, 9.3, and 9.4 limit the condition­\ning allowed to be performed by the manufacturer or processor. Condition­\ning of imperfections beyond the limits of 9.2, 9.3, and 9.4 may be \nperformed by parties other than the manufacturer or processor at the \ndiscretion of the purchaser. \n9.2 Plate Conditioning: \n9.2.1 The grinding of plates by the manufacturer or proces­\nsor to remove imperfections on the top or bottom surface shall \nbe subject to the limitations that the area ground is well faired \nwithout abrupt changes in contour and the grinding does not \nreduce the thickness of the plate by (J) more than 7 % under \nthe nominal thickness for plates ordered to weight per square \nfoot or mass per square metre, but in no case more than 1/s in. \n[3 mm]; or (2) below the permissible minimum thickness for \nplates ordered to thickness in inches or millimetres. \n9.2.2 The deposition of weld metal (see 9.5) following the \nremoval of imperfections on the top or bottom surface of plates \nby chipping, grinding, or arc-air gouging shall be subject to the \nfollowing limiting conditions: \n9.2.2.l The chipped, ground, or gouged area shall not \nexceed 2 % of the area of the surface being conditioned. \n9.2.2.2 After removal of any imperfections preparatory to \nwelding, the thickness of the plate at any location shall not be \nreduced by more than 30 % of the nominal thickness of the \nplate. (Specification A131/A131M restricts the reduction in \nthickness to 20 % maximum.) \n9.2.3 The deposition of weld metal (see 9.5) following the \nremoval of injurious imperfections on the edges of plates by \ngrinding, chipping, or arc-air gouging by the manufacturer or \nprocessor shall be subject to the limitation that, prior to \nwelding, the depth of the depression, measured from the plate \nedge inward, is not more than the thickness of the plate or 1 in. \n[25 mm], whichever is the lesser. \n9.3 Structural Size Shapes, Bar Size Shapes, and Sheet \nPiling Conditioning: \n9.3.1 The grinding, or chipping and grinding, of structural \nsize shapes, bar size shapes, and sheet piling by the manufac­\nturer or processor to remove imperfections shall be subject to \nthe limitations that the area ground is well faired without \nabrupt changes in contour and the depression does not extend \nbelow the rolled surface by more than (J) 1/32 in. [1 mm], for \nmaterial less than 3/s in. [10 mm] in thickness; (2) 1/16 in. [2 \nmm], for material 3fs to 2 in. [10 to 50 mm] inclusive in \nthickness; or (3) 1/s in. [3 mm], for material over 2 in. [50 mm] \nin thickness. \n9.3.2 The deposition of weld metal (see 9.5) following \nremoval of imperfections that are greater in depth than the \nlimits listed in 9.3.1 shall be subject to the following limiting \nconditions: \n9.3.2.1 The total area of the chipped or ground surface of \nany piece prior to welding shall not exceed 2 % of the total \nsurface area of that piece. \n9.3.2.2 The reduction of thickness of the material resulting \nfrom removal of imperfections prior to welding shall not \nexceed 30 % of the nominal thickness at the location of the \nimperfection, nor shall the depth of depression prior to welding \nexceed 1 ¼ in. [32 mm] in any case except as noted in 9.3.2.3. \n9.3.2.3 The deposition of weld metal (see 9.5) following \ngrinding, chipping, or arc-air gouging of the toes of angles, \nbeams, channels, and zees and the stems and toes of tees shall \nbe subject to the limitation that, prior to welding, the depth of \nthe depression, measured from the toe inward, is not more than \nthe thickness of the material at the base of the depression or ½ \nin. [12.5 mm], whichever is the lesser. \n9.3.2.4 The deposition of weld metal (see 9.5) and grinding \nto correct or build up the interlock of any sheet piling section \nat any location shall be subject to the limitation that the total \nsurface area of the weld not exceed 2 % of the total surface \narea of the piece. \n9.4 Bar Conditioning: \n9.4.1 The conditioning of bars by the manufacturer or \nprocessor to remove imperfections by grinding, chipping, or \nsome other means shall be subject to the limitations that the \nconditioned area is well faired and the affected sectional area'is \nnot reduced by more than the applicable permitted variations \n.. (see Section 12). \n10 \n9.4.2 The deposition of weld metal (see 9.5) following \nchipping or grinding to remove imperfections that are greater \nin depth than the limits listed in 9.4.1 shall be subject to the \nfollowing conditions: \n9.4.2.1 The total area of the chipped or ground surface of \nany piece, prior to welding, shall not exceed 2 % of the total \nsurface area of the piece. \n9.4.2.2 The reduction of sectional dimension of a round, \nsquare, or hexagon bar, or the reduction in thickness of a flat \nbar, resulting from removal of an imperfection, prior to \nwelding, shall not exceed 5 % of the nominal dimension or \nthickness at the location of the imperfection. \n9.4.2.3 For the edges of flat bars, the depth of the condi­\ntioning depression prior to welding shall be measured from the \nedge inward and shall be limited to a maximum depth equal to \nthe thickness of the flat bar or ½ in. [12.5 mm], whichever is \nless. \n9.5 Repair by Welding: \n9.5.1 General Requirements: \n9.5.1.1 Repair by welding shall be in accordance with a \nwelding procedure specification (WPS) using shielded metal \narc welding (SMAW), gas metal arc welding (GMAW), flux \ncored arc welding (FCAW), or submerged arc welding (SAW) \nprocesses. Shielding gases used shall be of welding quality. \n9.5.1.2 Electrodes and electrode-flux combinations shall be \nin accordance with the requirements of A WS Specifications \nA5.l/A5.1M, A5.5/A5.5M, A5.17/A5.17M, A5.18/A5.18M, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0062.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6773,
  "bestTextAlphaRatio": 0.7462
}