{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 695,
  "globalPageIndex": 695,
  "width": 596.16,
  "height": 841.8,
  "text": "ASME BPVC.II.A-2025 SA-376/SA-376M \n11.3 Flattening Test-For pipe heat treated in a batch-type \nfurnace not equipped with recording pyrometers and automati­\ncally controlled within a 50 °F [30 °C] or lesser range, the \nflattening test shall be made on 5 % of the pipe from each \nheat-treated lot. When heat treated by the continuous process, \nby quenching after hot forming or in a batch-type furnace \nequipped with recording pyrometers and automatically con­\ntrolled within a 50 °F [30 °C] or lesser range, this test shall be \nmade on a sufficient number of pipe to constitute 5 % of the lot \nbut in no case less than two pipes. \n12. Certification \n12.1 In addition to the certification required by Specification \nA999/ A999M, the certification for pipe furnished to this \nspecification shall identify each length of pipe which is \nfurnished without the manufacturer's completed hydrostatic \ntest, in accordance with 10.3. \n13. Product Marking \n13.1 In addition to the marking prescribed in Specification \nA999/ A999M, the marking shall include the ANSI schedule \nnumber, the heat number or manufacturer's number by which \nthe heat can be identified, and if applicable, NH when \nhydrotesting is not performed and ET when eddy-current testing \nis performed, or UT when ultrasonic testing is performed. \n13.2 If the pipe conforms to any of the supplementary \nrequirements specified in S 1 through S 10, compliance shall be \nso indicated by adding the symbol \"S\" directly followed by the \nnumber of the applicable supplementary requirement to the \nmarking prescribed in 13.1. \n13.3 No steel indentation stamping shall be done without \nthe purchaser's consent. \n14. Keywords \n14.1 austenitic stainless steel; central station service; feed­\nwater heater tubes; stainless steel tube; steel tube; welded steel \ntube \nSUPPLEMENTARY REQUIREMENTS \nFOR PIPE REQUIRING SPECIAL CONSIDERATION \nOne or more of the following supplementary requirements shall apply only when specified in the \npurchase order. The purchaser may specify a different frequency of test or analysis than is provided \nin the supplementary requirement. Subject to agreement between the purchaser and manufacturer, \nretest and retreatment provisions of these supplementary requirements may also be modified. \nSl. Product Analysis \nS 1. 1 Product analysis shall be made on each length of pipe. \nIndividual lengths failing to conform to the chemical compo­\nsition requirements shall be rejected. \nS2. Transverse Tension Tests \nS2. l A transverse tension test shall be made on a specimen \nfrom one end or both ends of each pipe NPS 8 [DN 200] and \nover in nominal diameter. If this supplementary requirement is \nspecified, the number of tests per pipe shall also be specified. \nIf a specimen from any length fails to meet the required tensile \nproperties (tensile, yield, and elongation), that length shall be \nrejected subject to retreatment in accordance with Specification \nA999/ A999M and satisfactory retest. \nS3. Flattening Test \nS3.l The flattening test of Specification A999/A999M shall \nbe made on a specimen from one end or both ends of each pipe. \nCrop ends may be used. If this supplementary requirement is \nspecified, the number of tests per pipe shall also be specified. \nIf a specimen from any length fails because of lack of ductility \nprior to satisfactory completion of the first step of the flattening \ntest requirement that pipe shall be rejected subject to retreat­\nment in accordance with Specification A999/ A999M and \nsatisfactory retest. If a specimen from any length of pipe fails \nbecause of a lack of soundness that length shall be rejected, \nunless subsequent retesting indicates that the remaining length \nis sound. \nS4. Etching Tests \nS4. l The steel shall be homogeneous as shown by etching \ntests conducted in accordance with the appropriate portions of \nMethod E381. Etching tests shall be made on a cross section \nfrom one end or both ends of each pipe and shall show sound \nand reasonably uniform material free from injurious \nlaminations, cracks, and similar objectionable defects. If this \nsupplementary requirement is specified, the number of tests per \npipe required shall also be specified. If a specimen from any \nlength shows objectionable defects, the length shall be rejected, \nsubject to removal of the defective end and subsequent retests \nindicating the remainder of the length to be sound and \nreasonably uniform material. \nSS. Photomicrographs \nS5.l Photornicrographs at 100 diameters may be made from \none end of each piece of pipe furnished in sizes NPS 6 [DN \n150] and larger in the as-furnished condition. Such photomi­\ncrographs shall be suitably identified as to pipe size, wall \nthickness, piece number, and heat. Such photornicrographs are \nfor information only, and shall show the actual metal structure \nof the pipe as finished. \n645 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0695.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4850,
  "bestTextAlphaRatio": 0.779
}