{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 127,
  "globalPageIndex": 925,
  "width": 615.48,
  "height": 794.4,
  "text": "\\ \n~ \nASME BPVC.II.A-2025 SA-484/SA-484M \nthe option of the manufacturer. Marking shall be made by hot \nstamping, cold stamping, or painting of bars, or by marking \ntags attached to bundles, lifts, or boxes. \n18.1.2 Forgings shall be legibly die stamped with the \nmanufacturer's symbol or name, material specification \ndesignation, grade or type, and heat identification. When die \nstamping is not permitted by the purchaser, electric pencil or \nelectro-etching shall be used. \n18.2 Government Procurement: \n18.2.1 When specified in the contract or order, and for direct \nprocurement by or direct shipment to the government, marking \nfor shipment, in addition to any requirements specified in the \ncontract or order, shall be in accordance with MIL-STD-129 \nfor military agencies and in accordance with Fed. Std. No. 123 \nfor civil agencies. \n18.2.2 For government procurement by the Defense Supply \nAgency, bars and shapes shall be marked continuously for \nidentification in accordance with Fed. Std. No. 183. \n19. Packaging and Package Marking \n19.1 Unless otherwise specified, the bars and shapes shall be \npackaged and loaded in accordance with Practices A700. \n19.2 When specified in the contract or order, and for direct \nprocurement by or direct shipment to the government, when \nLevel A is specified, preservation, packaging, and packing shall \nbe in accordance with the Level A requirements of MIL-STD-\n163 _ \n20. Keywords \n20.1 general delivery requirements; stainless steel bars; \nstainless steel billets; stainless steel forgings; stainless steel \nshapes \nANNEXES \n(Mandatory Information) \nAl. REQUIREMENTS FOR INTRODUCTION OF NEW MATERIALS \nAl.1 New materials may be proposed for inclusion in \nspecifications referencing this specification, subject to the \nfollowing conditions: \nAl. 1. 1 The application for the addition of a new grade to a \nspecification shall be made to the chair of the subcommittee \nthat has jurisdiction over that specification. \nAl.1.2 The application shall be accompanied by a statement \nfrom at least one user indicating that there is a need for the new \ngrade to be included in the applicable specification. \nAl.1.3 The application shall be accompanied by test data as \nrequired by the applicable specification. Test data from a \nminimum of three test lots, as defined by the specification, each \nfrom a different heat, • shall be furnished. \nAl. 1 .4 The application shall provide recommendations for \nall requirements appearing in the applicable specification. \nAl.1.5 The application shall state whether the new grade is \ncovered by patent. \nA2. REQUIREMENTS FOR INTRODUCTION OF MATERIALS FROM OTHER A0l OR B02.07 SPECIFICATIONS \nA2. l Wrought materials that are already covered by an­\nother AOl or B02.07 specification may be proposed for \ninclusion in specifications referencing this specification of \ngeneral requirements subject to the following conditions: \nA2.1.1 Application for the addition of a grade that is already \ncovered in another AOl or B02.07 specification shall be made \nto the chair of the subcommittee that has jurisdiction over that \nthe specification to which the grade is to be added. \n825 \nA2.1.2 The chemical requirements, the specified mechani­\ncal properties, and the heat treatment requirements of the grade \nbeing added shall be the same as those for the grade in the AO 1 \nor B02.07 specification in which the grade is presently covered. \nA2. l.3 The application shall provide recommendations for \nall requirements appearing in the applicable specification. \nA2.1.4 The application shall state whether or not the grade \nis covered by patent. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0925.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3615,
  "bestTextAlphaRatio": 0.771
}