{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 796,
  "globalPageIndex": 796,
  "width": 648.72,
  "height": 882.36,
  "text": "SA-450 /SA-450M ASME BPVC.II.A-2025 \n29. Rejection \n29.1 Each length of tubing received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of the specification based on the inspection and \ntest method as outlined in the specification, the length may be \nrejected and the manufacturer shall be notified. Disposition of \nrejected tubing shall be a matter of agreement between the \nmanufacturer and the purchaser. \n29.2 Material that fails in any of the forming operations or \nin the process of installation and is found to be defective shall \nbe set aside and the manufacturer shall be notified for mutual \nevaluation of the material's suitability. Disposition of such \nmaterial shall be a matter for agreement. \n30. Product Marking \n30. l Each length of tube shall be legibly stenciled with the \nmanufacturers's name or brand, the specification number, and \ngrade. The marking need not include the year date of the \nspecification. For tubes less than 1 ¼ in. [31.8 mm] in diameter \nand tubes under 3 ft [1 m] in length, the required information \nmay be marked on a tag securely attached to the bundle or box \nin which the tubes are shipped. \n30.2 When it is specified that certain requirements of a \nspecification adopted by the ASME Boiler and Pressure Vessel \nCommittee are to be completed by the purchaser upon receipt \nof the mate1ial, the manufacturer shall indicate that all require­\nments of the specification have not been completed by a letter \nsuch as X, Y, or Z, immediately following the specification \nnumber. This letter may be removed after completion of all \nrequirements in accordance with the specification. An expla­\nnation of specification requirements to be completed is pro­\nvided in Section 27. \n30.3 Bar Coding-In addition to the requirements in 30.1 \nand 30.2, bar coding is acceptable as a supplemental identifi­\ncation method. The purchaser may specifiy in the order a \nspecific bar coding system to be used. \n31. Packaging, Marking, and Loading \n31. l When specified on the purchase order, packaging, \nmarking, and loading for shipment shall be in accordance with \nthe procedures of Practices A700. \n32. Government Procurement \n32.1 Scale Free Pipe: \n32.1.1 When specified in the contract or order, the following \nrequirements shall be considered in the inquiry contract or \norder, for agencies of the U.S. Government where scale free \ntube is required. These requirements shall take precedence if \nthere is a conflict between these requirements and the product \nspecification. \n32.1.2 Tube shall be ordered to outside diameter (OD) and \nwall thickness. \n32.1.3 Responsibility for Inspection-Unless otherwise \nspecified in the contract or purchase order, the manufacturer is \nresponsible for the performance of all inspection and test \nrequirements specified. The absence of any inspection require­\nments in the specification shall not relieve the contractor of the \nresponsibility for ensuring that all products or supplies submit­\nted to the Government for acceptance comply with all require­\nments of the contract. Sampling inspection, as part of the \nmanufactming operations, is an acceptable practice to ascertain \nconformance to requirements, however, this does not authorize \nsubmission of known defective material, either indicated or \nactual, nor does it commit the Government to accept the \nmaterial. Except as otherwise specified in the contract or \npurchase order, the manufacturer may use his own or any other \nsuitable facilities for the perfonnance of the inspection and test \nrequirements unless disapproved by the purchaser at the time \nthe order is placed. The purchaser shall have the right to \nperform any of the inspections and tests set forth when such \ninspections and tests are deemed necessary to ensure that the \nmaterial conforms to the prescribed requirements. \n746 \n32.1.4 Sampling for Flattening and Flaring Test and for \nVisual and Dimensional Examination-Minimum sampling for \nflattening and flaring tests and visual and dimensional exami­\nnation shall be as follows: \nLot Size (pieces per Sample Size \nlot) \n2 to 8 Entire lot \n9 to 90 8 \n91 to 150 12 \n151 to 280 19 \n281 to 500 21 \n501 to 1200 27 \n1201 to 3200 35 \n3201 to 10 000 38 \n10 001 to 35 000 46 \nIn all cases, the acceptance number is zero and the rejection \nnumber is one. Rejected lots may be screened and resubmitted \nfor visual and dimensional examination. All defective items \nshall be replaced with acceptable items prior to lot acceptance \n32.1.5 Sampling for Chemical Analysis-One sample for \nchemical analysis shall be selected from each of two tubes \nchosen from each lot. A lot shall be all material poured from \none heat. \n32.I.6 Sampling for Tension and Bend Test-One sample \nshall be taken from each lot. A lot shall consist of all tube of the \nsame outside diameter and wall thickness manufactured during \nan 8-h shift from the same heat of steel, and heat treated under \nthe same conditions of temperature and time in a single charge \nin a batch type furnace, or heat treated under the same \ncondition in a continuous furnace, and presented for inspection \nat the same time. \n32.1.7 Hydrostatic and Ultrasonic Tests-Each tube shall be \ntested by the ultrasonic (when specified) and hydrostatic tests. \n32.1.8 Tube shall be free from heavy oxide or scale. The \ninternal surface of hot finished ferritic steel tube shall be \npickled or blast cleaned to a free of scale condition equivalent \nto the CSa2 visual standard listed in SSPC-SP6. Cleaning shall \nbe performed in accordance with a written procedure that has \nbeen shown to be effective. This procedure shall be available \nfor audit. \n32.1.9 In addition to the marking in Specification A530/ \nA530M, each length of tube ¼ in. outside diameter and larger \nshall be marked with the following listed information. Marking \nshall be in accordance with SAE-AMS2806 and MIL-STD-\n792. (a) Outside diameter, wall thickness, and length (b) Heat \nor lot identification number. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0796.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6005,
  "bestTextAlphaRatio": 0.7672
}