{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 527,
  "globalPageIndex": 527,
  "width": 606.0,
  "height": 848.88,
  "text": "ASME BPVC.II.A-2025 SA-325 \nWashers, Direct Tension Indicators, and Rivets \nF788/F788M Specification for Surface Discontinuities of \nBolts, Screws, and Studs, Inch and Metric Series \nF959 Specification for Compressible-Washer-Type Direct \nTension Indicators for Use with Structural Fasteners \nFl136 Specification for Zinc/Aluminum Corrosion Protec­\ntive Coatings for Fasteners \nF1470 Practice for Fastener Sampling for Specified Me­\nchanical Properties and Performance Inspection \nF1789 Terminology for Fl6 Mechanical Fasteners \nF2329 Specification for Zinc Coating, Hot-Dip, Require­\nments for Application to Carbon and Alloy Steel Bolts, \nScrews, Washers, Nuts, and Special Threaded Fasteners \nGlOl Guide for Estimating the Atmospheric Corrosion Re-\nsistance of Low-Alloy Steels \n2.2 ASME Standards: \nB 1.1 Unified Screw Threads \nB 18.2.6 Fasteners for Use in Structural Applications \nB 18.24 Part Identification Number (PIN) Code System \nStandard for B18 Fastener Products \n3. Ordering Information \n3.1 Orders for heavy hex structural bolts under this speci­\nfication shall include the following: \n3.1.1 Quantity (number of pieces of bolts and accessories). \n3.1.2 Size, including nominal bolt diameter, thread pitch, \nand bolt length. \n3.1.3 Name of product, heavy hex structural bolts. \n3.1.4 When bolts threaded full length are required, Supple­\nmentary Requirement S 1 shall be specified. \n3.1.5 Type of bolt: Type 1 or 3. When type is not specified, \neither Type 1 or Type 3 shall be furuished at the supplier's \noption. \n3.1.6 ASTM designation and year of issue. \n3.1.7 Other components such as nuts, washers, and com­\npressible washer-type direct-tension indicators, if required. \n3.1.7.1 When such other components are specified to be \nfurnished, also state \"Nuts, washers, and direct tension indica­\ntors, or combination thereof, shall be furnished by lot number.\" \n3.1.8 Zinc Coating-Specify the zinc coating process re­\nquired, for example, hot dip, mechanically deposited, Zinc/ \nAluminum Corrosion Protective Coating or no preference (see \n4.3). \n3.1.9 Other Finishes-Specify other protective finish, if \nrequired. \n3.1.10 Test reports, if required (see Section 13). \n3.1.11 Supplementary or special requirements, if required. \n3.1.12 For establishment of a part identifying system, see \nASME B18.24. \nNoTE 3-A typical ordering description follows: 1000 pieces l1/s-7 \nUNC in. dia x 4 in. long heavy hex structural bolt, Type 1 ASTM A325-02, \neach with one hardened washer, ASTM F436 Type 1, and one heavy hex \nnut, ASTM A563 Grade DH. Each component hot-dip zinc-coated. Nuts \nlubricated. \n3.2 Recommended Nuts: \n3.2.1 Nuts conforming to the requirements of Specification \nA563 are the recommended nuts for use with Specification \nA325 heavy hex structural bolts. The nuts shall be of the class \nand have a surface finish for each type of bolt as follows: \nBolt Type and Finish \n1, plain (noncoated) \n1, zinc coated \n1, coated in accordance with \nSpecification F1136, Grade \n3 \nNut Class and Finish \nA563-C, C3, D, DH, DH3, \nplain \nA563-DH, zinc coated \nA563-DH coated in accor­\ndance with Specification \nF1136, Grade 5 \n3, plain A563-C3, DH3, plain \n3.2.2 Alternatively, nuts conforming to Specification A194/ \nAl 94M Gr. 2H are considered a suitable substitute for use with \nSpecification A325 Type 1 heavy hex structural bolts. \n3.2.3 When Specification A194/A194M Gr. 2H zinc-coated \nnuts are supplied, the zinc coating, overtapping, lubrication, \nand rotational capacity testing shall be in accordance with \nSpecification A563. \n3.3 Recommended Washers: \n3.3.1 Washers conforming to Specification F436 are the \nrecommended washers for use with Specification A325 heavy \nhex structural bolts. The washers shall have a surface finish for \neach type of bolt as follows: \nBolt Type and Finish \n1, plain (uncoated) \n1, zinc coated \n1, coated in accordance with \nSpecification F1136, Grade 3 \n3, plain \n3.4 Other Accessories: \nWasher Finish \nplain (uncoated) \nzinc coated \ncoated in accordance with Speci­\nfication F1136, Grade 3 \nweathering steel, plain \n3.4.1 When compressible washer type direct tension indica­\ntors are specified to be used with these bolts, they shall \nconform to Specification F959, Type 325. \n4. Materials and Manufacture \n4. l Heat Treatment: \n4.1.1 Type 1 bolts produced from medium carbon steel shall \nbe quenched in a liquid medium from the austenitizing \ntemperature. Type 1 bolts produced from medium carbon steel \nto which chromium, nickel, molybdenum, or boron were \nintentionally added shall be quenched only in oil from the \naustenitizing temperature. \n4.1.2 Type 3 bolts shall be quenched only in oil from the \naustenitizing temperature. \n4.1.3 Type 1 bolts, regardless of the steel used, and Type 3 \nbolts shall be tempered by reheating to not less than 800°F. \n475 \n4.2 Threading-Threads shall be cut or rolled. \n4.3 Zinc Coatings, Hot-Dip and Mechanically Deposited, \nZinc/Aluminum Corrosion Protective Coating: \n4.3.1 When zinc-coated fasteners are required, the pur­\nchaser shall specify the zinc coating process, for example, hot ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0527.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4952,
  "bestTextAlphaRatio": 0.742
}