{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 156,
  "globalPageIndex": 156,
  "width": 618.6,
  "height": 796.8,
  "text": "SA-29/SA-29M ASME BPVC.II.A-2025 \n4. Chemical Composition \n4.1 Limits: \n4.1.1 The chemical composition shall conform to the re­\nquirements specified in the purchase order or the individual \nproduct specifications. For convenience, the grades commonly \nspecified for carbon steel bars are shown in Table 1 and for \nalloy steel bars in Table 2. Bars may be ordered to these grade \ndesignations and when so ordered shall conform to the speci-\n. fied limits by heat analysis. \n4.1.2 When compositions other than those shown in Tables \n1 and 2 are required, the composition limits shall be prepared \nusing the ranges and limits shown in Table 3 for carbon steel \nand Table 4 for alloy steel. \n4.2 Heat or Cast Analysis: \n4.2.l The chemical composition of each heat or cast shall be \ndetermined by the manufacturer in accordance with Test \nMethods, Practices, and Terminology A751. \n4.2.2 The heat or cast analysis shall conform to the require­\nments specified in the product specification or purchase order. \nThese can be the heat chemical range and limit for a grade \ndesignated in Tables 1 and 2, or another range and limit in \naccordance with 4.1.2, or with requirements of the product \nspecification. \nNorn 2-Heat analysis for lead is not determinable since lead is added \nto the ladle stream while each ingot is poured. When specified as an added \nelement to a standard steel, the percentage of lead is reported as 0.15 to \n0.35 incl, which is the range commonly specified for this element. \n4.2.3 If requested or required, the heat analysis shall be \nreported to the purchaser or his representative. \n4.2.4 Reporting of significant figures and rounding shall be \nin accordance with Test Methods, Practices, and Terminology \nA751. \n4.3 Product Analysis: \n4.3.1 Merchant quality carbon bar steel is not subject to \nrejection for product analysis unless misapplication of a heat is \nclearly indicated. \n4.3.2 Analyses may be made by the purchaser from finished \nbars other than merchant quality representing each heat of \nopen-hearth, basic-oxygen, or electric-furnace steel. The \nchemical composition thus determined shall not vary from the \nlimits specified in the applicable specification by more than the \namounts prescribed in Table 5 and Table 6, but the several \ndeterminations of any element, excluding lead, in a heat may \nnot vary both above and below the specified range. Rimmed or \ncapped steel is characterized by a lack of homogeneity in its \ncomposition, especially for the elements carbon, phosphorus, \nand sulfur; therefore, when rimmed or capped steel is specified \nor required, the limitations for these elements shall not be \napplicable. Because of the degree to which phosphorus and \nsulfur segregate, the limitations for these elements shall not be \napplicable to rephosphorized or resulfurized steels. \n4.3.3 Samples for product analysis shall be taken by one of \nthe following methods: \n4.3.3.1 Applicable to small sections whose cross-sectional \narea does not exceed 0.75 in.2 [500 mm 2 ] such as rounds, \nsquares, hexagons, and the like. Chips are taken by milling or \nmachining the full cross section of the piece. Drilling is not a \nfeasible method for sampling sizes 0.75 in. 2 and smaller. \n4.3.3.2 Applicable to products where the width of the cross \nsection greatly exceeds the thickness, such as bar size shapes \nand light flat bars. Chips are taken by drilling entirely through \nthe steel at a point midway between the edge and the middle of \nthe section, or by milling or machining the entire cross section. \n4.3.3.3 Applicable to large rounds, squares semifinished, \netc. Chips are taken at any point midway between the outside \nand the center of the piece by drilling parallel to the axis or by \nmilling or machining the full cross section. In cases where \nthese methods are not practicable, the piece may be drilled on \nthe side, but chips are not taken until they represent the portion \nmidway between the outside and the center. \n4.3.3.4 When the steel is subject to tension test \nrequirements, the tension test specimen can also be used for \nproduct analysis. In that case, chips for product analysis can be \ntaken by drilling entirely through the tension test specimens or \nby the method described in 4.3.3.1. \n4.3.4 When chips are taken by chilling, the diameter of the \ndrill used shall conform to the following: \nArea of Sample Cross Section, Approximate Drill Diameter, \nin. 2 [cm 2 ] in. [mm] \n16 [1 OD] or less ½ [12.5] \nOver 16 [100] 1 [25.0] \n4.3.5 The minimum number of samples to be taken from \nmaterial representing the same heat or lot before rejection by \nthe purchaser shall be as follows: \n104 \nMinimum Number \nof Samples \n15 tons [15 Mg] and under 4 \nOver 15 tons [15 Mg] 6 \n4.3.6 In case the number of pieces in a heat is less than the \nnumber of samples required, one sample from each piece shall \nbe considered sufficient. \n4.3.7 In the event that product analysis determinations are \noutside the permissible limits as prescribed in 4.3.2, additional \nsamples shall be analyzed and the acceptability of the heat \nnegotiated between the purchaser and the producer. \n4.4 Referee Analysis-In case a referee analysis is required \nand agreed upon to resolve a dispute concerning the results of \na chemical analysis, the referee analysis shall be performed in \naccordance with the latest issue of Test Methods, Practices, and \nTerminology A751, unless otherwise agreed upon between the \nmanufacturer and the purchaser. \n5. Grain Size Requirement \n5.1 Austenitic Grain Size-All requirements for austenitic \ngrain size control in Section 5 refer to the size of the austenite \ngrain which forms during a subsequent bar reheating operation \nat or above the recrystallization temperature. These require­\nments do not apply to, nor do they in any way control, the p1ior \naustenite grain size or the ferrite grain size of the bar in the \nas-rolled condition. \n5.1.1 When a coarse austenitic grain size is specified, the \nsteel shall have a grain size number of 1 to 5 exclusive as ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0156.json",
  "tabulaTablesCsv": "tables_tabula/page-0156.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0156.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6027,
  "bestTextAlphaRatio": 0.7622
}