{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 148,
  "globalPageIndex": 946,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-513/SA-513M (ASTM A513/A513M) ASME BPVC.II.A-2025 \na Designation: A513/A513M - 20a \n~ull \nINTERNATIONAL \nStandard Specification for \nElectric-Resistance-Welded Carbon and Alloy Steel \nMechanical Tubing 1 \nThis standard is issued under the fixed designation A513/A513M; the number immediately following the designation indicates the year \nof original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscript epsilon ( e) indicates an editorial change since the last revision or reapproval. \n1. Scope* \n1.1 This specification covers electric-resistance-welded car­\nbon and alloy steel tubing for use as mechanical tubing. \n1.2 This specification covers mechanical tubing made from \nhot- or cold-rolled steel. \n1.3 This specification covers round, square, rectangular, and \nspecial shape tubing. \nType \nElectric-Resistance-Welded Tubing \nfrom Hot-Rolled Steel \nElectric-Resistance-Welded Tubing \nfrom Cold-Rolled Steel \nSize Range \n(Round Tubing) \noutside diameter from½ to 15 in. \n[12.7 to 380 mm] \nwall from 0.065 to 0.650 in. \n[1.65 to 16.5 mm] \noutside diameter from% to 12 in. \n[9.5 to 300 mm] \nwall from 0.022 to 0.134 in. \n[0.56 to 3.40 mm] \n1.3.1 Indeterminate wall thicknesses may be ordered. In \nthose cases the more stringent tolerances of Tables 4, 6, 7, 8, 9, \n10, 11, 12, 16, and 17 shall apply. When sizes within the \nallowable ranges lj.I'e ordered all other requirements of the \nspecification shall be met. \nhard or rationalized conversions apply to diameters, lengths \nand tensile properties. Soft conversion applies to other SI \nmeasurements. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Tra1e (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: 2 \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA1008/A1008M Specification for Steel, Sheet, Cold-Rolled, \nCarbon, Structural, High-Strength Low-Alloy, High­\nStrength Low-Alloy with Improved Formability, Solution \nHardened, and Bake Hardenable 1.4 This specification covers mechanical tubing in various \nGrades (see Section 5), Types (see 12.1), and Thermal Condi- AlOll/AlOllM Specification for Steel, Sheet and Strip, \nL \ntions (12.l). Hot-Rolled, Carbon, Structural, High-Strength Low-\nAlloy, High-Strength Low-Alloy with Improved \n----~l-.-5-0pti.onal---Wpplementacy-requir-ementS--ar.e-pi;0-vided-an.d,.._--------,flerma0-ility,and~-High.Strength1---------------\nwhen desired, shall be so stated in the order. A1039/A1039M Specification for Steel, Sheet, Hot Rolled, \n1.6 The values stated in either SI units or inch-pound units Carbon, Commercial, Structural, and High-Strength Low-\nare to be regarded separately as standard. Within the text the SI Alloy, Produced by Twin-Roll Casting Process \nunits are shown in brackets. The values stated in each system Al0 4 0 Guide for Specifying Harmonized Standard Grade \nmay not be exact equivalents; therefore each system shall be Compositions for Wrought Carbon, Low-Alloy, and Alloy \nused independently of the other. Combining values from the st eels \ntwo systems may result in non-conformance with the standard. E213 Practice for Ultrasonic Testing of Metal Pipe and \nThe inch-pound units shall apply unless the \"M\" designation of Tubing \nthis specification is specified in the order. In this specification E273 Practice for Ultrasonic Testing of the Weld Zone of \n1 This specification is under the jurisdiction of ASTM Committee A0l on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.09 on Carbon Steel Tubular Products. \nCurrent edition approved July 1, 2020. Published July 2020. Originally approved \nin 1964. Last previous edition approved in 2020 as A513/A513M- 20. DOI: \n10.1520/A0513_A0513M-20A. \nWelded Pipe and Tubing \nE309 Practice for Eddy Current Examination of Steel Tubu­\nlar Products Using Magnetic Saturation \n2 For referenced ASTM standards, visit the ASTM website, www.astm.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \n* A Summary of Changes section appears at the end of this standard \n846 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0946.json",
  "tabulaTablesCsv": "tables_tabula/page-0946.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0946.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4685,
  "bestTextAlphaRatio": 0.7434
}