{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 693,
  "globalPageIndex": 693,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-376/SA-376M \n10. Hydrostatic or Nondestructive Electric Test \n10.1 Each pipe shall be subjected to the Nondestmctive \nElectric Test or the Hydrostatic Test. Unless specified by the \npurchaser, either test may be used at the option of the producer. \n10.2 Hydrostatic Test-Each length of finished pipe shall be \nsubjected to the hydrostatic test in accordance with Specifica­\ntion A999/ A999M, unless specifically exempted under the \nprovisions of 10.3 and 10.4. \n10.3 For pipe sizes NPS 24 [DN 600] and over, the \npurchaser, with the agreement of the manufacturer, may \ncomplete the hydrostatic test requirement with the system \npressure test, which may be lower or higher than the specifi­\ncation test pressure, but in no case shall the test pressure be \nlower than the system design pressure. Each length of pipe \nfurnished without the completed manufacturer's hydrostatic \ntest shall include with the mandatory marking the letters \"NH.\" \n10.4 Nondestructive Examination-Each pipe shall be ex­\namined with a nondestmctive test in accordance with Practice \nE213 or Practice E426. Unless specifically called out by the \npurchaser, the selection of the nondestructive electric test will \nbe at the option of the manufacturer. The range of pipe sizes \nthat may be examined by each method shall be subject to the \nlimitations in the scope of the respective practices. \n10.4.1 The following information is for the benefit of the \nuser of this specification: \n10.4.1.1 The reference standards defined in 10.10.1 through \n11.l 0.4 are convenient standards for calibration of nondestruc­\ntive testing equipment. The dimensions of these standards \nshould not be construed as the minimum size imperfection \ndetectable by such equipment. \n10.4.1.2 The ultrasonic testing (UT) can be performed to \ndetect both longitudinally and circumferentially oriented de­\nfects. It should be recognized that different techniques should \nbe employed to detect differently oriented imperfections. The \nexamination may not detect short, deep, defects. \n10.4.1.3 The eddy-current testing (ET) referenced in Prac­\ntice E426 has the capability of detecting significant \ndiscontinuities, especially the short abrupt type. \n10.4.1.4 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of discontinuities that can \nbe detected in the specific application of these examinations \nshould discuss this with the manufacturer of the tubular \nproduct. \n10.5 Time of Examination-Nondestructive testing for \nspecification acceptance shall be performed after all mechani­\ncal processing, heat treatments, and straightening operations. \nThis requirement does not preclude additional testing at earlier \nstages in the processing. \n10.6 Surface Condition: \n10.6.1 All surfaces shall be free of scale, dirt, grease, paint, \nor other foreign material that could interfere with interpretation \nof test results. The methods used for cleaning and preparing the \nsurfaces for examination shall not be detrimental to the base \nmetal or the surface finish. \n10.6.2 Excessive surface roughness or deep scratches can \nproduce signals that interfere with the test. \n10.7 Extent of Examination: \n10.7.1 The relative motion of the pipe and the transducer(s), \ncoil(s), or sensor(s) shall be such that the entire pipe surface is \nscanned, except as in 5.2. \n10.7.2 The existence of end effects is recognized, and the \nextent of such effects shall be determined by the manufacturer, \nand, if requested, shall be repo1ied to the purchaser. Other \nnondestmctive tests may be applied to the end areas, subject to \nagreement between the purchaser and the manufacturer. \n10.8 Operator Qualifications-The test unit operator shall \nbe certified in accordance with SNT-TC-lA, or an equivalent \nrecognized and documented standard. \n10.9 Test Conditions: \n10.9.1 For eddy-current testing, the excitation coil fre­\nquency shall be chosen to ensure adequate penetration yet \nprovide good signal-to-noise ratio. \n10.9.2 The maximum eddy-cmrent coil frequency used \nshall be as follows: \nSpecified Wall Thickness, in. [mm] Maximum Frequency, KHz \n<0.050 [1.25] 100 \n0.050 to 1.50 [1.25 to 3.80] 50 \n>0.150 [3.80] 10 \n10.9.3 Ultrasonic-For examination by the ultrasonic \nmethod, the minimum nominal transducer frequency shall be \n2.00 MHz and the maximum nominal transducer size shall be \n1.5 in. [38 mm]. \n10.9.3.1 If the equipment contains a reject notice filter \nsetting, this shall remain off during calibration and testing \nunless linearity can be demonstrated at that setting. \n10.10 Reference Standards: \n10.10.1 Reference standards of convenient length shall be \nprepared from a length of pipe of the same grade, size (NPS, or \noutside diameter and schedule or wall tl1ickness), surface \nfinish, and heat treatment condition as the pipe to be examined. \n10.10.2 For Ultrasonic Testing, the reference ID and OD \nnotches shall be any one of the three common notch shapes \nshown in Practice E213, at the option of the manufacturer. The \ndepth of each notch shall not exceed 12½ % of the specified \nnominal wall thickness of the pipe or 0.004 in. [0.1 mm], \nwhichever is greater. The width of the notch shall not exceed \ntwice the depth. Notches shall be placed on both the OD and ID \nsurfaces. \n643 \n10.10.3 For Eddy-Current Testing, the reference standard \nshall contain, at the option of the manufacturer, any one of the \nfollowing discontinuities: \n10.10.3.1 Drilled Hole-The reference standard shall con­\ntain three or more holes, equally spaced circumferentially \naround the pipe and longitudinally separated by a sufficient \ndistance to allow distinct identification of the signal from each \nhole. The holes shall be drilled radially and completely through \nthe pipe wall, with care being taken to avoid dist01iion of the \npipe while drilling. One hole shall be drilled in the weld, if \nvisible. Alternately, the producer of welded pipe may choose to \ndrill one hole in the weld and mn the calibration standard \nthrough the test coils three times with the weld turned at 120° \non each pass. The hole diameter shall vary with NPS as \nfollows: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0693.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6139,
  "bestTextAlphaRatio": 0.7583
}