{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 765,
  "globalPageIndex": 1563,
  "width": 617.04,
  "height": 795.6,
  "text": ". ,,.---..._ . \nASME BPVC.II.A-2025 SA-1008/SA-1008M (ASTM A1008/A1008M) \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A1008/A1008M-23e1) that may impact the use of this standard. (Approved May 1, 2024.) \n( 1) Table 2 - increased maximum carbon content from 0.20 % \nmax to 0.25 % max, for SS grades 40 through 70, to establish \nharmony with other like specifications, such as AlOll, A1018, \nA463, A653, A792, A875, A1046, A1063. \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(Al008/A1008M-21a) that may impact the use of this standard. (Approved Nov. 1, 2023.) \n( 1) Table 1 deleted content of footnote C which specified \ntitanium equation, and relabeled footnotes D, E, F, G, H, I, J, \nK, & L to footnotes C, D, E, F, G, H, I, J, & K, respectively. \n(2) Table 2 deleted content of footnote C which specified \ntitanium equation, and relabeled footnotes D, E, F, & G to \nfootnotes C, D, E, & F respectively. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed eve,y five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM lntemational, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may a/so be secured from the Copyright Clearance Center; 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n1509 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1563.json",
  "tabulaTablesCsv": "tables_tabula/page-1563.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1563.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2577,
  "bestTextAlphaRatio": 0.7144
}