{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 59,
  "globalPageIndex": 59,
  "width": 627.84,
  "height": 804.24,
  "text": "ASME BPVC.II.A-2025 SA-6/SA-6M \nAustenitic grain refining elements include, but are not limited \nto, aluminum, columbium (niobium), titanium, and vanadium. \n3.1.19 structural product-a hot-rolled steel plate, shape, \nsheet piling, or bar. \n3.1.20 coil-hot-rolled steel in coiled form that is intended \nto be processed into a finished structural product. \n3.1.21 manufacturer-the organization that directly controls \nthe conversion of steel ingots, slabs, blooms, or billets, by \nhot-rolling, into an as-rolled structural product or into coil; and \nfor structural products produced from as-rolled structural \nproducts, the organization that directly controls, or is respon­\nsible for, the operations involved in finishing the structural \nproduct. \n3.1.21.1 Discussion-Such finishing operations include lev­\neling or straightening, hot forming or cold forming (if \napplicable), welding (if applicable), cutting to length, testing, \ninspection, conditioning, heat treatment (if applicable), \npackaging, marking, loading for shipment, and certification. \n3.1.22 processor-the organization that directly controls, or \nis responsible for, the operations involved in the processing of \ncoil into a finished structural product. Such processing opera­\ntions include decoiling, leveling or straightening, hot-forming \nor cold-forming (if applicable), welding (if applicable), cutting \nto length, testing, inspection, conditioning, heat treatment (if \napplicable), packaging, marking, loading for shipment, and \ncertification. \n3 .1.22.1 Discussion-The processing operations need not be \ndone by the organization that did the hot rolling of the coil. If \nonly one organization is involved in the hot rolling and \nprocessing operations, that organization is termed the manu­\nfacturer for the hot rolling operation and the processor for the \nprocessing operations. If more than one organization is in­\nvolved in the hot rolling and processing operations, the \norganization that did the hot rolling is termed the manufacturer \nand an organization that does one or more processing opera­\ntions is termed a processor. \n3.2 Refer to Terminology A941 for additional definitions of \nterms used in this standard. \n4. Ordering Information \n4.1 Information items to be considered, if appropriate, for \ninclusion in purchase orders are as follows: \n4.1.1 ASTM product specification designation (see 1.1) and \nyear-date; \n4.1.2 Name of structural product (plate, shape, bar, or sheet \npiling); \n4.1.3 Shape designation, or size and thickness or diameter; \n4.1.4 Grade, class, and type designation, if applicable; \n4.1.5 Condition (see Section 6), if other than as-rolled; \n4.1.6 Quantity (weight [mass] or number of pieces); \n4.1.7 Length; \n4.1.8 Exclusion of either structural product produced from \ncoil or structural product produced from an as-rolled structural \nproduct (see 5.4 and Appendix Xl), if applicable; \n4.1.9 Heat treatment requirements (see 6.2 and 6.3), if any; \n4.1.10 Testing for fine austenitic grain size (see 8.3.2); \n7 \n4.1.11 Mechanical property test report requirements (see \nSection 14), if any; \n4.1.12 Special packaging, marking, and loading for ship­\nment requirements (see Section 19), if any; \n4.1.13 Supplementary requirements, if any, including any \nadditional requirements called for in the supplementary re­\nquirements; \n4.1.14 End use, if there are any end-use-specific require­\nments (see 18.1, 11.3.4, Table 22 or Table Al.22, and Table 24 \nor Table Al.24); \n4.1.15 Special requirements (see 1.10), if any; and \n4.1.16 Repair welding requirements (see 9.5), if any. \n5. Materials and Manufacture \n5 .1 The steel shall be made in a basic-oxygen or electric-arc \nfurnace, possibly followed by additional refining in a ladle \nmetallurgy furnace (LMF) or secondary melting by vacuum­\narc remelting (VAR) or electroslag remelting (ESR). \n5.2 The steel shall be killed. \n5.3 The steel shall be strand cast or cast in stationary molds. \n5.3.1 Strand Cast: \n5.3.1.1 When heats of the same nominal chemical compo­\nsition are consecutively strand cast at one time, the heat \nnumber assigned to the cast product need not be changed until \nall of the steel in the cast product is from the following heat. \n5.3.1.2 When two consecutively strand cast heats have \ndifferent nominal chemical composition ranges, the manufac­\nturer shall remove the transition material by an established \nprocedure that positively separates the grades. \n5.4 Structural products shall be produced from an as-rolled \nstructural product or from coil. \n5.5 Where part of a heat is rolled into an as-rolled structural \nproduct and the balance of the heat is rolled into coil, each part \nshall be tested separately. \n5.6 Structural products produced from coil shall not contain \nsplice welds, unless previously approved by the purchaser. \n6. Heat Treatment \n6.1 Where the structural product is required to be heat \ntreated, such heat treatment shall be performed by the \nmanufacturer, the processor, or the fabricator, unless otherwise \nspecified in the applicable product specification. \nNOTE 2-When no heat treatment is required, the manufacturer or \nprocessor has the option of heat treating the structural product by \nnormalizing, stress relieving, or normalizing then stress relieving to meet \nthe applicable product specification. \n6.2 Where the heat treatment is to be performed by other \nthan the manufacturer, the order shall so state. \n6.2.1 Where the heat treatment is to be performed by other \nthan the manufacturer, the structural products shall be accepted \non the basis of tests made on test specimens taken from full \nthickness test coupons heat treated in accordance with the \nrequirements specified in the applicable product specification \nor in the purchase order. If the heat-treatment temperatures are \nnot specified, the manufacturer or processor shall heat treat the \ntest coupons under conditions the manufacturer or processor ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0059.json",
  "tabulaTablesCsv": "tables_tabula/page-0059.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0059.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5925,
  "bestTextAlphaRatio": 0.7607
}