{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 353,
  "globalPageIndex": 353,
  "width": 642.12,
  "height": 877.08,
  "text": "ASME BPVC.II.A-2025 SA-216/SA-216M (ASTM A216/A216M) \nTABLE 1 Chemical RequirementsA \nElement,% \nMaterial Grade Carbon Manganese Phosphorus Sulfur 8 Silicon Nickel 0 Chromium 0 Molybdenum 0 Copper 0 Vanadium 0 \nUNS \nweA 0 \n0.25 0.70 0.035 0.035 0.60 0.50 0.50 0.20 0.30 0.03 J02502 \nwes 0 \n0.30 1.00 0.035 0.035 0.60 0.50 0.50 0.20 0.30 0.03 J03002 \nwee 0 \n0.25 1.20 0.035 0.035 0.60 0.50 0.50 0.20 0.30 0.03 J02503 \nA All values are maximums. \n8 For lower maximum sulfur content, see Supplementary Requirement S52. \nc Specified Residual Elements-Except when Supplementary Requirement S50 is specified, the total content of these elements is 1.00 % maximum. \n° For each reduction of 0.01 % below the specified maximum carbon content, an increase of 0.04 % manganese above the specified maximum will be permitted up to a \nmaximum of 1.10 % for WCA, 1.28 % for wes, and 1.40 % for wee. \n4.1.2 Grade of steel, \n4.1.3 Options in the specification, \n4.1.4 Whether the castings are to be produced using the \ninvestment casting process, and \n4.1.5 The supplementary requirements desired, including \nthe standards of acceptance. \n5. Heat Treatment \n5 .1 All castings shall receive a heat treatment proper to their \ndesign and chemical composition. \n5.2 Castings shall be furnished in the annealed, or \nnormalized, or normalized and tempered condition unless \nSupplementary Requirement S15 is specified. \n5.3 Heat treatment shall be performed after castings have \nbeen allowed to cool below the transformation range. \n6. Temperature Control \n6.1 Furnace temperatures for heat treating shall be effec­\ntively controlled by pyrometer. \n7. Chemical Composition \n7.1 The steel shall be in accordance with the requirements \nas to chemical composition prescribed in Table 1. \n8. Tensile Requirements \n8.1 Steel used for the castings shall be in accordance with \nthe requirements as to tensile properties prescribed in Table 2. \nTABLE 2 Tensile RequirementsA \nMaterial Tensile Yield Elongation Reduction of \nGrade Strength, Strength, 8 in 2 in. Area,% ksi [MPa] ksi [MPa] [50 mm], % 0 \nWeA 60-85 30 [205] 24 35 [415-585] \nWeB 70-95 36 [250] 22 35 [485-655] \nwee 70-95 40 [275] 22 35 [485-655] \nA All values are minimums, except where a range is provided. \n8 Determine by either 0.2 % offset method or 0.5 % extension-under-load method. \n0 When IeI test bars are used in tensile testing as provided for in Specification \nA703/A703M, the gage length to reduced section diameter ratio shall be 4 to 1. \n9. Quality \n9.1 The surface of the casting shall be examined visually \nand shall be free of adhering sand, scale, cracks, and hot tears. \nOther smface discontinuities shall meet the visual acceptance \nstandards specified in the order. Visual Method SP-55 or other \nvisual standards may be used to define acceptable surface \ndiscontinuities and finish. Unacceptable visual surface discon­\ntinuities shall be removed and their removal verified by visual \nexamination of the resultant cavities. \n9.2 When additional inspection is desired, Supplementary \nRequirements S4, S5, and SlO may be ordered. \n9.3 The castings shall not be peened, plugged, or impreg­\nnated to stop leaks. \n10. Repair by Welding \n10.1 Repairs shall be made using procedures and welders \nqualified under Practice A488/A488M. \n301 \n10.2 Weld repairs shall be inspected to the same quality \nstandards that are used to inspect the castings. When castings \nare produced with Supplementary Requirement S4 specified, \nweld repairs shall be inspected by magnetic particle examina­\ntion to the same standards that are used to inspect the castings. \nWhen castings are produced with Supplementary Requirement \nS5 specified, weld repairs on castings that have leaked on \nhydrostatic test, or on castings in which the depth of any cavity \nprepared for repair welding exceeds 20 % of the wall thickness \nor 1 in. [25 mm], whichever is smaller, or on castings in which \nany cavity prepared for welding is greater than approximately \n10 in.2 [65 cm 2 ], shall be radiographed to the same standards \nthat are used to inspect the castings. \n10.3 Castings containing any repair weld that exceeds 20 % \nof the wall thickness or 1 in. [25 mm], whichever is smaller, or \nthat exceeds approximately 10 in.2 [65 cm 2 ] in area, or that was \nmade to correct hydrostatic test defects, shall be stress relieved \nor heat treated after welding. This mandatory stress relief or \nheat treatment shall be in accordance with the procedure \nqualification used. \n11. Keywords \n11.1 carbon steel; high temperature; pressure-containing \nparts; steel castings ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0353.json",
  "tabulaTablesCsv": "tables_tabula/page-0353.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0353.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4576,
  "bestTextAlphaRatio": 0.7067
}