{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 748,
  "globalPageIndex": 1546,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-999 /SA-999M ASME BPVC.II.A-2025 \n22.3.7.3 Ultrasonic-For examination by the ultrasonic \nmethod, the nominal transducer frequency shall be 2.00 MHz \nor more and the nominal transducer size shall be 1.5 in. [38 \nmm] or less. \n22.3.7.4 If the equipment contains a reject notice filter \nsetting, this shall remain off during calibration and testing \nunless linearity can be demonstrated at the setting. \n22.3.8 Reference Standards: \n22.3.8.1 Reference standards of convenient length shall be \nprepared from a length of pipe of the same grade, size (NPS, or \noutside diameter and schedule or wall thickness), surface \nfinish, and heat treatment conditions as the pipe to be exam­\nined. \n22.3.8.2 For Ultrasonic Testing, the reference ID and OD \nnotches shall be any one of the three common notch shapes \nshown in Practice E213, at the option of the manufacturer. The \ndepth of each notch shall not exceed 12.5 % of the specified \nwall thickness of the pipe or 0.004 in. [0.1 mm], whichever is \nthe greater. The width of the notch shall not exceed twice the \ndepth. Notches shall be placed on both the OD and ID surfaces. \n22.3.8.3 For Eddy-Current Testing, the reference standard \nshall contain, at the option of the manufacturer, any one of the \nfollowing reference discontinuities: \n22.3.8.4 Drilled Hole-The reference standard shall contain \nthree or more holes, equally spaced circumferentially around \nthe pipe and longitudinally separated by a sufficient distance to \nallow distinct identification of the signal from each hole. The \nholes shall be drilled radially and completely through the pipe \nwall, with care being taken to avoid distortion of the pipe while \ndrilling. One hole shall be drilled in the weld, if visible. \nAlternatively, the manufacturer of welded pipe is permitted to \ndrill one hole in the weld and run the calibration standard \nthrough the test coils three times, with the weld turned at 120° \non each pass. The hole diameter shall not exceed the following: \nNPS Designator Hole Diameter \n½ 0.039 in. [1.0 mm] \nabove ½ to 1 ¼ 0.055 in. [1.4 mm] \nabove 1 ¼ to 2 0.071 in. [1.8 mm] \nabove 2 to 5 0.087 in. [2.2 mm] \nabove 5 0.106 In. [2.7 mm] \n22.3.8.5 Transverse Tangential Notch-Using a round tool \nor a file with a ¼-in. [6.4-mm] diameter, a notch shall be filed \nor milled tangential to the surface and transverse to the \nlongitudinal axis of the pipe. Such a notch shall have a depth \nnot exceeding 12.5 % of the specified wall thickness of the \npipe or 0.004 in. [0.10 mm], whichever is the greater. \n22.3.8.6 Longitudinal Notch-A notch of 0.031 in. [0.8 mm] \nor less in width shall be machined in a radial plane parallel to \nthe pipe axis on the outside surface of the pipe, to have a depth \nnot exceeding 12.5 % of the specified wall thickness of the pipe \nor 0.004 in. [0.10 mm], whichever is the greater. \n22.3.8.7 More or smaller reference discontinuities, or both, \nmay be used by agreement between the purchaser and the \nmanufacturer. \n22.3.9 Standardization Procedure: \n22.3.9.1 The test apparatus shall be standardized at the \nbeginning and end of each series of pipes of the same size \n(NPS or diameter and schedule or wall thickness), grade and \nheat treatment condition, and at intervals not exceeding 4 h. \nMore frequent standardization may be performed at the manu­\nfacturer's option and may be required upon agreement between \nthe purchaser and the manufacturer. \n22.3.9.2 The test apparatus shall also be standardized after \nany change in test system settings, change of operator, equip­\nment repair, or interruption due to power loss, process \nshutdown, or when a problem is suspected. \n22.3.9.3 The reference standard shall be passed through the \ntest apparatus at the same speed and test system settings as the \npipe to be tested. \n22.3.9.4 The signal-to-noise ratio for the reference standard \nshall be 2½ to 1 or greater. Extraneous signals caused by \nidentifiable causes such as dings, scratches, dents, straightener \nmarks, etc., shall not be considered noise. The rejection \namplitude shall be adjusted to be at least 50 % of full scale of \nthe readout display. \n22.3.9.5 If upon any standardization, the rejection ampli­\ntude has decreased by at least 29 % (3 dB) of peak height from \nthe last standardization, the pipe tested since the last calibration \nshall be rejected or retested for acceptance after the test \napparatus settings have been changed, or the transducer(s), \ncoil(s), or sensor(s) have been adjusted, and the test apparatus \nhas been restandardized. \n22.3.10 Evaluation of Imperfections: \n22.3.10.1 Pipes producing a signal equal to or greater than \nthe lowest signal produced by the reference discontinuities \nshall be identified and separated from the acceptable pipes. The \narea producing the signal may be reexamined. \n22.3.10.2 Such pipes shall be rejected if the test signals \nwere produced by imperfections that cannot be identified or \nwere produced by cracks or crack-like imperfections. Such \npipes may be repaired if such repair is permitted by the \napplicable product specification. To be accepted, a repaired \npipe shall pass the same nondestructive test by which it was \nrejected, and it shall meet the minimum wall thickness require­\nments of the applicable product specification. \n22.3.10.3 If the test signals were produced by visual imper­\nfections such as scratches, surface roughness, dings, straight­\nener marks, cutting chips, steel die stamps, stop marks, or pipe \nreducer ripple, the pipe is permitted to be accepted based upon \nvisual examination provided that the depth of the imperfection \nis less than 0.004 in. [0.1 mm] or 12.5 % of the specified wall \nthickness, whichever is the greater. \n22.3.10.4 Rejected pipe may be reconditioned and retested, \nprovided that the wall thickness is not decreased to less than \nthat required by the applicable product specification. The \noutside diameter at the point of grinding may be reduced by the \namount so removed. To be accepted, retested pipe shall meet \nthe test requirement. \n22.3 .10.5 If the imperfection is explored to the extent that it \ncan be identified as non-rejectable, the pipe may be accepted \nwithout further test provided that the imperfection does not \nencroach on the minimum required wall thickness. \n23. Inspection \n23.1 The inspector representing the purchaser shall have \nentry at all times work on the contract of the purchaser is being \nperformed, to all parts of the manufacturer's facilities that \n1492 \n,.'~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1546.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6485,
  "bestTextAlphaRatio": 0.7429
}