{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 585,
  "globalPageIndex": 1383,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-813 /SA-813M \nS3. Flattening Test \nS3.1 The flattening test of Specification A999/A999M shall \nbe made on a specimen from one or both ends of each pipe. \nCrop ends may be used. If this supplementary requirement is \nspecified, the number of tests per pipe shall also be specified. \nIf a specimen from any length fails because of lack of ductility \nprior to satisfactory completion of the first step of the flattening \ntest requirement, that pipe shall be rejected subject to retreat­\nment in accordance with Specification A999/ A999M and \nsatisfactory retest. If a specimen from any length of pipe fails \nbecause of a lack of soundness, that length shall be tested, \nunless subsequent retesting indicates that the remaining length \nis sound. \nS4. Etching Tests \nS4.1 The steel shall be homogeneous as shown by etching \ntests conducted in accordance with the appropriate portions of \nMethod E381. Etching tests shall be made on a cross section \nfrom one end or both ends of each pipe and shall show sound \nwelds and reasonably uniform material free of injurious \nlaminations, cracks, and similar objectionable imperfections. If \nthis supplementary requirement is specified, the number of \ntests per pipe required shall also be specified. If a specimen \nfrom any length shows objectionable imperfections, the length \nshall be rejected subject to removal of the defective end and \nsubsequent retests indicating the remainder of the length to be \nsound and reasonably uniform material. \nSS. Radiographic Examination \nS5.l Weld soundness shall be determined through radio­\ngraphic examination made in accordance with requirements as \nagreed upon between the pipe manufacturer and purchaser. \nS6. Corrosion Requirements \nS6.1 Boiling Nitric Acid Test-Except for Grade TP 321, \ncoupons representing finished pipe made of nonmolybdenum­\nbearing material (0.50 % and less molybdenum) shall meet the \nrequirements of Practice C of Practices A262. The condition of \nthe test specimens and the corrosion rates are as follows: Types \n304L, 304LN, 347, and 348 shall be tested in the sensitized \ncondition (heated for 1 h at 1240 °P [670 °C]) and the rate of \npenetration when the solution is tested in accordance with \nPractice C shall not exceed 0.0020 in. [0.05 mm] per month. \nAll other nonmolybdenum-bearing types, except for Grade TP \n321, shown in Table 2, shall be tested in the annealed and \nunsensitized condition and the rate of penetration shall not \nexceed 0.0015 in. [0.038 mm] per month. \nS6.2 Acidified Copper Sulfate Test-Coupons representing \nfinished pipe made of molybdenum-bearing material (over \n0.50 % molybdenum) and Type 321 shall meet the require­\nments of Practice E of Practices A262. The condition of the test \nspecimen is as follows: Types 316L, 316LN, 317L, and 321 \nshall be tested in the sensitized condition (heated for 1 h at \n1240 °P [670 °C]). All molybdenum-bearing types shown in \nTable 2 shall be tested in the annealed and unsensitized \ncondition. All specimens shall meet the requirements of the \nprescribed bend tests. \n1321 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1383.json",
  "tabulaTablesCsv": "tables_tabula/page-1383.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1383.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3076,
  "bestTextAlphaRatio": 0.7568
}