{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 241,
  "globalPageIndex": 241,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-135/SA-135M (ASTM A135/A135M) \nThe examination may not detect circumferentially oriented \nimperfections of short, deep imperfections. \n11.3.2 The eddy-current examination referenced in this \nspecification has the capability of detecting significant \nimperfections, especially of the short, abrupt type. \n11.3.3 The hydrostatic test referred to in Section 10 is a test \nmethod provided for in many product specifications. This test \nhas the capability of finding imperfections of a size permitting \nthe test fluid to leak through the tube wall and may be either \nvisually seen or detected by a loss of pressure. This test may \nnot detect very tight, through-the-wall imperfections or imper­\nfections that extend an appreciable distance into the wall \nwithout complete penetration. \n11.3 .4 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of imperfections that can \nbe detected in the specific application of these examinations \nshould discuss this with the manufacturer of the tubular \nproduct. \n11.4 In order to accommodate the various types of nonde­\nstructive electric testing equipment and techniques in use, the \ncalibration pipe shall contain, at the option of the producer, any \none or more of the following discontinuities to establish a \nminimum sensitivity level for rejection: \n11.4.1 Drilled Hole-A hole not larger than 0.031-in. [0.8-\nmm] diameter shall be drilled radially and completely through \npipe wall, preferably in the weld area, care being taken to avoid \ndistortion of the pipe while drilling. \n11.4.2 Transverse Tangential Notch-A notch shall be filed \nor milled tangential to the surface and transverse to the \nlongitudinal axis of the pipe preferably in the weld area. Said \nnotch shall have a depth not exceeding 12.5 % of the nominal \nwall thickness of the pipe or 0.004 in., [0.10 mm], whichever \nis greater. \n11.4.3 Longituclinal Notch-A notch 0.031 in. [0.8 mm] or \nless in width shall be machined in a radial plane parallel to the \npipe axis on the outside surface of the pipe preferably in the \nweld area, to have a depth not exceeding 12.5 % of the nominal \nwall thickness of the pipe or 0.004 in. [0.10 mm], whichever is \ngreater. \n11.5 Pipe producing a signal equal to or greater than the \ncalibration imperfection shall be rejected. \n12. Dimensions, Weight (Mass), and Permissible \nVariations \n12.1 Weight (Mass)-The weight (mass) of any length of \npipe other than Schedule 10 shall not vary more than 3.5 % \nunder or 10 % over that specified, but the carload weight \n(mass) shall be not more than 1.75 % under the nominal weight \n(mass). The weight (mass) of pipe furnished to Schedule 10 \nshall not vary more than ± 10 % from that calculated using the \nweight (mass) per unit length prescribed in Appendix Table \nXl.1. The weight (mass) of the pipe shall be calculated from \nthe relevant equation in ASME B36.10M. \nNoTE 4-A system of standard pipe sizes has been approved by the \nAmerican National Standards Institute as American National Standard for \nWelded and Seamless Wrought Steel Pipe (ASME B36.lOM). \n12.2 Diameter-The outside diameter shall not vary more \nthan ± 1 % from the nominal size specified. \n12.3 Minimum Wall Thickness-The minimum wall thick­\nness at any point shall be not more than 12.5 % under the \nspecified wall thickness. \nNoTE 5-The minimum wall thickness on inspection is shown in Table \nXl.2 of the Appendix. \n12.4 Lengths: \n12.4.1 Except as allowed in 12.4.2, pipe shall be furnished \nin lengths averaging 38 ft [11.6 m] or over, with a minimum \nlength of 20 ft [6.1 m], but no more than 5 % may be under 32 \nft [9.8 m]. Jointers made by welding are permissible. When \nthreaded pipe is ordered, jointers shall be made by threaded \nconnections and shall not exceed 5 % of the order. \n12.4.2 Unless otherwise specified, Schedule 10 pipe shall be \nbetween 16 and 22 ft [4.9 and 6.7 m] for a minimum of 90 % \nof the footage furnished, with any balance being shorter \nlengths at least 8 ft [2.4 m] long. \n13. Workmanship, Finish, and Appearance \n13.1 The finished pipe shall be reasonably straight and free \nof defects. Surface imperfections in excess of 12.5 % of the \nnominal wall thickness shall be considered defects. \n13.2 End Finish: \n13.2.1 Schedule JO Pipe-Pipe furnished to Schedule 10 \nshall be plain end only. All inside and outside cutting burrs \nshall be removed. This generally involves breaking the comers. \n13.2.2 Ends, Plain End Pipe-Unless otherwise specified, \nplain end pipe for use with the Dresser or Dayton type coupling \nshall be reamed both outside and inside sufficiently to remove \nall burrs. Plain end pipe for welding shall be beveled on the \noutside to an angle of 30° with a tolerance of+ 5° and - 0° and \nwith a width of flat at the end of the pipe of 1/16 ± ½2 in. [1.6 \n± 0.8 mm]. When material is ordered beveled to any other than \na 30° angle, it should be understood that the angle is to be \nmeasured from a line drawn perpendicular to the axis of the \npipe. This means that a greater amount of material is removed \nwith a 60° angle than with a 30° angle. Pipe shall be \nsufficiently free from indentations, projections, or roll marks \nfor a distance of 8 in. [200 mm] from the end of the pipe to \nmake a tight joint with the rubber gasket type of coupling. All \nplain end pipe intended for Dresser or Dayton type joints or for \nwelding, sizes NPS 10 [DN 250] and smaller in outside \ndiameter specified, shall be not more than 1/32 in. [0.8 mm] \nsmaller than the outside diameter specified for a distance of 8 \nin. [200 mm] from the ends of the pipe and shall permit the \npassing for a distance of 8 in. [200 mm] of a ring gauge that has \na bore 1/16 in. [1.6 mm] larger than the outside diameter \nspecified of the pipe. Sizes larger than NPS 10 [DN 250] shall \nbe not more than 1/32 in. [0.8 mm] smaller than the nominal \noutside diameter for a distance of 8 in. [200 mm] from the end \nof the pipe and shall permit the passing for a distance of 8 in. \n[200 mm] of a ring gauge which has a bore 3/32 in. [2.4 mm] \nlarger than the nominal outside diameter of the pipe. \n189 \n13.2.3 Ends, Threaded Pipe-Each end of threaded pipe \nshall be reamed to remove all burrs. All threads shall be in \naccordance with the American National Standard Pipe Threads ",
  "words": [],
  "tableCount": 0,
  "noteCount": 2,
  "tabulaTablesPath": "tables_tabula/page-0241.json",
  "tabulaTablesCsv": "tables_tabula/page-0241.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0241.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6315,
  "bestTextAlphaRatio": 0.7289
}