{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 349,
  "globalPageIndex": 349,
  "width": 635.52,
  "height": 871.68,
  "text": "ASME BPVC.II.A-2025 SA-214/SA-214M \n7. Chemical Composition \n7 .1 The steel shall conform to the following requirements as \nto chemical composition: \nCarbon, max% 0.18 \nManganese, % 0.27 to 0.63 \nPhosphorus, max, % 0.035 \nSulfur, max, % 0.035 \n7 .2 Supplying an alloy grade of steel that specifically \nrequires the addition of any element other than those listed in \n7 .1 is not permitted. \n8. Product Analysis \n8.1 When requested on the purchase order, a product analy­\nsis shall be made by the supplier from 1 tube per 250 pieces; \nwhen tubes are identified by heat, one tube per heat shall be \nanalyzed. The chemical composition thus determined shall \nconform to the requirements specified. \n8.2 If the original test for product analysis fails, retests of \ntwo additional lengths of flat-rolled stock, or tubes shall be \nmade. Both retests, for the elements in question, shall meet the \nrequirements of the specification; otherwise all remaining \nmaterial in the heat or lot (Note 1) shall be rejected or, at the \noption of the producer, each length of flat-rolled stock or tube \nmay be individually tested for acceptance. Lengths of flat­\nrolled stock or tubes which do not meet the requirements of the \nspecification shall be rejected. \nNoTE 1-A lot consists of 250 tubes. \n9. Hardness Requirements \n9.1 The tubes shall have a hardness number not exceeding \n72 HRBW. \n10. Mechanical Tests Required \n10.1 Flattening Test-One flattening test shall be made on \nspecimens from each of two tubes from each lot (Note 1) or \nfraction thereof. \n10.2 Flange Test-One flange test shall be made on speci­\nmens from each of two tubes from each lot (Note 1) or fraction \nthereof. \n10.3 Reverse Flattening Test-One reverse flattening test \nshall be made on a specimen from each 1500 ft [450 m] of \nfinished tubing. \n10.4 Hardness Test-Brinell or Rockwell hardness tests \nshall be made on specimens from two tubes from each lot. The \nterm lot applies to all tubes prior to cutting, of the same \nnominal diameter and wall thickness which are produced from \nthe same heat of steel. When final heat treatment is in a \nbatch-type furnace, a lot shall include only those tubes of the \nsame size and the same heat which are heat treated in the same \nfurnace charge. When final heat treatment is in a continuous \nfurnace, a lot shall include all tubes of the same size and heat, \nheat treated in the same furnace at the same temperature, time \nat heat, and furnace speed. \n10.5 Hydrostatic or Nondestructive Electric Test-Bach \ntube shall be subjected to either the hydrostatic or the nonde­\nstructive electric test. The purchaser may specify which test is \nto be used. \n11. Surface Condition \n11.1 The finished tubes shall be free of scale. A slight \namount of oxidation shall not be considered as scale. \n12. Product Marking \n12.1 In addition to the marking prescribed in Specification \nA450/ A450M, the letters \"ERW\" shall be legibly stenciled on \neach tube, or marked on a tag attached to the bundle or box in \nwhich the tubes are shipped. \n12.2 The manufacturer's name or symbol may be placed \npermanently on each tube by rolling or light stamping before \nnormalizing. If a single stamp is placed on the tube by hand, \nthis mark should not be less than 8 in. [200 mm] from one end \nof the tube. \n12.3 Bar Coding-In addition to the requirements in 12.1 \nand 12.2 bar coding is acceptable as a supplemental identifi­\ncation method. The purchaser may specify in the order a \nspecific bar coding system to be used. \n297 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0349.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3520,
  "bestTextAlphaRatio": 0.75,
  "noteOcrPath": "note_ocr/page-0349.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0349.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": [],
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0349.txt",
  "gapOcrHighDpiLength": 3505,
  "camelotTablesPath": "camelot_tables/page-0349.json",
  "camelotTablesCsv": "camelot_tables/page-0349.csv",
  "camelotTableCount": 2
}