{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 155,
  "globalPageIndex": 155,
  "width": 626.4,
  "height": 803.04,
  "text": "ASME BPVC.II.A-2025 SA-29/SA-29M \nA311/A311M Specification for Cold-Drawn, Stress­\nRelieved Carbon Steel Bars Subject to Mechanical Prop­\nerty Requirements \nA321 Specification for Steel Bars, Carbon, Quenched and \nTempered (Withdrawn 2007) \nA322 Specification for Steel Bars, Alloy, Standard Grades \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA434/A434M Specification for Steel Bars, Alloy, Hot­\nWrought or Cold-Finished, Quenched and Tempered \nA499 Specification for Steel Bars and Shapes, Carbon \nRolled from \"T\" Rails \nA575 Specification for Steel Bars, Carbon, Merchant \nQuality, M-Grades \nA576 Specification for Steel Bars, Carbon, Hot-Wrought, \nSpecial Quality \nA663/A663M Specification for Steel Bars, Carbon, Mer­\nchant Quality, Mechanical Properties \nA675/A675M Specification for Steel Bars, Carbon, Hot­\nWrought, Special Quality, Mechanical Properties \nA689 Specification for Carbon and Alloy Steel Bars for \nSprings \nA696 Specification for Steel Bars, Carbon, Hot-Wrought or \nCold-Finished, Special Quality, for Pressure Piping Com­\nponents \nA700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA 739 Specification for Steel Bars, Alloy, Hot-Wrought, for \nElevated Temperature or Pressure-Containing Parts, or \nBoth \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE112 Test Methods for Determining Average Grain Size \n2.2 ASME Code: \nASME Boiler and Pressure Vessel Code \n2.3 Federal Standards: \nFed. Std. No. 123 Marking for Shipment (Civil Agencies) \nFed. Std. No. 183 Continuous Identification Marking of Iron \nand Steel Products \n2.4 Military Standard: \nMIL-STD-163 Steel Mill Products-Preparation for Ship­\nment and Storage \n2.5 Other Standards: \nAIAG B-1 Bar Code Symbology Standard for 3-of-9 Bar \nCodes \nAIAG B-5 02.00 Primary Metals Tag Application Standard \n3. Terminology \n3 .1 Definitions of Terms Specific to This Standard: \n3.1.1 cold-finished steel bars-steel bars produced by cold \nfinishing previously hot-wrought bars by means of cold \ndrawing, cold forming, turning, grinding, or polishing (singly \nor in combination) to yield straight lengths or coils in sections \nthat are uniform throughout their length and in the following \nsections and sizes: \n3.1.1.1 rounds-9 in. [230 mm] and under in diameter, \n3.1.1.2 squares-6 in. [150 mm] and under between parallel \nsurfaces, \n3.1.1.3 hexagons-4 in. [100 mm] and under between par­\nallel surfaces, \n3.1.1.4 fiats-Vs in. [3 mm] and over in thickness and not \nover 12 in. [300 mm] in width, and \n3.1.1.5 special bar sections. \n3.1.2 hot-wrought steel bars-steel bars produced by hot \nforming ingots, blooms, billets, or other semifinished forms to \nyield straight lengths ( or coils, depending upon size, section, \nand mill equipment) in sections that are uniform throughout \ntheir length, and in the following sections and sizes: \n3.1.2.1 rounds-½2 in. to 10.0 in. [5.5 mm to 250 mm], \ninclusive; \n3.1.2.2 squares-½2 in. to 6.0 in. [6 mm to 160 mm], \ninclusive; \n3.1.2.3 round-cornered squares-1/32 in. to 8.0 in. [6 mm to \n200 mm], inclusive; \n3.1.2.4 fiats-¼ in. to 8 in. inclusive, in width: 13 /64 in. in \nminimum thickness up to 6 in. in width; and 0.230 in. in \nminimum thickness for over 6 in. to 8 in. in width, inclusive \n[ over 5 mm in thickness up to 150 mm in width; and over 6 mm \nin thickness for over 150 mm through 200 mm in width]. \nMaximum thickness for all widths is 4 in. [100 mm]; \n3.1.2.5 hexagons and octagons-¼ in. to 4½6 in. [6 mm to \n103 mm], inclusive, between parallel surfaces; \n3.1.2.6 bar size shapes-Angles, channels, tees, zees, when \ntheir greatest cross-sectional dimension is under 3 in. [75 mm]; \nand \n3.1.2.7 special bar sections-Half-rounds, ovals, half-ovals, \nother special bar size sections. \n3.1.3 lot-unless otherwise specified in the contract or \norder, a lot shall consist of all bars submitted for inspection at \nthe same time of the same heat, condition, finish, size, or shape. \nFor bars specified in the quenched and tempered condition, \nwhen heat treated in batch-type furnaces, a lot shall consist of \nall bars from the same heat, of the same prior condition, the \nsame size, and subjected to the same heat treatment in one \ntempering charge. For bars specified in the quenched and \ntempered condition, when heat treated without interruption in a \ncontinuous-type furnace, a lot shall consist of all bars from the \nsame heat, of the same prior condition, of the same size, and \nsubjected to the same heat treatment. \n103 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0155.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4663,
  "bestTextAlphaRatio": 0.7167
}