{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 567,
  "globalPageIndex": 567,
  "width": 610.92,
  "height": 852.6,
  "text": "ASME BPVC.II.A-2025 SA-335/SA-335M (ASTM A335/A335M) \n17 .1.4.1 Pipe shall be ordered to nominal pipe size and \nschedule specified in ASME B36.10M \nExample: A335/A335M Pipe P-11 NPS 12 Sch 40 \nSpecification Number \nPipe \nGrade \nNPS \nWall \n17.1.4.2 \nSpecification Number \nTube \nGrade \nOutside Diameter \nWall \nASTM A335/A335M \np \nP-11 \n12 \n0.375 \nASTM A335/A335M \nT \nP-11 \n0.250 \n0.035 \n17.1.5 Ordering Information-Orders for material under \nthis specification shall include the following in addition to the \nrequirements of Section 3: \n17.1.5.1 Pipe or tube, \n17.1.5.2 Part number, \n17 .1.5.3 Ultrasonic inspection, if required, \n17 .1.5 .4 If shear wave test is to be conducted in two \nopposite circumferential directions, and \n17 .1.5.5 Level of preservation and packing required. \n18. Keywords \n18.1 alloy steel pipe; high temperature service; seamless \nsteel pipe; steel pipe; temperature service applications \nSUPPLEMENTARY REQUffiEMENTS \nOne or more of the following supplementary requirements shall apply only when specified in the \npurchase order. The purchaser may specify a different frequency of test or analysis than is provided \nin the supplementary requirement. Subject to agreement between the purchaser and manufacturer, \nretest and retreatment provisions of these supplementary requirements may also be modified. \nSl. Product Analysis \nS 1. 1 Product analysis shall be made on each length of pipe. \nIndividual lengths failing to conform to the chemical compo­\nsition requirements shall be rejected. \nS2. Transverse Tension Tests \nS2.1 A transverse tension test shall be made on a specimen \nfrom one end or both ends of each pipe NPS 8 and over. If this \nsupplementary requirement is specified, the number of tests per \npipe shall also be specified. If a specimen from any length fails \nto meet the required tensile properties (tensile, yield, and \nelongation), that length shall be rejected subject to retreatment \nin accordance with Specification A999/A999M and satisfac­\ntory retest. \nS3. Flattening Test \nS3.l The flattening test of Specification A999/A999M shall \nbe made on a specimen from one end or both ends of each pipe. \nCrop ends may be used. If this supplementary requirement is \nspecified, the number of tests per pipe shall also be specified. \nIf a specimen from any length fails because of lack of ductility \nprior to satisfactory completion of the first step of the flattening \ntest requirement, that pipe shall be rejected subject to retreat­\nment in accordance with Specification A999/A999M and \nsatisfactory retest. If a specimen from any length of pipe fails \nbecause of a lack of soundness that length shall be rejected, \nunless subsequent retesting indicates that the remaining length \nis sound. The bend test shall be substituted for the flattening \ntest for pipe whose diameter exceeds NPS 25 and whose \ndiameter to wall thickness ratio is 7 .0 or less. \nS4. Metal Structure and Etching Tests \nS4. l The steel shall be homogeneous as shown by etching \ntests conducted in accordance with the appropriate portions of \nMethod E381. Etching tests shall be made on a cross section \nfrom one end or both ends of each pipe and shall show sound \nand reasonably uniform material free from injurious \nlaminations, cracks, and similar objectionable defects. If this \nsupplementary requirement is specified, the number of tests per \npipe required shall also be specified. If a specimen from any \nlength shows objectionable defects, the length shall be rejected, \nsubject to removal of the defective end and subsequent retests \nindicating the remainder of the length to be sound and \nreasonably uniform material. \nNorn S4.1-Pending development of etching methods applicable to the \nproduct covered by this specification, it is recommended that the Recom­\nmended Practice for a Standard Macro Etch Test for Routine Inspection of \nIron and Steel, described in the Metals Handbook, Am. Soc. for Metals, \n1948 edition, p. 389, be followed. \nSS. Photomicrographs \nS5.1 When requested by the purchaser and so stated in the \norder, the manufacturer shall furnish one photomicrograph at \n100 diameters from a specimen of pipe in the as-finished \ncondition for each individual size and wall thickness from each \nheat, for pipe NPS 3 and over. Such photomicrographs shall be \nsuitably identified as to pipe size, wall thickness, and heat. No \nphotomicrographs for the individual pieces purchased shall be \nrequired except as specified in Supplementary Requirement S6. \nSuch photomicrographs are for information only, to show the \nactual metal structure of the pipe as finished. \n515 \nS6. Photomicrographs for Individual Pieces \nS6.1 In addition to the photomicrographs required in accor­\ndance with Supplementary Requirement S5, the purchaser may \nspecify that photomicrographs shall be furnished from each \nend of one or more pipes from each lot of pipe NPS 3 and \nlarger in the as-finished condition. The purchaser shall state in \nthe order the number of pipes to be tested from each lot. When \nphotomicrographs are required on each length, the photomi­\ncrographs from each lot of pipe in the as-finished condition \nwhich may be required under Supplementary Requirement S5 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0567.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5192,
  "bestTextAlphaRatio": 0.7671
}