{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 423,
  "globalPageIndex": 1221,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC,II.A-2025 SA-691/SA-691M \nS7.3 Acceptance Standards, shall be by agreement between \nthe manufacturer and the purchaser. \nS8. Liquid Penetrant Examination of Base Metal \nS8. l All accessible surfaces of the pipe shall be examined in \naccordance with Test Method El65/E165M. Accessible is as \ndefined in S7 .1. \nS8.2 Butt-weld end preparations are to be completely liquid \npenetrant examined in accordance with Test Method E165/ \nE165M. \nS8.3 Acceptance Standards, shall be by agreement between \nthe manufacturer and the purchaser. \nS9. Liquid Penetrant Examination of Weld Metal \nS9.1 All accessible surfaces of the pipe shall be examined in \naccordance with Test Method E165/E165M. Accessible is as \ndefined in S6.1. \nS9.2 Acceptance Standards, shall be by agreement between \nthe manufacturer and the purchaser. \nS10. lntrasonic Test \nSlO.l Plate in Flat: \nSl0.1.1 One hundred percent on one surface shall be \nscanned. \nSl0.1.2 Straight search shall be used in accordance with \nSpecification A435/A435M. \nSl0.1.3 Acceptance standards shall be in accordance with \nSpecification A435/A435M or as by agreement between the \nmanufacturer and the purchaser. \nS11. Repair Welding \nS 11.1 Repair of base metal defects by welding shall be done \nonly with customer approval. \nS12. Description of Term \nS12.1 lot-all pipe of the same mill heat of plate material \nand wall thickness (within±¼ in. [6 mm]) heat treated in one \nfurnace charge. For pipe that is not heat treated or that is heat \ntreated in a continuous furnace, a lot shall consist of each 200 \nft [60 m] or fraction thereof of all pipe of the same mill heat of \nplate material and wall thickness (within ±¼ in. [6 mm]), \nsubjected to the same heat treatment. For pipe heat treated in a \nbatch-type furnace that is automatically controlled within a 50 \n°F [30 °C] range and is equipped with recording pyrometers so \nthat heating records are available, a lot shall be defined the \nsame as for continuous furnaces. \nS13. ASME Section III Construction \nS13.l Products furnished under this specification that are \nintended for application under the rules of Section III of the \nASME Boiler and Pressure Vessel Code shall be manufactured \nby holders of the appropriate ASME Certificate of Authoriza­\ntion and Certification Mark. The product is subject to all \napplicable requirements of Section III, including welding, heat \ntreatment, nondestructive examination, authorized inspection \nat the point of manufacture, and application of the Certification \nMark. \nS13.2 The applicable ASME Partial Data Report form, \nsigned by an Authorized Nuclear Inspector, and a material test \nreport shall be furnished for each lot of pipe. \nSl3.3 The plate used to fabricate the pipe shall conform to \nthe applicable SA specification in the ASME Boiler and \nPressure Vessel Code, Section II. The welded joints shall be \nfull penetration butt welds as obtained by double welding or by \nother means that will obtain the same quality of deposited weld \nmetal on the inside and outside. Welds using metal backing \nstrips that remain in place are prohibited. \nSl3.4 In addition to the requirements of S12 and Section 13 \n(Product Marking), each length of pipe shall be so marked as \nto identify each such piece of pipe with the lot and the material \ntest report. \n1135 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1221.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3307,
  "bestTextAlphaRatio": 0.7596
}