{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 82,
  "globalPageIndex": 82,
  "width": 618.6,
  "height": 796.8,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \nand cooling rates) specified in the order. The test results for \nsuch heat-treated test specimens shall meet the applicable \nproduct specification requirements. \nS4. Additional Tension Test \nS4.1 Plate-One tension test shall be made from each unit \nplate rolled from a slab or directly from an ingot, • except that \nfor quenched and tempered plates, a test shall be taken from \neach unit plate heat treated. The results obtained shall be \nreported on the mill test reports when such tests are required by \nthe order. \nSS. Charpy V-Notch Impact Test \nS5. l Charpy V-notch impact tests shall be conducted in \naccordance with Specification A673/A673M. \nS5.2 The frequency of testing, the test temperature to be \nused, and the absorbed energy requirements shall be as \nspecified on the order. \nS6. Drop-Weight Test (for Material 0.625 in. [16 mm] and \nOver in Thickness) \nS6.1 Drop-weight tests shall be made in accordance with \nTest Method E208. The specimens shall represent the material \nin the final condition of heat treatment. Agreement shall be \nreached between the purchaser and the manufacturer or pro­\ncessor as to the number of pieces to be tested and whether a \nmaximum nil-ductility transition (NDT) temperature is man­\ndatory or if the test results are for information only. \nSS. Ultrasonic Examination \nS8. l The material shall be ultrasonically examined in ac­\ncordance with the requirements specified on the order. \nS15. Reduction of Area Measurement \nSl5.l The reduction of area, as determined on the 0.500-in. \n[12.5-mm] diameter round tension test specimen in accordance \nwith Test Methods and Definitions A370, shall not be less than \n40%. \n30 \nSlS. Maximum Tensile Strength \nS18.l Steel having a specified minimum tensile strength of \nless than 70 ksi [485 MPa] shall not exceed the minimum \nspecified tensile strength by more than 30 ksi [205 MPa]. \nS18.2 Steel having a minimum specified tensile strength of \n70 ksi [485 MPa] or higher shall not exceed the minimum \nspecified tensile strength by more than 25 ksi [170 MPa]. \nS23. Copper-Bearing Steel (for improved atmospheric cor-\nrosion resistance) \nS23. l The copper content shall be a minimum of 0.20 % on \nheat analysis, 0.18 on product analysis. \nS26. Subdivided Material-Marking of Individual Pieces \nS26.1 Subdivided pieces shall be individually identified by \nmarking, stenciling, or die stamping the applicable product \nspecification designation (year-date not required), grade, heat \nnumber, and the heat treatment identification, if applicable, \nalong with the trademark, brand, or name of the organization \nthat subdivided the structural product. As an alternative, \nindividual subdivided pieces shall be identified by a code \ntraceable to the original required identification, provided that \nthe trademark, name, or brand of the organization that subdi­\nvided the structural product is also placed on the structural \nproduct and the original required identification, cross refer­\nenced on the code, is furnished with the structural product. \nS27. Restrictive Plate Flatness \nS27 .1 As-rolled or normalized carbon steel plates ordered to \nrestrictive flatness shall conform to the permitted variations \nfrom a flat surface given in Table S27.1 or Table S27.2, \nwhichever is applicable. \nS27.2 As-rolled or normalized high-strength low-alloy steel \nplates ordered to restrictive flatness shall conform to the \npermitted variations from a flat surface given in Table S27 .3 or \nTable S27 .4, whichever is applicable. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0082.json",
  "tabulaTablesCsv": "tables_tabula/page-0082.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0082.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3530,
  "bestTextAlphaRatio": 0.7637
}