{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 442,
  "globalPageIndex": 442,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-265 ASME BPVC.II.A-2025 \n13.2 Inspection: \n13.2.1 Clad plates less than% in. (10 mm) total minimum \ncomposite thickness shall be visually inspected for bond \nintegrity p1ior to shipment. \n13.2.2 Clad plates 3/s in. (10 mm) and thicker total minimum \ncomposite thickness, and when specified by the purchaser, clad \nplates less than 3/s in. (10 mm) total minimum composite \nthickness, shall be ultrasonically inspected for bond integrity \nprior to shipment in accordance with the Procedures and \nMethods of Specification A578/A578M. \n13.2.3 Areas of non-bond detected visually shall be ex­\nplored ultrasonically to determine the extent of the condition in \naccordance with 13.2.2. For purposes of defining non-bond, the \ncladding shall be interpreted to be unbonded when there is \ncomplete loss of back reflection accompanied by an echo \nindication from the plane of the interface of the clad and \nbacking steel. Areas within 1 in. (25 mm) of a cut edge on the \nplate that contain indications exceeding 50 % of the back \nreflection at the bond interface shall be considered to be \nunbonded. \n13.2.4 Extent of ultrasonic examination shall be at the \ndiscretion of the manufacturer and sufficient enough to provide \nthe quality level required by the purchaser. Plates may be \nordered with 100 % coverage (see Supplementary Requirement \nSl2). \n13.3 Quality Levels: \n13.3.1 Class I-No single unbonded area exceeding 1 in. \n(25 mm) in its longest dimension with total unbonded area not \nto exceed 1 % of the total cladded surface area. \n13.3.2 Class 3-No single unbonded area exceeding 3 in. \n(75 mm) in its longest dimension with total unbonded area not \nto exceed 3 % of the total cladded surface area. \n13.3.3 Class 5-No single unbonded area exceeding 9 in.2 \n(58 cm 2 ) with total unbonded area not to exceed 5 % of the \ntotal cladded surface area. \n13.3.4 The class to be supplied shall be listed on the \npurchase order. When none has been specified, plates shall be \nfurnished as Class 5 at the option of the manufacturer. \n14. Welding \n14.1 All welding which is a part of the delivered product, \nincluding any made in the fabrication of the cladding alloy \ncomponent, shall be performed with a procedure and welders \nor welding operators that are qualified in accordance with \nSection IX of the ASME Code. \n14.2 The material manufacturer may repair defects in clad­\nding by welding provided the following requirements are met: \n14.2.1 When specified in the purchase order, prior approval \nshall be obtained from the purchaser. \n14.2.2 The defective area shall be removed and the area \nprepared for repair shall be examined by a liquid penetrant \nmethod to ensure all defective area has been removed. Method \nof test and acceptance standard shall be as agreed upon \nbetween the purchaser and the manufacturer. \n14.2.3 The repair weld shall be deposited in accordance \nwith a welding procedure and welding materials suitable for \nthe cladding material. The surface condition of the repaired \narea shall be restored to a condition similar to the rest of the \ncladding. \n14.2.4 The repaired area shall be examined by a liquid \npenetrant method in accordance with 14.2.2. \n14.2.5 The location and extent of the weld repairs together \nwith the repair procedure and examination results shall be \ntransmitted as a part of the certification. \n15. General Requirements for Delivery \n15.1 Material furnished under this specification shall con­\nform to the applicable requirements of Specification A6/A6M \nor A20/ A20M as appropriate for the backing metal. \n15.2 In the event of conflicts between this specification and \nthe general delivery requirement specification for the backing \nsteel, this specification shall apply. \n16. Certification \n16.l The chemical analysis of the base metal and the alloy \ncladding shall be certified to the purchaser by the clad plate \nmanufacturer. \n16.2 The results of the tests in Section 7 and any other tests \nrequired by the purchase order shall be reported to the \npurchaser. \n390 \n16.3 Compliance with the clad quality level of 13.3 shall be \ncertified. Reports shall include the results of ultrasonic inspec­\ntion when Supplementary Requirement S12 is specified. \n16.4 Compliance with any applicable construction code \nshall be certified and the appropriate documentation provided \nwhen appropriate in the case of explosively bonded clad \nproduced using welded alloy cladding components (see 4.1.9 \nand 4.1.11). \n17. Product Marking \n17 .1 Except as specified in plates shall be marked in \naccordance with the requirements of Specification A6/ A6M or \nA20/A20M for the backing steel as applicable, the cladding \nalloy designation, and this specification number. \n17 .2 For double-clad material or for material under % in. \n(6.35 mm) nominal in thickness or for clad plates provided \nwith conditioned surfaces, the marking specified in 17. l shall \nbe legibly stenciled instead of stamped when the material is \nshipped with the alloy smface up. \n18. Keywords \n18.1 alloy cladding; bond strength; carbon steel; clad steel \nplate; low-alloy steel; nickel; nickel-base alloy ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0442.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5103,
  "bestTextAlphaRatio": 0.7547
}