{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 510,
  "globalPageIndex": 1308,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-765/SA-765M ASME BPVC.II.A-2025 \nStandard Specification for \nCarbon Steel and Low-Alloy Steel Pressure-Vessel­\nComponent Forgings with Mandatory Toughness \nRequirements \n1. Scope \n1. 1 This specification covers heat-treated carbon steel and \nalloy steel forgings with mandatory toughness requirements. \nThese forgings are intended for pressure vessels, feedwater \nheaters, and similar uses. \n1.2 These forgings include tube sheets, covers, channel \nbarrels, integral forged channels, rings, nozzles, flanges, and \nsimilar parts. \n1.3 All grades are considered weldable under proper condi­\ntions. \n1.4 The maximum thickness of forgings produced to this \nspecification is limited only by the capacity of the selected \ngrade to respond to any heat treatment specified and to meet the \nspecified mechanical tests, including impact tests at the speci­\nfied temperature. \n1.5 Material supplied to this specification shall conform to \nthe requirements of Specification A788/A788M, which out­\nlines additional ordering information, manufacturing \nrequirements, testing and retesting methods and procedures, \nmarking, certification, product analysis variations, and addi­\ntional supplementary requirements. \n1.6 If the requirements of this specification are in conflict \nwith the requirements of Specification A788/A788M, the \nrequirements of this specification shall prevail. \n1. 7 The values stated in either inch-pound units or SI \n[metric] units are to be regarded separately as the standard; \nwithin the text and tables, the SI units are shown in brackets. \nThe values stated in each system are not exact equivalents; \ntherefore, each system must be used independently of the other. \nCombining values from the two systems may result in noncon­\nformance with the specification. \n1.8 Unless the order specifies the applicable \"M\" specifica­\ntion designation, the material shall be furnished to the inch­\npound units. \n2. Referenced Documents \n2.1 ASTM Standards: \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA388/A388M Practice for Ultrasonic Examination of Steel \nForgings \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nE112 Test Methods for Determining Average Grain Size \nE165 Practice for Liquid Penetrant Examination for General \nIndustry \n2.2 ASME Standards: \nASME Boiler and Pressure Vessel Code \n3. Ordering Information \n3.1 In addition to the ordering information requirements of \nSpecification A788/A788M, a detailed sketch or written de­\nscription of the forging and the method of selecting the test \nlocation (see 6.2) should be supplied to the producer, when \nappropriate areas of significant in-service loading of the \nforging need to be designated. \n3.2 The required impact test temperature should be supplied \nif different than the temperature listed in Table 3, otherwise the \nimpact test shall be conducted at the temperature listed in Table \n3 for the chosen Grade. \n3.3 If a hubbed tube sheet is to be supplied for ASME Boiler \nand Pressure Code Application Supplementary Requirement \nS12 of Specification A788/A788M shall be specified. \n1240 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1308.json",
  "tabulaTablesCsv": "tables_tabula/page-1308.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1308.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3190,
  "bestTextAlphaRatio": 0.7793
}