{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 663,
  "globalPageIndex": 663,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-370 \nTABLE A 1.2 Recommended Practice for Selecting Bend Test Specimens for Steel Bar Products \nNorn I-The length of all specimens is to be not less than 6 in. (150 mm). \nNorn 2-The edges of the specimen may be rounded to a radius not exceeding 1/16 in. (1.6 mm). \nFlats \nThickness, in. (mm) Width, in. (mm) Recommended Size \nUp to¼ (13), incl Up to¾ (19), incl Full section. \nOver¾ (19) Full section or machine to not less than ot less than \n¾ in. (19 mm) in width by thickness of specimen. \nOver¼ (13) All Full section or machine to 1 by ¼ in. (25 by 13 mm) \nspecimen from midway between center and surface. \nRounds, Squares, Hexagons, and Octagons \nDiameter or Distance Between Parallel Faces, in. (mm) \nUp to 1¼ (38), incl \nOver 1¼ (38) \nhardness penetration. \nRecommended Size \nFull section. \nMachine to 1 by ¼-in. {25 by 13 mm) specimen from midway between center \nand surface. \nA2. STEEL TUBULAR PRODUCTS \nA2.1 Scope \nA2.l.1 This annex contains testing requirements for Steel \nTubular Products that are specific to the product. The require­\nments contained in this annex are supplementary to those found \nin the general section of this specification. In the case of \nconflict between requirements provided in this annex and those \nfound in the general section of this specification, the require­\nments of this annex shall prevail. In the case of conflict \nbetween requirements provided in this annex and requirements \nfound in product specifications, the requirements found in the \nproduct specification shall prevail. \nA2.1.2 Tubular shapes covered by this specification include, \nround, square, rectangular, and special shapes. \nA2.2 Tension Test \nA2.2.1 Full-size Longitudinal Test Specimens: \nA2.2.1.1 As an alternative to the use of longitudinal strip \ntest specimens or longitudinal round test specimens, tension \ntest specimens of full-size tubular sections are used, provided \nthat the testing equipment has sufficient capacity. Snug-fitting \nmetal plugs should be inserted far enough in the end of such \ntubular specimens to permit the testing machine jaws to grip \nthe specimens properly without crushing. A design that may be \nused for such plugs is shown in Fig. A2.1. The plugs shall not \nextend into that part of the specimen on which the elongation \nis measured (see Fig. A2.l). Care should be exercised to see \nthat insofar as practicable, the load in such cases is applied \naxially. The length of the full-section specimen depends on the \ngauge length prescribed for measuring the elongation. \nA2.2.1.2 Unless otherwise required by the product \nspecification, the gauge length is 2 in. or 50 mm, except that for \ntubing having an outside diameter of 3/s in. (9.5 mm) or less, it \nis customary for a gauge length equal to four times the outside \n611 \n@) \nFIG. A2.1 Metal Plugs for Testing Tubular Specimens, Proper Lo­\ncation of Plugs in Specimen and of Specimen in Heads of Test­\ning Machine \ndiameter to be used when elongation comparable to that \nobtainable with larger test specimens is required. \nA2.2.1.3 To determine the cross-sectional area of the full­\nsection specimen, measurements shall be recorded as the \naverage or mean between the greatest and least measurements \nof the outside diameter and the average or mean wall thickness, \nto the nearest 0.001 in. (0.025 mm) and the cross-sectional area \nis determined by the following equation: \nA= 3.1416t (D t) (A2. l) \nwhere: \nA = sectional area, in.2 \nD = outside diameter, in., and \nt = thickness of tube wall, in. \nNorn A2.1-There exist other methods of cross-sectional area \ndetermination, such as by weighing of the specimens, which are equally ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0663.json",
  "tabulaTablesCsv": "tables_tabula/page-0663.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0663.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3656,
  "bestTextAlphaRatio": 0.7445
}