{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 626,
  "globalPageIndex": 1424,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-841/SA-841M ASME BPVC.II.A-2025 \nS78. Low Sulfur Treatment \nS78.1 Restricted sulfur content shall be specified on the \norder. In the absence of such a specification the maximum \nsulfur furnished under this supplementary requirement shall be \n0.003 % on heat analysis. \nNoTE S78.l-The low sulfur treatment is for the purpose of enhancing \nthe HIC (Hydrogen Induced Cracking) and SSC (Sulfide Stress Cracking) \nresistance. \nS79. Carbon Equivalent Limit \nS79.1 The carbon equivalent, on heat analysis, shall not \nexceed 0.27 %, or a lower value as specified in the purchase \norder, when based on the following equation: \nSi Mn+Cu+Cr Ni Mo V \nPCM= c+ 30+ 20 + 60+1s+ 10+ 5 B% \nAPPENDIX \n(Nomnandatory Information) \nXl. THERMO-MECHANICAL CONTROLLED PROCESSING (TMCP) \nXl.1 Introduction-The Thermo•Mechanical Controlled \nProcessing, commonly referred . to as \"TMCP,\" has evolved \nfrom the \"controlled rolling\" (CR) processes, which have been \nknown and used for a number of years. TMCP produces \nfine-grained steel by a combination of chemical composition \nand integrated controls of manufacturing processes from slab \nreheating to post-rolling cooling, thereby achieving the speci­\nfied mechanical properties in the required plate thicknesses. \nTMCP requires accurate control of both the steel temperature \nand rolling reductions, and does not involve coiling after the \npost- cooling. \nXl.2 Outline of TMCP As May Be applied to Grades A \nthrough F-As shown in Fig. Xl.l, TMCP for those grades \nmay incorporate three processes, as follows: \nXl.2.1 Thermo-Mechanical Rolling (TMR)-Steels of fine \ngrain size are produced by rolling in the recrystallization and \nthe nonrecrystallization regions of austenite, and sometimes in \nthe dual-phase temperature region of austenite and ferrite. \nGenerally, a high proportion of the rolling reduction is per• \nlYPE OF PROCESSING \nSTRUCTURE . TEMPERATURE THERMO-MECHANICAL CONTROL PROCE$SES \nIIEClt'l'$TA!.lmD \n~) \n~ \nNOffltECl';'(S'r. \n{l:LONG.<ll'lll)) \nAUSl'ENllll \n~$I.All \nHl!A'l'lffllfl!MP. \n~ \nffl,IP, \nAr3 \nTMlt AC \n(1) (2) (4) (S) (6) \nR. \nR \nformed close to, or below, the temperature at which austenite \nbegins to transform to ferrite during cooling (Ar3) and may \ninvolve rolling in the lower portion of the temperature range of \nthe intercritical dual-phase region. \nXl.2.2 Accelerated Cooling (AC)-Steels meeting the \nspecified requirements are produced by controlled cooling \n(accelerated cooling and air cooling) through the dual-phase \nteq1perature region immediately after final controlled rolling \n(CR) or TMR operation, \nXl.2.3 Direct Quenched and Tempered (DQT)-:-Steels \nmeeting the specified requirements are produced by promoting \ngrain refinement and increasing hardness through direct \nquenching i:tnmediately after final controlled rolling (CR) or \nTMR operations. Subsequent to direct quenching the plates are \ntempered. \nXl.2.4 The selection, from the above, of the method to be \nused is made by the plate producer depending upon the \nchemical composition, the plate thickness, and the required \nproperties. \nCONVENTIONAL PRO<l!SSES \nOQ·T AA N CR \n(8) (9) (10) (11) (12) \nR \nAIJffl!lm! \n+l'!!!IRm! \nAr1 \nAC AC AC \nl'lilllUTe+l'l!:'AA1ffll \n(l'l!llRm + SAIHfl'll \n+l!AA1ffiSITI!) \nNelie: \n'TMR: TH~l ROI.UNG N: NORMAIRS> \nM;: ACCEt.ellATeO COOUNG PEtOa!SS ~: CONTROi.i.ED ROI.UNG \nAR: AS ROWD R: REDUCTION \nDQ: tl!RllCT QUl!NO!lNG \nT:TeMPEREO \nFIG, X1 .1 Schematic Diagrams of Thermo-Mechanical Control and Conventional Process of Steel Plate as may be Applied to Grades A \nthrough F \n1362 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1424.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3555,
  "bestTextAlphaRatio": 0.748
}