{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 801,
  "globalPageIndex": 1599,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-1058 \ncross-sectional area, the diameter shall be measured at the \ncenter of the gauge length to the nearest 0.025 mm. \n7.6 General-Test specimens shall be either substantially \nfull size or machined, as prescribed in the product specifica­\ntions for the material being tested. \n7.6.1 It is desirable to have the cross-sectional area of the \nspecimen smallest at the center of the gauge length to ensure \nfracture within the gauge length. This is provided for by the \ntaper in the gauge length permitted for each of the specimens \ndescribed in the following sections. \n7 .6.2 For low ductility materials it is desirable to have fillets \nof large radius at the ends of the gauge length. \n• 8. Plate-Type Specimen \n8.1 The standard plate-type test specimen is shown in Test \nMethods E8/E8M, ISO 6892-1, or JIS Z 2241. This specimen \nis used for testing metallic materials in the form of plate, \nstructural and bar-size shapes, and flat material having a \nnominal thickness of 5 mm or over. When product specifica­\ntions so permit, other types of specimens may be used. \n9. Sheet-Type Specimen \n9.1 The standard sheet-type test specimen is shown in Test \nMethods E8/E8M, ISO 6892-1, or JIS Z 2241. This specimen \nis used for testing metallic materials in the form of sheet, plate, \nflat wire, strip, band, and hoop ranging in nominal thickness \nfrom 0.13 to 19 mm. When product specifications so permit, \nother types of specimens may be used, as specified in Test \nMethods E8/E8M. \n10. Round Specimens \n10.1 The standard diameter round test specimen as shown in \nTest Methods E8/E8M, ISO 6892-1, or JIS Z 2241 is frequently \nused for testing metallic materials. \n10.2 Small size specimens proportional to standard speci­\nmens may be used when it is necessary to test material from \nwhich the standard specimens cannot be prepared. When small \nsize specimens are used, the gauge length for measurement of \nelongation shall be five times the diameter of the specimen. \n10.3 The type of specimen ends outside of the gauge length \nshall accommodate the shape of the product tested, and shall \nproperly fit the holders or grips of the testing machine so that \naxial loads are applied with a minimum of load eccentricity and \nslippage. \n11. Gauge Marks \n11.1 Test specimens shall be marked in accordance with the \nrequirements of the relevant standards. \n12. Determination of Tensile Properties \n12.1 The determination and description of the tensile prop­\nerties shall be in accordance with the requirements of the \nrelevant standards. \n12.2 Elongation values may be converted from (i) 4d gauge \nlength to a 5d gauge length, or (ii) 5d gage length to a 4d gage \nlength by use of the multiplication factors shown in Table 2. If \nthis conversion is used, the supplier must show the calculation \non the certification. \nTABLE 2 Conversion Factors for 4d and 5d Gauge Lengths (ISO \n2566-1 and ISO 2566-2) \nConversion from \nCarbon and low alloy steels \nAustenitic steels \n4d to 5d \n0.916 \n0.972 \n5d to 4d \n1.093 \n1.029 \n12.2.1 Example I-Conversion of Carbon and low alloy \nsteel elongation derived from 4d gauge length to a 5d gauge \nlength elongation value: \n23 % X 0.916 = 21 % \n12.2.2 Example 2-Conversion of Austenitic steel elonga­\ntion derived from 5d gauge length to a 4d gauge length \nelongation value: \n23 % X l.029 = 24 % \n12.3 Reduction of Area-Fit the ends of the fractured \nspecimen together and measure the mean diameter or the width \nand thickness at the smallest cross section to the same accuracy \nas the original dimensions. The difference between the area \nthus found and the area of the original cross section expressed \nas a percentage of the original area is the reduction of area. \nBEND TEST \n13. Description \n13.1 The bend test is one method for evaluating ductility, \nbut it cannot be considered as a quantitative means of predict­\ning service performance in all bending operations. The severity \nof the bend test is primarily a function of the angle of bend and \ninside diameter to which the specimen is bent, and of the cross \nsection of the specimen. These conditions are varied according \nto location and orientation of the test specimen and the \nchemical composition, tensile properties, hardness, type, and \nquality of the steel specified. Test Method E190, Test Methods \nE290, EN ISO 7438, EN 10232 (tube), ISO 7438, or ISO 8491 \n(tube) and JIS Z 2248 may be consulted for methods of \nperforming the test. \n13.2 Unless otherwise specified, it shall be pennissible to \nage bend test specimens. The time-temperature cycle employed \nmust be such that the effects of previous processing will not be \nmaterially changed. It may be accomplished by aging at room \ntemperature 24 to 48 h, or in shorter time at moderately \nelevated temperatures by boiling in water or by heating in oil \nor in an oven. \n13.3 Bend the test specimen at room temperature to an \ninside diameter, as designated by the applicable product \nspecifications, to the extent specified. The speed of bending is \nordinarily not an important factor. \nHARDNESS TEST \n14. General \n14.1 A hardness test is a means of determining resistance to \npenetration and is occasionally employed to obtain a quick \napproximation of tensile strength. Table 3, Table 4, Table 5, \nand Table 6 are for the conversion of hardness measurements \nfrom one scale to another or to approximate tensile strength. \n1545 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1599.json",
  "tabulaTablesCsv": "tables_tabula/page-1599.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1599.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5393,
  "bestTextAlphaRatio": 0.7458
}