{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 789,
  "globalPageIndex": 1587,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A•2025 SA·1016/SA-1016M \n25.8.6 More or smaller reference discontinuities, or both, \nmay be used by agreement between the purchaser and the \nmanufacturer. \n25.9 Standardization Procedure: \n25.9.1 The test apparatus shall be standardized at the \nbeginning and end of each series of tubes of the same specified \nsize (diameter and wall thickness), grade and heat treatment \ncondition, and at intervals not exceeding 4 h during the \nexamination of such tubing. More frequent standardizations \nmay be performed at the manufacturer's option or may be \nrequired upon agreement between the purchaser and the \nmanufacturer. \n25.9.2 The test apparatus shall also be standardized after \nany change in test system settings, change of operator, equip­\nment repair, or interruption due to power loss or shutdown. \n25.9.3 The reference standard shall be passed through the \ntest apparatus at the same speed and test system settings as the \ntube to be tested, except that, at the manufacturer's discretion, \nthe tubes may be tested at a higher sensitivity. \n25.9.4 The signal-to-noise ratio for the reference standard \nshall be 2.5 to 1 or greater, and the reference signal amplitude \nfor each discontinuity shall be at least 50 % of full scale of the \ndisplay. In establishing the noise level, extraneous signals from \nidentifiable surface imperfections on the reference standard \nmay be ignored. When reject filtering is used during UT \ntesting, linearity must be demonstrated. \n25.9.5 If, upon any standardization, the reference signal \namplitude has decreased by at least 29 % (3.0 dB), the test \napparatus shall be considered out of standardization. The test \nsystem settings may be changed, or the transducer(s), coil(s), \nor sensor(s) adjusted, and the unit restandardized, but all tubes \ntested since the last acceptable standardization must be re­\ntested. \n25.10 Evaluation of Impeifections: \n25.10.1 Tubing producing a test signal equal to or greater \nthan the lowest signal produced by the reference standard shall \nbe designated suspect, shall be clearly marked or identified, \nand shall be separated from the acceptable tubing. \n25.10.2 Such suspect tubing shall be subject to one of the \nfollowing three dispositions: \n25.10.2.1 The tubes shall be rejected without further \nexamination, at the discretion of the manufacturer. \n25.10.2.2 If the test signal was produced by imperfections \nsuch as scratches, surface roughness, dings, straightener marks, \nloose ID bead and cutting chips, steel die stamps, stop marks, \ntube reducer ripple, or chattered flash tJ.im, the tubing shall be \naccepted or rejected depending on visual observation of the \nseverity of the imperfection, the type of signal it produces on \nthe testing equipment used, or both. \n25.10.2.3 If the test signal was produced by imperfections \nthat cannot be identified, or was produced by cracks or \ncrack-like imperfections, the tubing shall be rejected. \n25.10.3 Any tubes with imperfections of the types in \n25.10.2.2 and 25.10.2.3, exceeding 0.004 in. [0.1 mm] or \n12.5 % of the specified minimum wall thickness (whichever is \ngreater) in depth shall be rejected. \n25.10.4 Rejected tubes may be reconditioned and retested \nproviding the wall thickness is not decreased to less than that \nrequired by this or the product specification. If grinding is \nperfo1med, the outside diameter in the area of grinding may be \nreduced by the amount so removed. To be accepted, recondi­\ntioned tubes must pass the nondestructive examination by \nwhich they were originally rejected. \n26. Hydrostatic Test \n26.1 In lieu of nondestructive electJ.ic examination, and \nwhen specified by the purchaser, and, except as provided in \n26.2 and 26.3, each tube shall be tested by the manufacturer to \na minimum hydrostatic test pressure determined by the follow­\ning equation: \nwhere: \nInch- Pound Units:P = 32000 t/D \nSI Units:P = 220.6 t/D \nP = hydrostatic test pressure, psi or MPa, \nt = specified wall thickness, in. or mm, and \nD = specified outside diameter, in. or mm. \n(3) \n26.1.1 The hydrostatic test pressure determined by Eq 3 \nshall be rounded to the nearest 50 psi [0.5 MPa] for pressure \nbelow 1000 psi [7 MPa], and to the nearest 100 psi [1 MPa] for \npressures 1000 psi [7 MPa] and above. The hydrostatic test \nmay be performed prior to cutting to final length, or prior to \nupsetting, swaging, expanding, bending or other forming \noperations, or both. \n26.2 Regardless of the determination made by Eq 3, the \nminimum hydrostatic test pressure required to satisfy these \nrequirements need not exceed 1000 psi [7 MPa]. This does not \nprohibit testing at higher pressures at manufacturer's option or \nas provided in 26.3. \n26.3 With concurrence of the manufacturer, a minimum \nhydrostatic test pressure in excess of the requirements of 26.2 \nor 26.1, or both, may be stated on the order. The tube wall \nstress shall be determined by the following equation: \nS = PD/2t (4) \nwhere: \nS = tube wall stress, psi or MPa, and all other symbols as \ndefined in 24.1. \n26.4 The test pressure shall be held for a minimum of 5 s. \n26.5 If any tube shows leaks during the hydrostatic test, it \nshall be rejected. \n26.6 The hydrostatic test may not be capable of testing the \nend portion of the pipe. The lengths of pipe that cannot be \ntested shall be determined by the manufacturer and, when \nspecified in the purchase order, reported to the purchaser. \n27. Pneumatic Test \n27.1 Air Undenvater Test-When this test is required, each \ntube, with internal surfac~ clean and dry, shall be internally \npressurized to 150 psi [1000 kPa] minimum with clean and dry \ncompressed air while being submerged in clear water. The tube \nshall be well lighted, preferably by underwater illumination. \nAny evidence of air leakage of the pneumatic couplings shall \nbe corrected prior to testing. Inspection shall be made of the \n1533 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1587.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5875,
  "bestTextAlphaRatio": 0.7469
}