{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 494,
  "globalPageIndex": 1292,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-748/SA-748M ASME BPVC.II.A-2025 \nStandard Specification for \nStatically Cast Chilled White Iron-Gray Iron Dual Metal Rolls \nfor Pressure Vessel Use \n1. Scope \n1.1 This specification covers statically cast dual metal rolls \nwith the outer layer of the roll body being chilled white iron of \ndifferent chemical composition than the core and joumals of \nthe roll which is gray cast iron. The castings are suitable for \npressure containing parts, the design strength of which is based \non the gray iron p011ion of the cylinder. The castings are \nsuitable for service at temperatures up to 450°F [232°C]. \n1.2 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.3 The following safety hazards statement pertains only to \nthe test method portion, 9, of this specification: This standard \ndoes not purport to address all of the safety concerns, if any, \nassociated with its use. It is the responsibility of the user of this \nstandard to establish appropriate safety and health practices \nand detennine the applicability of regulatory limitations prior \nto use. \n2. Referenced Documents \n2.1 ASTM Standards: \nA278/A278M Specification for Gray Iron Castings for \nPressure-Containing Parts for Temperatures Up to 650°F \n(350°C) \nA667/A667M Specification for Centrifugally Cast Dual \nMetal (Gray and White Cast Iron) Cylinders \n3. Ordering Information \n3.1 Orders for material under this specification shall include \nthe following information: \n3.1.1 ASTM designation and year of issue, \n3.1.2 Dimensions of dual rolls, \n3.1.3 Class of gray iron in the roll core (see 4.2), \n3.1.4 Inspection requirements, if different (see 10.1), \n3.1.5 Certification, if required (see 11.1), and \n3.1.6 Special position of marking information, if required \n(see 12.1). \n3.2 Any additional requirements not covered in this speci­\nfication are subject to agreement between the manufacturer and \npurchaser. \n4. Materials and Manufacture \n4.1 The melting procedure shall be optional with the \nfoundry. \n4.2 The chilled white iron exterior of the roll body shall be \nmade to a minimum hardness of 60 Scleroscope \"C\". The gray \niron portion of the roll shall conform to the applicable class of \nSpecification A278/A278M, as determined by design require­\nments. The scope of this specification shall include Nos. 20, 25, \n30, 35, 150,175,200, and 250 of Specification A278/A278M. \n4.3 The casting process shall be controlled to produce a \nmetallurgical bond between the chilled white iron exterior and \ngray iron interior of the roll body. \n5. Test Requirements \n5.1 Tensile Requirements-Tensile bars removed from a \nprolongation at one end of the roll journal, in accordance with \nSpecification A278/A278M, shall have a tensile strength not \nless than 80 % of that specified by the applicable class of \nSpecification A278/A278M. \n5.2 Thickness of Chilled White Iron: \n5.2.1 The thickness of the clear chilled white iron plus the \nmottled iron at the roll face shall not be more than 30 % of the \ntotal finished wall thickness. \n5.2.2 The thickness of the chilled white iron exterior of the \nroll body shall be determined by measuring the chill depth at \nthe ends of the roll face. \n6. Finish \n6.1 All surfaces shall be machined or ground, or both, prior \nto the rolls being placed into service. \n1218 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1292.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3543,
  "bestTextAlphaRatio": 0.7432
}