{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 663,
  "globalPageIndex": 1461,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-961/SA-961M \nfor Steel Products for Shipment \nA707/A707M Specification for Forged Carbon and Alloy \nSteel Flanges for Low-Temperature Service \nA 727 / A 727M Specification for Carbon Steel Forgings for \nPiping Components with Inherent Notch Toughness \nA751 Test Methods and Practices for Chemical Analysis of \nSteel Products \nA836/ A836M Specification for Titanium-Stabilized Carbon \nSteel Forgings for Glass-Lined Piping and Pressure Vessel \nService \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA967/A967M Specification for Chemical Passivation Treat­\nments for Stainless Steel Parts \nA991/A991M Test Method for Conducting Temperature \nUniformity Surveys of Furnaces Used to Heat Treat Steel \nProducts \nA1058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nB880 Specification for General Requirements for Chemical \nCheck Analysis Limits for Nickel, Nickel Alloys and \nCobalt Alloys \nE165/E165M Practice for Liquid Penetrant Testing for Gen­\neral Industry \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \nE709 Guide for Magnetic Particle Testing \nE1916 Guide for Identification of Mixed Lots of Metals \n2.2 ASME Standard: \nASME Boiler and Pressure Vessel Code-Section IX \n2.3 Manufacturer's Standardization Society Standard: \nSP 25 Standard Marking System of Valves, Fittings, Flanges \nand Unions \n3. Terminology \n3.1 Definitions-For definitions of other terms used in this \nspecification, refer to Terminology A941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.1 bar; n-a solid rolled or forged section that is long in \nrelationship to its cross sectional dimensions, with a relatively \nconstant cross section throughout its length and a wrought \nmicrostructure. \n3.2.2 certifying organization, n-the company or associa­\ntion responsible for the conformance of, the marking of, and \nthe certification of the product to the specification require­\nments. \n3.2.3 fitting, n-a component for non-bolted joints in piping \nsystems. \n3.2.4 flange, n-a component for bolted joints used in \npiping systems. \n3.2.5 forging, n-the product of a substantially compressive \nhot or cold plastic working operation that consolidates the \nmaterial and produces the required shape. \n3.2.5.1 Discussion-The plastic working must be performed \nby a forging machine, such as a hammer, press, or ring rolling \nmachine, and must deform the material to produce a wrought \nstructure throughout the material cross section. \n3.2.6 seamless tubing, n-a tubular product made without a \nwelded seam. \n3.2.6.1 Discussion-It is manufactured usually by hot work­\ning the material, and if necessary, by subsequently cold \nfinishing the hot worked tubular product to produce the desired \nshape, dimensions and properties. \n4. Ordering Information \n4.1 It is the purchaser's responsibility to specify in the \npurchase order all ordering information necessary to purchase \nthe needed material. Examples of such information include, but \nare not limited to, the following: \n4.1.1 Quantity, \n4.1.2 Size and pressure class or dimensions, (tolerances and \nsurface finishes should be included), \n4.1.3 Specification number with grade or class, or both, as \napplicable, and year/date, \n4.1.4 Choice of testing track from the options listed in Test \nMethods A1058 when material is ordered to an M suffix (SI \nunits) product standard. If the choice of test track is not \nspecified in the order, then the default ASTM track shall be \nused as noted in Test Methods Al058, \n4.1.5 Supplementary requirements, and \n4.1.6 Additional requirements. \nS. Melting Process \n5.1 Unless otherwise specified in the individual Product \nSpecification, the steel shall be fully killed. \n5.2 If a specific type of melting is required by the purchaser, \nit shall be stated on the purchase order. \n5.3 The primary melting may incorporate separate degas­\nsing or refining and may be followed by secondary melting, \nsuch as electroslag remelting or vacuum remelting. If second­\nary melting is employed, the heat shall be defined as all of the \ningot remelted from a single primary heat. \n5.4 Steel may be cast in ingots or may be strand cast. When \nsteel of different grades is sequentially strand cast, identifica­\ntion of the resultant transition material is required. The steel \nproducer shall remove the transition material by an established \nprocedure that positively separates the grades. \n5.5 A sufficient discard shall be made from the source \nmaterial to secure freedom from injurious porosity and \nshrinkage, and undue segregation. \n6. Manufacture \n6.1 The finished part shall be manufactured from a forging \nthat is as close as practicable to the finished size or shape. \nAlternative starting materials may be used, but with the \nfollowing exceptions and requirements. \n1403 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1461.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4839,
  "bestTextAlphaRatio": 0.7698
}