{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 265,
  "globalPageIndex": 265,
  "width": 597.72,
  "height": 842.88,
  "text": "ASME BPVC.ll.A-2025 SA-182/SA-182M {ASTM A182/A182M) \nA511/ A511M Specification for Seamless Stainless Steel Me­\nchanical Tubing and Hollow Bar \nA 739 Specification for Steel Bars, Alloy, Hot- Wrought, for \nElevated Temperature or Pressure-Containing Parts, or \nBoth \nA 763 Practices for Detecting Susceptibility to Intergranular \nAttack in Ferritic Stainless Steels \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nA923 Test Methods for Detecting Detrimental Intermetallic \nPhase in Duplex Austenitic/Ferritic Stainless Steels \nA961/A961M Specification for Common Requirements for \nSteel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \nA965/ A965M Specification for Steel Forgings, Austenitic, \nfor Pressure and High Temperature Parts \nA1049/A1049M Specification for Stainless Steel Forgings, \nFerritic/ Austenitic (Duplex), for Pressure Vessels and \nRelated Components \nA1084 Test Method for Detecting Detrimental Phases in \nLean Duplex Austenitic/Ferritic Stainless Steels \nE92 Test Methods for Vickers Hardness and Knoop Hard­\nness of Metallic Materials \nEl12 Test Methods for Determining Average Grain Size \nE165/El65M Practice for Liquid Penetrant Testing for Gen-\neral Industry \nE340 Practice for Macroetching Metals and Alloys \n2.3 ASME Standards . .4 \nB 16.11 Forged Steel Fittings, Socket Welding, and Threaded \n2.4 ASME Boiler and Pressure Vessel Code: 4 \nSection IX \n2.5 A WS Specifications 5 \nA5.4/A5.4M Specification for Stainless Steel Electrodes for \nShielded Metal Arc Welding \nA5.5/A5.5M Specification for Low-Alloy Steel Electrodes \nfor Shielded Metal Arc Welding \nA5.9/A5.9M Specification for Bare Stainless Steel Welding \nElectrodes and Rods \nA5.ll/A5.11M Specification for Nickel and Nickel-Alloy \nWelding Electrodes for Shielded Metal Arc Welding \nA5.14/A5.14M Specification for Nickel and Nickel-Alloy \nBare Welding Electrodes and Rods \nA5.23/A5.23M Specification for Low-Alloy Steel Elec­\ntrodes and Fluxes for Submerged Arc Welding \nA5.28/A5.28M Specification for Low-Alloy Steel Elec­\ntrodes for Gas Shielded Arc Welding \nA5.29/A5.29M Low-Alloy Steel Electrodes for Flux Cored \nArc Welding \n3. Terminology \n3.1 Definitions-For definitions of terms used in this \nspecification, refer to Specification A961/A961M. \n4 Available from American Society of Mechanical _Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n5 Available from American Welding Society (AWS), 550 NW LeJeune Rd., \nMiami, FL 33126, http://www.aws.org. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.l hardened condition, n-for F 23, the metallurgical \ncondition achieved after normalizing and cooling to room \ntemperature but prior to tempering. \n4. Ordering Information \n4.1 It is the purchaser's responsibility to specify in the \npurchase order information necessary to purchase the needed \nmaterial. In addition to the ordering information guidelines in \nSpecification A961/A961M, orders should include the follow­\ning information: \n4.1.1 Additional requirements (see 7.2.1, Table 2 footnotes, \n9.3, and 19.2), and \n4.1.2 Requirement, if any, that manufacturer shall submit \ndrawings for approval showing the shape of the rough forging \nbefore machining and the exact location of test specimen \nmaterial (see 9.3.1). \n5. General Requirements \n5 .1 Product furnished to this specification shall conform to \nthe requirements of Specification A961/A961M, including any \nsupplementary requirements that are indicated in the purchase \norder. Failure to comply with the general requirements of \nSpecification A961/A961M constitutes nonconformance with \nthis specification. In case of conflict between the requirements \nof this specification and Specification A961/A961M, this \nspecification shall prevail. \n6. Manufacture \n6.1 The low-alloy ferritic steels shall be made by the \nopen-hearth, electric-furnace, or basic-oxygen process with the \noption of separate degassing and refining processes in each \ncase. \n6.2 The stainless steels shall be melted by one of the \nfollowing processes: ( a) electric-furnace (with the option of \nseparate degassing and refining processes); (b) vacuum­\nfumace; or ( c) one of the former followed by vacuum or \nelectroslag-consumable remelting. Grade F XM-27Cb may be \nproduced by electron-beam melting. \n6.3 A sufficient discard shall be made to secure freedom \nfrom injurious piping and undue segregation. \n6.4 Except as permitted in 6.4.2 and 6.4.3, the material shall \nbe forged as close as practicable to the specified shape and size. \n6.4.1 Flanges, elbows, return bends, tees, and header tees \nshall not be machined directly from bar stock. Other parts \nwhose longitudinal axis is not parallel to the longitudinal axis \nof the hollow bar or forged or rolled bar shall not be machined \ndirectly from bar. \n6.4.2 Parts may be machined from hollow bar or forged or \nrolled solution-annealed austenitic stainless steel bar without \nadditional hot working provided the longitudinal axis of the \npart is parallel to the longitudinal axis of the bar. \n6.4.3 Low alloy, martensitic stainless, ferritic stainless, and \nferritic-austenitic stainless steel parts, NPS-4 [DN 100] and \nunder, may be machined from hollow bar or forged or rolled \nbar, without additional hot working provided the longitudinal \naxis of the part is parallel to the longitudinal axis of the bar. \n213 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0265.json",
  "tabulaTablesCsv": "tables_tabula/page-0265.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0265.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5419,
  "bestTextAlphaRatio": 0.7562
}