{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 510,
  "globalPageIndex": 510,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-312/SA-312M (ASTM A312/A312M) ASME BPVC.II.A-2025 \nTABLE 2 Annealing Requirements \nGrade or UNS DesignationA Heat Treating Coolingffesting \nTemperature 8 Requirements \nAll grades not individually listed 1900 \"F [1040 \"C] C \nbelow: \nTP321H, TP347H, TP348H \nCold finished 2000 \"F [1100 °C] D \nHot finished 1925 \"F [1050 \"C] D \nTP304H, TP316H \nCold finished 1900 \"F [1040 \"C] D \nHot finished 1900 \"F [1040 \"C] D \nTP309H, TP309HCb, TP310H, 1900 \"F [1040 \"C] D \nTP310HCb \nS30600 2010-2140 \"F D \n[1100-1170 \"C] \nS30601 2010-2140 \"F D \n[1100-1170 \"C] \nS30815, S31272 1920 \"F [1050 \"C] D \nS31035 2160-2280 \"F D \n[1180-1250 \"C] \nS31254, S32654 2100 \"F [1150 \"C] D \nS31266 2100 \"F [1150 \"C] D \nS31277 2050 \"F [1120 \"C] D \nS31727, S32053 1975-2155 \"F D \n[1080-1180 \"C] \nS33228 2050-2160 \"F D \n[1120-1180 \"C] \nS34565 2050-2140 \"F D \n[1120-1170 \"C] \nS34752 1940-2138 \"F D \n[1060-1170 \"C] \nS35315 2010 \"F [1100 \"C] D \nS38815 1950 \"F [1065 \"C] D \nN08367 2025 \"F [1110 \"C] D \nN08020 1700-1850 \"F D \n[925-1010 \"C] \nN08028 2000 \"F [1100 \"C] D \nN08029 2000 \"F [1100 \"C] D \nN08810 2050 \"F [1120 \"C] D \nN08811 2100 \"F [1150 \"C] D \nN08904 2000 \"F [1100 \"C] D \nN08925, N08926 2010-2100 \"F D \n[1100-1150 \"C] \nA New designation established in accordance with Practice E527 and SAE J1086. \n8 Minimum, unless otherwise stated. \nc Quenched in water or rapidly cooled by other means, at a rate sufficient to \nprevent re-precipitation of carbides, as demonstrable by the capability of pipes, \nheat treated by either separate solution annealing or by direct quenching, of \npassing Practices A262, Practice E. The manufacturer is not required to run the \ntest unless it is specified on the purchase order (see Supplementary Requirement \nS7). Note that Practices A262 requires the test to be performed on sensitized \nspecimens in the low-carbon and stabilized types and on specimens representa­\ntive of the as-shipped condition for other types. In the case of low-carbon types \ncontaining 3 % or more molybdenum, the applicability of the sensitizing treatment \nprior to testing shall be a matter for negotiation between the seller and the \npurchaser. \n0 Quenched in water or rapidly cooled by other means. \nwall thickness ( or schedule) of the same heat, hot formed and \nquenched in the same production run. \n11.1.2 Where the final heat treated condition is obtained, \nconsistent with the requirements of 6.2, in a batch-type furnace \nequipped with recording pyrometers and automatically con­\ntrolled within a 50 °F [30 °C] or lesser range, the term lot shall \napply to all pipes of the same specified outside diameter and \nspecified wall thickness (or schedule), of the same heat, \nsubjected to the same finishing temperature within the same \nproduction run. \n11.1.3 Where the final heat treated condition is obtained, \nconsistent with the requirements of 6.2, in a batch-type furnace \nnot equipped with recording pyrometers and automatically \nTABLE 3 Permitted Variations in Wall Thickness \nTolerance, % from Nominal \nNPS Designator Over Under \n1/a to 2½ incl., all t/D 20.0 12.5 ratios \n3 to 18 incl., t/D up to 22.5 12.5 5% incl. \n3 to 18 incl., t/D > 5 % 15.0 12.5 \n20 and larger, welded, 17.5 12.5 all t/D ratios \n20 and larger, \nseamless, t/D up to 22.5 12.5 \n5% incl. \n20 and larger, 15.0 12.5 seamless, t/D > 5 % \nwhere: \nt Nominal Wall Thickness \nD = Ordered Outside Diameter \ncontrolled within a 50 °F [30 °C] or lesser range, the term lot \nshall apply to the larger of: (a) each 200 ft [60 m] or fraction \nthereof and (b) those pipes heat treated in the same furnace \nbatch charge for pipes of the same specified outside diameter \nand specified wall thickness ( or schedule) that are produced \nfrom the same heat of steel and are subjected to the same \nfinishing temperature within the same production run. \n458 \n11.2 Transverse or Longitudinal Tension Test-One tension \ntest shall be made on a specimen for lots of not more than 100 \npipes. Tension tests shall be made on specimens from two tubes \nfor lots of more than 100 pipes. \n11.3 Flattening Test-For material heat treated in a continu­\nous furnace, by quenching after hot forming or in a batch-type \nfurnace equipped with recording pyrometers and automatically \ncontrolled within a 50 °F [30 °C] or lesser range, flattening \ntests shall be made on a sufficient number of pipe to constitute \n5 % of the lot, but in no case less than 2 lengths of pipe. For \nmaterial heat treated in a batch-type furnace not equipped with \nrecording pyrometers and automatically controlled within a 50 \n°F [30 °C] or lesser range, flattening tests shall be made on 5 % \nof the pipe from each heat treated lot. \n11.3.1 For welded pipe a transverse-guided face bend test of \nthe weld may be conducted instead of a flattening test in \naccordance with the method outlined in the steel tubular \nproduct supplement of Test Methods and Definitions A370. For \nwelded pipe with a specified wall thickness over 3/s in., two \nside bend tests may be made instead of the face bend test. The \nductility of the weld shall be considered acceptable when there \nis no evidence of cracks in the weld or between the weld and \nthe base metal after bending. Test specimens from 5 % of the \nlot shall be taken from the pipe or test plates of the same \nmaterial as the pipe, the test plates being attached to the end of \nthe cylinder and welded as a prolongation of the pipe longitu­\ndinal seam. \n11.4 Grain Size-Grain size determinations, in accordance \nwith Test Methods E112, shall be made on the grades listed in \nTable 5. Grain size determinations shall be made on each heat \ntreatment lot, as defined in 11.1, for the same number of pipes \nas prescribed for the flattening test in 11.3. The grain size \nresults shall conform to the requirements prescribed in Table 5. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0510.json",
  "tabulaTablesCsv": "tables_tabula/page-0510.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0510.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5771,
  "bestTextAlphaRatio": 0.6522
}