{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 881,
  "globalPageIndex": 1679,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 \nMANDATORY APPENDIX IV (2s) \nGUIDELINES ON THE APPROVAL OF NEW MATERIALS UNDER \nTHE ASME BOILER AND PRESSURE VESSEL CODE \nIV-100 CODE POLICY \nIt is expected that requests for Code approval will nor­\nmally be for materials for which there is a recognized na­\ntional or international specification. It is the policy of the \nASME Boiler and Pressure Vessel (BPV) Committee on \nMaterials to approve, for inclusion in the Code Sections, \nonly materials covered by specifications that have been \nissued by standards-developing organizations such as, \nbut not limited to, American Petroleum Institute (API), \nAmerican Society for Testing and Materials (ASTM), \nAmerican Welding Society (AWS), Canadian Standards \nAssociation (CSA), European Committee for Standardiza­\ntion (CEN), Japan Industrial Standards (JIS), Standards As­\nsociation of Australia (SAA), and China Standardization \nCommittee (CSC). \nMaterial specifications issued by other than national or \ninternational standards-developing organizations will not \nbe considered for approval. Examples for such material \nspecifications are those issued by organizations perform­\ning conformity assessment activities and those issued by \nmaterial producers/suppliers or by equipment manufac­\nturers. The Committee will consider only official requests \nfor specifications authorized by the originating standardi­\nzation body and available in the English language and in \nU.S. Customary and/or SI/Metric units. \nFor materials made to a recognized national or interna­\ntional specification other than that of ASTM or AWS, the \ninquirer shall give notice to the standards-developing or­\nganization that a request has been made to ASME for ap­\nproval of the specification under the ASME Code and \nshould request that the issuing organization grant ASME \npermission to at least reproduce copies of the specifica­\ntion for Code Committee internal use and, if possible, re­\nprint the specification. For other materials, a request shall \nbe made to ASTM, AWS, or a recognized national or inter­\nnational standardization body to include the material in a \nspecification that can be presented to the BPV Committee \non Materials. \nIt is the policy of the ASME BPV Committee on Materials \nto consider requests to approve new materials only from \nboiler, pressure vessel, transport tank, nuclear facility \ncomponent manufacturers, architect-engineers, or end \nusers. Such requests should be for wrought, cast, or hot \nisostatically pressed powder materials for which there \nis a reasonable expectation of use in a boiler, pressure \nvessel, transport tank, or nuclear facility component \nconstructed to the rules of one of the Sections of this \nCode. When a grade does exist in a defined wrought pro­\nduct form, a material producer/supplier may request the \ninclusion of additional wrought product forms or, pro­\nvided all of the requirements of Table IV-100-1 of this \nAppendix are met, the inclusion of hot isostatically \npressed (HIP) powder metallurgy components of this \ngrade. When a grade does exist in a defined cast product \nform, a material producer/supplier may request the in­\nclusion of additional cast product forms. \nAny qualified organization requesting that an ASME \nBPV Committee approve a \"new\" material for use in their \nCode book should be aware that only the BPV Committee \non Materials provides the appropriate design values for \nthe Construction Codes (Sections I, III, IV, VIII, and XII \nof the BPV Code and B31 Codes). \nThe design values are calculated in accordance with the \nappropriate mandatory Code rules. If the inquirer consid­\ners the material to be essentially identical to one that has \nbeen approved by the BPV Committee on Materials, the \ninquirer shall so state in its request, and the BPV Commit­\ntee on Materials shall evaluate that judgment. If the mate­\nrial is not essentially identical to one that has been \napproved by the BPV Committee on Materials, the in­\nquirer shall provide all of the data cited in these Guide­\nlines. Based on those data, the BPV Committee on \nMaterials will provide the appropriate design values. \nBefore approval of a new material for inclusion in one \nof the Sections of the Code, use of this material may be \npermitted in the form of a Code Case. This Case shall fix \nat least the conditions of use and the necessary require­\nments linked to these conditions. It is the policy of the \nASME BPV Committee to admit, in this way, material for \nwhich full experience on all working parameters has not \nyet been acquired. If the new material is not made to a re­\ncognized national or international specification, a Code \nCase can be issued only when a request is submitted to \na recognized standardization body to include the material \nin their specification. \nIV-200 APPLICATION \nThe inquirer shall identify to the BPV Committee the \nfollowing: \n( a) the Section or Sections and Divisions of the Code in \nwhich the new material is to be approved \n1625 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1679.json",
  "tabulaTablesCsv": "tables_tabula/page-1679.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1679.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4974,
  "bestTextAlphaRatio": 0.799
}