{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 787,
  "globalPageIndex": 1585,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-1016/SA-1016M \nto the percentages specified in Table 5 without cracking or \nshowing imperfections rejectable under the provisions of the \nproduct specification. \n23. Flange Test \n23.1 A section of tube shall be capable of having a flange \nturned over at a right angle to the body of the tube without \ncracking or showing imperfections rejectable under the provi­\nsions of the product specification. The width of the flange for \ncarbon and alloy steels shall be not less than the percentages \nspecified in Table 6. For the austenitic grades, the width of the \nflange for all sizes listed in Table 6 shall be not less than 15 %. \n24. Hardness Test \n24.1 For tubes with wall thickness 0.200 in. [5.1 mm] or \nover, either the Brinell or Rockwell hardness test shall be used. \nWhen Brinell hardness testing is used, a 10-mm ball with 3000, \n1500, or 500-kg load, or a 5-mm ball with 750-kg load shall be \nused, at the option of the manufacturer. \n24.2 For tubes with wall thickness 0.065 in. [1.7 mm] or \nover but less than 0.200 in. [5.1 mm], the Rockwell hardness \ntest shall be used. \n24.3 For tubes with wall thickness less than 0.065 in. [1.7 \nmm], the hardness test shall not be required. \n24.4 The Brinell hardness test shall, at the option of the \nmanufacturer, be made on the outside of the tube near the end, \non the outside of a specimen cut from the tube, or on the wall \ncross section of a specimen cut from the tube. This test shall be \nmade so that the distance from the center of the impression to \nthe edge of the specimen is at least 2.5 times the diameter of \nthe impression. \n24.5 The Rockwell hardness test shall, at the option of the \nmanufacturer, be made on the inside surface, on the wall cross \nsection, or on a flat on. the outside surface. \n24.6 For tubes furnished with upset, swaged, or otherwise \nformed ends, the hardness test shall be made as prescribed in \n24.1 and 24.2 on the outside of the tube near the end after the \nforming operation and heat treatment. \n24.7 For welded or brazed tubes, the hardness test shall be \nmade away from the joints. \nTABLE 5 Flaring Test Requirements \nRatio of Inside \nDiameter to Specified \nOutside Diameter' \n0.9 \n0.8 \n0.7 \n0.6 \n0.5 \n0.4 \n0.3 \nMinimum Expansion of Inside Diameter, % \nCarbon-Molybdenum \nand Austenitic Steels \n21 \n22 \n25 \n30 \n39 \n51 \n68 \nOther Ferritic \nAlloy Steels and \nOther Stainless Steels \n15 \n17 \n19 \n23 \n28 \n38 \n50 \nA In determining the ratio of inside diameter to specified outside diameter, the \ninside diameter shall be defined as the actual mean inside diameter of the material \ntested. \nTABLE 6 Flange Requirements \nSpecified Outside Diameter \nof Tube, in. [mm] Width of Flange \nTo 2½ [63.5], incl 15 % of Specified Outside Diameter \nOver 2½ to 3¾ [63.5 to 95.2], incl 12½ % of Specified Outside Diameter \nOver 3¾ to 8 [95.2 to 203.2], incl 10 % of Specified Outside Diameter \n24.8 When the product specification provides for Vickers \nhardness, such testing shall be in accordance with Test Method \nB92. \n25. Nondestructive Examination \n25.1 Except as provided in 26.1, each tube shall be exam­\nined by a nondestructive examination method in accordance \nwith Practice B213, Practice E309 (for ferromagnetic \nmaterials), Practice B426 (for non-magnetic materials), or \nPractice E570. Upon agreement, Practice E273 shall be em­\nployed in addition to one of the full periphery tests. The range \nof tube sizes that may be examined by each method shall be \nsubject to the limitations in the scope of that practice. In case \nof conflict between these methods and practices and this \nspecification, the requirements of this specification shall pre­\nvail. \n25.2 The following information is for the benefit of the user \nof this specification. \n25.2.1 Calibration standards for the nondestructive electric \ntest are convenient standards for calibration of nondestructive \ntesting equipment only. For several reasons, including shape, \norientation, width, and so forth, the correlation between the \nsignal produced in the electric test from an imperfection and \nfrom calibration standards is only approximate. A purchaser \ninterested in ascertaining the nature (type, size, location, and \norientation) of discontinuities that can be detected in the \nspecific application of these examinations should discuss this \nwith the manufacturer of the tubular product. \n25.2.2 The ultrasonic examination referred to in this speci­\nfication is intended to detect longitudinal discontinuities having \na reflective area similar to or larger than the calibration \nreference notches specified in 25.8. Th.e examination may not \ndetect circumferentially oriented imperfections or short, deep . \ndefects. \n25.2.3 The eddy current examination referenced in this \nspecification has the capability of detecting significant \ndiscontinuities, especially of the short abrupt type. Practices \nB309 and E426 contain additional information regarding the \ncapabilities and limitations of eddy-current examination. \n25.2.4 The flux leakage examination referred to in this \nspecification is capable of detecting the presence and location \nof significant longitudinally or transversely oriented disconti­\nnuities. The provisions of this specification only provide for \nlongitudinal calibration for flux leakage. It should be recog­\nnized that different techniques should be employed to detect \ndifferently oriented imperfections. \n25.2.5 The hydrostatic test referred to in Section 26 is a test \nmethod provided for in many product specifications. This test \nhas the capability of finding defects of a size permitting the test \nfluid to leak through the tube wall and may be either visually \nseen or detected by a loss of pressure. This test may not detect \n1531 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1585.json",
  "tabulaTablesCsv": "tables_tabula/page-1585.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-1585.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5741,
  "bestTextAlphaRatio": 0.7467
}