{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 126,
  "globalPageIndex": 924,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-484/SA-484M ASME BPVC.II.A-2025 \nNom I-Camber or bow tolerances shall not exceed 0.025 in. \n[0.60 mm] x length in ft [m/3]. \nCamber tolerances for hot finished or extruded shapes camber (or bow) \nis the greatest deviation of a side from a straight line. Measurement is \ntaken on the concave side of the shapes with a straight edge. \nFIG. 1 Camber or Bow Tolerances \nNoTE I-Allowable deviation from flat is max 0.010 in. [0.25 mm] per \nl in. [25 mm] of width. Maximum deviation on dimensions of less than \n1 in. [25 mm] is 0.010 in. [0.250 mm]. \nThe transverse flatness tolerance is the maximum deviation from a \nreference base across any cross-section flat surface. \nFIG. 2 Transverse Flatness Tolerances \n14.1.2 Tension Tests-Test Methods and Definitions A370. \n14.1.3 Stress Rupture-Test Methods E139. \n14.1.4 Brinell Hardness-Test Methods and Definitions \nA370. \n14.1.5 Rockwell Hardness-Test Methods and Definitions \nA370. \n14.1.6 lntergranular Corrosion-Practice E of Practices \nA262. \n14.1.7 Grain Size-Test Methods E112. \n14.1.8 Charpy V-notch Impact Test-Test Methods and \nDefinitions A370. \n15. Inspection \n15.1 Civilian Procurement-Inspection of the material shall \nbe as agreed upon between the purchaser and the supplier as \npart of the purchase contract. \n15.2 Government Procurement-Unless otherwise specified \nin the contract or purchase order, the seller is responsible for \nthe performance of all inspection and test requirements in this \nspecification, the seller is permitted to use their own facilities \nor other suitable facilities for the performance of the inspection \nand testing, and the purchaser shall have the right to perform \nany of the inspection and tests set forth in this specification. \nThe manufacturer shall afford the purchaser's inspector all \nreasonable facilities necessary to satisfy purchaser that the \nmaterial is being furnished in accordance with the specifica­\ntion. Inspection by the purchaser shall not interfere unneces­\nsarily with the manufacturer. \n16. Rejection and Rehearing \n16.1 The purchaser is permitted to reject material that fails \nto conform to the requirements of this specification. Rejection \nshall be reported to the producer or supplier promptly, prefer-\nably in writing. In case of dissatisfaction with the results of a \ntest, the producer or supplier is permitted to make claim for a \nrehearing. \n17. Certification \n17 .1 A report of the results of all tests required by the \nproduct specification shall be supplied to the purchaser. This \nmaterial test report shall reference the product specification \ndesignation and year date indicating that the material was \nmanufactured, sampled, tested, and inspected in accordance \nwith requirements of the product specification and has been \nfound to meet those requirements. The material test report shall \nreport the melting process when the purchase order requires \neither a specific type of melting or requires that the melting \nprocess used is to be reported. \n17 .1.1 The report shall indicate the type of steel. If certify­\ning that the material conforms to the requirements for more \nthan one type of steel, the manufacturer may indicate each type \nof steel on the report, or may issue a separate report for each \ntype of steel. \n17 .2 A signature is not required on the report. However, the \ndocument shall clearly identify the organization submitting the \nreport. Not withstanding the absence of a signature, the \norganization submitting the document is responsible for its \ncontent. \n17.3 A document printed from or used in electronic form \nfrom an electronic data interchange (EDI) transmission shall be \nregarded as having the same validity as a counterpart printed in \nthe certifier's facility. The content of the EDI transmitted \ndocument shall meet the requirements of the invoked ASTM \nstandard(s) and conform to any existing EDI agreement be­\ntween the purchaser and the supplier. Not withstanding the \nabsence of a signature, the organization submitting the EDI \ntransmission is responsible for the content of the report. \nNoTE 3-The industry definition of EDI invoked herein is the \ncomputer-to-computer exchange of business information in a standard \nformat such as ANSI ASC X12. \n824 \n17.4 When finished material is supplied to a purchase order \nspecifying the product specification, the organization supply­\ning that material shall provide the purchaser with a copy of the \noriginal manufacturer's test report. \n17.4.1 When the original manufacturer's test report was \nprovided by EDI to the organization supplying the finished \nmaterial to the purchaser, the organization supplying the \nfinished material shall provide to the purchaser a printed form \nof the original test report or shall retransmit the test report by \nEDI to the purchaser. In either case, the test report shall be \ncomplete with the full identification of the original manufac­\nturer and with all data provided on the test report of the original \nmanufacturer. \n18. Product Marking \n18.1 Civilian Procurement: \n18.1.1 Bars and shapes shall be marked or tagged with the \nname of manufacturer, purchaser's name and order number, \nASTM specification designation, heat number, grade or type, \ncondition, finish, and where appropriate, the size, length, and \nweight. Uruess otherwise specified, the method of marking is at \n~· ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0924.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5331,
  "bestTextAlphaRatio": 0.7734
}