{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 702,
  "globalPageIndex": 1500,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-985/SA-985M ASME BPVC.II.A-2025 \nExtent of examination methods of testing and basis for \nacceptance shall be agreed upon between the manufacturer \nand purchaser. \nS7 .2 Ultrasonic examination of casting of carbon and \nlow-alloy steels shall be performed after at least one heat \ntreatment above the transformation temperature range but \nneed not be repeated after subsequent heat treatment. \nS7 .3 Personnel performing the examination shall be \nqualified in accordance with an acceptable written practice. \nS8. Charpy Impact Test \nS8.1 Charpy impact test properties shall be determined \non each master heat from a set of three Charpy V-notch \nspecimens made from a test coupon in accordance with \nTest Methods and Definitions A 370, and tested at a test \ntemperature agreed upon by the manufacturer and pur­\nchaser. The sampling requirements shall be agreed upon \nbetween the manufacturer and purchaser (see 4.4). The \nacceptance requirements shall be energy absorbed, lateral \nexpansion, percent shear area or any combination thereof, \nand shall be agreed upon by the manufacturer and pur­\nchaser. Test specimens shall be prepared as Type A and \ntested in accordance with Test Methods and Definitions \nA370. \nS8.2 Absorbed Energy-Average energy value of three \nspecimens shall not be less than specified, with not more \nthan one value permitted to fall below the minimum speci­\nfied and no value permitted below the minimum specified \nfor a single specimen. \nS8.3 Lateral Expansion - Lateral expansion value shall \nbe agreed upon by the manufacturer and purchaser. \nS8.4 Percent Shear Area - Percent shear area shall be \nagreed upon by the manufacturer and purchaser. \nS9. Drop Weight Tests \nS9.1 Drop weight test properties shall be determined \nfrom each heat by preparing and testing either Type Pl, \nP2, or P3 specimens in accordance with Test Methods \nE 208. The crack starter weld shall be deposited on the \nsurface of the specimen that was nearest to the casting \nsurf ace. Each test shall consist of at least two specimens \ntested at a temperature agreed upon by the manufacturer \nand purchaser. Each specimen shall exhibit \"no break\" \nperformance. \nS10. Examination of Weld Preparation \nS10.1 Magnetic particle or liquid penetrant examina­\ntion of cavities prepared for welding shall be performed \nto verify removal of those discontinuities found unaccept­\nable by the inspection method specified for the casting. The \nmethod of performing magnetic particle or liquid penetrant \nexamination shall be in accordance with either Guide E 709 \nor Test Method E 165. Unless other degrees of shrinkage \nor types of discontinuities found in the cavities are speci­\nfied, Type II, Internal Shrinkage of Reference Photographs \nE 125, of Degree 2 in sections up to 2 in. [50 mm] thick, \nand of Degree 3 in sections over 2 in. [50 mm] thick shall \nbe acceptable. \nS11. Prior Approval of Major Weld Repairs \nS11.1 Major weld repairs shall be subject to the prior \napproval of the purchaser. \nS12. Hardness Test \nS12.1 A hardness test shall be made in accordance with \nTest Methods and Definitions A 370. The test location and \nthe hardness requirements shall be agreed upon between \nthe manufacturer and the purchaser. \nS14. Tension Test From Each Heat and Heat \nTreatment Charge \nS14.1 One tension test shall be made for each master \nheat and heat-treatment charge combination. \nS15. Quench and Temper Heat Treatment \nS15.1 The castings shall be quenched and tempered. \nCastings so treated shall be marked QT. \nS17. Tension Test From Castings \nS17 .1 In addition to the tensile test required in \nSection 6, test material shall be cut from heat treated cast­\nings. The mechanical properties and location for the test \nmaterial shall be agreed upon by the manufacturer and \npurchaser. \nS20. Weld Repair Charts \nS20.1 Weld repairs made to correct leakage on hydro­\nstatic testing, weld repairs for which the depth of the cavity \nrequired for welding exceeds 20% of the actual wall thick­\nness or 1 in. [25 mm], whichever is smaller, or weld repairs \nfor which the area of the cavity required for welding \nexceeds approximately 10 in.2 [65 mm 2 ] shall be docu­\nmented. \nS20.2 Weld repairs requiring documentation shall be \ndocumented on sketches or photographs, or both. The \nsketches or photographs shall show the location and major \ndimensions of cavities prepared for weld repair. The weld \nrepair documentation shall be submitted to the purchaser \nat the completion of the order. \n1444 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1500.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4487,
  "bestTextAlphaRatio": 0.7731
}