{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 869,
  "globalPageIndex": 1667,
  "width": 615.48,
  "height": 794.4,
  "text": "'~ \nASME BPVC.II.A-2025 \nTable 11-200-1 \nFerrous Material Specifications Acceptable for BPVC Construction {Including Acceptable ASTM \nEditions) (Cont'd) \nLatest \nASME Material Adopted All Acceptable Editions \nSpecification [Note (1)] Description [Note (2)] [Note (3)], [Note ( 4)] \nSA-209/SA-209M 03(2017) Identical 88 through 03(2017) \nSA-210/SA-210M 19 Identical 96 through 19 \nSA-213/SA-213M 23 Identical except for the additional H Grade heat treatment requirements in 10 through 23 \npara. 6.2 and Supplementary Requirement SS made mandatory. For Grade \nT91 Type 1, other acceptable editions are limited to 18 and later. For Grade \nT91 Type 2, the acceptable edition is limited to 23 with Supplementary \nRequirement S5 made mandatory. For UNS S31035 and UNS K91060, other \nacceptable editions are limited to 18b and later. For UNS S31050, other \nacceptable ASTM editions are limited to 15a and later. For UNS S31002, \nother ASTM editions are limited to 22 and later. \nSA-214/SA-214M 19 Identical 88 through 19 \nSA-216/SA-216M 21 Identical except for addition of 2.3 and editorial differences in 2.1 and 10.1 12 through 21 \nSA-217 /SA-217M 22 Identical except for addition of 2.3 and editorial differences in 2.1 and 9.1. 12 through 22 \nSA-225/SA-225M 17 Identical 86 through 17 \nSA-231/SA-231M 96 Identical except that certification requirements in 13.1 are mandatory \nSA-232/SA-232M 91 Identical \nSA-234/SA-234M 23a Identical, except for editorial correction of Supplementary Requirement S5. For 82a through 23a \nGrade WP91, other acceptable ASTM editions are limited to 18 and later. For \nwelded and filler metal products ordered to Section III or Section VIII, \nDivision 1, Supplementary Requirement S4 is mandatory. For Grade WP91 \nType 2, Supplementary Requirement S5 is mandatory. \nSA-240/SA-240M 17 Identical except for UNS S31050, other acceptable ASTM editions are limited to 88c through 17 \n04 and later. For UNS S32906, other acceptable ASTM editions are limited to \n07e1 and later. For UNS S38815, other acceptable ASTM editions are limited \nto 16 and later. For UNS S32101, other acceptable ASTM editions are limited \nto -OS and later. \nSA-249/SA-249M 18a Identical except for the deletion of S5, which allows lower mechanical 88b through 18a \nproperties, and for Section I only, S9 is mandatory when 100% joint \nefficiency is required. For UNS S31040, other acceptable ASTM editions are \nlimited to 10a and later. For UNS S31254, other acceptable ASTM editions \nare limited to 01 and later. \nSA-250/SA-250M 05(2014) Identical except that Supplementary Requirement Sl is mandatory when 100% 88a through 05(2014) \nweld joint efficiency is required. \nSA-263 12(2019) Identical. In cases where cladding is used in the design strength calculations 88 through 12(2019) \nand welding is used to join multiple alloy cladding plates, ASTM editions \nprior to 12 are not acceptable unless welding was performed by an ASME \nCertificate Holder. \nSA-264 12(2019) Identical. In cases where cladding is used in the design strength calculations 88 through 12(2019) \nand welding is used to join multiple alloy cladding plates, ASTM editions \nprior to 12 are not acceptable unless welding was performed by an ASME \nCertificate Holder. \nSA-265 12(2019) Identical. In cases where cladding is used in the design strength calculations 88 through 12(2019) \nand welding is used to join multiple alloy cladding plates, ASTM editions \nprior to 12 are not acceptable unless welding was performed by an ASME \nCertificate Holder. \nSA-266/SA-266M 21 Identical. ASTM editions 03 through 11 are acceptable provided the term 99 through 21 \n\"hubbed flanges\" is replaced with \"hubbed flat heads\" in oara. 3.4. \n1613 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1667.json",
  "tabulaTablesCsv": "tables_tabula/page-1667.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1667.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3697,
  "bestTextAlphaRatio": 0.6897
}