{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 140,
  "globalPageIndex": 938,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-508/SA-S0BM ASME BPVC.II.A-2025 \nand 3, the austenitizing temperature shall be 1540 °F [840 °C] \nmin to 1640 °F [895 °C] max. Quenching shall be followed by \ntempering at a subcritical temperature and holding at this \ntemperature for a minimum time of one-half hour per inch of \nmaximum section thickness. Except when Supplementary Re­\nquirement S 13 is specified for Grades 2 and 3, the minimum \ntempering temperatures shall be as follows: \nGrades 1, 1A, 2 Class 2, and 3 Class 2 \nGrades 2 Class 1 and 3 Class 1 \nGrades 4N Classes 1 and 2, and 5 \nClasses 1 and 2 \n1150 °F [620 °C] \n1200 °F [650 °C] \n1100 'F [595 °C] \nGrade 4N Class 3 1125 °F [605 °C] \nGrades av and 3VCb 1250 °F [675 °C] \nGrade 22, Class 3 1200 °F [650 °C] \nGrade 22, Classes 4, 5, 6, and 7 1100 °F [593 °C] \nSpecific cooling rates from the tempering temperature shall \nbe applied if Supplementary Requirement S 14 is specified. \n5.3 For Grades 1, lA, 2, 2A, 3, or 3A, a multiple stage \naustenitizing procedure may be used whereby the forging is \nfirst fully austenitized and liquid quenched, followed by \nreheating within the intercritical temperature range to partially \nreaustenitize and again liquid quenched. On completion of the \naustenitizing/quenching cycles, the forgings shall be tempered \nat a subcritical temperature as described in 5.2.2. \n6. Chemical Composition \n6.1 Heat Analysis-The heat analysis obtained from sam­\npling in accordance with Specification A788/A788M shall \ncomply with Table 1 except that the additional features of \nSupplementary Requirements S7, S8, S9, and SU shall also \napply as individually specified in the ordering information. \n6.2 Product Analysis-The manufacturer shall use the prod­\nuct analysis provision of Specification A788/A788M to obtain \na product analysis from a forging representing each heat or \nmultiple heat. The permissible variations provided in the table \non Permissible Variations in Product Analysis for Killed Steel \nin Specification A788/A788M apply for manganese, nickel, \nchromium, molybdenum, and vanadium only. Boron is not \nsubject to product analysis. The purchaser may also make this \ndetermination in accordance with Specification A788/A788M. \n7. Mechanical Properties \n7.1 Tension Test: \n7 .1.1 The steel shall conform to the requirements of Table 2. \n7 .1.2 The location and number of tension test specimens for \neach forging or multiple forging shall be as follows: \n7.1.2.1 Individual Forgings with Weights Not Exceeding \n1000 lb [455 kg] or Multiple Forgings Separated into Identical \nIndividual Forgings with Weights not Exceeding 1000 lb [455 \nkg] Prior to Quenching and Tempering Treatment-At least \none individual forging from each heat and each heat-treating \nlot shall be tested using the test specimen locations of 7 .1.5 or \n7.1.6 as specified on the purchase orders, except that test \nspecimens located at midlength may be closer to the ends of the \nproduction forging than the specified distance to the second \nsurfaces. All forgings shall be quenched and tempered in the \nsame furnace charge. All forgings from the multiple shall be \nBrinell hardness tested after heat treatment and forgings not \ntested for mechanical properties shall have a Brinell Hardness \nwithin 20 points of the Brinell Hardness of the forging that has \nbeen tested for mechanical properties. \n7.1.2.2 Forgings or Multiple Forgings (Note 3) with Weight \nat Time of Heat Treatment Not Exceeding 10 000 lb [4540 kg] \nand Having a Heat-Treated Length (Exclusive of Test Prolon­\ngation) of 80 in. [2032 mm] or Less-A test prolongation (Note \n4) shall be located at one end. One tension test specimen shall \nbe taken from the test prolongation. \n7.1.2.3 Forgings or Multiple Forgings with Weight at Time \nof Heat Treatment Not Exceeding 10 000 lb [4540 kg] and \nHaving a Heat-Treated Length (Exclusive of Test Prolonga­\ntions) Exceeding 80 in. [2032 mm]-A test prolongation shall \nbe located at each end. One tension test specimen shall be \ntaken from each test prolongation. An orientation of 180° shall \nbe established between the two tension test specimens. \n7.1.2.4 Forgings or Multiple Forgings with Weight at Time \nof Heat Treatment Over 10 000 lb [4540 kg] and Having a \nHeat-Treated Length (Exclusive of Test Prolongation) of 80 in. \n[2032 mm] or Less-A test prolongation shall be located atone \nend. Two tension test specimens shall be taken from the test \nprolongation and shall be oriented 180° apart. \n7.1.2.5 Forgings or Multiple Forgings with Weight at Time \nof Heat Treatment Over 10 000 lb [4540 kg] and Having a \nHeat-Treated Length (Exclusive of Test Prolongations) Exceed­\ning 80 in. [2032 mm]-A test prolongation shall be located at \neach end. The tension test specimens oriented 180° apart from \neach other shall be taken from each test prolongation. The two \ntension specimens located in one test prolongation shall be \noriented 90° in relation to the two tension specimens located in \nthe other test prolongation. \nNoTE 3-Multiple forgings in 7.1.2.2 through 7.1.2.5 are those which \nwill be separated after the quench and temper treatment. \nNOTE 4--A test prolongation is defined as that integral test metal \nlocated at an end of the forging or forging multiples. \n838 \n7 .1.3 Samples for mechanical test specimen shall be re­\nmoved from forgings after the quenching and tempering heat \ntreatment. The sample material shall be subjected to a simu­\nlated post weld heat treatment if Supplementary Requirement \nS 1 is specified. \n7 .1.4 For upset disk forgings, the longitudinal axis of the \ntest specimens shall be in the tangential direction. For all other \nparts, the longitudinal axis of the specimens shall be parallel to \nthe direction of major working of the forging. \n7.1.5 Each forging shall be manufactured in accordance \nwith a purchaser-approved drawing, showing the prequenched \ndimensions, the finished dimensions, the surfaces that will be \nsubjected to critical stresses, and the location of mechanical \ntest specimens. \n7.1.6 The tension test specimens shall be positioned so that \nthe longitudinal axis and mid-length is in accordance with one \nof the following methods: \n7.1.6.1 Method 1-t by 2t, where tis the distance from the \narea of significant loading (see 4.1) to the nearest quenched \nsurface. Specimens shall be removed at least 2t from the \nnearest second surface. However, they shall not be nearer to \none quenched surface than ¾ in. [20 mm] and to the second \nquenched surface than 1 ½ in. [40 mm]. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0938.json",
  "tabulaTablesCsv": "tables_tabula/page-0938.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0938.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6480,
  "bestTextAlphaRatio": 0.7364
}