{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 268,
  "globalPageIndex": 1066,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-564/SA-564M ASME BPVC.II.A-2025 \nSPECIFICATION FOR HOT-ROLLED \nAND COLD-FINISHED AGE-HARDENING \nSTAINLESS STEEL BARS AND SHAPES \nSA-564/SA-564M cO \nINTSRNATIONAL \nStandards Worldwide \n[Identical with AS1M Specification A 564/A 564M-04(2009).] \n1. Scope \n1.1 This specification covers bars and shapes of age­\nhardening stainless steels. Hot-finished or cold-finished \nrounds, squares, hexagons, bar shapes, angles, tees, and \nchannels are included; these shapes may be produced by \nhot rolling, extruding, or forging. Billets or bars for reforg­\ning may be purchased to this specification. \n1.2 These steels are generally used for parts requiring \ncorrosion resistance and high strength at room temperature, \nor at temperatures up to 600°F [315°C]; 700°F (370°C] \nfor Type 632; 840°F [450°C] for Type UNS S46910. They \nare suitable for machining in the solution-annealed condi­\ntion after which they may be age-hardened to the mechani­\ncal properties specified in Section 7 without danger of \ncracking or distortion. Type XM-25 is machinable in the \nas-received fully heat treated condition. Type UNS S46910 \nis suitable for machining in the solution-annealed, cold­\nworked, and aged-hardened condition. \n2. Referenced Documents \n2.1 ASTM Standards: \nA 314 Specification for Stainless Steel Billets and Bars for \nForging \nA 370 Test Methods and Definitions for Mechanical Test­\ning of Steel Products \nA 484/ A 484M Specification for General Requirements for \nStainless Steel Bars, Billets, and Forgings \nA 705/ A 705M Specification for Age-Hardening, Stainless \nSteel Forgings \nA 751 Test Methods, Practices, and Terminology for \nChemical Analysis of Steel Products \nE 527 Practice for Numbering Metals and Alloys (UNS) \n2.2 Other Documents: \nSAE J1086 Recommended Practice for Numbering Metals \nand Alloys (UNS) \n1.3 Types 631 and 632 contain a large amount of ferrite 3. Ordering Information \nin the microstructure and can have low ductility in forgings 3.1 It is the responsibility of the purchaser to specify \nand larger diameter bars. Applications should be limited all requirements that are necessary for material ordered \n____ _.t~o__.,s'!!m\"\"all'!!_'di,.,,,'cf!.am~e~te~r_.,b,..ar_,__.. ______________ _l,duLlln\"\"de..,,r~t,.._h,.,_,js\"---\"':specification.~~-Such~.equireme11ts-m~)LinC-ludG-------------+--\nl.4 The values stated in either inch-pound units or SI but are not limited to the following: \n(metric) units are to be regarded separately as standards; 3.1.1 Quantity (weight or number of pieces), \nwithin the text and tables, the SI units are shown in [brack- 3.1.2 Type or UNS designation (Table 1), \nets]. The values stated in each system are not exact equiva-\nlents; therefore, each system must be used independent of 3 •1 •3 Specific melt type when required, \nthe other. Combining values from the two systems may 3.1.4 Heat treated condition (5.1), \nresult in nonconformance with the specification. 3.1.5 Transverse properties when required (7.6), \n1.5 Unless the order specifies an \"M\" designation, the 3.1.6 Finish (Specification A 484/ A 484M), \nmaterial shall be furnished to inch-pound units. 317 S rf ti' f h p (5 2 1) . . u aceprepara ono s a es .. , \nNOTE 1 - For forgings, see Specification A 705/ A 705M. 3.1.8 Size, or applicable dimension including diame-\nNOTE 2 - For billets and bars for forging see Specification A 314. ter, thickness, width, length, etc., \n966 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 2,
  "tabulaTablesPath": "tables_tabula/page-1066.json",
  "tabulaTablesCsv": "tables_tabula/page-1066.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1066.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3398,
  "bestTextAlphaRatio": 0.7081
}