{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 543,
  "globalPageIndex": 1341,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-788/SA-788M \n14.3 Mill inspection by the purchaser shall not interfere \nunnecessarily with the manufacturer's operations. \n15. Rejection \n15.1 Any rejection based on the presence of an injurious \ndefect found subsequent to acceptance at the manufacturer's \nworks or based on the results of a product analysis made in \naccordance with 8.4 shall be reported to the manufacturer. \n15 .2 Disposition of forgings rejected by the purchaser under \n15.1 shall be as agreed upon between manufacturer and the \npurchaser. \n16. Certification \n16.1 The manufacturer shall furnish to the purchaser the \nnumber of copies of the material test report specified in the \nordering information (4.1.4). The following items shall be \nreported: \n16.1.1 Purchase order number, \n16.1.2 Forging identification number, \n16.1.3 The product specification number, including the year \ndate and revision letter if any, as well as the appropriate class, \ntype, and grade, \n16.1.3.1 Reference to Specification A788/A788M including \nthe year date together with the applicable revision letter, if any, \nof the revision used shall be a part of the certification. \n16.1.4 Heat number and analysis, \n16.1.5 Results of the required acceptance tests for mechani­\ncal properties, \n16.1.6 Results of any required nondestructive examinations, \n16.1.7 Final heat treatment cycle including austenitizing \nand tempering temperatures and holding times and cooling \nmethods if required by the product specification or 4.2.3, \n16.1.8 Extent to which the forging is incomplete with \nrespect to the product specification (see 1.4 and 16.1.7), and \n16.1.9 Results of any supplementary and additional test \nrequirements that were specified. \n16.1.10 The material test report may be sent to the purchaser \nin electronic form from an electronic data interchange (EDI) \ntransmission, and this shall be regarded as having the same \nvalidity as a counterpart printed in the certifier's facility. The \ncontent of the EDI transmitted document shall meet the \nrequirements of the invokedASTM standard(s) and conform to \nany existing EDI agreement between the purchaser and the \nsupplier. Notwithstanding the absence of a signature, the \norganization submitting the EDI transmission is responsible for \nthe content of the report. \n17. Packaging and Package Marking \n17 .1 Each forging shall be legibly identified as required by \nthe product specification and instructions from the purchaser. \nWhen not otherwise defined, each forging shall be identified by \nthe manufacturer as follows: \n17 .1.1 Manufacturer's name or symbol. \n17 .1.2 Manufacturer's identification or heat number. \n17 .1.3 Product specification number. \n17 .1.4 The class, grade, and type identification as appropri-\nate. \n17.1.5 Purchaser's identification (4.2.3). \n17.1.6 Location of stamping (4.2.3). \n17.1.7 Incomplete forging (1.4). The marking shall include \nthe suffix Y immediately following the ASTM number, and \npreceding any other suffix. This suffix shall not be removed \nuntil the material specification requirements have been com­\npleted and the material test report supplemented. \n17 .2 Marking shall be done by impression stamping or other \nacceptable means specified in the product specification or \norder. Bar coding is an acceptable supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. The bar coding system, if applied at \nthe discretion of the supplier, should be consistent with one of \npublished industry standards for bar coding. \n17.3 The specification year date, and revision letter are not \nrequired to be marked on the forgings. \n18. Keywords \n18.1 general delivery requirements; steel forgings-alloy; \nsteel forgings-carbon \nSUPPLEMENTARY REQUIREMENTS \n(GENERAL) \nThe following supplementary general requirements are common to the forging specifications listed \nin this specification. These and other limitations or tests may be performed by agreement between the \nsupplier and purchaser. The additional requirements shall be specified in the order, and shall be \ncompleted by the supplier before the shipment of the forgings. \n1279 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1341.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4155,
  "bestTextAlphaRatio": 0.7634
}