{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 132,
  "globalPageIndex": 132,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-20/SA-ZOM ASME BPVC.II.A-2025 \nSlO. Charpy V-Notch Impact Transition Curve Sl9. Restricted Chemical Requirements \nS 10.1 Sufficient impact tests of the same specimen size shall \nbe made from the plate test material to establish a transition \ncurve. The test temperature range shall be wide enough to \nestablish the upper and lower shelf energies, with sufficient \ntesting at intermediate temperatures to permit plotting a rea­\nsonable smooth curve. A plot of the data is not required. The \nmanufacturer shall report the specimen orientation, test \ntemperature, and absorbed energy for each specimen tested. \nLateral expansion and percent shear shall also be reported \nwhen specified in the purchase order. The number of plates \ntested and the specimen orientation shall be the same as in 12.1 \nunless otherwise specified in the purchase order. \nSll. Ultrasonic Examination in Accordance with A577/ \nA577M \nSll.1 All plates shall be ultrasonically examined in accor­\ndance with the requirements of Specification A577 I A577M. \nS12. Ultrasonic Examination in Accordance with A578/ \nA578M \nSl2.1 All plates shall be ultrasonically examined in accor­\ndance with the requirements of Specification A578/A578M. \nThe acceptance level shall be as specified in the RUrchase order. \nS13. NDT Temperature Determination \nS13.1 The NDT temperature shall be established in accor­\ndance with Test Method E208 using coupons from a single \nplate. The number of plates to be so tested shall be subject to \nagreement between the purchaser and the manufacturer or \nprocessor. \nSl5. Reduction of Area Measurement \nS 15 .1 A reduction of area measurement shall be taken while \nmaking the required tension test. Reduction of area shall be \ndetermined only-on the 0.500-in. [12.5-mm] round specimen as \nshown in Fig. 5 of Test Methods and Definitions A370. The \nminimum acceptance limit shall be 40 % . \nS16. Thermal Stress Relief of Mechanical Test Coupons \nS16.1 Test coupons representing the plates shall be ther­\nmally stress relieved by gradually and uniformly heating them \nto a temperature between 1100 and 1200°F [595 and 650°C], or \na temperature range otherwise agreed upon between the \nmanufacturer or processor and the purchaser, holding at tem­\nperature for at least 1 h/in. [2.4 min/mm] of thickness and \ncooling in still air to a temperature not exceeding 600°F \n[315°C]. \nS17. Vacuum Carbon-Deoxidized Steel \nS 17 .1 Material shall be vacuum carbon-deoxidized, in \nwhich case the silicon content at the time of vacuum deoxi­\ndizing shall be 0.12 % maximum, and the content of deoxidiz­\ners such as aluminum, zirconium, and titanium should be kept \nlow enough to allow deoxidation by carbon. The test report \nshall indicate that the steel was vacuum carbon-deoxidized. \nThe minimum heat analysis and product analysis requirements \nfor silicon do not apply to vacuum carbon-deoxidized steel. \n80 \nS 19 .1 Restricted heat analysis and product analysis limits \nare applicable, as specified in the purchase order. \nS20. Maximum Carbon Equivalent for Weldability \nS20.1 Plates shall be supplied with a specific maximum \ncarbon equivalent value. This value shall be based upon the \nheat analysis. The required chemical analysis as well as the \ncarbon equivalent shall be reported. \nS20.2 The carbon equivalent shall be calculated using the \nfollowing formula: \nCE= C+Mn/6+(Cr+Mo+V)/5+(Ni+Cu)/15 \nS20.3 The maximum value of the carbon equivalent for \ncarbon steels (including C-Mn, C-Mn-Si, C-Mn-Si-Al steels), \nare given in Table S20.1. \nS21. Restricted Limits on Elements \nFor each heat, based upon the heat analysis, the content shall \nnot exceed 0.35 % for copper, 0.25 % for nickel, 0.25 % for \nchromium, 0.08 % for molybdenum, or 0.70 % for the sum of \nthose four elements. \nS22. Through-Thickness Tension Tests \nS22.l Through-thickness tension tests shall be made in \naccordance with the requirements of Specification A 770/ \nA770M. (See Ordering Information in Specification A770/ \nA770M for the additional information that may be needed.) \nS24. Strain Age Test \nS24.1 Test coupons shall be given a strain age treatment \ndesignated by the purchaser. Charpy V-notch tests shall be \nconducted on the strain aged specimens. Heat treatment, strain \naging, test temperature, and acceptance criteria shall be as \nagreed upon between the manufacturer or processor and the \npurchaser. \nS25. Weldability \nS25.l Weldability tests shall \nbe conducted. The type of test and the acceptance criteria \nshall be as agreed upon between the manufacturer or processor \nand the purchaser. \nTABLE S20.1 Maximum Carbon Equivalent for Weldability \nSpecified Minimum UTS \nksi [MPa] \n60,;;LJTS<70 \n[415,;; UTS < 485] \n70,;; UTS < 80 \n[485,;; UTS < 550] \nUTS 2: 80 \n[UTS 2: 550] \nMaximum Carbon Equivalent Value \nThickness up to 2 In. Thickness over 2 in. \n[50 mm] incl (50 mm] \n0.45 0.46 \n0.47 \nA If simulated PWHT of the test coupons is specified (S3), the maximum carbon \nequivalent value may be Increased up to 0.50 upon agreement between purchaser \nand supplier. \n8 Applicable to quenched-and-tempered material; for other conditions, maximum \ncarbon equivalent shall be by agreement between purchaser and supplier. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0132.json",
  "tabulaTablesCsv": "tables_tabula/page-0132.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0132.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5188,
  "bestTextAlphaRatio": 0.7438
}