{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 675,
  "globalPageIndex": 675,
  "width": 604.32,
  "height": 847.68,
  "text": "ASME BPVC.II.A-2025 SA-370 \nA4.4 Elongation \nA4.4.1 In determining permanent elongation, the ends of the \nfractured specimen shall be carefully fitted together and the \ndistance between the gauge marks measured to the nearest \n0.01 in. (0.25 mm) with dividers and scale or other suitable \ndevice. The elongation is the increase in length of the gauge \nlength, expressed as a percentage of the original gauge length. \nIn recording elongation values, both the percentage increase \nand the original gauge length shall be given. \nA4.4.2 In determining total elongation (elastic plus plastic \nextension) autographic or extensometer methods may be em­\nployed. \nA4.4.3 If fracture takes place outside of the middle third of \nthe gauge length, the elongation value obtained may not be \nrepresentative of the material. \nA4.S Reduction of Area \nA4.5.1 The ends of the fractured specimen shall be carefully \nfitted together and the dimensions of the smallest cross section \nmeasured to the nearest 0.001 in. (0.025 mm) with a pointed \nmicrometer. The difference between the area thus found and the \narea of the original cross section, expressed as a percentage of \nthe original area, is the reduction of area. \nA4.5.2 The reduction of area test is not recommended in \nwire diameters less than 0.092 in. (2.34 mm) due to the \ndifficulties of measuring the reduced cross sections. \nA4.6 Rockwell Hardness Test \nA4.6.1 On heat-treated wire of diameter 0.100 in. \n(2.54 mm) and larger, the specimen shall be flattened on two \nparallel sides by grinding before testing. The hardness test is \nnot recommended for any diameter of hard drawn wire or \nheat-treated wire less than 0.100 in. (2.54 mm) in diameter. For \nround wire, the tensile strength test is greatly preferred over the \nhardness test. \nA4.7 Wrap Test \nA4. 7 .1 This test is used as a means for testing the ductility \nof certain kinds of wire. \nA4. 7 .2 The test consists of coiling the wire in a closely \nspaced helix tightly against a mandrel of a specified diameter \nfor a required number of turns. (Unless other specified, the \nrequired number of turns shall be five.) The wrapping may be \ndone by hand or a power device. The wrapping rate may not \nexceed 15 turns per min. The mandrel diameter shall be \nspecified in the relevant wire product specification. \nA4.7.3 The wire tested shall be considered to have failed if \nthe wire fractures or if any longitudinal or transverse cracks \ndevelop which can be seen by the unaided eye after the first \ncomplete tum. Wire which fails in the first tum shall be \nretested, as such fractures may be caused by bending the wire \nto a radius less than specified when the test starts. \nA4.8 Coiling Test \nA4.8.l This test is used to determine if imperfections are \npresent to the extent that they may cause cracking or splitting \nduring spring coiling and spring extension. A coil of specified \nlength is closed wound on an arbor of a specified diameter. The \nclosed coil is then stretched to a specified permanent increase \nin length and examined for uniformity of pitch with no splits or \nfractures. The required arbor diameter, closed coil length, and \npermanent coil extended length increase may vary with wire \ndiameter, properties, and type. \nAS. NOTES ON SIGNIFICANCE OF NOTCHED-BAR IMPACT TESTING \nAS.I Notch Behavior \nA5.l.1 The Charpy and Izod type tests bring out notch \nbehavior (brittleness versus ductility) by applying a single \noverload of stress. The energy values detennined are quantita­\ntive comparisons on a selected specimen but cannot be \nconverted into energy values that would serve for engineering \ndesign calculations. The notch behavior indicated in an indi­\nvidual test applies only to the specimen size, notch geometry, \nand testing conditions involved and cannot be generalized to \nother sizes. of specimens and conditions. \nA5.l.2 The notch behavior of the face-centered cubic met­\nals and alloys, a large group of nonfen-ous materials and the \naustenitic steels can be judged from their common tensile \nproperties, If they are brittle in tension they will be brittle when \nnotched, while if they are ductile in tension, they will be ductile \nwhen notched, except for unusually sharp or deep notches \n(much more severe than the standard Charpy or Izod speci­\nmens). Even low temperatures do not alter this characteristic of \n625 \nthese materials. In contrast, the behavior of the ferritic steels \nunder notch conditions cannot be predicted from their proper­\nties as revealed by the tension test. For the study of these \nmaterials the Charpy and Izod type tests are accordingly very \nuseful. Some metals that display normal ductility in the tension \ntest may nevertheless break in brittle fashion when tested or \nwhen used in the notched condition. Notched conditions \ninclude restraints to deformation in directions perpendicular to \nthe major stress, or multiaxial stresses, and stress concentra­\ntions. It is in this field that the Charpy and Izod tests prove \nuseful for determining the susceptibility of a steel to notch­\nbrittle behavior though they cannot be directly used to appraise \nthe serviceability of a structure. \nA5.1.3 The testing machine itself must be sufficiently rigid \nor tests on high-strength low-energy materials will result in \nexcessive elastic energy losses either upward through the . \npendulum shaft or downward through the base of the machine. \nIf the anvil supports, the pendulum striking edge, or the ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0675.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5454,
  "bestTextAlphaRatio": 0.7794
}