{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 539,
  "globalPageIndex": 539,
  "width": 601.08,
  "height": 845.28,
  "text": "ASME BPVC.11.A-2025 SA-333/SA-333M \nTABLE 3 Impact Requirements for Grades 1, 3, 4, 6, 7, 9, 10, and \n11 \nMinimum Average Notched Minimum Notched Bar \nBar Impact Value of Impact Value of One \nSize of Each Set of Three Specimen Only of \nSpecimen, mm SpecimensA a SetA \nft-lb! J ft,lbf J \n10 by 10 13 18 10 14 \n10 by 7.5 10 14 8 11 \n10 by 6.67 9 12 7 9 \n10 by 5 7 9 5 7 \n10 by 3.33 5 7 3 4 \n10 by 2.5 4 5 3 4 \nA Straight line interpolation for intermediate values is permitted. \nTABLE 4 Impact Temperature \nGrade \n3 \n4 \n6 \n7 \n8 \n9 \n10 \nii \nMinimum Impact Test Temperature \n°F °C \n-50 -45 \n-150 -100 \n-150 -100 \n-50 -45 \n-100 -75 \n-320 -195 \n-100 -75 \n-75 -60 \n-320 -195 \n4.2.7.1 Each set of weld metal impact test specimens shall \nbe taken across the weld with the notch in the weld metal. Each \ntest specimen shall be oriented so that the notch is normal to \nthe surface of the material and one face of the specimen shall \nbe within 1/16 in. [1.5 mm] of the surface of the material. \n4.2.7.2 Each set of heat affected zone impact test specimens \nshall be taken across the weld and of sufficient length to locate, \nafter etching, the notch in the heat affected zone. The notch \nshall be cut approximately normal to the surface of the material \nin such a manner as to include as much heat affected zone \nmaterial as possible in the resulting fracture. \nNoTE 3-The term \"lot\" applies to all pipe (may include more than one \nheat of steel) within a 3/16 in. [4.7 mm] range of thickness and welded to \nthe weld procedure, and when heat treated, clone to the same heat-treating \nprocedure and in the same furnace. The maximum lot size shall be 200 \nlinear ft [60 m] of pipe. \n4.3 Heat Treatment: \n4.3.1 All seamless and welded pipe, other than Grades 8 and \n11, shall be treated to control their microstructure in accor­\ndance with one of the following methods: \n4.3.l.1 Normalize by heating to a uniform temperature of \nnot less than 1500 °P [815 °C] and cool in air or in the cooling \nchamber of an atmosphere controlled furnace. \n4.3.l.2 Normalize as in 4.3.1.1, and, at the discretion of the \nmanufacturer, reheat to a suitable tempering temperature. \n4.3.1.3 For the seamless process only, reheat and control hot \nworking and the temperature of the hot-finishing operation to a \nfinishing temperature range from 1550 to 1750 °P [845 to 945 \n°C] and cool in air or in a controlled atmosphere furnace from \nan initial temperature of not less than 1550 °P [845 °C]. \n4.3.1.4 Treat as in 4.3. l.3 and, at the discretion of the \nmanufacturer, reheat to a suitable tempering temperature. \n4.3.1.5 Seamless pipe of Grades 1, 6, and 10 may be heat \ntreated by heating to a uniform temperature of not less than \n1500 °P [815 °C], followed by quenching in liquid and \nreheating to a suitable tempering temperature, in place of any \nof the other heat treatments provided for in 4.3.1. \n4.3.2 Grade 8 pipe shall be heat treated by the manufacturer \nby either of the following methods: \n4.3.2.1 Quenched and Tempered-Heat to a uniform tem­\nperature of 1475 :±: 25 °P [800 :±: 15 °C]; hold at this \ntemperature for a minimum time in the ratio of 1 h/in. [2 \nmin/mm] of thickness, but in no case less than 15 min; quench \nby immersion in circulating water. Reheat until the pipe attains \na unifonn temperature within the range from 1050 to 1125 °P \n[565 to 605 °C]; hold at this temperature for a minimum time \nin the ratio of I h/in. [2 min/mm] of thickness, but in no case \nless than 15 min; cool in air or water quench at a rate no less \nthan 300 °P [165 °C]/h. \n4.3.2.2 Double Normalized and Tempered-Heat to a uni­\nform temperature of 1650 :±: 25 °P [900 :±: 15 °C]; hold at this \ntemperature for a minimum time in the ratio of 1 h/in. [2 \nmin/mm] of thickness, but in no case less than 15 min; cool in \nair. Reheat until the pipe attains a unifonn temperature of 1450 \n:±: 25 °P [790 :±: 15 °C]; hold at this temperature for a \nminimum time in the ratio of 1 h/in. [2 min/mm] of thickness, \nbut in no case less than 15 min; cool in air. Reheat to nmiform \ntemperature within the range from 1050 to 1125 °P [565 to 605 \n0 C]; hold at this temperature for a minimum time of 1 h/in. [2 \nmin/mm] of thickness but in no case less than 15 min; cool in \nair or water quench at a rate not less than 300 °P [165 °C]/h. \n4.3.3 Whether to anneal Grade 11 pipe is per agreement \nbetween purchaser and supplier. When Grade 11 pipe is \nannealed, it shall be normalized in the range of 1400 to 1600 °P \n[760 to 870 °C]. \n4.3.4 Material from which test specimens are obtained shall \nbe in the same condition of heat treatment as the pipe \nfurnished. Material from which specimens are to be taken shall \nbe heat treated prior to preparation of the specimens. \n4.3.5 When specified in the order the test specimens shall be \ntaken from full thi.ckness test pieces which have been stress \nrelieved after having been removed from the heat-treated pipe. \nThe test pieces shall be gradually and uniformly heated to the \nprescribed temperature, held at that temperature for a period of \ntime in accordance with Table 5, and then furnace cooled at a \ntemperature not exceeding 600 °P [315 °C]. Grade 8 shall be \n487 \nTABLE 5 Stress Relieving of Test Pieces \nMetal TemperatureA,a Minimum Holding \nGrades 1, 3, 6, 7, and 1 0 Grade 4c Time, \n\"F \"C \"F \"C \nh/in. [min/mm] \nof Thickness \n1100 600 1150 620 1 [2.4] \n1050 565 1100 600 2 [4.7] \n1000 540 1050 565 3 [7.1] \nA For intermediate temperatures, the holding time shall be determined by straight­\nline interpolation. \n8 Grade 8 shall be stress relieved at 1025 to 1085 °F, [550 to 585 °C], held for a \nminimum time of 2 h for thickness up to 1.0 in. [25.4 mm], plus a minimum of 1 h \nfor each additional inch [25.4 mm] of thickness and cooled at a minimum rate of \n300 °F [165 °C]/h in air or water to a temperature not exceeding 600 °F [315 °C]. \nc Unless otherwise specified, Grade 4 shall be stress relieved at 1150 °F [620 °C]. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0539.json",
  "tabulaTablesCsv": "tables_tabula/page-0539.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0539.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5741,
  "bestTextAlphaRatio": 0.674
}