{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 452,
  "globalPageIndex": 452,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-268/SA-268M ASME BPVC.II.A-2025 \nSpecification for \nSeamless and Welded Ferritic and Martensitic Stainless \nSteel Tubing for General Service \n1. Scope \n1.1 This specification covers a number of grades of \nnominal-wall-thickness, stainless steel tubing for general \ncorrosion-resisting and high-temperature service. Most of these \ngrades are commonly known as the \"straight-chromium\" types \nand are characterized by being ferromagnetic. Two of these \ngrades, TP410 and UNS S 41500 (Table 1), are amenable to \nhardening by heat treatment, and the high-chromium, ferritic \nalloys are sensitive to notch-brittleness on slow cooling to \nordinary temperatures. These features should be recognized in \nthe use of these materials. \n1.2 An optional supplementary requirement is provided, and \nwhen desired, shall be so stated in the order. \n1.3 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.4 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \n400 \nA480/A480M Specification for General Requirements for \nFlat-Rolled Stainless and Heat-Resisting Steel Plate, \nSheet, and Strip \nA763 Practices for Detecting Susceptibility to Intergranular \nAttack in Ferritic Stainless Steels \nAl016/A1016M Specification for General Requirements for \nFerritic Alloy Steel, Austenitic Alloy Steel, and Stainless \nSteel Tubes \nE213 Practice for Ultrasonic Testing of Metal Pipe and \nTubing \nE273 Practice for Ultrasonic Testing of the Weld Zone of \nWelded Pipe and Tubing \n3. Terminology \n3.l Lot Definitions: \n3.1.1 For flange and flaring requirements, the term lot \napplies to all tubes, prior to cutting, of the same nominal size \nand wall thickness that are produced from the same heat of \nsteel. If final heat treatment is in a batch-type furnace, a lot \nshall include only those tubes of the same size and from the \nsame heat that are heat treated in the same furnace charge. If \nthe final heat treatment is in a continuous furnace, the number \nof tubes of the same size and from the same heat in a lot shall \nbe determined from the size of the tubes as given in Table 2. \n3 .1.2 For tensile and hardness test requirements, the term lot \napplies to all tubes, prior to cutting, of the same nominal \ndiameter and wall thickness that are produced from the same \nheat of steel. If final heat treatment is in a batch-type furnace, \na lot shall include only those tubes of the same size and the \nsame heat that are heat treated in the same furnace charge. If \nthe final heat treatment is in a continuous furnace, a lot shall ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0452.json",
  "tabulaTablesCsv": "tables_tabula/page-0452.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0452.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3264,
  "bestTextAlphaRatio": 0.7794
}