{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 574,
  "globalPageIndex": 574,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-336/SA-336M (ASTM A336/A336M) ASME BPVC.II.A-2025 \n8.2.1.1 Except as provided for liquid quenched and tem­\npered forgings in 8.2.1.3, the longitudinal axis of the specimen \nshall be located midway between the parallel surfaces of the \ntest extension if added to the periphery of disks or midway \nbetween the center and surface of solid forgings. For hollow \nforgings, or those heat-treated after boring, the specimen shall \nbe located at midwall. For the special case of forgings that are \nheat-treated solid, but are subsequently bored, the tension test \nspecimen may be taken at the location of the minimum inside \ndiameter after boring instead of the mid-radius position. When \nseparately forged test blocks are employed, as defined in 8.2.3, \nthe tension test specimens shall be taken from a location that \nrepresents the mid wall of the heaviest section of the production \nforgings. When specimens are required from opposite ends, \nthey shall be taken from the diagonal corners of an axial plane. \nAlternatively, and when specified by the purchaser, the speci­\nmens shall be taken in accordance with Supplementary Re­\nquirement S3. \n8.2.1.2 For liquid quenched and tempered forgings, the test \nspecimens shall have their longitudinal axis at least ¼ T of the \nmaximum heat-treated thickness from any surface and with the \nmid-length of the specimens at least one T from any second \nsurface. This is normally referred to as ¼ T x T, where Tis the \nmaximum heat-treated thiclmess. A thermal buffer may be used \nto adhere to the above condition. \n8.2.1.3 For liquid quenched and tempered forgings with \nprior purchaser approval, test specimens may be taken at a \ndepth (t) corresponding to the distance from the area of \nsignificant stress to the nearest heat-treated surface and at least \ntwice this distance (2 t) from any second surface. However, the \ntest depth shall not be nearer to one heat-treated surface than \n¾ in. [19 mm] and to the second treated surface than 1 ½ in. \n[38 mm]. This method of test specimen location normally \n(lmown as tx2t testing) applies to thick and complex pressure \nvessel components where the testing in accordance with 8.2.1.2 \nis not practical. Sketches showing the proposed exact test \nlocations shall be approved by the purchaser when this method \nis used. \n8.2.2 Except as specified in this specification, tests for \nacceptance shall be made after heat treatment has been \ncompleted in accordance with Section 6. When the ends of the \ncylindrical forgings are closed in by reforging, the cylindrical \nforgings may be normalized and tempered or annealed and \ntested before reforging. After reforging, the entire forging shall \nbe reheat-treated in the same manner and at the same tempera­\nture range as employed when the forging was heat-treated \nbefore certification testing. \n8.2.3 When mutually agreed upon between the manufac­\nturer and the purchaser, test specimens may be machined from \na specially forged block suitably worked and heat-treated with \nthe production forgings. Such a special block shall be obtained \nfrom an ingot, slab, or billet from the same heat used to make \nthe forgings it represents. This block shall receive essentially \nthe same type of hot-working and forging reduction as the \nproduction forgings; however, a longitudinally forged bar with \ndimensions not less than T x T x 3T may be used to represent \na ring forging. The dimension T shall be representative of the \nheaviest effective cross section of the forging. For quenched \n522 \nand tempered forgings for which tests are required at both ends \nby 8.3.2.3 and 8.3.2.4, separately forged test blocks are not \nallowed. \nNoTE 1-In using separately forged test blocks, attention is drawn to the \neffect of mass differences between the production forgings and the test \nblocks. This can be particularly significant when forgings are either \nnormalized and tempered or quenched and tempered. \n8.3 Number and Location of Tests-The number and loca­\ntion of tests are based on forging length, weight, and heat \ntreatment and shall be as prescribed below. The length and \nweight to be used for this purpose shall be the length and \nweight at the time of heat treatment. \n8.3.1 Annealed or Normalized and Tempered Forgings: \n8.3.1.1 For forgings weighing 5000 lb [2250 kg] or less at \nthe time of heat treatment, one tension test shall be taken from \none forging per heat, per heat treatment charge. When heat \ntreatment is performed in continuous type furnaces with \nsuitable temperature controls and equipped with recording \npyrometers so that complete heat treatment records are \navailable, a tempering charge may be considered as any \ncontinuous run not exceeding an 8 h period. \n8.3.1.2 For forgings and forged bars weighing over 5000 lb \n[2250 kg] at the time of heat treatment, one tension test shall be \ntaken from each forging. \n8.3.2 Quenched and Tempered Forgings: \n8.3.2.1 For quenched and tempered forgings weighing \n5000 lb [2250 kg] or less at the time of heat treatment, but not \nexceeding 12 ft [3.7 m] in length, one tension test shall be \ntaken from one forging per heat, per heat treatment charge. \nWhen heat treatment is performed in continuous type furnaces \nwith suitable temperature controls and equipped with recording \npyrometers so that complete heat treatment records are \navailable, a tempering charge may be considered as any \ncontinuous run not exceeding an 8 h period. \n8.3.2.2 For quenched and tempered forgings and forged bars \nweighing over 5000 lb to 10 000 lb [2250 kg to 4500 kg] at the \ntime of heat treatment, but not exceeding 12 ft [3.7 m] in \nlength, one tension test shall be taken from each forging. \n8.3.2.3 Quenched and tempered forgings that exceed 12 ft \n[3.7 m] in length shall be tension tested at both ends of the \nforging under test. \n8.3.2.4 For quenched and tempered forgings and forged bars \nweighing more than 10 000 lb [ 4500 kg] at the time of heat \ntreatment, two tension test specimens shall be taken from each \nforging. These shall be offset 180° from each other except that \nif the length of the forging, excluding test prolongations, \nexceeds 12 ft [3.7 m], then one specimen shall be taken from \neach end of the forging. \n8.4 Notch Toughness Requirements-Grades FJV, FJVCb, \nF22V, and F6NM: \n8.4.1 Impact test specimens shall be Charpy V-notch, as \nshown in Test Methods and Definitions A370. The usage of \nsubsize specimens due to material limitations must have prior \npurchaser approval. \n8.4.2 The Charpy V-notch test specimens shall be obtained \nas required for tension tests in 8.1 and 8.3. One set of three \nCharpy V-notch specimens shall be taken from each tensile \nspecimen location. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0574.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 6632,
  "bestTextAlphaRatio": 0.767
}