{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 668,
  "globalPageIndex": 1466,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-961/SA-961M ASME BPVC.II.A-2025 \nproduct analysis (check analysis) tolerances are not to be \napplied to the heat analysis requirements. \nS52. Product Analysis \nS52.1 A product analysis shall be made from one randomly \nselected forging representing each heat. The results shall \ncomply with the product analysis limits listed in the applicable \nproduct specification. For Specification Al82/A182M grades \nof F20 and F58, results shall comply with the product analysis \nlimits listed in Specification B880. \nS52.2 If the analysis fails to comply, each forging shall be \nchecked or the lot rejected. All results shall be reported to the \npurchaser. \nS53. Tension Tests \nS53.1 In addition to the requirements of Section 9, one \ntension specimen shall be obtained from a representative \nforging from each heat at a location agreed upon between the \ncertifying organization and the purchaser. The results of the test \nshall comply with the tensile property requirements listed in \nthe applicable product specification and shall be reported to the \npurchaser. \nS54. Impact Tests \nS54.1 In addition to the requirements of Section 9, three \nCVN impact energy specimens shall be obtained from a \nrepresentative forging from each heat at a location agreed upon \nbetween the certifying organization and the purchaser. \nS54.2 The purchaser shall supply the impact test tempera­\nture and the required minimum requirements for the test, \nincluding the lowest single absorbed energy for a single \nspecimen if an average absorbed energy value is required. The \nlateral expansion values and the fracture appearance of the \nspecipiens as percentage ductile fracture shall be reported for \ninformation if these parameters are not part of the acceptance \nrequirements. \nSSS. Magnetic Particle Examination \nS55.1 All accessible surfaces of the finished forging shall be \nexamined by a magnetic particle method. The method shall be \nin accordance with Test Method A275/A275M. Acceptance \nlimits shall be as agreed upon between the certifying organic \nzation and the purchaser. \nS56. Liquid Penetrant Examination \nS56.1 All accessible surfaces shall be examined by a liquid \npenetrant method in accordance with Test Method E165/ \nE165M. Acceptance limits shall be as agreed upon between the \ncertifying organization and the purchaser. \nS57. Hydrostatic Testing \nS57.1 A hydrostatic test at a pressure agreed upon between \nthe certifying organization and the purchaser shall be applied \nby the certifying organization. \nSSS. Repair Welding \nS58.1 No repair welding shall be permitted without prior \napproval of the purchaser. If permitted, the restrictions of \nSection 16 shall apply. \nS59. Electropolished Austenitic and Ferritic-Austenitic \nGrades \nS59.l All electropolished austenitic and ferritic-austenitic \nproducts shall be of a cleanliness in accordance with Specifi­\ncation A967 / A967M. \nS59.2 Details concerning which test method of Specifica­\ntion A967 / A967M are to be a matter of agreement between the \nmanufacturer and the purchaser. \nS60. Positive Material Identification Examination \nS60.1 Forgings shall receive positive material identification \nto ensure that the purchaser is receiving forgings of the correct \nmaterial grade prior to shipment of the forgings. This exami­\nnation is a method to ensure that no material grade mix-up has \noccurred during the manufacturing and marking of the forg­\nings. \nS60.2 Forgings shall receive a positive material identifica­\ntion examination in accordance with Guide B1916. \nS60.3 The quantity examined shall be 100 % of the forg­\nings. \nS60.4 All forgings that are not of the correct material grade \nshall be rejected. \nS60.5 The method of forging marking after examination \nshall be agreed upon between the manufacturer and the \npurchaser. \nS61. Heat Treatment in the Working Zone of a Surveyed \nFurnace \nS61.1 Material shall be heat treated in the working zone of \na furnace that has been surveyed in accordance with Test \nMethod A991/A991M, provided that such working zone was \nestablished using a variation of 25 °F [14 °C] or less from the \nfurnace set point. \nS61.2 The test report shall indicate that S61 applies. \nS62. Requirements for Carbon Steel Products for Concen­\ntrated Hydrofluoric Acid Service \nS62.1 The maximum carbon equivalent based on heat \nanalysis shall be as follows: \nMaximum section thickness less than or equal CE maximum = 0.43 \nto 1 in. \nMaximum section thickness greater than 1 in. CE maximum = 0.45 \nS62.2 Determine the carbon equivalent (CE) as follows: \nCE= C+Mnl6+(C r +Mo + V)/5+(N i + C u)/15 (1) \nS62.3 Vanadium and Niobium maximum content based on \nheat analysis shall be: \nMaximum Vanadium = 0.02 wt % \nMaximum NiobiumA = 0.02 wt % \nMaximum Vanadium plus NiobiumA = 0.03 wt % \nANiobium = Columbium \nS62.4 The maximum composition based on heat analysis of \nNi + Cu shall be 0.15 wt %. \nS62.5 The minimum C content based on heat analysis shall \nbe 0.18 wt%. The maximum C content shall be as specified in \nthe appropriate material specification. \n1408 \n, ~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1466.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5034,
  "bestTextAlphaRatio": 0.7604
}