{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 303,
  "globalPageIndex": 1101,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-568/SA-568M (ASTM A568/A568M) \nand the second lead is attached to the etch pad. Although the \ncurrent may be turned on at this time, caution should be taken \nnot to lay the pad on the sheet blank as it will arc. It is \nadvisable to refrain from touching the metal of the etch pad and \nthe grounded sheet blank. \nX4.3.7 The stencil is placed with the plastic coating against \nthe sheet surface in the area to be etched. Wetting the stencil \nwith a minimum amount of electrolyte will assist in smoothing \nout the wrinkles and gives a more uniform etch. The etch pad \nis now positioned on the stencil and the current turned on, if it \nis not already on. Apply suitable pressure to the pad. Only the \nminimum time necessary to produce a clear etched pattern \nshould be used. The etching time will vary with the amperage \navailable from the power source and the stencil area, as well as \nthe pad area in contact with the stencil. Rocker-type etch pads \ngive good prints and require less amperage than flat-surfaced \npads. Excessive current causes stencil damage. \nX4.3.8 The etching solution activates the surface of the \nmetal and may cause rusting unless it is inhibited. After the \ndesired area has been etched, the blank should be wiped or \nrinsed, dried, and neutralized. \nX4.3.9 The etched blank is now ready for forming. The \nlubricants and press conditions should simulate production \nsituations. If a sequence of operations is used in forming a part, \nit is desirable to etch sufficient blanks so that each operation \ncan be studied. \nX4.4 Measurement of Strain After Forming \nX4.4.1 After forming, the circles are generally distorted into \nelliptical shapes (Fig. X4.2). These ellipses have major and \nminor strain axes. The major strain (e 1 ) is always defined to be \nthe direction in which the greatest positive strain has occurred \nwithout regard to original blank edges or the sheet rolling \ndirection. The minor strain (e 2 ) is defined to be 90° to the major \nstrain direction. \nX4.4.2 There are several methods for determining the major \nand minor strains of the formed panel. Typical tools are a pair \nof dividers and a scale ruled in 0.5 mm. For sharp radii, a thin \nplastic scale that can follow the contour of the stamping can be \nused to determine the dimensions of the ellipses. (Scales are \navailable to read the percent strain directly.) \nMINOR \nsrAAtlll \nTliNSlON • COMPRIISSU)N \n, ' I \\ \nI 1 \n: / \\ , \n\\ I \n\"\"'_..,...,.,,\"' \nMINOR \n$TAAIN \n~ \n, \nTSNSION • TI!NSION \nFIG. X4.2 Major and Minor Strain Axes \nX4.5 Evaluation of Strain Measurements \nX4.5.1 The e 1 strain is always positive while the e 2 strain \nmay be zero, positive, or negative, as indicated on the forming \nlimit curve chart (Fig. X4.1). The maximum e 1 and associated \ne 2 values measured in critical areas on the formed part are \nplotted on the graph paper containing the forming limit curve \nby locating the point of intersections of the e 1 , e 2 strains. \nX4.5.2 If this point is on or below the \"safety band\" of the \nforming limit curve, the strain should not cause breakage. \nPoints further below the curve indicate that a less ductile \nmaterial of a lower grade may be applied. Points above the \n\"safety band\" show that fabrication has induced strains that \ncould result in breakage. Therefore, in evaluation on stampings \nexhibiting these strains, efforts should be made to provide an \ne 1 , e 2 strain combination that would lie on or below the \"safety \nband\" of the forming limit curve. A different e 1 , e 2 strain \ncombination can be obtained through changes of one or more \nof the forming variables such as die conditions, · lubricants, \nblank size, thickness, or material grade. It should be noted at \nthis time that these conclusions are derived from a reference \nbase being the steel \"quality\" used to fabricate the grid \nstamping. \nX4.5.3 When attempting to change the relationship of e 1 \nand e 2 strains, it should be noted that on the forming limit curve \nthe most severe condition for a given e 1 strain is at O % e 2 \nstrain. This means the metal works best when it is allowed to \ndeform in two dimensions, e 1 and e 2 , rather than being \nrestricted in one dimension. A change in e 2 to decrease the \nseverity can be made by changing one of the previously \nmentioned forming variables of the die design, for example, \nimproving lubrication on the tension-tension side will increase \ne 2 and decrease the severity. \nX4.5.4 In addition to the forming limit curve, the e 1 e 2 strain \nmeasurements may be used to evaluate the material require­\nments on the basis of strain gradients, as illustrated in Fig. \nX4.3, or by plotting contours of equivalent strain levels on the \n1003 \n(l)@im: APPROXIMATE LOCATION \nOf ETCHED ClRO.l:!S \nCftOSSSt!Cm>N OF l!TCHED PANEL \nFIG. X4.3 Graph of Major Strains and Critical Major Strains and \nCross Section of Etched Panel ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1101.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4891,
  "bestTextAlphaRatio": 0.7547
}