{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 81,
  "globalPageIndex": 81,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-6/SA-6M \nTABLE 29 Permitted Variations in Straightness for Bars \nPermitted Variations in Straightness, in.A \n¼ in any 5 ft and ¼ x (number of feet of total length/5) \nA Permitted variations in straightness do not apply to hot-rolled bars if any \nsubsequent heating operation has been performed. \nTABLE 30 Permitted Variations in Length for Hot-Cut Steel BarsA \nNoTE I-Where\" ... \" appears in this table, there is no requirement. \nSpecified Sizes of Flats, in. Permitted Variations Over Specified Length \nSpecified Sizes of Rounds, Given in Feet, in. (No Variation Under) \nSquares, and Hexagons, in. \nThickness Width 5 to 10, 1010 20, 20 to 30, \nexcl excl excl \nTo 1, incl To 1, incl To 3, incl ½ ¾ 1¼ \nOver 1 to 2, incl Over 1 To 3, incl 5/a 1 1½ \nOver 1 to 2, incl To 1, incl Over 3 to 6, incl 5/a 1 1½ \nOver 2 to 5, incl Over 1 Over 3 to 6, incl 1 1½ 1¾ \nOver 5 to 10, incl 2 2½ 2¾ \n0.230 to 1, incl Over 6 to 8, incl ¾ 1¼ 1¾ \nOver 1 to 3, incl Over 6 to 8, incl 1¼ 1¾ 2 \nHot Sawin \n2 to 5, incl 8 1 and over 3 and over B 1½ 1¾ \nOver 5 to 10, incl B \n2½ 2¾ \nA For flats over 6 to 8 in., incl; in width and over 3 in. in thickness, consult the manufacturer for permitted variations in length. \n8 Smaller sizes and shorter lengths are not commonly hot sawed. \nTABLE 31 Permitted Variations in Length for Bars Recut Both Ends After StraighteningA,a \nPermitted Variations from Specified Lengths Given in Feet, \nin. \n30 to 40, \nexcl \n1¾ \n2 \n2 \n2¼ \n3 \n3½ \n3½ \n2¼ \n3 \nSizes of Rounds, Squares, • \nHexagons, Width of Flats \nand Maximum Dimension To 12, incl Over12 \nof Other Sections, in. \nTo 3, incl \nOver 3 to 6, incl \nOver 6 to 8, incl \nRounds over 8 to 10, incl \nOver \no/,0 \n¼ \n% \n½ \nUn- Over der \n1/10 ¼ \n1/10 % \n1/,0 ½ \n1/10 5/a \nA For flats over 6 to 8 in., incl, in width, and over 3 in. in thickness, consult the manufacturer or processor for permitted variations in length. \nUn-\nder \n1/,0 \n1/,0 \n1/10 \n1/,0 \n8 Permitted variations are sometimes required all over or all under the specified length, In which case the sum of the two permitted variations applies. \nSUPPLEMENTARY REQUIREMENTS \nThe following standardized supplementary requirements are for use when desired by the purchaser. \nThose that are considered suitable for use with each material specification are listed in the \nspecification. Other tests may be performed by agreement between the supplier and the purchaser. \nThese additional requirements shall apply only when specified in the order, in which event the \nspecified tests shall be made by the manufacturer or processor before shipment of the material. \n40 to 60, \nincl \n2¼ \n2½ \n2½ \n2¾ \n3¼ \n4 \n4 \n2¾ \n3¼ \nSl. Vacuum Treatment \nS 1.1 The steel shall be made by a process that includes \nvacuum degassing while molten. Unless otherwise agreed upon \nwith the purchaser, it is the responsibility of the manufacturer \nto select suitable process procedures. \nspecimen, or from a sample taken from the same relative \nlocation as that from which the tension test specimen was \ntaken. \nS2. Product Analysis \nS2.1 Product analyses shall be made for those elements \nspecified or restricted by the applicable product specification \nfor the applicable grade, class, and type. Specimens for \nanalysis shall be taken adjacent to or from the tension test \n29 \nS3. Simulated Post-Weld Heat Treatment of Mechanical \nTest Coupons \n·s3.l Prior to testing, the test specimens representing the \nstructural product for acceptance purposes for mechanical \nproperties shall be thermally treated to simulate a post-weld \nheat treatment below the critical temperature (Ac 3 ), using the \nheat treatment parameters (such as temperature range, time, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0081.json",
  "tabulaTablesCsv": "tables_tabula/page-0081.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0081.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3667,
  "bestTextAlphaRatio": 0.7041
}