{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 511,
  "globalPageIndex": 1309,
  "width": 613.92,
  "height": 793.2,
  "text": "~ \n~. \nASME BPVC.II.A-2025 SA-765/SA-765M \nTABLE 1 Chemical Requirements \nComposition, % \nGrade I Grade II Grade Ill Grade IV Grade V \nCarbon, max 0.30 0.30 0.20 0.20 0.30 \nManganese 0.60to 0.60 to 0.90 max 1.00-1.60 0.60-1.35 \n1.35 1.35 \nPhosphorus, 0.020 0.020 0.020 0.020 0.020 \nmax \nSulfur, max 0.020 0.020 0.020 0.020 0.020 \nSilicon 0.15 to 0.15 to 0.15 to 0.15--0.50 0.15--0.35 \n0.35 0.35 0.35 \nNickel, maxA 0.50 0.50 3.3 to 3.8 0.50 max 1.0-2.0 \nVanadium, max 0.05 0.05 0.05 0.06 0.03 \nAluminum, max 0.05 0.05 0.05 0.05 0.05 \nChromium,A 0.40 0.40 0.20 0.40 0.30 \nmax \nMolybdenum/ 0.10 0.10 0.06 0.10 0.12 \nmax \nCopper, max 0.35 0.35 0.35 0.35 0.35 \nA Intentional additions of Cr, Mo, and Ni up to the specified maximum are permitted \nto be made to Grades I, 11, and IV by the manufacturer. \n3.4 If steel is required to be vacuum degassed, Supplemen­\ntary Requirement S8 of Specification A788/A788M should be \nspecified. \n4. Heat Treatment for Mechanical Properties \n4.1 Heat treatment shall consist of one of the following heat \ntreatment options of the manufacturer's choice. \n4.1.1 Normalize and temper. \n4.1.2 Double normalize, wherein the second austenitizing \ntemperature is at the same or lower temperature than the first, \nfollowed by tempering. \n4.1.3 Quench and temper, with the option of adding a \npreliminary normalize before austenitizing for quenching in a \nsuitable liquid medium. The type of cooling medium used shall \nbe reported. \n4.1.4 Use of an intercritical heat treatment cycle in accor­\ndance with Specification A788/A788M in which cooling from \nthe full and partial austenitization stages may be done by liquid \nquenching or air cooling. The method of cooling and type of \nquench medium, if used, shall be reported. \n4.1.5 The minimum tempering temperature shall be 1100°F \n[590°C]. \n5. Chemical Requirements \n5.1 Heat Analysis-The heat analysis obtained from sam­\npling in accordance with Specification A788/A788M shall \ncomply with Table 1. \n5.2 Product Analysis-The purchaser may use the product \nanalysis provision of Specification A788/A788M to obtain a \nproduct analysis from a forging representing each heat or \nmultiple heat. \n6. Mechanical Requirements \n6.1 General Requirements-The forgings shall conform to \nthe tension test requirements of Table 2. The forgings shall also \nconform to the impact test requirements of Table 3. The largest \nobtainable round tension test specimen as specified in Test \nMethods and Definitions A370 shall be used. Impact speci­\nmens shall be Charpy V-notch, Type A, as in Test Methods and \nDefinitions A370. The usage of subsize impact specimens must \nhave prior purchaser approval. \n6.1.1 When agreed upon between the purchaser and the \nproducer and specified on the order, impact tests may be made \nat temperatures different from those shown in Table 3 provided \nthe test temperature is at least as low as the intended service \ntemperatures and the provided impact energy requirements of \nTable 3 are met. Such forgings shall be suitably marked in \naccordance with 9.1 to identify the test temperature. \n6.2 Test Location-Test coupons shall be taken so that the \nlongitudinal axis and mid-length of tension and impact test \nspecimens shall be positioned in accordance with one of the \nfollowing methods: \n6.2.1 Method I-Forgings with 2 in. [50 mm] maximum \nthickness. The specimens shall have their longitudinal axis at \nthe midthickness or the center of the cross section and with the \nmidlength of the specimen at least 2 in. [50 mm] from any \nsecond surface. \n6.2.2 Method 2-Grade I and Grade II forgings with thick­\nnesses greater than 2 in. up to 4 in. [50 to 100 mm] inclusive, \nor Grade III and IV forgings with thicknesses greater than 2 in. \nup to 6 in. [50 to 150 mm] inclusive. The specimens shall have \ntheir longitudinal axis at least ¼ T of maximum heat-treated \nthickness from any surface and with the midlength of the \nspecimen at least one T from any second surface. This is \nnormally referred to as ¼ T by T when T is the maximum \nheat-treated thickness. A thermal buffer may be used to adhere \nto the condition in 6.3. Unless otherwise agreed upon, the \nfollowing limitation for heat-treated thickness shall apply: \nGrade \nI \nII \nIll \nIV \nV \n(Classes 1 and 2) \nin. [mm], min \n2 [50] \n2 [50] \n2 [50] \n2 [50] \n2 [50] \nin. [mm], max \n4 [100] \n4 [100] \n6 [150] \n6 [150] \n6 [150] \n6.2.3 Method 3-For forgings thicker than described in \nMethod 2 (6.2.2): \n6.2.3.1 Prior to heat treatment the forging shall be machined \nto a purchaser supplied or approved drawing that indicates the \nlocations of significant in-service loading in the finished part. \nThe mechanical test specimens shall be located as an integral \npart of the forging such that the mid-point of the gauge length \nof the tension test specimen and the area under the notch of the \nimpact specimens are located no closer than the dimension t \nfrom one heat treated surface and 2t from any other heat treated \nsurface where t is the dimension from the area of significant \nloading to the heat treated surface, or¾ in. [20 mm] whichever \nis the greater. \n6.2.4 Method 4-This method shall be limited to forgings \nwith a rough machined weight of not more than 1000 lb [455 \nkg]. Separate test forging when agreed upon between the \npurchaser and the supplier. Test coupons representing forgings \nfrom one heat and one heat treatment lot may be taken from a \nseparately forged piece under the following conditions: \n6.2.4.1 The separate test forging shall be of the same heat of \nmaterial and shall be subjected to substantially the same \nreduction and working as the production forging it represents. \n1241 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1309.json",
  "tabulaTablesCsv": "tables_tabula/page-1309.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1309.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5651,
  "bestTextAlphaRatio": 0.6976
}