{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 602,
  "globalPageIndex": 1400,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-815/SA-815M ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the supplementary requirements described below may be included in the purchaser's \ninquiry or in the order or contract. When so included, a supplementary requirement shall have the \nsame force as if it were in the body of the specification. Supplementary requirement details not fully \ndescribed shall be agreed upon between the purchaser and the supplier. \nSI. Product Analysis (Note Sl.l) \nSI. I A product analysis shall be made for each heat of base \nmetal and, if of welded construction, from each lot number of \nwelding material of the fittings offered for delivery and shall \nconform to the requirements specified in Section 7. \nNoTE S 1.1-If the results of any of the tests specified in Supplementary \nRequirements Sl, S2, or S3 do not conform to requirements, retests may \nbe made at the manufacturer's expense on additional fittings or represen­\ntative test pieces of double the original number from the same heat or lot \nas defined in Supplementary Requirements S.l, S2, or SJ, each of which \nshall conform to the requirements specified. \nS2. Tension Test (Note SU) \nS2.1 One tension test shall be made on one fitting or \nrepresentative test piece (Note S2.1) per lot (Note S2.2) of \nfittings. If the fittings are of welded construction, the tension \nspecimen shall include the weld and be prepared so that the \nweld is at the midlength of the specimen. \nNoTE S2.I-Where the test specimen for the tension or intergranular \ncorrosion bend test cannot be taken from a fitting due to size limitations, \na representative test piece shall be obtained. The test piece shall be from \nthe same lot it represents and shall have approximately the same amount \nof working. In addition, these pieces representing fittings manufactured \nfrom bars, plate, or forgings shall have a cross section equal to the greatest \ncross section of the fitting, and test pieces representing fittings manufac­\ntured from tubular products shaI! have a cross section approximately the \nsame as that of the finished product. The test piece for fittings of welded \nconstruction shall be prepared to the same weld procedures and from the \nsame heats of materials as the fittings it represents. \nNoTE S2.2-A lot shall consist of all fittings of the same type, size, and \nwall thickness, manufactured from one heat of material (and, if fabrication \nwelding is performed using one lot number of electrode or one heat of \nweld wire), and heat treated using the same heat treat cycle in either a \ncontinuous or batch-type furnace controlled within a range of 50 °F [28 \n°CJ and equipped with recording pyrometers so that complete records of \nheat treatment are available. \nS3. Intergranular Corrosion Bend Test (Note S1.1) \nS3.l An intergranular con-osion bend test shall be made on \none fitting or representative test piece (Note S2.1) per lot (Note \nS2.2) of fittings. If the fittings are of welded constmction, the \nbend specimen shall include the weld and be prepared so that \nthe weld is at the midlength location of the specimen. Speci­\nmens containing a weld shall be bent so that the location of \nweld is at the point of maximnm bend. The method of testing \nshall be in accordance with Practices A262 or Practices A763, \nas applicable. \nS4. Ultrasonic Test \nS4.1 Each fitting or the raw material from which each fitting \nis made shall be ultrasonically tested to determine its sound­\nness. The method, where applicable, shall be in accordance \nwith Practice A388/A388M. Acceptance limits shall be speci­\nfied by the purchaser. \nS5. Photomicrographs \nSS.1 Photomicrographs at 100 diameters shall be made for \ninfommtion only of the actual base metal structure from one \nfitting as furnished in each lot. The photomicrographs shall be \nidentified as to fitting size, wall thickness, lot identification, \nand heat. The definition of \"lot\" shall be as specified by the \npurchaser. \nS6. Surface Finish \nS6. l Machined surfaces shall have a maximum roughness \nof 250 RMS (root-mean-square) or 6.3 µin. AA (arithmetical \naverage). All other surfaces shall be suitable for ultrasonic \ntesting. \nS7. Liquid Penetrant Test \nS7.1 All surfaces shall be liquid penetrant tested. The \nmethod shall be in accordance with Practice E165. \n1338 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1400.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4285,
  "bestTextAlphaRatio": 0.7764
}