{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 542,
  "globalPageIndex": 542,
  "width": 602.64,
  "height": 846.48,
  "text": "SA-333/SA-333M ASME BPVC.II.A-2025 \nactually tested. Appendix X 1 shows some examples of how the \ntemperature reductions are determined. \n14.2 The notched bar impact test shall be made in accor­\ndance with the procedure for the simple beam, Charpy-type test \nof Test Methods E23. \n14.3 Impact tests specified for temperatures lower than 70 \n°F [20 °C] should be made with the following precautions. The \nimpact test specimens as well as the handling tongs shall be \ncooled a sufficient time in a suitable container so that both \nreach the desired temperature. The temperature shall be mea­\nsured with thennocouples, thermometers, or any other suitable \ndevices and shall be controlled within 3 °F [2 °C]. The \nspecimens shall be quickly transferred from the cooling device \nto the anvil of the Charpy impact testing machine and broken \nwith a time lapse of not more than 5 s. \n15. Hydrostatic or Nondestructive Electric Test \n15.l Each pipe shall be subjected to the nondestructive \nelectric test or the hydrostatic test. The type of test to be used \nshall be at the option of the manufacturer, unless otherwise \nspecified in the purchase order. \n15.2 The hydrostatic test shall be in accordance with Speci­\nfication A999/A999M. \n15.3 Nondestructive Electric Test-Nondestructive electric \ntests shall be in accordance with Specification A999/ A999M, \nwith the following addition: \n15.3.1 If the test signals were produced by visual imperfec­\ntions (listed in 15.3.2), the pipe may be accepted based on \nvisual examination, provided the imperfection is less than \n0.004 in. (0.1 mm) or 12½ % of the specified wall thickness \n(whichever is greater). \n15.3.2 Visual Imperfections: \n15.3.2.1 Scratches, \n15.3.2.2 Surface roughness, \n15.3.2.3 Dings, \n15.3.2.4 Straightener marks, \n15.3.2.5 Cutting chips, \n15.3.2.6 Steel die stamps, \n15.3.2.7 Stop marks, or \n15.3.2.8 Pipe reducer ripple. \n16. Product Marking \n16.1 Except as modified in 16.1.1, in addition to the \nmarking prescribed in Specification A999/A999M, the mark­\ning shall include whether hot finished, cold drawn, seamless or \nwelded, the schedule number and the letters \"LT'' followed by \nthe temperature at which the impact tests were made, except \nwhen a lower test temperature is required because of reduced \nspecimen size, in which case, the higher impact test tempera­\nture applicable to a full-size specimen should be marked. \n16.1.1 When the size of the finished pipe is insufficient to \nobtain subsize impact specimens, the marking shall not include \nthe letters \"LT\" followed by an indicated test temperature \nunless Supplementary Requirement Sl is specified. \n16.1.2 When the pipe is furnished in the quenched and \ntempered condition, the marking shall include the letters \"QT,\" \nand the heat treatment condition shall be reported to the \npurchaser or his representative. \n17. Keywords \n17 .1 low; low temperature service; seamless steel pipe; \nstainless steel pipe; steel pipe; temperature service applications \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirement shall apply only when specified by the purchaser in the \ncontract or order. \nSl. Subsize Impact Specimens \nS 1.1 When the size of the finished pipe is insufficient to \npermit obtaining subsize impact specimens, testing shall be a \nmatter of agreement between the manufacturer and the pur­\nchaser. \nS2. Requirements for Pipe for Hydrofluoric Acid Alky­\nlation Service \nS2.1 The carbon equivalent (CE), based on heat analysis, \nshall not exceed 0.43 % if the specified wall thickness is equal \nto or less than 1 in. [25.4 mm] or 0.45 % if the specified wall \nthickness is greater than 1 in. [25.4 mm]. \nS2.2 The carbon equivalent shall be determined using the \nfollowing formula: \nCE = C + Mn/6 + (Cr + Mo + V)/5 + (Ni + Cu)/15 \n490 \nS2.3 Based upon heat analysis in mass percent, the vana­\ndium content shall not exceed 0.02 %, the niobium content \nshall not exceed 0.02 % and the sum of the vanadium and \nniobium contents shall not exceed 0.03 %. \nS2.4 Based upon heat analysis in mass percent, the sum of \nthe nickel and copper contents shall not exceed 0.15 %. \nS2.5 Based upon heat analysis in mass percent, the carbon \ncontent shall not be less than 0.18 %. \nS2.6 Welding consumables for repair welds shall be of low \nhydrogen type. E60XX electrodes shall not be used, and the \nresultant weld chemistry shall meet the chemical composition \nrequirements specified for the pipe. \nS2.7 The designation \"HF\" shall be stamped or marked on \neach pipe to signify that the pipe complies with this supple­\nmentary requirement. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0542.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4571,
  "bestTextAlphaRatio": 0.7364
}