{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 264,
  "globalPageIndex": 264,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-182/SA-182M (ASTM A182/A182M) ASME BPVC.II.A-2025 \n~ Designation: A182/A182M - 23 \n~u 11 \nINTERNATIONAL \nStandard Specification for \nForged or Rolled Alloy and Stainless Steel Pipe Flanges, \nForged Fittings, and Valves and Parts for High-Temperature \nService 1 \nThis standard is issued under the fixed designation Al82/Al82M; the number immediately following the designation indicates the year \nof original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscript epsilon ( e) indicates an editorial change since the last revision or reapproval. \nThis standard has been approved for use by agencies of the U.S. Department of Defense. \n1. Scope* \n1.1 This specification 2 covers forged low alloy and stainless \nsteel piping components for use in pressure systems. Included \nare flanges, fittings, valves, and similar parts to specified \ndimensions or to dimensional standards, such as the ASME \nspecifications that are referenced in Section 2. \n1.2 For bars and products machined directly from bar or \nhollow bar (other than those directly addressed by this speci­\nfication; see 6.4), refer to Specifications A479/A479M, A739, \nor A511/ A511M for the similar grades available in those \nspecifications. \n1.3 Products made to this specification are limited to a \nmaximum weight of 10 000 lb [4540 kg]. For larger products \nand products for other applications, refer to Specifications \nA336/A336M and A965/A965M for the similar ferritic and \naustenitic grades, respectively, available in those specifica­\ntions. \n1.4 Several grades of low alloy steels and ferritic, \nmartensitic, austenitic, and ferritic-austenitic stainless steels \nare included in this specification. Selection will depend upon \ndesign and service requirements. Several of the ferritic/ \naustenitic ( duplex) grades are also found in Specification \nA1049/ A1049M. \n1.5 Supplementary requirements are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified individually by the purchaser in the order. \n1.6 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \n1 This specification is under the jurisdiction of ASTM Committee AO! on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.22 on Steel Forgings and Wrought Fittings for Piping Applications and Bolting \nMaterials for Piping and Special Purpose Applications. \nCurrent edition approved May I, 2023. Published May 2023. Originally \napproved in 1935. Last previous edition approved in 2022 as Al82/Al82M-22a. \nDOI: 10.1520/A0182_A0182M-23. \n2 For ASME Boiler and Pressure Vessel Code applications see related Specifi­\ncation SA-182 in Section JI of that Code. \napplicable \"M\" specification designation (SI units), the mate­\nrial shall be furnished to inch-pound units. \n1.7 The values stated in either SI units or inch-pound units \nare to be regarded separately as the standard. Within the text, \nthe SI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 In addition to the referenced documents listed in Speci­\nfication A961/A961M, the following list of standards apply to \nthis specification. \n2.2 ASTM Standards: 3 \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA336/A336M Specification for Alloy Steel Forgings for \nPressure and High-Temperature Parts \nA388/A388M Practice for Ultrasonic Examination of Steel \nForgings \nA479/A479M Specification for Stainless Steel Bars and \nShapes for Use in Boilers and Other Pressure Vessels \nA484/A484M Specification for General Requirements for \nStainless Steel Bars, Billets, and Forgings \n3 For referenced ASTM standards, visit the ASTM website, www.astm.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \n* A Summary of Changes section appears at the end of this standard \n212 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0264.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4710,
  "bestTextAlphaRatio": 0.7656
}