{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 791,
  "globalPageIndex": 791,
  "width": 637.2,
  "height": 872.88,
  "text": "ASME BPVC.II.A-2025 SA-450/SA·450M \n11. Permissible Variations in Length \n11.1 Variations from the specified length shall not exceed \nthe amounts prescribed in Table 4. \n12. Permissible Variations in Height of Flash on Electric­\nResistance-Welded Tubes \n12.1 For tubes manufactured to this specification, the weld \nflash on the outside of the tube shall be mechanically removed \nby cutting prior to any subsequent cold work or sizing. \n12.2 For tubes over 2 in. [50.8 mm] in outside diameter, or \nover 0.135 in. [3.44 mm] in wall thickness, the flash on the \ninside of the tubes shall be mechanically removed by cutting to \na maximum height of 0.010 in. [0.25 mm] at any point on the \ntube. \n12.3 For tubes 2 in. [50.8 mm] and under in outside \ndiameter and 0.135 in. [3.4 mm] and under in wall thickness, \nthe flash on the inside of the tube shall be mechanically \nremoved by cutting to a maximum height of 0.006 in. [0.15 \nmm] at any point on the tube. \n13. Straightness and Finish \n13.1 Finished tubes shall be reasonably straight and have \nsmooth ends free of burrs. They shall have a workmanlike \nfinish. Surface imperfections (see Note 1) may be removed by \ngrinding, provided that a smooth curved surface is maintained, \nand the wall thickness is not decreased to less than that \npermitted by this or the product specification. The outside \ndiameter at the point of grinding may be reduced by the amount \nso removed. \nNoTE 1-An imperfection is any discontinuity or irregularity found in \nthe tube. \n14. Repair by Welding \n14.1 Repair welding of base metal defects in tubing is \npermissible only with the approval of the purchaser and with \nthe further understanding that the tube shall be marked \"WR\" \nand the composition of the deposited filler metal shall be \nsuitable for the composition being welded. Defects shall be \nthoroughly chipped or ground out before welding and each \nrepaired length shall be reheat treated or stress relieved as \nrequired by the applicable specification. Each length of re­\npaired tube shall be tested hydrostatically as required by the \nproduct specification. \nTABLE 4 Permissible Variations in LengthA \nMethod of Outside Cut Length, \nManufacture Diameter, in.[mm] \nin.[mm] Over Under \nSeamless, hot-finished All sizes 3/,a [5] 0 [OJ \nSeamless, cold- Under 2 [50.8] 1/a [3] 0 [OJ \nfinished 2 [50.8] and over 3/,a [5] 0 [OJ \nWelded Under 2 [50.8] ¼ [3] O[O] \n2 [50.8] and over •As [5] 0 [OJ \nA These permissible variations in length apply to tubes before bending. They apply \nto cut lengths up to and including 24 ft [7.3 m]. For lengths greater than 24 ft [7.3 \nm], the above over-tolerances shall be increased by 1/s in. [3 mm] for each 10 ft [3 \nm] or fraction thereof over 24 ft or½ in. [13 mm], whichever is the lesser. \n14.2 Repair welding shall be performed using procedures \nand welders or welding operators that have been qualified in \naccordance with ASME Boiler and Pressure Vessel Code, \nSection IX. \n15. Retests \n15 .1 If the results of the mechanical tests of any group or lot \ndo not conform to the requirements specified in the individual \nspecification, retests may be made on additional tubes of \ndouble the original number from the same group or lot, each of \nwhich shall conform to the requirements specified. \n16. Retreatment \n16.1 If the individual tubes or the tubes selected to represent \nany group or lot fail to conform to the test requirements, the \nindividual tubes or the group or lot represented may be \nretreated and resubmitted for test. Not more than two reheat \ntreatments shall be permitted. \n17. Test Specimens \n17 .1 Test specimens shall be taken from the ends of finished \ntubes prior to upsetting, swaging, expanding, or other forming \noperations, or being cut to length. They shall be smooth on the \nends and free of burrs and flaws. \n17 .2 If any test specimen shows flaws or defective \nmachining, it may be discarded and another specimen substi­\ntuted. \n18. Method of Mechanical Testing \n18.1 The specimens and mechanical tests required shall be \nmade in accordance with Annex A2 of Test Methods and \nDefinitions A370 if inch-pound units are specified or to the \nrequirements described in the applicable track of Test Methods \nA1058 if SI units are specified. \n18.2 Specimens shall be tested at room temperature. \n18.3 Small or subsize specimens as described in Test \nMethods and Definitions A370 or Test Methods A1058 may be \nused only when there is insufficient material to prepare one of \nthe standard specimens. When using small or subsize \nspecimens, the largest one possible shall be used. \n741 \n19. Flattening Test \n19.1 A section of tube not less than 2 ½ in. [63 mm] in \nlength for seamless and not less than 4 in. [100 mm] in length \nfor welded shall be flattened cold between parallel plates in two \nsteps. For welded tubes, the weld shall be placed 90° from the \ndirection of the applied force (at a point of maximum bending). \nDuring the first step, which is a test for ductility, no cracks or \nbreaks, except as provided for in 19.4, on the inside, outside, or \nend surfaces shall occur in seamless tubes, or on the inside or \noutside surfaces of welded tubes, until the distance between the \nplates is less than the value of H calculated by the following \nequation: \n(1 +e)t \nH = e+t!D (2) ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0791.json",
  "tabulaTablesCsv": "tables_tabula/page-0791.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0791.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5161,
  "bestTextAlphaRatio": 0.746,
  "noteOcrPath": "note_ocr/page-0791.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0791.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}