{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 622,
  "globalPageIndex": 622,
  "width": 632.28,
  "height": 868.92,
  "text": "SA-358/SA-358M ASME BPVC.II.A-2025 \n6.3.1 Unless otherwise stated in the order, all pipe shall be \nfurnished in the heat-treated condition in accordance with the \nrequirements of Table 2. \n6.3.2 The purchase order shall specify one of the following \nconditions if the heat-treated condition specified in 6.3 .1 is not \ndesired by the purchaser: \n6.3.2.1 A final heat-treatment temperature under 1900 °F \n[1040 °CJ-Each pipe supplied under this requirement shall be \nstenciled with the final heat-treatment temperature in degrees \nFahrenheit or degrees Celsius after the suffix \"HT.\" Controlled \nstructural or special service characteristics may be specified as \na guide for the most suitable heat treatment. \n6.3.2.2 DELETED \n6.3.2.3 DELETED \n6.4 A solution annealing temperature above 1950 °F [1065 \n0 C] may impair the resistance to intergranular c01rnsion after \nsubsequent exposure to sensitizing conditions in Grades 321, \n321H, 347, 347H, and 348. When specified by the purchaser, a \nlower temperature stabilization or re-solution anneal shall be \nused subsequent to the initial high temperature solution anneal \n(see Supplementary Requirement SS). \n7. Chemical Composition \n7.1 The chemical composition of the plate shall conform to \nthe requirements of the applicable specification and grade \nlisted in Specification A240/ A240M. \n7.2 Except for Grade S34751 and S34752, the chemical \ncomposition of the welding filler metal shall conform to the \nrequirements of the applicable AWS specification for the \ncorresponding grade shown in Table 1, or shall conform to the \nchemical composition specified for the plate in Specification \nA240/ A240M, or shall, subject to purchaser approval, be a \nfiller metal more highly alloyed than the base metal when \nneeded for corrosion resistance or other properties. Use of a \nfiller metal other than that listed in Table 1 or conforming to the \nchemical composition specified for the plate in Specification \nA240/ A240M shall be rep01ted and the filler metal identified \non the certificate of tests. When nitrogen and cerium are \nspecified elements for the ordered grade, the method of \nanalysis for these elements shall be a matter of agreement \nbetween the purchaser and the manufacturer. \n7 .3 The chemical composition of the welding filler metal for \nGrade S34751 and S34752 shall conform to the chemical \ncomposition specified for the plate in Specification A240/ \nA240M. The method for analysis for nitrogen shall be a matter \nof agreement between the purchaser and the manufacturer. \n8. Permissible Variations in Dimensions \n8.1 Permissible Variations-The dimensions at any point in \na length of pipe shall not exceed the following: \n8.1.1 Outside Diameter-Based on circumferential \nmeasurement, ±0.5 % of the specified outside diameter. \n8.1.2 Out-of-Roundness-Difference between major and mi­\nnor outside diameters, 1 %. \n8.1.3 Alignment-Using a 10-ft [3-m] straightedge placed \nso that both ends are in contact with the pipe, Vs in. [3 mm] \ndeviation from contact with the pipe. \nTABLE 2 Annealing Requirements \nGrade or UNS DesignationA Heat Treating \nTemperature 8 \nAll grades not individually listed below: 1900 °F [1040 °C] \n304H,309S,309Cb,310S, 310Gb, 1900 °F [1040 °C] \n321 H, 347H, S22100, S28300, \nN08020 1800-1850 °F [980-1010 °C] \nN08367 2025 °F [1110 °C] \nN08700 2000 °F [1095 °C] \nN08810 2050 °F [1120 °C] \nN08811 2100 °F [1150 °C] \nN08904 2000 °F [1095 °C] \nN08926 2010 °F [1100 °C] \nS30600 2100 °F [1150 °C] \nS30815 1920 °F [1050 °C] \nS31254 2100 °F [1150 °C] \nS31266 2100 °F [1150 °C] \nS31727 1975-2175 °F [1080 to 1180 °C] \nS32050 2100 °F [1150 °C] \nS32053 1975-2175 °F [1080 to 1180 °C] \nS32654 2100 °F [1150 °C] \nS34565 2050 °F [1120 °C] \nS34752 1940-2138 °F [1060 to 1170 °C] \nA New designation established in accordance with Practice E527 and SAE J1086. \n8 Minimum, unless otherwise stated. \nCooling/Testing \nRequirements \nC \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \nD \n0 Quenched in water or rapidly cooled by other means, at a rate sufficient to prevent reprecipitation of carbides, as demonstrable by the capability of passing Practices \nA262, Practice E. The manufacturer is not required to run the test unless it is specified on the purchase order (see Supplementary Requirement S7). Note that Practices \nA262 requires the test to be performed on sensitized specimens in the low-carbon and stabilized types and on specimens representative of the as-shipped condition for \nother types. In the case of low-carbon types containing 3 % or more molybdenum, the applicability of the sensitizing treatment prior to testing shall be a matter for \nnegotiation between the seller and the purchaser. \n0 Quenched in water or rapidly cooled by other means. \n570 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0622.json",
  "tabulaTablesCsv": "tables_tabula/page-0622.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0622.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4740,
  "bestTextAlphaRatio": 0.6783
}