{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 362,
  "globalPageIndex": 1160,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-656 /SA-656M ASME BPVC.II.A-2025 \nSpecification for \nHot-Rolled Structural Steel, High-Strength Low-Alloy Plate \nwith Improved Formability \n1. Scope \n1.1 This specification covers three types and five strength \ngrades of high-strength low-alloy, hot-rolled structural steel \nplate for use in truck frames, brackets, crane booms, rail cars, \nand similar applications. Steels that conform to this specifica­\ntion offer improved formability. These steels are normally \nfurnished in the as-rolled condition. The type and strength \ngrade furnished is as agreed upon between the manufacturer \nand the purchaser. The types and strength grades are shown in \nthe tables. \n1.2 The maximum thickness of plates shall be as follows: \nGrade Plate Thickness, max, \nin.[mm] \n50 2 [50] \n60 1½ [40] \n70 1 [25] \n00 1• \n100 ½~~ \n1.3 The values stated in either inch-pound units or SI units \nare to be regarded as standard. Within the text, the SI units are \nshown in brackets. The values stated in each system are not \nexact equivalents; therefore, each system must be used inde­\npendently of the other. Combining values from the two systems \nmay result in nonconformance with this specification. \n1.4 For plates produced from coil and furnished without \nheat treatment or with stress relieving only, the additional \nrequirements, including additional testing requirements and the \nreporting of additional test results, of Specification A6/ A6M \napply. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA6/ A6M Specification for General Requirements for Rolled \nStructural Steel Bars, Plates, Shapes, and Sheet Piling \n3. General Requirements for Delivery \n3 .1 Plates furnished under this specification shall conform \nto the requirements of the current edition of Specification \nA6/ A6M, for the specific plate ordered, unless a conflict exists, \nin which case this specification shall prevail. \n3.2 Coils are excluded from qualification to this specifica­\ntion until. they are processed into finished plates. Plates \nproduced from coil means plates that have been cut to \nindividual lengths from a coil. The processor directly controls, \nor is responsible for, the operations involved in the processing \nof a coil into finished plates. Such operations include decoiling, \nleveling, cutting to length, testing, inspection, conditioning, \nheat treatment (if applicable), packaging, marking, loading for \nshipment, and certification. \nND'I'E 1-For plates produced from coil and furnished without heat \ntreatment or with stress relieving only, two test results are to be reported \nfor each qualifying coil. Additional requirements regarding plate produced \nfrom coil are described in Specification A6/A6M. \n4. Materials and Manufacture \n4.1 The steel shall be made to fine grain practice. \n5. Chemical Composition \n5.1 Heat analyses shall conform to the chemical require­\nments given in Table 1. Dependent upon thickness, grade, and \nintended application, variations in the chemical composition \nare permitted within the limits given in Table 1 for the \napplicable type. Where it is of particular importance, the \nmanufacturer should be consulted for specific chemical com­\nposition. \n5.2 Product Analysis-If a product analysis is made, it shall \nconform to the requirements given in Table 1, subject to the \nproduct analysis tolerances of Specification A6/A6M. \n1068 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1160.json",
  "tabulaTablesCsv": "tables_tabula/page-1160.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1160.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3678,
  "bestTextAlphaRatio": 0.7798
}