{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 583,
  "globalPageIndex": 1381,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-813/SA-813M \n13.3.1.1 The reference standards defined in 13.9.1 - 13.9.4 \nare convenient standards for calibration of nondestructive \ntesting equipment. The dimensions of these standards should \nnot be construed as the minimum size imperfection detectable \nby such equipment. \n13.3.1.2 The ultrasonic testing (UT) can be performed to \ndetect both longitudinally and circumferentially oriented de­\nfects. It should be recognized that different techniques should \nbe employed to detect differently oriented imperfections. The \nexamination may not detect short, deep, defects. \n13.3.1.3 The eddy-current testing (ET) referenced in this \nspecification, (Practice E426), has the capability of detecting \nsignificant discontinuities, especially the short abrupt type. \n13.3.1.4 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of discontinuities that can \nbe detected in the specific application of these examinations \nshould discuss this with the manufacturer of the tubular \nproduct. \n13.4 Time of Examination: \n13.4.1 Nondestructive testing for specification acceptance \nshall be performed after all mechanical processing, heat \ntreatments, and straightening operations. This requirement \ndoes not preclude additional testing at earlier stages in the \nprocessing. \n13.5 Surface Condition: \n13.5.1 All surfaces shall be free of scale, dirt, grease, paint, \nor other foreign material that could interfere with interpretation \nof test results. The methods used for cleaning and preparing the \nsurfaces for examination shall not be detrimental to the base \nmetal or the surface finish. \n13.5.2 Excessive surface roughness or deep scratches can \nproduce signals that interfere with the test. \n13.6 Extent of Examination: \n13.6.1 The relative motion of the pipe and the transducer(s), \ncoil(s), or sensor(s) shall be such that the entire pipe surface is \nscanned, except as in 13.5.2. \n13.6.2 The existence of end effects is recognized, and the \nextent of such effects shall be determined by the manufacturer, \nand, if requested, shall be reported to the purchaser. Other \nnondestructive tests may be applied to the end areas, subject to \nagreement between the purchaser and the manufacturer. \n13.7 Operator Qualifications: \n13. 7 .1 The test unit operator shall be certified in accordance \nwith SNT-TC-lA, or an equivalent recognized and documented \nstandard. \n13.8 Test Conditions: \n13.8.1 For eddy-current testing, the excitation coil fre­\nquency shall be chosen to ensure adequate penetration yet \nprovide good signal-to-noise ratio. \n13.8.2 The maximum eddy-current coil frequency used \nshall be as follows: \nOn specified walls up to 0.050 in.-100 KHz max \nOn specified walls up to 0.150 in.-50 KHz max \nOn specified walls above 0.150 in.-10 KHz max \n13.8.3 Ultrasonic-For examination by the ultrasonic \nmethod, the minimum nominal transducer frequency shall be \n2.00 MHz and the maximum nominal transducer size shall be \n1.5 in. \n( 1) H the equipment contains a reject notice filter setting, \nthis shall remain off during calibration and testing unless \nlinearity can be demonstrated at that setting. \n13.9 Reference Standards: \n13.9.1 Reference standards of convenient length shall be \nprepared from a length of pipe of the same grade, size (NPS, or \noutside diameter and schedule or wall thickness), surface finish \nand heat treatment condition as the pipe to be examined. \n13.9.2 For Ultrasonic Testing, the reference ID and OD \nnotches shall be any one of the three common notch shapes \nshown in Practice E213, at the option of the manufacturer. The \ndepth of each notch shall not exceed 12½ % of the specified \nnominal wall thickness of the pipe or 0.004 in., whichever is \ngreater. The width of the notch shall not exceed twice the \ndepth. Notches shall be placed on both the OD and ID surfaces. \n13.9.3 For Eddy-Current Testing, the reference standard \nshall contain, at the option of the manufacturer, any one of the \nfollowing discontinuities: \n( 1) Drilled Hole-The reference standard shall contain \nthree or more holes, equally spaced circumferentially around \nthe pipe and longitudinally separated by a sufficient distance to \nallow distinct identification of the signal from each hole. The \nholes shall be drilled radially and completely through the pipe \nwall, with care being taken to avoid distortion of the pipe while \ndrilling. One hole shall be drilled in the weld, if visible. \nAlternately, the producer of welded pipe may choose to drill \none hole in the weld and run the calibration standard through \nthe test coils three times with the weld turned at 120° on each \npass. The hole diameter shall vary with NPS as follows: \nNPS Designator \n½ \nabove½ to 1¼ \nabove 1¼to 2 \nabove 2 to 5 \nabove 5 \nHole Diameter \n0.039 in. [1 mm] \n0.055 in. [1.4 mm] \n0.071 in. [1.8 mm] \n0.087 in. [2.2 mm] \n0.106 in. [2.7 mm] \n(2) Transverse Tangential Notch-Using a round tool or \nfile with a ¼ in. [6.4 mm] diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the pipe. Said notch shall have a depth not \nexceeding 12½ % of the specified nominal wall thickness of \nthe pipe or 0.004 in. (0.102 mm), whichever is greater. \n( 3) Longitudinal Notch-A notch 0.031 in. or less in width \nshall be machined in a radial plane parallel to the tube axis on \nthe outside surface of the pipe, to have a depth not exceeding \n12½ % of the specified wall thickness of the pipe or 0.004 in., \nwhichever is greater. The length of the notch shall be compat­\nible with the testing method. \n13.9.4 More or smaller reference discontinuities, or both, \nmay be used by agreement between the purchaser and the \nmanufacturer. \n13.10 Standardization Procedure: \n13.10.1 The test apparatus shall be standardized at the \nbeginning and end of each series of pipes of the same size \n(NPS or diameter and schedule or wall thickness), Grade and \n1319 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1381.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5946,
  "bestTextAlphaRatio": 0.7442
}