{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 632,
  "globalPageIndex": 1430,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-859/SA-859M (ASTM A859/A859M) ASME BPVC.II.A-2025 \nTABLE 2 Tensile Requirements \nProperty \nYield strength 0.2 % offset ksi [MPa] \nTensile Strength ksi [MPa] \nElongation in 2 in. or 50 mm % min \nReduction of Area % min \nGrade A \nClass 1 \n55 [380 min] \n65-85 [ 450-585] \n20 \n45 \nGrade A \nClass 2 \n65 [450] min \n75-95 [515-650] \n20 \n45 \nGrade B \n100-115 [690-800] \n105 [725] min \n16 \n45 \nTABLE 3 Charpy Impact Requirements \nGrade A \nClass 1 \n-50 'F [-45 'CJ \nTest Average, fVlb [JjA \nMinimum single value, fVlb [J] \nA Not more than one specimen from a set may be below this value. \n20 [27] \n15 [20] \n6.3.1 Method I-This method shall always be used when \nthe maximum as-heat-treated thickness does not exceed 2 in. \n[50 mm]. Specimens shall be located in the production forging \nor test forging (as described in Method 4) at mid-thickness and \nat least 2 in. [50 mm] from other as-heat-treated surfaces. \n6.3.2 Method 2-T by 2T, where Tis the distance from the \narea of significant loading (see 3.1) to the nearest as-heat­\ntreated surface. However, the specimen shall not be nearer to \none as-heat-treated surface than¾ in. [20 mm] and not nearer \nthan 1 ½ in. [40 mm] to a second as-heat-treated surface. When \nthis method of testing is employed, forgings are usually \nmanufactured in accordance with a purchaser-approved draw­\ning showing pre-heat-treatment dimensions and the location of \ntest specimens. \n6.3.3 Method 3-¼ T by T, where T is the maximum \nthickness of the forging as-heat-treated. When this method of \ntesting is employed for Class 2, the maximum as-heat-treated \nthickness shall not exceed 8 in. [200 mm] unless otherwise \nagreed. \n6.3.4 Method 4-Test specimens shall be taken from a \nrepresentative separate test forging or bar made from the same \nheat of steel that shall receive substantially the same reduction \nand type of hot working as the production forgings which it \nrepresents; except that a longitudinally forged bar may be used \nto represent a rolled ring of similar cross section. It shall be of \nthe same nominal thickness as the as-heat-treated production \nforgings and shall be heat treated in the same furnace charge \nand under the same conditions as the production forgings. Test \nspecimens shall be removed using the ¼ T by T procedure \nreferenced in Method 3 with the same limitation on forging \nthickness as in 6.3.3. This method shall be limited to forgings \nwith a rough machined weight of not more than 1000 lb \n[500 kg]. \n6.4 Metal Buffers-The required distances from as-heat­\ntreated surfaces may be obtained with metal buffers instead of \nintegral extensions. Buffer material may be carbon or low-alloy \nsteel and shall be joined to the forging with a partial penetra­\ntion weld that seals the buffered surface. Specimens shall be \nlocated at least ½ in. [13 mm] from the buffered surface of the \nforging. Buffers shall be removed and the welded areas \nsubjected to magnetic particle test to ensure freedom from \nGrade A \nClass 2 \n-50 'F [-45 'CJ \n20 [27] \n15 [20] \nGrade B \n0 'F [18 'CJ \n80 [110] \n75 [100] \nGrade B \n-120 'F [-85 'CJ \n60 [80] \n55 [75] \ncracks unless the welded areas are completely removed by \nsubsequent machining. \n6.5 Samples shall be removed from forgings after heat \ntreatment. The sample material shall be subjected to a simu­\nlated post-weld heat-treatment if Supplementary Requirement \nS l is specified. \n6.6 Orientation-For upset disk forgings, the longitudinal \naxis of all test specimens shall be oriented in the tangential \ndirection. For all other forgings, the longitudinal axis of the \nspecimens shall be oriented in the direction of maximum \nworking of the forging unless Supplementary Requirements \nS 11 or S 14 are imposed. \n6.7 Number of Tests: \n6.7.1 Forgings Under 500 lb [250 kg] As-Heat-Treated­\nFor duplicate forgings weighing less than 500 lb [250 kg] \nas-heat-treated, one tension test and one impact test (three \nspecimens) shall be made to represent each heat in each \nheat-treatment charge. When heat-treatment is performed in \ncontinuous-type furnaces with suitable temperature control and \nequipped with recording pyrometers so that complete heat­\ntreatment records are available, a heat-treatment charge shall \nbe considered as any continuous run not exceeding any 8 h \nduration. \n6.7.2 Forgings Weighing 500 to JO 000 lb [250 to 5000 kg] \nAs-Heat-Treated-One tension and one impact test (three \nspecimens) shall be made for each forging. \n6.7.3 Each forging weighing over 10 000 lb [5000 kg] shall \nrequire two tension tests and two impact tests, located at \nopposite ends if the length, excluding test prolongations, \nexceeds 80 in. [2000 mm], or located 180° apart for shorter \nlength forgings. \n7. Workmanship, Finish, and Appearance \n7 .1 The forgings shall conform to the dimensions specified \nby the purchaser. The finishes shall permit adequate visual \ninspection for surface imperfections. If a dimension varies \nfrom that specified, the forging may be offered to the purchaser \nfor acceptance. \n1368 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1430.json",
  "tabulaTablesCsv": "tables_tabula/page-1430.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1430.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5008,
  "bestTextAlphaRatio": 0.7165
}