{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 367,
  "globalPageIndex": 1165,
  "width": 613.92,
  "height": 793.2,
  "text": "~' \nASME BPVC.II.A-2025 SA-660 \n3.1.8 Test report required (Certification Section of Specifi­\ncation A530/ A530M), \n3.1.9 Specification designation, and \n3.1.10 Special requirements. \n4. General Requirements \n4.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A530/ A530M unless otherwise provided herein. \n5. Materials and Manufacture \n5.1 Machining: \n5.1.1 All centrifugally cast pipe shall have both the inner \nand outer surfaces machined. \n5.1.2 After heat treatment, the pipe shall be machined to a \nfinish with a roughness value no greater than 250 µin. (6.35 \nµm) arithmetical average deviation (AA), terms as defined in \nANSI B46. l unless otherwise specified. \n5.2 Heat Treatment: \n5.2.1 All pipe shall receive a heat treatment proper for its \ndesign and chemical composition. \n5.2.2 Castings shall be heat treated after they have been \nallowed to cool below the transformation range. \n6. Temperature Control \n6.1 Furnace temperatures for heat treating shall be effec­\ntively controlled by pyrometers. \n7. Chemical Requirements \n7. l The steel shall conform to the requirements as to \nchemical composition presclibed in Table 1. \n7 .2 Product Analysis: \n7 .2.1 At the request of the purchaser, a product analysis \nshall be made by the manufacturer on every heat. \n7 .2.2 The results of these analyses shall be reported to the \npurchaser or his representative, and shall conform to the \nrequirements specified in Table 1. \n7.2.3 If the analysis of one of the tests specified in 7.2.l \ndoes not conform to the requirements specified, an analysis of \neach pipe from the same heat may be made, and all pipes \nconforming to the requirements shall be accepted. \n8. Mechanical Requirements \n8.1 Tensile Properties: \n8.1.1 The material shall conform to the requirements as to \ntensile properties presclibed in Table 2. \nTABLE 2 Tensile Requirements \nwe A wes wee \nksi MPa ksl MPa ksl MPa \nTensile strength, min 60 414 70 483 70 483 \nYield strength, min 30 207 36 248 40 276 \nElongation In 2 In. or 50 24 22 22 \nmm, min,% \nReduction of area, min, 35 35 35 \n% \n8.1.2 Transverse or Longitudinal Tension Test-One test \nshall be made on a specimen from one end of one length of \npipe representing each heat in each heat-treatment lot. \n8.2 Flattening Test: \n8.2.1 A flattening test shall be performed when requested by \nthe purchaser or when stated by the purchaser on the order that \nthe pipe is to be upset, swaged, expanded, bent, or formed by \nsome other operation. \n8.2.2 A flattening test need not be performed on heavy wall \npipe which is not to be upset, swaged, expanded, bent, or \nformed in some other manner. \n8.2.3 When required by 8.2, a test shall be made on \nspecimens cut from one end of each length of pipe. \n8.2.4 A flattening test when required shall be performed in \naccordance with the requirements for seamless and centrifu­\ngally cast pipe in the Flattening Test Requirements Section of \nSpecification A530/ A530M. \nNore 1-In heavy-walled small-diameter tubing the flattening test \nspecimen may be bored out so that the OD/t ratio will be greater than 11.0. \n8.3 Hydrostatic Test: \n8.3.1 Each length of pipe shall be hydrostatically tested in \naccordance with the Hydrostatic Test Requirements Section of \nSpecification A530/A530M when requested by the purchaser \nand stated on the order. If performance of the hydrostatic test \nis not required by the purchaser, the manufacturer shall \nguarantee pipe to pass the test and mark each length of pipe \nwith the letters \"NH\" immediately following the specification \nnumber, indicating that the pipe has not been hydrostatically \ntested. \n8.3.2 When required by 8.3, each length of pipe shall be \nsubjected to the hydrostatic test. The test pressure shall be \nmaintained for not less than 5 min. \n9. Permissible Variation in Wall Thickness \n9.1 The wall thickness shall not vary over the specified \nminimum wall thickness by more than 10 %. There shall be no \nvariation under the specified minimum wall thickness. \nNorn 2-A system of standard pipe sizes has been approved by the \nAmerican National Standards Institute, as ANSI B36.10. This system may \nbe used for obtaining pipe under this specification. \n10. Workmanship and Finish \n10.1 The pipe shall have a finish as provided in 5.2 and it \nshall be reasonably straight and free from injurious defects. \n11. Rework and Retreatment \n11.1 Impeifections-The surface of the casting shall be \ninspected visually for cracks and hot tears. These imperfections \nshall be removed, and their removal verified by visual inspec­\ntion of the resultant cavities. Imperfections located by inspect­\ning with Supplementary Requirements S7, S8, or S9 shall be \nremoved or reduced to an acceptable size. \n11.2 Blending-If removal of the imperfection does not \ninfringe upon the minimum wall thickness, the depression may \nbe blended uniformly into the surrounding surface. \n11.3 Repair by Welding-Imperfections that infringe upon \nthe minimum wall thickness may be repaired by welding \nsubject to approval by the purchaser. Only qualified operators \n1073 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1165.json",
  "tabulaTablesCsv": "tables_tabula/page-1165.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-1165.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5105,
  "bestTextAlphaRatio": 0.756,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-1165.txt",
  "gapOcrHighDpiLength": 5122
}