{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 707,
  "globalPageIndex": 707,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-395/SA-395M \n11.1.2 Test bars removed from castings shall con­\nform to Fig. 6. The testing diameter shall be½ in. [12.5 mm] \nif possible. Smaller diameters shall be utilized if necessary. \n11.2 The test coupon size shall be as mutually agreed \nupon between the manufacturer and purchaser. In the \nabsence of agreement, it shall be the option of the manufac­\nturer. \n11.3 The test coupons shall be cast in molds made of \nsuitable core sand having a minimum wall thickness of \n1½ in. [38 mm] for the ½ in. [12.5 mm], 1 in. [25 mm] \nsizes, and 3 in. [75 mm] for the 3 in. [75 mm] size. The \ncoupons shall be left in the mold until they have changed \nto a black color (approximately 900°F [480°C] or less). \nThe keel block as shown in Fig. 2 or the modified keel \nblock produced from the mold shown in Fig. 4 may be \nsubstituted for the 1 in. [25 mm] block shown in Fig. 3. \n11.4 When investment castings are made to this speci­\nfication, the manufacturer may use test specimens cast to \nsize incorporated in the mold with the castings or separately \ncast to size using the same type of mold and the same \nthermal conditions that are used to produce the castings. \nThese test specimens shall be made to the dimensions \nshown in Fig. 1 of Specification A 732/ A 732M or Fig. 5 \nand Fig. 6 of Test Methods and Definitions A 370. \n11.5 The manufacturer shall cast a sufficient number \nof test coupons to provide for each ferritizing anneal. The \ntest coupons shall be heat treated with the castings they \nrepresent. Sectioning of the test coupons prior to heat treat­\ning is not permitted. \n11.6 The metallographic examination shall be made on \na test lug from the test coupon shown in Fig. 7 or from a \ncasting; or from a representative test coupon poured with \nthe casting(s). The test coupon shall represent the metal \ntreated with the nodularizing agent. \n12. Number of Tests and Retests \n12.1 One tension test shall be made from sections cut \nfrom the test coupons (Fig. 5) required by Section 11. \n12.1.1 Unless otherwise stated in the contract or \norder for castings, a metallographic examination may be \nsubstituted for the tension test when separately cast test \ncoupons are used. When the microstructure option is used, \na minimum of one tension test is required from each day's \nmelt and for each heat treatment (see 12.2). \n12.2 If any tension test specimen shows obvious \ndefects, another from the same coupon, or from another \ncoupon/ or representing the same metal and the same anneal \ncharge, may be tested. If an apparently sound test specimen \nfails to conform to this specification, castings may be re­\nannealed, if required, and two retests made. If either retest \nfails to conform to this specification, the castings they \nrepresent shall be rejected. \n13. Tension Test Specimen Preparation \n13.1 The standard machined ½ in. [12.5 mm] round \ntension test specimen with 2 in. [50 mm] gage length as \nshown in Fig. 6 shall be used except where the ½ in. \n[12.5 mm] Y-block test coupon is required. In this case, \neither of the small size specimens, 0.375 or 0.250 in. \n[9 or 6.5 mm] round as shown in Fig. 6, shall be used. \n14. Test Methods \n14.1 Chemical analysis shall be made in accordance \nwith Test Method E 1806. \n14.2 The yield strength shall be determined in accor­\ndance with Test Methods E 8 using one of the following \nmethods: \n14.2.1 The 0.2% off-set method, or \n14.2.2 Extension under load method where the yield \nstrength may be determined as the stress producing an \nelongation under load of 0.375%; that is, 0.0075 in. \n[0.19 mm] in a gage length of 2 in. [50 mm]. \n14.3 The hardness of the ductile iron as represented \nby the test specimens and castings shall be determined in \naccordance with Test Method E 10. \n657 \n14.4 The percentage of each graphite type shall be \ndetermined by manual counting, semi-automatic, or auto­\nmatic image analysis methods. The sum of all graphite \ntypes shall total to 100%. \n15. Records \n15.1 Records of the chemical composition,. mechanical \nproperties, and metallographic examination, when applica­\nble, shall be systematically made and maintained. \n16. Inspection \n16.1 Unless otherwise specified in the contract or pur­\nchase order, the manufacturer shall be responsible for car­\nrying out all the tests and inspection required by this \nspecification. \n16.2 The inspector representing the purchaser shall \nhave entry at all time, while work on the contract of the \npurchaser is being performed, to all parts of the manufactur­\ner's works which concern the manufacturer of the material \nordered. The manufacturer shall afford the inspector all ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0707.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4635,
  "bestTextAlphaRatio": 0.7312
}