{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 504,
  "globalPageIndex": 504,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-312/SA-312M (ASTM A312/A312M} ASME BPVC.II.A-2025 \nc6 Designation: A312/A312M - 24 \n~u 11 7 \nINTERNATIONAL \nStandard Specification for \nSeamless, Welded, and Heavily Cold Worked Austenitic \nStainless Steel Pipes 1 \nThis standard is issued under the fixed designation A312/ A312M; the number immediately following the designation indicates the year \nof original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscript epsilon (s) indicates an editorial change since the last revision or reapproval. \n1. Scope* \n1.1 This specification 2 covers seamless, straight-seam \nwelded, and heavily cold worked welded austenitic stainless \nsteel pipe intended for high-temperature and general corrosive \nservice. \n1.2 Grades TP304H, TP309H, TP309HCb, TP310H, \nTP310HCb, TP316H, TP321H, TP347H, and TP348H are \nmodifications of Grades TP304, TP309Cb, TP309S, TP310Cb, \nTP310S, TP316, TP321, TP347, and TP348, and are intended \nfor service at temperatures where creep and stress rupture \nproperties are important. \n1.3 Optional supplementary requirements are provided for \npipe where a greater degree of testing is desired. These \nsupplementary requirements call for additional tests to be made \nand, when desired, it is permitted to specify in the order one or \nmore of these supplementary requirements. \n1.4 Table Xl.l lists the standardized dimensions of welded \nand seamless stainless steel pipe as shown in ASME B36.19. \nThese dimensions are also applicable to heavily cold worked \npipe. Pipe having other dimensions is permitted to be ordered \nand furnished provided such pipe complies with all other \nrequirements of this specification. \n1.5 Grades TP321 and TP321H have lower strength require­\nments for pipe manufactured by the seamless process in \nnominal wall thicknesses greater than 3/s in. [9.5 mm]. \n1.6 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-confonnance with the \nstandard. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1 This specification is under the jurisdiction of ASTM Committee AO! on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0!.10 on Stainless and Alloy Steel Tubular Products. \nCurrent edition approved March 1, 2024. Published March 2024. Originally \napproved in 1948. Last previous edition approved in 2022 as A312/A312M-22a. \nDOI: 10.1520/A0312_A0312M-24. \n2 For ASME Boiler and Pressure Vessel Code applications see related Specifi­\ncation SA-312 in Section II of that Code. \nNorn 1-The dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiameter,\" \"size,\" and \"nominal size.\" \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards:3 \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA999/A999M Specification for General Requirements for \nAlloy and Stainless Steel Pipe \nAl016/Al016M Specification for General Requirements for \nFerritic Alloy Steel, Austenitic Alloy Steel, and Stainless \nSteel Tubes \nEll2 Test Methods for Determining Average Grain Size \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \nE527 Practice for Numbering Metals and Alloys in the \nUnified Numbering System (UNS) \n2.2 ASME Standards: \nBl.20.1 Pipe Threads, General Purpose \nB36.10M Welded and Seamless Wrought Steel Pipe \nB36.19 Stainless Steel Pipe \nASME Boiler and Pressure Vessel Code : Section VIII 4 \n3 For referenced ASTM standards, visit the ASTM website, www.astm.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \n4 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n* A Summary of Changes section appears at the end of this standard \n452 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0504.json",
  "tabulaTablesCsv": "tables_tabula/page-0504.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0504.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4838,
  "bestTextAlphaRatio": 0.7549
}