{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 442,
  "globalPageIndex": 1240,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-703/SA-703M ASME BPVC.ll.A-2025 \n[30 °C] below nor more than 175 °F [100 °C] above the \nfurnace set point used. \n4.2.2.2 The maximum variation in measured temperature as \ndetermined by the difference between the highest temperature \nand the lowest temperature shall be as agreed between the \npurchaser and producer, except that during production heat \ntreatment no portion of the furnace shall be below the \nminimum specified temperature nor above the maximum \nspecified temperature for the grade being processed. \n5. Chemical Composition \n5.1 Chemical Analysis-Chemical analysis of materials \ncovered by this specification shall be in accordance with Test \nMethods A751. \n5.2 Heat Analysis-An analysis of each heat shall be made \nby the manufacturer to determine the percentages of the \nelements specified. The analysis shall be made from a test \nsample preferably taken during the pouring of the heat. When \ndrillings are used, they shall be taken not less than ¼ in. \n[6.4 mm] beneath the surface. The chemical composition thus \ndetermined shall be reported to the purchaser, or their \nrepresentative, and shall conform to the requirements in the \nindividual specification for the grade being poured. \n5.3 Product Analysis-A product analysis may be made by \nthe purchaser from material representing each heat, lot, or \ncasting. The analysis shall be made on representative material. \nDue to the possibility of decarburization, samples for carbon \nanalysis shall be taken no closer than ¼ in. [6.4 mm] to a cast \nsurface, except that castings too thin for this shall be analyzed \non representative material. The chemical composition thus \ndetermined shall meet the requirements specified in the appli­\ncable specification for the grade involved, or shall be subject to \nrejection by the purchaser, except that the chemical composi­\ntion determined for carbon and low-alloy steel and stainless \nsteel castings may vary from the specified limits by the \namounts shown in Table 1 and Table 2, respectively. The \nproduct analysis tolerances of Tables 1 and 2 are not applicable \nas acceptance criteria for heat analysis by the casting manu­\nfacturer. When comparing product and heat analysis for other \nthari carbon and low-alloy steels and stainless steels, the \nreproducibility data R 2 , in Test Methods E353 or E354, as \napplicable, shall be taken into consideration .. \n5.4 Unspecified Elements-When chemical analysis for el­\nements not specified for the grade ordered is desired, Supple­\nmentary Requirement S 1 may be specified. \n5.5 Grade Substitution-Grade substitution is not permitted. \nGrade substitution occurs when the material being supplied \ncontains one or more elements that are not specified for the \nsupplied material such that the material conforms to the \nrequirements of a different grade. \n5.6 Where more than one ladle is poured into a single \ncasting, the molten metal in each ladle must conform to the \nspecified chemical requirements. \n6. Mechanical Test Methods \n6.1 All mechanical tests shall be conducted in accordance \nwith Test Methods and Definitions A370. When material is \nTABLE 1 Product Analysis Tolerances - Carbon and Low-Alloy \nSteels \nElement RangeA Tolerances 8 • 0 over max or \nunder min, Limit, % \nCarbon (C) up to 0.65% 0.03 x % CL + 0.02 \nabove 0.65% 0.04% \nManganese (Mn) upto 1 % 0.08 x % Mnc + 0.01 \nabove 1 % 0.09 \nSilicon (Si) upto 0.60% 0.22 x % Sic - 0.01 \nabove 0.60 % 0.15% \nPhosphorus (P) all 0.13 x % Pc+ 0.005 \nSulfur (S) all 0.36 x % Sc+ 0.001 \nNickel (Ni) up to 2% 0.10 x % Nie + 0.03 \nabove 2% 0.25% \nChromium (Cr) upto 2% 0.07 x % Crc + 0.04 \nabove 2% 0.18% \nMolybdenum (Mo) upto 0.6% 0.04 x % Moc + 0.03 \nabove 0.6 % 0.06% \nVanadium (V) up to 0.25% 0.23 x % Ve+ 0.004 \nabove 0.25% 0.06% \nTungsten (W) upto0.10% 0.08 x % We+ 0.02 \nabove 0.10% 0.02% \nCopper (Cu) upto 0.15% 0.18 x % Cuc+ 0.02 \nabove 0.15 % 0.05% \nAluminum (Al) upto 0.03% 0.01 % \n0.03 to 0.10 %, incl. 0.08x % Al + 0.02 \nabove 0.10% 0.03% \nA The range denotes the composition limits up to which the tolerances are \ncomputed by the equation, and above which the tolerances are given by a \nconstant. \n8 The subscript L for the elements In each equation indicates that the limits of the \nelement specified by the applicable specification are to be inserted into the \nequation to calculate the tolerance for the upper limlt and the lower limit, if \napplicable, respectively. Examples of computing tolerances are presented In the \nfootnote C. \n0 To compute the tolerances, consider the manganese limits 0.50 - 80 % of Grade \nWC4 of Specification A217/A217M. In accordance with Table 1, the maximum \npermissible deviation of a product analysis below the lower limit 0.50 is 0.05 % = \n(0.08 x 0.50 + 0.01 ). The lowest acceptable product analysis of Grade WC4, \ntherefore, is 0.45 %. Similarly, the maximum permissible deviation above the \nupper limit of 0.80 % is 0.074 % = (0.08 x 0.80 + 0.01). The highest acceptable \nproduct analysis of Grade WC4, therefore, is 0.874. For Grade wee of Specifi­\ncation A216/A216M, the maximum manganese content is 1.40 % if the carbon \ncontent is 0.20 %. In this case, the highest acceptable product analysis is 1.49 = \n(1.40 + 0.09). \nordered to an M-suffix (SI units) standard, then in accordance \nwith Test Methods A1058. \n6.2 Choice of testing track from the options listed in Test \nMethods Al058 when material is ordered to an M-su:ffix (SI \nunits) product standard, should be identified by the purchaser \nin the ordering information. If the choice of test track is not \nspecified in the. order, then the default ASTM tr.ack shall be \nused as noted in Test Methods A1058. \n7. Tensile Requirements \n7 .1 One tension test shall be made from each heat, and shall \nconform to the tensile requirements specified. Test coupons \nshall be cast from the same heat as the castings represented, \nexcept that for investment castings, the test coupons shall be \ncast in the same type of mold as the castings. \n1154 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1240.json",
  "tabulaTablesCsv": "tables_tabula/page-1240.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1240.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5967,
  "bestTextAlphaRatio": 0.7102
}