{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 647,
  "globalPageIndex": 1445,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-941 \nor the ferrite grain size of the steel in the as-rolled or as-forged \ncondition. The prior austenitic grain size and the fen-itic grain size of \nas-rolled or as-forged steel products are controlled by the manufactur­\ning process and may be assisted by suitable chemistry. The appropriate \nmanufacturing process controls needed to meet the mechanical property \nrequirements of the specification in the asrolled or as-forged condition \nare neither defined nor implied by the inclusion of a fine grain practice \nrequirement. \nflame annealing, n-annealing in which the heat is applied \ndirectly by a flame. \nflame hardening, n-a process in which only the surface layer \nof a suitable steel object is heated by flame to above Ac 3 or \nAccm• and then the object is quenched. \nfog quenching, n-quenching in a mist. \nfull annealing, n-annealing a steel object by austenitizing it \nand then cooling it slowly through the transformation \nrange. \nD1scuss10N-The austenitizing temperature is usually above Ac 3 for \nhypoeutectoid steels and between Ac 1 and Accm for hypereutectoid \nsteels. \ngrain growth, n-an increase in the grain size of a steel object, \nusually as a result of exposure to elevated temperatures. \ngrain size, n-the dimensions of tl1e grains or crystals in a \npolycrystalline metal, exclusive of twinned regions and \nsubgrains when present. \nD1scuss10N-Grain size is usually estimated or measured on the \ncross section of ,m aggregate of grains, and designated by an ASTM \ngrain size number. (See Test Methods Ell2.) \ngraphitization annealing, n-annealing a steel object in such \na way that some or all of the carbon is precipitated as \ngraphite. \nhardenability, n-the property that determines the depth and \ndistribution of hardness induced by quenching a steel \nobject. \nhardening, n-increasing the hardness by suitable treatment, \nusually involving heating and cooling. \nD1scuss10N-Where applicable, it is preferred that the following \nmore specific terms be used: age hardening, case hardening, flame \nhardening, induction hardening, precipitation hardening, and \nquench hardening. \nheat, -n-a generic term denoting a specific lot of steel, based \nupon steelmaking and casting considerations. \nD1scussmN-Where it is necessary to be more definitive, the follow­\ning more specific terms are used: primary heat, multiple heat, and \nremelted heat. In product specifications, the term heat generally is \nused, without qualification, to mean the primary, multiple, or re­\nmelted heat, whichever is applicable. \nheat analysis, n-the chemical analysis determined by tl1e \nsteel producer as being representative of a specific heat of \nsteel. \nD1scuss10N-Where the analysis reported by the steel producer is not \nsufficiently complete for conformance with the heat analysis require­\nments of the applicable product specification to be fully assessed, the \nmanufacturer may complete the assessment of conformance with such \nheat analysis requirements by using a product analysis for the specified \nelements that were not reported by the steel producer, provided that \nproduct analysis tolerances are not applied and the heat analysis is not \naltered. \nheat number, n-the alpha, numeric, or alphanumeric desig­\nnator used to identify a specific heat of steel. \nheat treatment, n-heating and cooling a steel object in such \na way as to obtain desired conditions or properties. \nD1scuss10N-Heating for the sole purpose of hot working is excluded \nfrom the meaning of this definition. \nhigh-strength low-alloy steel, n-a steel, other than a carbon \nsteel or an interstitial-free steel, that conforms to a speci­\nfication that requires the minimum content for each specified \nalloying element to be lower tlmn the applicable limit in the \ndefinition for alloy steel, and the yield point or yield strength \nof the product to be at least 36 ksi or 250 MPa. \nhomogeneous carburizing, n-a process that converts a low­\ncarbon steel to one of substantially uniform and higher \ncarbon content throughout the section, so that a specific \nresponse to hardening may be obtained. \nhomogenizing, n-holding a steel object at high temperature to \neliminate or decrease chemical segregation by diffusion. \nhot-cold working, n-the mechanical deformation of auste­\nnitic and precipitation hardening steels at a temperature just \nbelow the recrystallization temperature to increase the \nyield strength and hardness by plastic deformation or pre­\ncipitation hardening effects induced by plastic deformation, \nor both. \nhot-finished, n-the condition of a product that has been \ncooled directly after the last hot-working operation, without \ncold-working (except for straightening or flattening), and \nindependent of the temperature at which hot-working was \ncompleted. \nD1scuss10N-The tolerances and surface finish of hot-finished prod­\nuct can be different from those of cold-finished, cold-drawn, or \ncold-rolled product. \nhot quenching, n-an imprecise term used to cover a variety \nof quenching procedures in which the quenching medium is \nmaintained at a prescribed temperature above 160 °F or \n70 °C. \nhot working, n-mechanical deformation of a metal at tem­\nperatures above its recrystallization temperature. \nimperfection, n-a material discontinuity or irregularity that is \ndetectable by inspection. \ninclusion shape control, n-the addition of elements during \nsteel making in order to affect the inclusion morphology. \ninduction hardening, n-in surface hardening, a process in \nwhich only the surface layer of a suitable steel object is \nheated by electrical induction to above Ac 3 or Ac 0 m, and then \nthe object is quenched. \ninduction hardening, n-in through hardening, a process in \nwhich a suitable steel object is heated by electrical induction \nto above Ac 3 or Ac 0 m throughout its section, and then the \nobject is quenched. \n1383 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1445.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5853,
  "bestTextAlphaRatio": 0.7963
}