{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 538,
  "globalPageIndex": 1336,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-788/SA-788M ASME BPVC.II.A-2025 \nA940/ A940M Specification for Vacuum Treated Steel \nForgings, Alloy, Differentially Heat Treated, for Turbine \nRotors \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA965/ A965M Specification for Steel Forgings, Austenitic, \nfor Pressure and High Temperature Parts \nA966/ A966M Practice for Magnetic Particle Examination of \nSteel Forgings Using Alternating Current \nA982/A982M Specification for Steel Forgings, Stainless, for \nCompressor and Turbine Airfoils \nA983/A983M Specification for Continuous Grain Flow \nForged Carbon and Alloy Steel Crankshafts for Medium \nSpeed Diesel Engines \nA986/A986M Specification for Magnetic Particle Examina­\ntion of Continuous Grain Flow Crankshaft Forgings \nA991/A991M Test Method for Conducting Temperature \nUniformity Surveys of Furnaces Used to Heat Treat Steel \nProducts \nA1021/A1021M Specification for Martensitic Stainless Steel \nForgings and Forging Stock for High-Temperature Service \nA1048/A1048M Specification for Pressure Vessel Forgings, \nAlloy Steel, Higher Strength Chromium-Molybdenum­\nTungsten for Elevated Temperature Service \nA1049/A1049M Specification for Stainless Steel Forgings, \nFerritic/Austenitic (Duplex), for Pressure Vessels and \nRelated Components \nA1058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nE23 Test Methods for Notched Bar Impact Testing of Me­\ntallic Materials \nEll2 Test Methods for Determining Average Grain Size \nE165/E165M Practice for Liquid Penetrant Examination for \nGeneral Industry \nE380 Practice for Use of the International System of Units \n(SI) (the Modernized Metric System) (Withdrawn 1997) \nE399 Test Method for Linear-Elastic Plane-Strain Fracture \nToughness Kic of Metallic Materials \nE428 Practice for Fabrication and Control of Metal, Other \nthan Aluminum, Reference Blocks Used in Ultrasonic \nTesting \nB1290 Test Method for Crack-Tip Opening Displacement \n(CTOD) Fracture Toughness Measurement (Withdrawn \n2013) \nB1820 Test Method for Measurement of Fracture Toughness \nB1916 Guide for Identification of Mixed Lots of Metals \n2.2 Other Standards: \nANSI/ASME B46.1 Surface Texture (Surface Roughness, \nWaviness and Lay) \nASME Boiler and Pressure Vessel Code \n3. Terminology \n3.1 Terminology A941 is applicable to this specification. \nAdditional terms and wording more applicable to forgings are \nas noted in this section. \n3.2 Forging Definitions: \n3.2.1 steel forging, n-the product of a substantially com­\npressive plastic working operation that consolidates the mate­\nrial and produces the desired shape. The plastic working may \nbe performed by a hammer, press, forging machine, or ring \nrolling machine, and must deform the material to produce an \nessentially wrought structure. \n3.2.1.1 Discussion-Hot rolling operations may be used to \nproduce blooms or billets for reforging. \n3.3 Forging Geometries: \n3.3.1 bar forging, n-forging that has no bore and having an \naxial length greater than its maximum cross sectional dimen­\nsion. \n3.3.1.1 Discussion-More than one cross sectional shape or \nsize may be included. Sometimes referred to as a solid forging. \n3.3.2 disk forging, n-forging, sometimes referred to as a \npancake forging, that has (a) an axial length appreciably less \nthan its diameter, (b) may be dished on one or both faces, and \n( c) final forging includes upsetting operations to reduce the \nheight of the stock and increase its diameter. \n3.3.2.1 Discussion-Since much of the hot working is done \nin axially compressing the stock, the central area may not \nreceive sufficient consolidation. To counter this effect, consid­\neration is usually given to the initial saddening (see 3.3.6) of \nthe ingot or billet. \n3.3.3 hollow forging, n-forging (also known as a shell \nforging or a mandrel forging) in which (a) the axial length is \nequal to or greater than the diameter, and (b) the forging length \nand wall thickness are produced by hot working over a mandrel \n(usually water cooled) such that the bore diameter remains \nessentially the same as that of the mandrel. \n3.3.3.1 Discussion-Unless a hollow ingot has been used, \nthe starting slug is hot trepanned or punched after upsetting and \nthe bore diameter adjusted to suit the forging mandrel. The \noutside diameter may be contoured if required. The workpiece \nis forged between the upper die and lower dies while the \nmandrel is supported by cranes or manipulators to facilitate \nrotation. \n3.3.4 ring forging, n-type of hollow forging in which (a) \nthe axial length is less than the diameter, (b) the wall thickness \nis reduced, and ( c) the outside diameter is increased by hot \nworking between the top die and a mandrel supported on \ntemporary saddles. \n3.3.4.1 Discussion-Forging between the top die and the \nmandrel enables the ring diameter to be increased while \nreducing the wall thickness, without increasing the axial \nlength. \n3.3.5 ring rolling, n-involves the use of specialized equip­\nment whereby a hot punched, trepanned, or bored disk is ( a) \nhot worked between a powered outer roller and an idling inner \nroller, such that the wall thickness is reduced and the outside \ndiameter is increased, and (b) the axial length of the ring is not \n1274 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1336.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5230,
  "bestTextAlphaRatio": 0.7662
}