{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 623,
  "globalPageIndex": 623,
  "width": 622.44,
  "height": 861.36,
  "text": "ASME BPVC.II.A-2025 SA-358/SA-358M \n8.1.4 Thickness-The minimum wall thickness at any point \nin the pipe shall not be more than 0.01 in. [0.3 mm] under the \nnominal thickness. \n9. Workmanship, Finish, and Appearance \n9.1 The finished pipe shall have a workmanlike finish. \n9.2 Repair of Plate Defects by Machining or Grinding-It is \npermitted to repair pipes showing slivers, or other smface \ndefects, by machining or grounding inside or outside to a depth \nthat ensures the removal of all included scale and slivers, \nprovided that the wall thickness is not reduced below the \nspecified minimum wall thickness. Machining or grinding shall \nfollow inspection of the pipe as rolled, and shall be followed by \nsupplementary visual inspection. \n9.3 Repair of Plate Defects by Welding-It is permitted to \nrepair by welding defects that violate minimum wall thickness, \nbut only with the approval of the purchaser. Areas shall be \nsuitably prepared for welding with tightly closed defects \nremoved by grinding. Open, clean defects, such as pits or \nimpressions, may require no preparation. All welders, welding \noperators, and weld procedures shall be qualified to the ASME \nBoiler and Pressure Vessel Code, Section IX. Unless the \npurchaser specifies otherwise, pipe required to be heat treated \nunder the provisions of 6.3, shall be heat treated or reheat \ntreated following repair welding. Repaired lengths, where \nrepair depth is greater than ¼ of the thickness, shall be pressure \ntested or repressure tested after repair and heat treatment (if \nany). Repair welds shall also be examined by suitable non­\ndestmctive examination techniques, including any techniques \nspecifically required of the primary weld. \n9 .4 The pipe shall be free of scale and contaminating iron \nparticles. Pickling, blasting, or surface finishing is not manda­\ntory when pipe is bright annealed. The purchaser is permitted \nto request that a passivating treatment be applied. \n10. Heat Analysis \n10.1 An analysis of each heat of steel shall be made by the \nplate manufacturer to determine the percentages of the ele­\nments prescribed in Specification A240/A240M. The chemical \ncomposition thus determined shall confonn to the requirements \nprescribed in Specification A240/A240M. \n11. Product Analysis \n11.1 For each lot of 500 ft [150 m] of pipe or fraction \nthereof, analysis shall be made by the manufacturer from the \nfinished pipe of the plate and of the weld deposit. Dtillings for \nanalysis may be taken from the mechanical test specimens. The \nresults of these analyses shall be reported to the purchaser or \nthe purchaser's representative, and shall conform to the re­\nquirements of Section 7, subject to the product analysis \ntolerances of Table 1 in Specification A480/ A480M. \n11.2 If the analysis of one of the tests specified in 9.1 does \nnot conform to the requirements specified in Section 7, \nanalyses shall be made on additional pipe of double the original \nnumber from the same lot, each of which shall conform to the \nrequirements specified. \n12. Tensile Requirements \n12.1 The plate used in making the pipe shall conform to the \nrequirements as to tensile properties of the applicable specifi­\ncations listed in Table 1. Tension tests made by the plate \nmanufacturer shall qualify the plate material. \n12.2 The transverse tension test taken across the welded \njoint specimen shall have a tensile strength not less than the \nspecified minimum tensile strength of the plate. \n13. Transverse Guided-Bend Weld Tests \n13.1 Two bend test specimens shall be taken transversely \nfrom the pipe. Except as provided in 13.2, one shall be subject \nto a face guided-bend test and the second to a root guided-bend \ntest. One specimen shall be bent with the inside smface of the \npipe against the plunger, and the other with the outside surface \nagainst the plunger. \n13.2 For wall thicknesses over 3/s in. [9.5 mm] but less than \n¾ in. [19 mm] side-bend tests may be made instead of the face \nand root-bend tests. For specified wall thicknesses ¾ in. [19 \nmm] and over, both specimens shall be subjected to the \nside-bend tests. Side-bend specimens shall be bent so that one \nof the side surfaces becomes the convex surface of the bend \nspecimen. \n13.3 The bend test shall be acceptable if no cracks or other \ndefects exceeding 1h in. [3 mm] in any direction is present in \nthe weld metal or between the weld and the pipe metal after \nbending. Cracks that originate along the edges of the specimen \nduring testing, and that are less than¼ in. [6.5 mm] measured \nin any direction shall not be considered. \n14. Test Specimens and Methods of Testing \n14.1 Transverse tension and bend test specimens shall be \ntaken from the end of the finished pipe; the transverse tension \nand bend test specimens shall be flattened cold before final \nmachining to size. \n14.2 As an alternative to the requirements of 14.1, it is \npermitted to take the test specimens from a test plate of the \nsame material as the pipe that is attached to the end of the \ncylinder and welded as a prolongation of the pipe longitudinal \nseam. \n14.3 Tension test specimens shall be made in accordance \nwith Section IX, Part QW, Paragraph QW-150 of the ASME \nBoiler and Pressure Vessel Code and shall be one of the types \nshown in QW-462.1 of that code. \n14.3.1 Reduced-section specimens conforming to the re­\nquirements given in QW-462.1 (b) may be used for tension tests \non all thicknesses of pipe having outside diameter greater than \n3 in. [76 mm]. \n14.3.2 Turned specimens conforming to the requirements of \nQW-462.l(d) may be used for tension tests. \n571 \n14.3.2.1 If turned specimens are used as given in 14.3.2.2 \nand 14.3.2.3, one complete set shall be made for each required \ntension test. \n14.3.2.2 For thicknesses to and including 1 ¼ in. [32 mm], it \nis permitted to use a single turned specimen. \n14.3.2.3 For thicknesses over 1 ¼ in. [32 mm], multiple \nspecimens shall be cut through the full thickness of the weld ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0623.json",
  "tabulaTablesCsv": "tables_tabula/page-0623.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0623.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5976,
  "bestTextAlphaRatio": 0.7565
}