{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 298,
  "globalPageIndex": 298,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-193/SA-193M ASME BPVC.II.A-2025 \nS14. Marking Coated Bolting Components \nS14.1 Bolting components coated with zinc shall have ZN \nmarked after the grade symbol. Bolting components coated \nwith cadmium shall have CD marked after the grade symbol. \nNorn S14.1-As an example, the marking for zinc-coated B7 will now \nbe B7ZN rather than B7*. \nSIS. Requirements for Service Temperature Exceeding \n1000°F \nS15.1 For bolting of Class 1 Grades B8, B8C, B8M, and \nB8T, to be used in service at temperatures exceeding 1000°F, \nthe following shall apply: \nS15.1.1 The minimum carbon content shall be 0.04 %. \nS15.1.2 Carbide solution treatment shall be between 1900°F \nand 1950°F followed by quenching in water or rapid cooling \nby other means. \nAPPENDIXES \n(Nonmandatory Information) \nXl. STRAIN HARDENING OF AUSTENITIC STEELS \nXl.1 Strain hardening is the increase in strength and hard­\nness that results from plastic deformation below the recrystal-. \nlization temperature (cold work). This effect is produced in \naustenitic stainless steels by reducing oversized bars or wire to \nthe desired final size by cold drawing or other process. The \ndegree of strain hardening achievable in any alloy is limited by \nits strain hardening characteristics. In addition, the amount of \nstrain hardening that can be produced is further limited by the \nvariables of the process, such as the total amount of cross­\nsection reduction, die angle, and bar size. In large diameter \nbars, for example, plastic deformation will occur principally in \nthe outer regions of the bar so that the increased strength and \nhardness due to strain hardening is achieved predominantly \nnear the surface of the bar. That is, the smaller the bar, the \ngreater the penetration of strain hardening. \nXl .2 Thus, the mechanical properties of a given strain \nhardened bolting component are dependent not just on the \nalloy, but also on the size of bar from which it is machined. The \nminimum bar size that can be used, however, is established by \nthe configuration of the component so that the configuration \ncan affect the strength of the componoent. \nXl.3 For example, a stud of a particular alloy and size may \nbe machined from a smaller diameter bar than a bolt of the \nsame alloy and size because a larger diameter bar is required to \naccommodate the head of the bolt. The stud, therefore, is likely \nto be stronger than the same size bolt in a given alloy. \nX2. COATINGS AND APPLICATION LIMITS \nX2.1 Use of coated bolting components at temperatures \nabove approximately one-half the melting point (Fahrenheit or \nCelsius) of the coating is not recommended unless consider­\nation is given to the potential for liquid and solid metal \nembrittlement, or both. The melting point of elemental zinc is \napproximately 780 °F [415 °C]. Therefore, application of \n246 \nzinc-coated bolting components should be limited to tempera­\ntures less than 390 °F [210 °C]. The melting point of cadmium \nis approximately 600 °F [320 °C]. Therefore, application of \ncadmium-coated bolting components should be limited to \ntemperatures less than 300 °F [160 °C]. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0298.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3106,
  "bestTextAlphaRatio": 0.7614
}