{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 95,
  "globalPageIndex": 893,
  "width": 621.72,
  "height": 799.2,
  "text": "ASME BPVC.II.A-2025 SA-480/SA-480M (ASTM A480/A480M) \nanother through the furnace. Interspersement of different melts is permis­\nsible if they are of approximately the same nominal thickness and are heat \ntreated in the same operating period and under the same conditions ( time \nand temperature). \n16.1.3 One intergranular corrosion test, when required, shall \nbe selected from each heat and thickness subjected to the same \nheat treatment practice. It is permitted to obtain such speci­\nmens from specimens selected for mechanical testing. \n17. Test Specimens \n17.1 Tension Test: \n17 .1.1 Tension test specimens shall be taken from finished \nmaterial and shall be selected in either or both longitudinal and \ntransverse direction. The tension test specimen shall conform \nto the appropriate sections of Test Methods and Definitions \nA370, unless otherwise specified in the applicable material \nspecification or agreed upon by the seller and the purchaser. \n17 .1.2 The testing speed between the yield strength and the \nfracture of the specimen, shall be conducted at a constant strain \nrate between 1/s in. and ½ in. [3.18 mm and 12.70 mm] \ninclusive, per in. [25.40 mm] of gauge length per minute, or at \na crosshead speed that will give a strain rate within this range. \nFor the purposes of this specification, the rate of strain shall be \ndetermined by a strain-rate pacer, indicator, or controller, or by \ndividing the unit elongation by the elapsed time from yield \nstrength to fracture. \n17.2 Hardness Test-It is permitted to perform hardness \ntests on the grip ends of the tension specimens before they are \nsubjected to the tension test. \n17.2.1 Unless otherwise specified in the purchase order, the \nmanufacturer may use an alternate hardness test procedure \nwhen material size or form dictates. Hardness conversion shall \nbe done using the applicable tables in Test Methods and \nDefinitions A370. When the material is too thin to allow \nhardness testing using any of the Rockwell superficial hardness \ntests, the hardness requirement is waived. \n17.3 Bend Test: \n17.3,1 Bend test specimens (when required) shall be taken \nfrom finished material and shall be selected in the transverse \ndirection or as indicated in the applicable material specification \nor as agreed upon by the seller and the purchaser. In the case \nof transverse bend test specimens, the axis of bend shall be \nparallel to the direction of rolling. \n17.3.2 Bend test specimens from sheet and strip product \nshall be the full thickness of the material and approximately \n1 in. [25.4 mm] in width. It is permitted to round the edges of \nthe test specimen to a radius equal to one half the specimen \nthickness. \n17.3.3 The width of strip for which bend tests can be made \nis subject to practical limitations on the length of the bend test \nspecimen. For narrow strip, the following widths can be tested: \nMinimum Strip Width \nStrip Thickness, in. [mm] and Minimum Specimen Length for \nBend Tests, in. [mm] \n0.100 [2.5] and under ½ [12.7] \nOver 0.100 to 0.140 [2.5 to 3.5], excl 1 [25.4] \n0.140 [3.5] and over 1 ½ [38.1] \nBend test specimens shall be of any suitable length over the \nspecified minimum length. \n17.3.4 Bend test specimens taken from plates shall be in full \nthickness of the material up to and including ½ in. [12.7 mm] \nin thickness, of suitable length, and between 1 in. and 2 in. \n[25.4 mm and 50.8 mm] in width. It is permitted to remove the \nsheared edges to a depth of at least 1/s in. [3.2 mm] and it is \npermitted to smooth the sides with a file. It is permitted to \nbreak the corners of the cross section of the specimen with a \nfile, but no appreciable rounding of the corners is permitted. \n17.3.5 In the case of plates over ½in. [12.7 mm] in \nthickness, it is permitted to use bend test specimens, machined \nto 1 in. [25.4 mm] nominal width by½ in. [12.7 mm] nominal \nthickness and at least 6 in. [152.4 mm] in length. One surface, \nto be the outside surface in bending, shall be the original \nsurface of the plate; however, surface preparation by light \ngrinding is permitted. It is permitted to round the edges to a \n1/16 in. [1.6 mm] radius. When agreed by the seller and the \npurchaser, it is permitted to modify the cross section to ½ in. \n[12.7 mm] nominal square. \n17.3.6 In the case of plates over 1 in. [25.4 mm] in \nthickness, bend tests must be agreed upon between the seller \nand the purchaser. \n17.3.7 The bend test specimen shall withstand cold bending \nthrough the angle specified in the applicable material specifi­\ncation without cracking on the outside of the bent portion. \n17.4 The bend shall be made over a diameter equal to the \nnumber of thicknesses of flat stock shown in the applicable \nmaterial specification or over a single piece of flat stock equal \nto the number of thicknesses shown in the applicable material \nspecification; or as follows: \n17.4.1 Material up to and including 3/s in. [9.5 mm] in \nthickness shall be bent over a piece ( or pieces) of flat stock that \nhas the same nominal thickness of the material being tested \n(1 T), allowing the test material to form its natural curvature. \n17.4.2 Material over 3 /s in. [9.5 mm] and up to and including \n1 in. [25.4 mm] in thickness shall be bent over a piece (or \npieces) of flat stock equalling two times the thickness of the \nmaterial being tested (2T), allowing the test material to form its \nnatural curvature. \n18. Special Tests \n18.1 If other tests are required, the methods and acceptance \ncriteria shall be agreed upon between the seller and the \npurchaser and specified on the purchase order. \n791 \n18.2 Resistance to Intergranular Corrosion: \n18.2.1 The intergranular corrosion test, Practice E of Prac­\ntices A262, is not required unless it is specified on the purchase \norder. All austenitic chromium-nickel types except the H types \nare expected to be capable of passing this test. However, it is \nnot necessary to actually run the test unless it is specified on the \npurchase order. Note that Practices A262 requires the test to be \nperformed on sensitized specimens in the low-carbon and \nstabilized types and on specimens representative of the as­\nshipped condition for other types. In the case of low-carbon \ntypes containing 3 % or more molybdenum in their specified \ncomposition, the applicability of the sensitizing treatment prior \nto testing shall be a matter for negotiation between the . seller \nand the purchaser. When specified, all flat rolled products of \nthe chromium-nickel series (300 series) in thickness up to and ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0893.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6540,
  "bestTextAlphaRatio": 0.7436
}