{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 395,
  "globalPageIndex": 1193,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-671/SA-671M (ASTM A671/A671M) \nif so required by the purchaser. The maximum acceptable \nhardness shall be as agreed upon between the manufacturer and \nthe purchaser. \nS3.2 As an alternative to the heat-affected zone hardness, by \nagreement between the manufacturer and purchaser, maximum \nheat-affected zone hardness may be specified for the procedure \ntest results. \nS4. Product Analysis \nS4.l Product analyses in accordance with 7.1 shall be made \non each 500 ft [150 m] of pipe or fraction thereof, or \nalternatively, on each length of pipe as designated in the order. \nS5. Metallography \nS5.1 The manufacturer shall furnish one photomicrograph \nto show the microstructure at 1 OOx magnification of the weld \nmetal or base metal of the pipe in the as-finished condition. The \npurchaser shall state in the order: the material, base metal or \nweld, and the number and locations of tests to be made. This \ntest is for information only. \nS6. Magnetic Particle Examination of Base Metal \nS6.1 All accessible surfaces of the pipe shall be examined in \naccordance with Guide E709. Accessible is defined as: All \noutside surfaces, all inside surfaces of pipe 24 in. [600 mm] in \ndiameter and greater, and inside surfaces of pipe less than 24 \nin. [600 mm] in diameter for a distance of 1 pipe diameter from \nthe ends. \nS6.2 Acceptance Standards-The following relevant indica­\ntions are unacceptable: \nS6.2.1 Any linear indications greater than 1/16 in. [1 mm] \nking for materials less than 5/s in. [16 mm] thick; greater than \nVs in. [3 mm] long for materials from 5/s in. [16 mm] thick to \nunder 2 in. [50 mm] thick; and greater than 3/16 in. [5 mm] long \nfor materials 2 in. [50 mm] thick or greater. \nS6.2.2 Rounded indications with dimensions greater than Vs \nin. [3 mm] for thicknesses less than 5/s in. [16 mm], and greater \nthan 3/16 in. [5 mm] for thicknesses 5/s in. [16 mm] and greater. \nS6.2.3 Four or more indications in any line separated by V16 \nin. [1 mm] or less edge-to-edge. \nS6.2.4 Ten or more indications in any 6 in.2 [39 cm 2 ] of \nsurface with the major dimension of this area not to exceed 6 \nin. [150 mm] when it is taken in the most unfavorable \norientation relative to the indications being evaluated. \nS7. Magnetic Particle Examination of Weld Metal \nS7 .1 All accessible welds shall be examined in accordance \nwith Guide E709. Accessible is defined as: All outside surfaces, \nall inside surfaces of pipe 24 in. [600 mm] in diameter and \ngreater, and inside surfaces of pipe less than 24 in. [600 mm] \nin diameter for a distance of one pipe diameter from the ends. \nS7 .2 Acceptance Criteria-The following relevant indica­\ntions are unacceptable: \nS7.2.1 Any cracks and linear indications. \nS7.2.2 Rounded indications with dimensions greater than \n3 /16 in. [5 mm]. \nS7.2.3 Four or more indications in any line separated by 1/16 \nin. [1 mm] or less edge-to-edge. \nS7 .2.4 Ten or more indications in any 6 in.2 [39 cm 2 ] of \nsurface with the major dimension of this area not to exceed 6 \nin. [150 mm] when it is taken in the most unfavorable \norientation relative to the indications being evaluated. \nSS. Liquid Penetrant Examination of Base Metal \nS8.1 All accessible surfaces of the pipe shall be examined in \naccordance with Test Method E165/E165M. Accessible is as \ndefined in S7 .1. \nS8.2 The acceptance criteria shall be in accordance with \nS6.2. \nS9. Liquid Penetrant Examination of Weld Metal \nS9.1 All accessible surfaces of the pipe shall be examined in \naccordance with Test Method E165/E165M. Accessible is as \ndefined in S7.1. \nS9.2 The acceptance criteria shall be in accordance with \nS7.2. \nSlO. Straight Beam Ultrasonic Examination of Flat \nPlate-UT 1 \nSl0.1 The plate shall be examined and accepted in accor­\ndance with Specification A435/A435M except that 100 % of \none surface shall be scanned by moving the search unit in \nparallel paths with not less than 10 % overlap. \nSU. Straight Beam Ultrasonic Examination of Flat \nPlate-UT 2 \nS 11.1 The plate shall be examined in accordance with \nSpecification A578/A578M except that 100 % of one surface \nshall be scanned and the acceptance criteria shall be as follows: \nS 11.1.1 Any area, where one or more discontinuities pro­\nduce a continuous total loss of back reflection accompanied by \ncontinuous indications on the same plane that cannot be \nencompassed within a circle whose diameter is 3 in. [76.2 mm] \nor one half of the plate thickness, whichever is greater, is \nunacceptable. \nS 11.1.2 In addition, two or more discontinuities on the same \nplane and having the same characteristics but smaller than \ndescribed above shall be unacceptable unless separated by a \nminimum distance equal to the largest diameter of the larger \ndiscontinuity or unless they may be collectively encompassed \nby the circle described above. \nS12. Angle Beam Ultrasonic Examination (Plate Less \nthan 2 in. [50 mm] Thick)-UT 3 \nSl2.1 The plate shall be examined in accordance with \nSpecification A577 / A577M except that the calibration notch \nshall be vee shaped and the acceptance criteria shall be as \nfollows: Any area showing one or more reflections producing \nindications whose amplitude exceeds that of the calibration \nnotch is unacceptable. \n. S13. Repair Welding \nSl3.l Repair of base metal defects by welding shall be done \nonly with customer approval. \n1103 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1193.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5366,
  "bestTextAlphaRatio": 0.7294
}