{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 654,
  "globalPageIndex": 654,
  "width": 612.6,
  "height": 853.8,
  "text": "SA-370 ASME BPVC.II.A-2025 \n18.3 Test Blocks-Machines should be checked to make \ncertain they are in good order by means of standardized \nRockwell test blocks. \n18 .4 Detailed Procedure-For detailed requirements of this \ntest, reference shall be made to the latest revision of Test \nMethods E18. \n19. Portable Hardness Test \n19.1 Although this standard generally prefers the use of \nfixed-location Brinell or Rockwell hardness test methods, it is \nnot always possible to perform the hardness test using such \nequipment due to the part size, location, or other logistical \nreasons. In this event, hardness testing using portable equip­\nment as desc1ibed in Test Methods A956/A956M, A1038, and \nEll0 shall be used with strict compliance for rep01ting the test \nresults in accordance with the selected standard (see examples \nbelow). \n19.1.1 Practice A833-The measured hardness number \nshall be reported in accordance with the standard methods and \ngiven the HBC designation followed by the comparative test \nbar hardness to indicate that it was determined by a portable \ncomparative hardness tester, as in the following example: \n19.1.1.1 232 HBC/240, where 232 is the hardness test result \nusing the portable comparative test method (HBC) and 240 is \nthe Brinell hardness of the comparative test bar. \n19.1.2 Test Method A956/A956M: \n19 .1.2.1 The measured hardness number shall be reported in \naccordance with the standard methods and appended with a \nLeeb impact device in parenthesis to indicate that it was \ndetermined by a portable hardness tester, as in the following \nexample: \n( 1) 350 HLD where 350 is the hardness test result using the \np01table Leeb hardness test method with the HLD impact \ndevice. \n19.1.2.2 When hardness values converted from the Leeb \nnumber are reported, the portable instrument used shall be \nreported in parentheses, for example: \n(1) 350 HB (HLD) where the original hardness test was \nperformed using the portable Leeb hardness test method with \nthe HLD impact device and converted to the Brinell hardness \nvalue (HB). \n19 .1.3 Test Method Al 038-The measured hardness number \nshall be reported in accordance with the standard methods and \nappended with UCI in parenthesis to indicate that it was \ndetermined by a portable hardness tester, as in the following \nexample: \n19.l.3.l 446 HV (UC!) 10 where 446 is the hardness test \nresult using the portable UCI test method under a force of \n10 kgf. \n19.1.4 Test Method Ell0-The measured hardness number \nshall be reported in accordance with the standard methods and \nappended with a IP to indicate that it was determined by a \nportable hardness tester, as follows: \n19.1.4.1 Rockwell Hardness Examples: \n( 1) 40 HRCIP where 40 is the hardness test result using the \nRockwell C portable test method. \n602 \n(2) 72 HRBWIP where 72 is the hardness test result using \nthe Rockwell B portable test method using a tungsten carbide \nball indenter. \n19.1.4.2 Brinell Hardness Examples: \n( 1) 220 HBWIP 10/3000 where 220 is the hardness test \nresult using the Brinell portable test method with a ball of \n10 mm diameter and with a test force of 3000 kgf (29.42 kN) \napplied for 10 to 15 s. \n(2) 350 HBW/P 5/750 where 350 is the hardness test result \nusing the Brinell portable test method with a ball of 5 mm \ndiameter and with a test force of 750 kgf (7.355 kN) applied for \n10 to 15 s. \nCHARPY IMPACT TESTING \n20. Summary \n20.1 A Charpy V-notch impact test is a dynamic test in \nwhich a notched specimen is struck and broken by a single \nblow in a specially designed testing machine. The measured \ntest values may be the energy absorbed, the percentage shear \nfracture, the lateral expansion opposite the notch, or a combi­\nnation thereof. \n20.2 Testing temperatures other than room (ambient) tem­\nperature often are specified in product or general requirement \nspecifications (hereinafter referred to as the specification). \nAlthough the testing temperature is sometimes related to the \nexpected service temperature, the two temperatures need not be \nidentical. \n21. Significance and Use \n21.1 Ductile Versus Brittle Behavior-Body-centered-cubic \nor ferritic alloys exhibit a significant transition in behavior \nwhen impact tested over a range of temperatures. At tempera­\ntures above transition, impact specimens fracture by a ductile \n(usually microvoid coalescence) mechanism, absorbing rela­\ntively large amounts of energy. At lower temperatures, they \nfracture in a brittle (usually cleavage) manner absorbing \nappreciably less energy. Within the transition range, the frac­\nture will generally be a mixture of areas of ductile fracture and \nbrittle fracture. \n21.2 The temperature range of tlle transition from one type \nof behavior to the other varies according to the material being \ntested. This transition behavior may be defined in various ways \nfor specification purposes. \n21.2.1 The specification may require a minimum test result \nfor absorbed energy, fracture appearance, lateral expansion, or \na combination thereof, at a specified test temperature. \n21.2.2 The specification may require the determination of \nthe transition temperature at which eitller the absorbed energy \nor fracture appearance attains a specified level when testing is \nperformed over a range of temperatures. Alternatively the \nspecification may require the detennination of tlle fracture \nappearance transition temperature (FATTn) as the temperature \nat which the required minimum percentage of shear fracture (n) \nis obtained. \n21.3 Further information on the significance of impact \ntesting appears in Annex AS. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0654.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5579,
  "bestTextAlphaRatio": 0.7575
}