{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 886,
  "globalPageIndex": 1684,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 \nnecessary to choose different temperature intervals in or­\nder to adequately reflect the evolution of the properties. \nIn such cases, the interval between successive test tem­\nperatures shall be chosen such that rupture lives do not \ndiffer by more than a factor of 10 at any given stress for \ntwo adjacent temperatures. Data to be reported include \nstress, temperature, time to rupture, and elongation. Re­\nduction of area shall also be reported, if feasible. \nPost-test metallographic evaluation shall be performed \non at least three test specimens including the longest­\nduration test samples at the time of submission of test \nsamples. The assessment should be done on actual test \nspecimens that were tested at temperatures within the \nrange between the minimum time-dependent tempera­\nture and the maximum intended use temperature. The as­\nsessment shall include macro-images to document the \noverall appearance (oxidation, necking, intergranular \nfracture, etc.), as well as micro-images to document the \nextent of cavitation damage and grain size. \nExcept as provided further below, the longest rupture \ntime at each test temperature shall be in excess of \n10,000 hr for each required heat. At least three additional \ntests shall be conducted for each required heat at each \ntest temperature, at stresses selected to provide shorter \nrupture times but at least 500 hr (e.g., 500 hr, 1,400 hr, \nand 4,000 hr). For precipitation-strengthened alloys, the \nshortest test duration considered in the allowable stress \nanalysis values is 1,000 hr. At successive temperatures, \ntwo or more tests should be conducted at nearly the same \nstress value. \nAlternative test plans that deviate from the prior de­\nscription but achieve the overall objective may be consid­\nered. This may, in particular, apply to solid solution alloys \nfor which the stability of strength-controlling microstruc­\ntures is certain. For precipitation-strengthened materials, \nan emphasis shall be placed on relevant test conditions \nsuitably below the yield strength. \nFor new materials for which the expectation of reason­\nable stability of strength-controlling microstructures is \nuncertain or suspect, and for extension of allowable \nstresses of more familiar classes of alloys into much high­\ner temperature applications where such stability might \ncome into question, creep-rupture data with duration of \nmore than 30,000 hr is required at ±50°F (±25°C) of the \nmaximum intended use temperature. This long-term da~ \ncan be supplemented with relevant or equivalent service \nexperience. A Code Case may be approved bas.ed on short­\ner duration test data, but inclusion of the material into \none of the sections of the BPV Code may be deferred until \nlonger-term creep-rupture data are available or until \nsufficient service experience is obtained to provide confi­\ndence that extrapolations from the existing database rea­\nsonably describe the long-term behavior of the material. \nFor at least two heats, strain-time plots or minimum \ncreep rate (MCR) data shall be provided for at least three \ntest stresses at each test temperature, including at least \none stress for each material resulting in MCR values be­\nlow 3x10- 4 %/hr. Creep rate data may be obtained from \ninstrumented stress-rupture tests or may be obtained on \nadditional test specimens. \nIV-1000 LOW-TEMPERATURE PROPERTIES \nIf use of the material below room temperature is con­\ntemplated, data should be provided at appropriate tem­\nperatures down to the lowest contemplated use \ntemperature. \nIV-1100 TOUGHNESS DATA \nToughness data shall be provided for materials for \nwhich Construction Code toughness rules would be ex­\npected to apply. The test requirements shall be as re­\nquired by the requested Construction Code(s). The data \nshall include test results for the intended lowest service \nmetal temperature and for the range of material thick­\nnesses desired. \nIV-1200 STRESS-STRAIN CURVES \nIf the material is to be used in components that operate \nunder compressive loads (e.g., external pressure), stress­\nstrain plots (tension or compression)shall be furnished \nfor each of the three heats of material at 100°F (50°C) in­\ntervals from room temperature up to 100°F (50°C) above \nthe maximum temperature desired. 1 Engineering stress­\nstrain data (stress versus strain) shall be provided in \nthe form of stress-strain plots and digitized data, from \nwhich the plots were derived, in tabular form up to \n1.2% strain. Digitized data shall be provided at intervals \nno greater than 0.01 % strain. In addition, the minimum \nyield strength,2 modulus of elasticity, 3 and proportional \nlimit, for materials where a proportional limit can be \nidentified, shall be reported for each temperature. The \nstress-strain plots (not load versus extension) shall be \ndetermined using a Class B-2 or better-accuracy extens­\nometer as defined in ASTM E83. The plots shall include \ngridlines with the units marked on the gridlines: for \nstrain, minor gridlines at intervals of 0.01% and major \n1 Since most materials are, in many applications, used in components that operate under compressive loads, the Committee recommends \nthat stress-strain plots as described above should always be included in the data package submitted in support of the application for any \nnew material. \n2 The term minimum yield strength, as used here, means the yield strength values that are derived from the analysis of the tensile data re­\nquired elsewhere in these Guidelines. \n3 Modulus of elasticity values shall be determined by dynamic methods such as ASTM Test Method E1876 (latest edition) or other interna-\ntional equivalent. • \n1630 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1684.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5672,
  "bestTextAlphaRatio": 0.7868
}