{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 686,
  "globalPageIndex": 1484,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-965/SA-965M ASME BPVC.II.A-2025 \nSpecification for \nSteel Forgings, Austenitic, for Pressure and High \nTemperature Parts \n1. Scope \n1.1 This specification covers austenitic stainless steel forg­\nings for boilers, pressure vessels, high temperature parts, and \nassociated equipment. \n1.2 Supplementary requirements are provided for use when \nadditional testing, inspection, or processing is required. In \naddition, supplementary requirements from Specification \nA788/A788M may be specified when appropriate. \n1.3 This specification includes the austenitic steel forgings \nthat were a part of Specification A336/A336M. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system are not necessarily exact equivalents; therefore, to \nensure conformance with the standard, each system shall be \nused independently of the other, and values from the two \nsystems shall not be combined. \n1.5 Unless the order specifies the applicable \"M\" specifica­\ntion designation, the material shall be furnished to the inch­\npound units. \n1.6 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA336/A336M Specification for Alloy Steel Forgings for \nPressure and High-Temperature Parts \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA745/A745M Practice for Ultrasonic Examination of Aus­\ntenitic Steel Forgings \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nA1058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nE112 Test Methods for Determining Average Grain Size \n2.2 Other Standards: \nASME Boiler and Pressure Vessel Code, including Section \nVID Pressure Vessels and Section IX \nA5.ll/A5.11M Specification for Nickel and Nickel-Alloy \nWelding Electrodes for Shielded Metal Arc Welding 4 \nA5.14/A5.14M Specification for Nickel and Nickel-Alloy \nBare Welding Electrodes and Rods \n3. Ordering Information and General Requirements \n3 .1 In addition to the ordering information required by \nSpecification A788/A788M, the intended use should be stated \nif 5.1 is to be applicable. \n3.2 Material supplied to this specification shall conform to \nthe requirements of Specification A788/A788M, which out­\nlines additional ordering information, manufacturing \nrequirements, testing and retesting methods and procedures, \n1426 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1484.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2981,
  "bestTextAlphaRatio": 0.7796
}