{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 330,
  "globalPageIndex": 1128,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-609 /SA-609M ASME BPVC.II.A-2025 \nSPECIFICATION FOR CASTINGS, CARBON, LOW­\nALLOY, AND MARTENSITIC STAINLESS STEEL, \nULTRASONIC EXAMINATION THEREOF \nSA-609 /SA-609M cO \nINT&RNATIONAL \nStandards Worldwide \n[Identical with ASTM Specification A 609/ A 609M-91(2007).] \n1. Scope \n1.1 This practice covers the standards and procedures \nfor the pulse-echo ultrasonic examination of heat-treated \ncarbon, low-alloy, and martensitic stainless steel castings \nby the longitudinal-beam technique. \n1.2 This practice is to be used whenever the inquiry, \ncontract, order, or specification states that castings are to \nbe subjected to ultrasonic examination in accordance with \nPractice A 609 / A 609M. \n1.3 This practice contains two procedures for ultrasonic \ninspection of carbon, low-alloy, and martensitic stainless \nsteel castings, that is, Procedure A and Procedure B. Proce­\ndure A is the original A 609 / A 609M practice and requires \ncalibration using a series of test blocks containing flat \nbottomed holes. It also provides supplementary require­\nments for angle beam testing. Procedure B requires calibra­\ntion using a back wall reflection from a series of solid \ncalibration blocks. \nNOTE 1 - illtrasonic examination and radiography are not directly \ncomparable. This examination technique is intended to complement Guide \nE 94 in the detection of discontinuities. \n1.4 The values stated in either inch-pound units or SI \nunits are to be regarded separately as standard. Within the \ntext, the SI units are shown in brackets. The values stated \nin each system are not exact equivalents; therefore, each \nsystem must be used independently of the other. Combining \nvalues from the two systems may result in nonconformance \nwith this practice. . \n1.5 This standard does not purport to address all of \nthe safety problems, if any, associated with its use. It is \nthe responsibility of the user of this standard to establish \nappropriate safety and health practices and determine the \napplicability of regulatory limitations prior to use. \n2. Referenced Documents \n2.1 ASTM Standards: \nA 217 / A 217M Specification for Steel Castings, Marten­\nsitic Stainless and Alloy, for Pressure-Containing Parts, \nSuitable for High-Temperature Service \nE 94 Guide for Radiographic Testing \nE 317 Practice for Evaluating Performance Characteristics \nof Ultrasonic; Pulse-Echo Testing Systems Without the \nUse of Electronic Measurement Instruments \n2.2 Other Document: \nSNT-TC-lA Recommended Practice for Nondestructive \nTesting Personnel Qualification and Certification \n3. Ordering Information \n3.1 The inquiry and order should specify which proce­\ndure is to be used. If a procedure is not specified, Procedure \nA shall be used. \n3.2 Procedure A - Flat-Bottomed Hole Calibration \nProcedure: \n3.2.1 When this practice is to be applied to an inquiry, \ncontract, or order, the purchaser shall furnish the following \ninformation: \n3.2.1.1 Quality levels for the entire casting or \nportions thereof. \n3.2.1.2 Sections of castings requiring longitudinal­\nbeam examination. \n3.2.1.3 Sections of castings requiring dual element \nexamination. \n3.2.1.4 Sections of castings requiring supplemen­\ntary examination, using the angle-beam procedure \ndescribed in Supplementary Requirement S 1 in order to \nachieve more complete examination. \n1034 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-1128.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3318,
  "bestTextAlphaRatio": 0.7709
}