{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 654,
  "globalPageIndex": 1452,
  "width": 613.92,
  "height": 793.2,
  "text": "SA·960/SA·960M ASME BPVC.II.A-2025 \nto the axial length of the fitting. Elbows, return bends, tees and \nheader tees shall not be machined directly from bar stock. \n6.3 Fittings, after forming at an elevated temperature, shall \nbe cooled to a temperature below the critical range under \nsuitable conditions to prevent injury by cooling too rapidly. \n6.4 All classes of fittings shall have the welders, welding \noperators, and welding procedures qualified under the provi­\nsion of Section IX of the ASME Boiler and Pressure Vessel \nCode except that welds from the original pipe manufacturer \nmade without the addition of filler metal do not require such \nqualification. \n7. Heat Treatment \n7 .1 Fittings requiring heat treatment shall be treated as \nspecified in the individual product specification using the \nfollowing procedures: \n7 .1.1 Annealing-Fittings shall be uniformly reheated to a \ntemperature above the transformation range and, after holding \nfor a sufficient time at this temperature, cooled slowly to a \ntemperature below the transformation range. \n7.1.2 Solution Annealing (or Solution Treat or Treatment)­\nFittings shall be heated to a temperature that causes the \ncarbides to go into solution and then quenched in water or \nrapidly cooled by other means to prevent reprecipitation. \n7.1.3 Isothermal Annealing-Isothermal annealing shall \nconsist of austenitizing a ferrous alloy and then cooling to and \nholding within the range of temperature at which the austenite \ntransforms to a relatively soft ferrite-carbide aggregate. \n7 .1.4 Normalizing-Fittings shall be uniformly reheated to a \ntemperature above the transformation range and subsequently \ncooled in air at room temperature. \n7.1.5 Tempering and Post-Weld Heat Treatment-Fittings \nshall be reheated to the prescribed temperature below the \ntransformation range, held at temperature for the greater of ½ \nh or 1 h/in. [25.4 mm] of thickness at the thickest section and \ncooled in still air. \n7.1.6 Stress Relieving-Fittings shall be uniformly heated to \nthe selected stress relieving temperature, held long enough to \nreduce stresses and then cooled at a rate that will result in the \nproperties required for the material grade and minimize the \ndevelopment of new residual stresses. The temperature shall \nnot vary from the selected temperature by more than ± 25 °F \n[± 14 °C]. \n7.1.7 Quench and Temper-Fittings shall be fully austen­\nitized and immediately quenched in a suitable liquid medium. \nThe quenched fittings shall be reheated to a minimum tempera­\nture of 1100 °F [590 °C] and cooled in still air. \n8. Chemical Requirements \n8.1 Chemical Analysis-Samples for chemical analysis and \nmethods of analysis shall be in accordance with Test Methods, \nPractices and Terminology A751 for Chemical Analysis of \nSteel Products. \n8.2 Heat Analysis-An analysis of each heat of steel shall be \nmade by the manufacturer to determine the percentages of \nthose elements specified in the individual product specification. \nIf secondary melting processes are employed, the heat analysis \nshall be obtained from one remelted ingot of each primary \nmelt. The chemical analysis thus determined shall conform to \nthe requirements of the individual product specification. Note \nthat the product analysis (check analysis) tolerances are not to \nbe applied to the heat analysis requirements. \n8.2.1 For steels ordered under product specifications refer­\nencing this specification of general requirements, the steel shall \nnot contain an unspecified element, other than nitrogen for \nstainless steels, for the ordered grade to the extent that the steel \nconforms to the requirements of another grade for which that \nelement is a specified element having a required minimum \ncontent. For this requirement, a grade is defined as an alloy \ndescribed individually and identified by its own UNS or grade \ndesignation in a table of chemical requirements within any \nspecification listed within the scope as being covered by this \nspecification. \n8.3 Product Analysis-If a product analysis is performed it \nshall be in accordance with Test Methods, Practices, and \nTerminology A751. The chemical composition thus determined \nshall conform to limits of the product specification, within the \npermissible variations of Table 1 of this specification. \n8.3.1 Limits on formula calculations involving elemental \ncontents shall apply only to the heat analysis, unless agreed \nupon between supplier and purchaser. Where limits on formula \ncalculations involving elemental contents apply to product \nanalysis by such agreement, permissible variations in the \nformula calculation results beyond the limits for the heat \nanalysis shall also be agreed upon between supplier and \npurchaser. Examples of such formula calculations include, but \nare not limited to, the following: carbon equivalent CE = C + \nMn/6 + (Cr + Mo + V) / 5 + (Ni + Cu) / 15; J factor= (Mn + \nSi) x (P + Sn) x 104; or requirements for specific elemental \nbalance or sufficiency, typically related to Ti, Nb, or Al and \ninterstitials C and N, such as Nb = 5 x C minimum. \n9. Mechanical Requirements \n9.I Method of Mechanical Test-All tests shall be con­\nducted in accordance with Test Methods and Definitions A370 \nif the inch-pound units are specified or Test Methods A1058 if \nthe M suffix (SI Units) standard is specified. \n9.2 The test specimen shall represent all material from the \nsame heat and heat treatment load whose maximum thick­\nnesses do not exceed the thickness of the test specimen or \nblank by more than ¼ in. [6 mm]. \n9.3 One tension test at room temperature shall be made in \naccordance with 9.2 from each heat in each heat treatment load. \n9.3.1 If heat treatment is performed in either a continuous or \nbatch type furnace controlled within ± 25 °F [ ± 14 °C] of the \nrequired heat treatment temperature and equipped with record­\ning pyrometers so that complete records of heat treatment are \navailable, and if the same heat treating cycles are used on the \nmaterial represented by the tension test, then one tension test \nfrom each heat shall be required, instead of one tension test \nfrom each heat in each heat treatment load in accordance with \n9.2. \n9.4 Retest-When a retest is permitted by the product \nspecification, it shall be performed on twice the number of \nrepresentative specimens that were originally nonconforming. \n1392 \n-~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1452.json",
  "tabulaTablesCsv": "tables_tabula/page-1452.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1452.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6378,
  "bestTextAlphaRatio": 0.7813
}