{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 682,
  "globalPageIndex": 682,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-370 ASME BPVC.II.A-2025 \nforgings and bars may receive during fabrication. The simu­\nlated heat treatment shall utilize temperatures, times, and \ncooling rates as specified on the order. The total time at \ntemperature( s) for the test material shall be at least 80 % of the \ntotal time at temperature(s) to which the forgings and bars are \nsubjected during postweld heat treatment. The total time at \ntemperature(s) for the test specimens may be performed in a \nsingle cycle. \nAl0.4.3.3 Prior to heat treatment in the simulator unit, test \nspecimens shall be machined to standard sizes that have been \ndetermined to allow adequately for subsequent removal of \ndecarb and oxidation. \nAl0.4.3.4 At least one thermocouple per specimen shall be \nused for continuous recording of temperature on an indepen­\ndent external temperature-monitoring source. Due to the sen­\nsitivity and design peculiarities of the heating chamber of \ncertain equipment, it is mandatory that the hot junctions of \ncontrol and monitoring thermocouples always be placed in the \nsame relative position with respect to the heating source \n(generally infrared lamps). \nAl0.4.3.5 Each individual specimen shall be identified, and \nsuch identification shall be clearly shown on the simulator \nchart and simulator cycle record. \nAl0.4.3.6 The simulator chart shall be compared to the \nmaster chart for accurate reproduction of simulated quench in \naccordance with Al0.4.3.2(a). If any one specimen is not heat \ntreated within the acceptable limits of temperature and time, \nsuch specimen shall be discarded and replaced by a newly \nmachined specimen. Documentation of such action and reasons \nfor deviation from the master chart shall be shown on the \nsimulator chart, and on the co1Tesponding nonconformance \nrepmi. \nAl0.4.4 Reheat Treatment and Retesting: \nAl0.4.4.1 In the event of a test failure, retesting shall be \nhandled in accordance with rules set forth by the material \nspecification. \nAl0.4.4.2 If retesting is permissible, a new test specimen \nshall be heat treated the same as previously. The production \nforging that it represents will have received the same heat \ntreatment. If the test passes, the forging shall be acceptable. If \nit fails, the forging shall be rejected or shall be subject to reheat \ntreatment if permissible. \nAl0.4.4.3 If reheat treatment is permissible, proceed as \nfollows: ( 1) Reheat treatment same as original heat treatment \n(time, temperature, cooling rate). Using new test specimens \nfrom an area as close as possible to the original specimens, \nrepeat the austenitize and quench cycles twice, followed by the \ntempering cycle (double quench and temper). The production \nforging shall be given the identical double quench and temper \nas its test specimens above. (2) Reheat treatment using a new \nheat treatment practice. Any change in time, temperature, or \ncooling rate shall constitute a new heat treatment practice. A \nnew master curve shall be produced and the simulation and \ntesting shall proceed as originally set forth. \n632 \nAl0.4.4.4 In summation, each test specimen and its corre­\nsponding forging shall receive identical heat treatment or heat \ntreatment; otherwise the testing shall be invalid. \nAl0.4.5 Storage, Recall, and Documentation of Heat-cycle \nSimulation Data-All records pertaining to heat-cycle simula­\ntion shall be maintained and held for a period of ten years or as \ndesigned by the customer. Information shall be so organized \nthat all practices can be verified by adequate documented \nrecords. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0682.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3537,
  "bestTextAlphaRatio": 0.7834
}