{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 779,
  "globalPageIndex": 1577,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-1011/SA-1011M (ASTM A1011/A1011M} \nX3. HARDNESS PROPERTIES \nX3.1 Table X3. l lists the typical hardness values. \nTABLE X3.1 Typical Hardness Values \nNorn 1-The hardness values shown are at the time of shipment. \nNorn 2-Tests for hardness shall be conducted in accordance with the \nrequirements of Test Methods EIS. \nNorn 3-The hardness values are Rockwell B scale as measured or \nconverted from the appropriate Rockwell scales. \nNorn 4-The typical hardness values apply to the full range of steel • \nsheet thickness. Hardness tends to increase as the steel sheet thickness \ndecreases. \nNorn 5-Hardness testing is commonly nsed to assess the relative \nfmmability of various designations of uncoated steel sheet. This assess­\nment done by many users is recognized to be only an approximation of the \nrelative formability and therefore cannot be used as a specification \nrequirement. \nDesignation \nCS Type A \nCS Type B \nCS Type C \nDS \nHardness-Rockwell B Scale \n75 or less \n75 or less \n75 or less \n65 or less \nSUMMARY OF CHANGES \nCommittee AO 1 has identified the location of selected changes to this standard since the last issue \n(AlOll/AlOllM- 18a) that may impact the use of this standard. (Approved May 1, 2023.) \n( 1) Removed titanium equation from Footnote C of Tables 1 \nand 2. \n(2) Relabeled Footnote J of Table 1 and Footnote G of Table 2 \nas Footnote C in Tables 1 and 2. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n1523 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1577.json",
  "tabulaTablesCsv": "tables_tabula/page-1577.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1577.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2941,
  "bestTextAlphaRatio": 0.7559,
  "camelotTablesPath": "camelot_tables/page-1577.json",
  "camelotTablesCsv": "camelot_tables/page-1577.csv",
  "camelotTableCount": 2
}