{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 124,
  "globalPageIndex": 124,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-20/SA-20M ASME BPVC.II.A-2025 \n5.5.1 Plates produced from coil shall not contain splice \nwelds, unless approved by the purchaser. \n6. Heat Treatment \n6.1 If plates are required to be heat treated, the heat \ntreatment shall be performed by the manufacturer, the \nprocessor, or the fabricator, unless otherwise specified in the \napplicable product specification. \n6.2 If the heat treatment required by the applicable product \nspecification is to be performed by the purchaser or the \npurchaser's agent, and the plates are to be supplied by the \nmanufacturer or processor in a condition other than that \nrequired by the applicable product specification, the order shall \nso state. \n6.2.1 If plates are ordered without the heat treatment re­\nquired by the applicable product specification, heat treatment \nof the plates to confonn to the requirements of the applicable \nproduct specification shall be the responsibility of the pur­\nchaser. \n6.3 If heat treatment is to be performed, the plates shall be \nheat treated as specified in the applicable product specification. \nThe purchaser may specify the heat treatment to be used, \nprovided it is not in conflict with the requirements of the \napplicable product specification. \n6.4 If normalizing is to be performed by the fabricator, the \nplates shall be either normalized or heated uniformly for hot \nforming, provided that the temperature to which the plates are \nheated for hot forming does not significantly exceed the \nnormalizing temperature, \n6.5 If no heat treatment is required, the manufacturer or \nprocessor shall have the option of heat treating the plates by \nnormalizing, stress relieving, or normalizing and then stress \nrelieving to meet the requirements of the applicable product \nspecification. \n6.6 If approved by the purchaser, cooling rates faster than \nthose obtained by cooling in air are permissible to achieve \nspecified mechanical properties, provided that the plates are \nsubsequently tempered in the temperature range from 1100 to \n1300°F [595 to 705°C]. \n7. Chemical Composition \n7.1 Heat Analysis: \n7.1.1 Sampling for chemical analysis and methods of analy­\nsis shall be in accordance with Test Methods, Practices, and \nTerminology A751. \n7.1.2 For each heat, the heat analysis shall include determi­\nnation of the content of carbon, manganese, phosphorus, sulfur, \nsilicon, nickel, chromium, molybdenum, copper, vanadium, \ncolumbium (niobium); any other element that is specified or \nrestricted by the applicable product specification for the \napplicable grade, class, and type; aluminum, if the aluminum \ncontent is to be used in place of austenitic grain size testing of \nthe heat (see 8.3.2.1); and any other austenitic grain refining \nelement for which limits are specified in the purchase order \n(see 8.3.2). \n7 .1.3 Heat analyses shall conform to the heat analysis \nrequirements of the applicable product specification for the \n72 \napplicable grade, class, and type. In addition, for elements that \nare listed in Table 1 but are not specified or restricted in the \napplicable product specification for the applicable grade, class, \nand type, heat analyses shall conform to the applicable heat \nanalysis limits given in Table 1. \n7.2 Product Analysis: \n7.2.1 Sampling for chemical analysis and methods of analy­\nsis shall be in accordance with Test Methods, Practices, and \nTerminology A751. \n7 .2.2 For each plate-as-rolled, the purchaser shall have the \noption of chemically analyzing a broken tension test specimen \nor a sample taken from the same relative location as that from \nwhich the tension test specimen was obtained. \n7.2.3 For elements that are specified or restricted by the \napplicable product specification for the applicable grade, class, \nand type, product analyses shall conform to the product \nanalysis requirements of the applicable product specification \nfor the applicable grade, class, and type. \n7.2.4 For elements that are listed in Table 1 but are not \nspecified or restricted by the applicable product specification \nTABLE 1 Limits on Elements (see 7.1.3 and 7.2.4) \nCopper, max %A Heat analysis 0.40 \nProduct analysis 0.43 \nNickel, max %A Heat analysis 0.40 \nProduct analysis 0.43 \nChromium, max %A,B Heat analysis 0.30 \nProduct analysis 0.34 \nMolybdenum, max %A.a Heat analysis 0.12 \nProduct analysis 0.13 \nVanadium, max %c Heat analysis 0.03 \nProduct analysis 0.04 \nColumbium (Niobium), 0 max %E Heat analysis 0.02 \nProduct analysis 0.03 \nTitanium, max %F Heat analysis 0,03 \nProduct analysis 0.04 \nBoron, max% Heat analysis 0,0010 \nProduct analysis 0.0015 \nA In addition for each heat, based upon the heat analysis, the sum of copper, \nnickel, chromium, and molybdenum shall not exceed 1.00 %, unless one or more \nof those elements are specified or restricted by the applicable product specification \nfor the applicable grade, class, and type. \n8 In addition for each heat, based upon the heat analysis, the sum of chromium \nand molybdenum shall not exceed 0.32 %, unless one or both of those elements \nare specified or restricted by the applicable product specification for the applicable \ngrade, class, and type. \nc By agreement between the purchaser and the supplier, the heat analysis limit for \nvanadium is permitted to be increased to a value not higher than 0.10 %, and the \nproduct analysis limit for vanadium is permitted to be increased to a value not \nhigher than 0.11 %. \n° Columbium and niobium are interchangeable names for the same element and \nboth names are acceptable for use in A01 specifications. \nE By agreement between the purchaser and the supplier, the heat analysis limit for \ncolumbium (niobium) is permitted to be increased to a value not higher that \n0.05 %, and the product analysis limit for columbium (niobium) is permitted to be \nincreased to a value not higher than 0.06 %. \nF By agreement between the purchaser and the supplier, the heat analysis limit for \ntitanium is permitted to be increased to a value not higher than 0.04 %, and the \nproduct analysis limit for titanium is permitted to be increased to a value not higher \nthan 0.05 %. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0124.json",
  "tabulaTablesCsv": "tables_tabula/page-0124.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0124.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6091,
  "bestTextAlphaRatio": 0.7624,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0124.txt",
  "gapOcrHighDpiLength": 6220,
  "camelotTablesPath": "camelot_tables/page-0124.json",
  "camelotTablesCsv": "camelot_tables/page-0124.csv",
  "camelotTableCount": 1
}