{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 215,
  "globalPageIndex": 1013,
  "width": 637.2,
  "height": 811.92,
  "text": "',s...... ____ __.... \nASME BPVC.II.A-2025 SA-540 /SA-540M \n5. Manufacture \n5.1 Bolting material shall be supplied hot-rolled or hot­\nforged or cold-finished at the option of the producer. However, \nif desired by the purchaser, cold finishing may be specified. \n6. Heat Treatment \n6.1 Bolting material ordered in the annealed condition shall \nhave a structure suitable for machining. Such annealed material \nis not intended to be used without subsequent quenching and \ntempering as specified in 6.2. \n6.2 Bolting material ordered in the liquid-quenched and \ntempered condition shall be uniformly reheated from a tem­\nperature below the cooling transformation range to the proper \naustenitizing temperature, quenched in a liquid medium under \nsubstantially uniform conditions, and then uniformly reheated \nfor tempering. The minimum tempering temperature shall be \n850 °P [455 °C]. \n6.3 Bolting material that has been straightened after quench­\ning and tempering shall be stress relieved by reheating to a \ntemperature not lower than 100 °P [55 °C] under the tempering \ntemperature. \n7. Chemical Composition \n7 .1 Steels used for bolting materials shall conform to the \nchemical requirements prescribed in Table 1. \n8. Tensile Requirements \n8.1 Bolting material furnished in the annealed condition \nshall be capable of meeting the specified tensile properties for \nthe class as specified in Table 2 when heat treated in accor­\ndance with 6.2 and 6.3 (see Supplementary Requirement S4). \n8.2 Bolting material in the quenched and tempered or \nquenched, tempered and stress-relieved condition shall con­\nform to properties shown in Table 2 for the specified class. \n9. Hardness Requirements \n9.1 The hardness shall be determined on the surface of the \nmaterial after removal of decarburization. \n9.2 The hardness of bolting material in the annealed condi­\ntion shall not be greater than 235 HBW. \n9.3 The hardness of bolting material in the quenched and \ntempered or quenched, tempered and stress-relieved condition \nshall be within the limits in Table 2 for the specified class. \n10. Impact Requirements \n10.1 Annealed bolting material after proper heat treatment \nshall be capable of meeting the impact requirements in Table 2 \nor of Supplementary Requirement S8, if so specified (see \nSupplementary Requirement S4). \n10.2 Bolting material in the quenched and tempered or \nquenched, tempered, and stress-relieved condition shall con­\nform to the impact requirements in Table 2, or of Supplemen­\ntary Requirement S8 if so specified. \n10.3 The percent of shear (ductility or fibrous) fracture shall \nbe computed. The computed value shall be recorded for all \nimpact specimens. \n10.4 The amount of lateral expansion shall be measured. \nThe measured value shall be recorded for all impact specimens. \n10.5 The percent shear and the amount of lateral expansion \nshall be reported for information purposes (see 16.1). \n11. Workmanship, Finish, and Appearance \n11.1 Bolting material shall be uniform in quality and free of \ndefects that would be detrimental to the intended service. If \nmagnetic particle inspection for such defects is desired, \nSupplementary Requirement S6 should be specified. \n11.2 Su,face Quality-Bolting material shall be free of \nseams, laps, cracks, or other defects that are not removable \nwithin the machining cleanup allowance specified in Table 3. \nTABLE 1 Chemical RequirementsA \nGrade B21 B22 B23 B24 B24V \nmbol (C- - (4142-H) (E-4340-H) (4340 Mod.) (4340V Mod.) \nChromium- Chromium- Chromium-Nickel- Chromium-Nickel- ro - • ke-\nMolybdenum- Molybdenum Molybdenum Molybdenum Molybdenum-\nVanadium Vanadium \nRange,% Product Range,% Product Range,% Product Range,% Product Product \nVariation, Variation, Variation, Variation, Variation, \nOver or Over or Over or Over or Over or \nUnder, 8 % Under, 8 % Under, 8 % Under, 8 % Under, 8 % \nCarbon 0.36-0.44 0.02 0.39--0.46 0.02 0.37--0.44 0.02 0.37--0.44 0.02 0.37-0.44 0.02 \nManganese 0.45-0.70 0.03 0.65-1.10 0.04 0.60--0.95 0.04 0.70-0.90 0.04 0.60-0.95 0.04 \nPhosphorus, max 0.025° 0.005 0.025° 0.005 0.025° 0.005 0.025° 0.005 0.025° 0.005 \nSulfur, max 0.025° 0.005 0.025° 0.005 0.025° 0.005 0.025° 0.005 0.025° 0.005 \nSilicon 0.15-0.35 0.02 0.15--0.35 0.02 0.15--0.35 0.02 0.15--0.35 0.02 0.15--0.35D 0.02 \nChromium 0.80-1.15 0.05 0.75-1.20 0.05 0.65-0.95 0.05 0.70--0.95 0.05 0.60--0.95 0.05 \nNickel 1.55-2.00 0.05 1.65-2.00 0.05 1.55-2.00 0.05 \nMolybdenum 0.50--0.65 0.03 0.15-0.25 0.02 0.20--0.30 0.02 0.30-0.40 0.02 0.40-0.60 0.03 \nVanadium 0.25--0.35 0.03 0.04--0.10 0.01 \nA The intentional addition of Bl, Se, Te, and Pb is not permitted. \n8 Unless otherwise specified, separate determinations may vary from the specified ranges, except that elements in any heat must not vary both above and below the \nspecified range. \n0 Phosphorus and sulfur content is 0.04 % max when open-hearth steel is specified. \n0 Silicon content Is 0.35 % max if vacuum-carbon deoxidized. \n913 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1013.json",
  "tabulaTablesCsv": "tables_tabula/page-1013.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1013.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4944,
  "bestTextAlphaRatio": 0.6644
}