{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 302,
  "globalPageIndex": 1100,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-568/SA-568M (ASTM A568/ A568M) ASME BPVC.II.A-2025 \nMINOR. STRAI!\\I, Pel'<:flnt (ei) \nFIG. X4.1 Forming Limit Curve \nthe forming limit curve is lower. The magnitude of the \ndowngrade displacement is specific to each material; therefore, \ncurrent material information should be consulted to determine \nplacement of the forming limit curve. \nX4.3 Procedure \nX4.3.l Obtain a sheet sample of \"known quality,\" the sheet \nquality being established by either supplier designation, con­\nsumer purchase order, or most preferred tensile data obtained \nfrom a companion sheet sample. \nX4.3.2 Obtain or prepare a negative on stencil with selected \ncircles in a uniform pattern. The circles may be 2.5 to 25.0 mm \nin diameter; the most convenient diameter is 5.0 mm because \nit is easy to read and the gauge spacing is short enough to show \nthe maximum strain in a specific location on the part. \nX4.3.3 The sheet metal blanks should be cleaned to remove \nexcess oil and dirt; however, some precoated sheets can be \netched without removing the coating. The area(s) to be etched \nshould be detem1ined from observation of panels previously \nformed; generally, the area that has a split problem is selected \nfor etching. Normally, the convex side of the radius is gridded. \nIf sufficient time is available, the entire blank may be etched, \nsince valuable information can be obtained about the move­\nment of metal in stamping a part when strains can be evaluated \nin what may appear to be noncritical areas. Additionally, for \ncomplex shapes it may be desirable to etch both surfaces of \nblanks so that the strains that occur in reverse draws can be \ndetermined. \nX4.3.4 The sheet metal blanks may be etched by a photo­\ngraphic or electrochemical method. In the former method of \nphotosensitive solution, for example, 50 % Kodak Photo Resist \n(KPR) emulsion and 50 % KPR-thinner, is sprayed onto the \nsheet. The emulsion is dried by baking the sheet at 65 °C for \n15 min or by just standing it for several hours at room \ntemperature in a dark room. The latter should be employed in \nmaterials that age and, hence, become stronger when baked at \n65 °C. The negative is placed on the emulsion, held intimately \nin contact with the sheet, and exposed to a strong ultraviolet \nlight source for 1 to 1 ½ min. The sheet is developed for 30 to \n45 s in KPR developer, rinsed with water, and sprayed with \nalcohol to set the resist. It is again rinsed with water and then \nsprayed with KPR black dye to reveal the etched circles. \nX4.3.5 In the electrochemical method, the etch pad is \nsaturated with an appropriate electrolyte. Various electrolytes \nare available from suppliers of the etching equipment. Some \nelectrolytes are more effective than others for etching certain \nsurfaces, such as terne plate and other metallic coated steels. A \nmst-inhibiting solution is preferred for steel sheets. \nX4.3.6 A ground clamp for the transformer of suitable \namperage (10 to 50 A is usually used) is fastened to the blank \n1002 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1100.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3002,
  "bestTextAlphaRatio": 0.7625
}