{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 470,
  "globalPageIndex": 1268,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-727 /SA-727M ASME BPVC.II.A-2025 \nSpecification for \nCarbon Steel Forgings for Piping Components with Inherent \nNotch Toughness \n1. Scope \n1.1 This specification covers forged carbon steel piping \ncomponents intended primarily for service in pressure piping \nsystems from -20 to +650 °F [-30 to +345 °C] where inherent \nnotch toughness is desired, but where notch toughness testing \nis not required. Included are forged or ring-rolled flanges, \nforged fittings, and valves made to specified dimensions, or to \ndimensional standards such as the ASME and API specifica­\ntions referenced in Section 2. \n1.2 This specification is limited to forgings with maximum \nfinished section thicknesses no larger than 2 in. [51 mm]. \n1.3 It shall be the responsibility of the purchaser to deter­\nmine whether material meeting the requirements of this speci­\nfication is satisfactory for the service application. \n1.4 Supplementary requirements are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified by the purchaser in the order. \nNOTE 1-There are no provisions for impact testing in this specifica­\ntion. When impact testing is required, refer to Specification A350/A350M. \n1.5 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the mate­\nrial shall be furnished to inch-pound units. \n1.6 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard-\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 In addition to those reference documents listed in \nSpecification A961/A961M, the following list of standards \napply to this specification. \n2.2 ASTM Standards: \nA350/A350M Specification for Carbon and Low-Alloy Steel \nForgings, Requiring Notch Toughness Testing for Piping \nComponents \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nA961/A961M Specification for Common Requirements for \nSteel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \nE59 Practice for Sampling Steel and Iron for Determination \nof Chemical Composition (Withdrawn 1996) \n2.3 ASME Boiler and Pressure Vessel Codes: \nSection II, Material Specifications, Part C \nSPA 5.5 Low-Alloy Steel Covered Arc-Welding Electrodes \nB 16.5 Steel Pipe Flanges and Flanged Fittings \nB 16.10 Face-to-Face and End-to-End Dimensions of Fer-\nrous Valves \nB 16.11 Forged Steel Fittings, Socket-Welding and Threaded \nB 16.30 Unfired Pressure Vessel Flange Dimensions \n2.4 API Standards: \n600 Steel Gate Valves with Flanged or Butt-Welding Ends \n602 Compact Design Carbon Steel Gate Valves for Refinery \nUse \n1188 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-1268.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3294,
  "bestTextAlphaRatio": 0.7702
}