{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 539,
  "globalPageIndex": 1337,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-788/SA-788M \nintended to increase and may be contained by a radially \noriented tapered roller. \n3.3.6 saddening, n-term used in the open die forging \nindustry to describe the initial hot working of an ingot for \nsurface compaction and flute working surface prior to full \nworking of the ingot cross section. \n3.3.6.1 Discussion-The term is also extended to initial hot \nworking intended to give consolidation of ingot central areas \nprior to upsetting when making products such as turbine and \ngenerator rotors and tube sheets. \n3.3.7 slab forging, n-forging, sometimes referred to as a \nforged plate, that is usually square or rectangular in shape, with \na thickness appreciably smaller than the other dimension. The \nhot working may include upsetting. \n3.4 billets and blooms, n-interchangeable terms represent­\ning hot-worked semi-finished product intended as a starting \nstock for making forgings. \n3.4.1 Discussion-No size limitations are assumed for ei­\nther term. Cast shapes produced by a continuous casting \nprocess, without subsequent work, are considered to be ingots \nfor the purposes of this specification, and if supplied as billets \nor blooms must carry the descriptor Cast Billet or Cast Bloom. \n3.5 Definitions of Terms Specific to This Standard: \n3.5.1 bottom pouring, n-steel from a single heat, or from a \nmultiple heat tapped into a common ladle (see 8.1.1 and 8.1.2), \nintroduced into ingot mold(s) such that they are filled from the \nbottom up. One or more molds can be set up on an individual \nplate, and more than one plate may be poured in sequence from \na heat. \n3.5.2 ingot, n-the product obtained when molten steel, \nupon being cast into a mold, is subsequently capable of being \nwrought in conformance with 3.1. Open-ended molds, which \nare usually cooled and used, for example, in the continuous \ncasting of steel, are considered to be included in this definition. \n3.5.3 intercritical heat treatment, n-use of a multi-stage \nheat treatment procedure in which the material is first austen­\nitized at a temperature above the upper critical temperature \n(Ac3) followed by cooling below the lower critical temperature \n(Acl). The material is then reheated to a temperature in the \nintercritical range between the Acl and the Ac3 and again \ncooled below the Ac 1, followed by subcritical tempering in the \nrange specified in the material specification. \n3.5.3.1 Discussion-This procedure is generally applicable \nto low hardenability carbon and low alloy steels that would \nusually have a microstructure of ferrite and pearlite in the heat \ntreated section size of the component being heat treated. \n3.5.4 precipitation deoxidation, n-steelmaking process in \nwhich primary deoxidation is achieved by the addition of \nstrong deoxidizing agents, such as aluminum, early in the \nprocess, and holding the steel in the molten state for sufficient \ntime for the products of deoxidation to separate from the melt \nto the slag. \n3.5.5 sequential or continuous strand casting, n-steel from \nseveral heats poured consecutively into a cooled open-ended \nmold to form a continuous cast product with a change from \nheat to heat along its length (see 8.1.5). \n3.5.6 strand casting, n-steel from one heat poured into a \ncooled open-ended mold to form a continuous strand or \nstrands. \n3.5.7 vacuum carbon deoxidation (VCD), n-steelmaking \nprocess in which primary deoxidation occurs during vacuum \ntreatment as a result of the carbon-oxygen reaction. In order for \nprimary deoxidation to occur during vacuum treatment, deoxi­\ndizing agents such as aluminum or silicon are not to be added \nto the melt in any significant amount prior to the vacuum \ntreatment operation. \n4. Ordering Information \n4.1 It shall be the responsibility of the purchaser to specify \nall requirements that are necessary for forgings under the \napplicable product specification. Such requirements to be \nconsidered include, but are not restricted to, the following: \n4.1.1 Quantity, \n4.1.2 Dimensions, including tolerances and surface finishes. \n4.1.3 Specification number with type, class, and grade as \napplicable (including year date), and should include: \n4.1.4 Number of copies of the material test report. \n4.1.5 Choice of testing track from the options listed in Test \nMethods A1058 when forgings are ordered to a suffix M \nproduct standard. If the choice of test track is not made in the \nordering information then the default ASTM track shall be used \nas noted in Test Methods A1058. \n4.2 Additional information including the following may be \nadded by agreement with the supplier: \n4.2.1 Type of heat treatment when alternative methods are \nallowed by the product specification, \n4.2.2 Supplementary requirements, if any, and \n4.2.3 Additional requirements (see 1.4, 16.1.5, and 16.1.6). \n4.2.4 Repair welding NOT permitted. \n4.3 For dual format specifications, unless otherwise \nspecified, the inch-pound units shall be used. \n5. Melting Process \n5.1 Unless otherwise specified in the product specification, \nthe steel shall be produced by any of the following primary \nprocesses: electric-furnace, basic oxygen, vacuum-induction \n(VIM), or open-hearth. The primary melting may incorporate \nseparate degassing or refining and may be followed by second­\nary melting, using electro slag remelting (ESR) or vacuum arc \nremelting (VAR). \n5.1.1 The steel shall be fully killed. \n5.2 The molten steel may be vacuum-treated prior to or \nduring pouring of the ingot. \n5.2.1 When vacuum treatment of the molten steel is re­\nquired by the product specification the following conditions \nshall apply: \n5.2.1.1 When the vacuum stream degassing process is used, \nthe vacuum system must be of sufficient capacity to effect a \nblank-off pressure low enough (usually less than 1000 µm) to \nbreak up the normal tight, rope-like stream of molten metal \ninto a wide-angled conical stream of relatively small droplets. \n1275 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1337.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5925,
  "bestTextAlphaRatio": 0.7674
}