{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 197,
  "globalPageIndex": 995,
  "width": 632.52,
  "height": 808.08,
  "text": "ASME BPVC.II.A-2025 SA-530/SA-530M \nA660/ A660M Specification for Centrifugally Cast Carbon \nSteel Pipe for High-Temperature Service \nA671/A671M Specification for Electric-Fusion-Welded \nSteel Pipe for Atmospheric and Lower Temperatures \nA672/A672M Specification for Electric-Fusion-Welded \nSteel Pipe for High-Pressure Service at Moderate Tem­\nperatures \nA691/A691M Specification for Carbon and Alloy Steel Pipe, \nElectric-Fusion-Welded for High-Pressure Service at High \nTemperatures \nA 700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA1058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nD3951 Practice for Commercial Packaging \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \n2.2 ASME Standards: \nB36.10 Welded and Seamless Wrought Steel Pipe \nB36.19 4 Stainless Steel Pipe \n2.3 Military Standards: \nMIL-STD-163 Steel Mill Products Preparation for Ship­\nment and Storage \nMIL-STD-271 Nondestructive Testing Requirements for \nMetals 5 \nMIL-STD- 792 Identification Marking Requirements for \nSpecial Purpose Components \n2.4 Federal Standards: \nFed. Std. No. 183 Continuous Identification Marking of Iron \nand Steel Products \n2.5 Steel Structures Painting Council: \nSSPC-SP 6 Surface Preparation Specification No. 6 Com­\nmercial Blast Cleaning \n3. Terminology \n4. Ordering Information \n4.1 It shall be the responsibility of the purchaser to specify \nall requirements necessary for product under this specification. \nSuch requirements to be considered include, but are not limited \nto, the following: \n4.1.1 Quantity (feet, meters, or number of lengths), \n4.1.2 Specification number with grade or class, or both, as \napplicable and year date, \n4.1.3 Manufacture (hot-finished or cold drawn), \n4.1.4 Size (NPS [DN] and weight class or schedule number, \nor both; outside diameter and nominal wall thickness; or inside \ndiameter and nominal wall thickness), \n4.1.5 Length (specific or random), \n4.1.6 Choice of testing track from the options listed in Test \nMethods A1058 when material is ordered to an M suffix (SI \nunits) product standard. If the choice of test track is not \nspecified in the order, then the default ASTM test track shall be \nused as noted in Test Methods A1058, \n4.1.7 Supplementary Requirements, and \n4.1.8 Additional requirements. \n5. Process \n5.1 The steel shall be made from any process. \n5.2 If a specific type of melting is required by the purchaser, \nit shall be stated on the purchase order. \n5.3 The primary melting may incorporate separate degas­\nsing or refining and may be followed by secondary melting, \nusing electroslag remelting or vacuum remelting. \n5.4 Steel may be cast in ingots or may be strand cast. When \nsteel of different grades is sequentially strand cast, identifica­\ntion of the resultant transition material is required. The \nproducer shall remove the transition material by an established \nprocedure that positively separates the grades. \n6. Chemical Composition \n6.1 Chemical Analysis-Samples for chemical analysis and \nmethod of analysis shall be in accordance with Test Methods, \nPractices, and Terminology A751. \n--~- ~~ 3.1 Definitionds ohif Terms ~pecific t~ This Stlat_ndard~, ~·f th 6.2 Heat Analysis-If the heat analysis reported_ by the steel - --~-3 1 -1-renrelte - eaf,---n-m-s@GGnciar-y-me mg,__au____Q,~_e __ ~~ . •th h \n• • • d. f • 1 • h 1 prooucer is not sufftci:ently-complete-fo1~e0nfoi-manGe-w-1 . _t . e_~--~-mgots remelte rom a smg e pnmary ea . . . . • d ·fi _ _ heat analysis reqmrements of the applicable pro uct speci ca-\n3.1.2 jointer, n-a Ieng~ of pipe created by weldmg two or tion to be fully assessed, the manufacturer may complete the \nmore shorter lengths of pipe, end-to-end. assessment of conformance with such heat analysis require-\n3.1.3 thin-wall pipe, n-a pipe having a wall thickness of ments by using a product analysis for the specified elements \n3 % or less of the outside diameter. that were not reported by the steel producer, provided that \n3.2 Other defined terms-The definitions in Test Methods produ~t _analysis tolerances are not applied and the heat \nand Definitions A370, Test Methods, Practices, and Terminal- analysis is not altered. . . \ny A751 and Terminology A941 are applicable to this 6.2.1 For steels ordered under product specifications refer-\nog \"fi t· ' d t th 1· t d • 1 5 encing this specification of general requirements, the steel shall speci ca 1011 an o ose is e 111 • • d h \nnot contain an unspecified element for the ordered gra e to t e \n895 \nextent that the steel conforms to the requirements of another \ngrade for which that element is a specified element having a \nrequired minimum content. For this requirement, a grade is \ndefined as an alloy described individually and identified by its \nown UNS designation in a table of chemical requirements \nwithin any specification listed within the scope as being \ncovered by this specification. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0995.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5144,
  "bestTextAlphaRatio": 0.7467
}