{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 726,
  "globalPageIndex": 1524,
  "width": 613.92,
  "height": 793.2,
  "text": "SA·989/SA-989M ASME BPVC.II.A-2025 \nSpecification for \nHot lsostatically-Pressed Alloy Steel Flanges, Fittings, \nValves, and Parts for High Temperature Service \n1. Scope \n1. 1 This specification covers hot isostatically-pressed, pow­\nder metallurgy, alloy steel piping components for use in \npressure systems. Included are flanges, fittings, valves, and \nsimilar parts made to specified dimensions or to dimensional \nstandards, such as in ASME Specification B16.5. \n1.2 Several grades of alloy steels are included in this \nspecification. \n1.3 Supplementary requirements are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified individually by the purchaser in the order. \n1.4 This specification is expressed in both inch-pound units \nand in SI units. Unless the order specifies the applicable \"M\" \nspecification designation (SI units), however, the material shall \nbe furnished to inch-pound units. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as the standard. Within the text, \nthe SI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.6 The following safety hazards caveat pertains only to test \nmethods portions, 8.1, 8.2, and 9.5 - 9.7 of this specification: \nThis standard does not purport to address all of the safety \nconcerns, if any, associated with its use. It is the responsibility \nof the user of this standard to establish appropriate safety, \nhealth, and environmental practices and to determine the \napplicability of regulatory limitations prior to use. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom-\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA961/A961M Specification for Common Requirements for \nSteel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \nB311 Test Method for Density of Powder Metallurgy (PM) \nMaterials Containing Less Than Two Percent Porosity \nE165/E165M Practice for Liquid Penetrant Examination for \nGeneral Industry \nE340 Practice for Macroetching Metals and Alloys \nE606/E606M Test Method for Strain-Controlled Fatigue \nTesting \n2.2 MSS Standard: \nSP 25 Standard Marking System for Valves, Fittings, \nFlanges, and Unions \n2.3 ASME Specifications and Boiler and Pressure Vessel \nCodes: \nB16.5 Dimensional Standards for Steel Pipe Flanges and \nFlanged Fittings \n2.4 ASME Section IX Welding Qualifications: \nSFA-5.5 Specification for Low~Alloy Steel Covered Arc­\nWelding Electrodes \n3. Terminology \n3 .1 Definitions of Terms Specific to This Standard: \n1470 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1524.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3168,
  "bestTextAlphaRatio": 0.7765
}