{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 58,
  "globalPageIndex": 58,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \ndimensions (thickness, width, and length) do not take into \naccount current production and processing capabilities. To \nqualify any product to a particular product specification re­\nquires all appropriate and necessary tests be performed and that \nthe results meet the limits prescribed in that product specifi­\ncation. If the necessary tests required by a product specification \ncannot be conducted, the product cannot be qualified to that \nspecification. This general requirement standard contains per­\nmitted variations for the commonly available sizes. Permitted \nvariations for other sizes are subject to agreement between the \ncustomer and the manufacturer or processor, whichever is \napplicable. \n3.1.1.4 Slabs, sheet bars, and skelp, though frequently \nfalling in the foregoing size ranges, are not classed as plates. \n3.1.1.5 Coils are excluded from qualification to the appli­\ncable product specification until they are decoiled, leveled or \nstraightened, formed (if applicable), cut to length, and, if \nrequired, properly tested by the processor in accordance with \nASTM specification requirements (see Sections 9-15, 18, and \n19 and the applicable product specification). \n3.1.2 Shapes (Flanged Sections): \n3.1.2.1 structural-size shapes-rolled :flanged sections hav­\ning at least one dimension of the cross section 3 in. [75 mm] or \ngreater. \n3.1.2.2 bar-size shapes-rolled flanged sections having a \nmaximum dimension of the cross section less than 3 in. [75 \nmm]. \n3.1.2.3 \"W\" shapes-doubly-symmetric, wide-flange \nshapes with inside flange surfaces that are substantially paral­\nlel. \n3.1.2.4 \"HP\" shapes-are wide-flange shapes generally \nused as bearing piles whose flanges and webs are of the same \nnominal thickness and whose depth and width are essentially \nthe same. \n3.1.2.5 \"S\" shapes-<loubly-symmetric beam shapes with \ninside flange surfaces that have a slope of approximately \n162/3%. \n3.1.2.6 \"M\" shapes-doubly-symmetric shapes that cannot \nbe classified as \"W,\" \"S,\" or \"HP\" shapes. \n3.1.2.7 \"C\" shapes-channels with inside flange surfaces \nthat have a slope of approximately 16 2/3 %. \n3.1.2.8 \"MC\" shapes-channels that cannot be classified as \n\"C\" shapes. \n3.1.2.9 \"L\" shapes-shapes having equal-leg and unequal­\nleg angles. \n3.1.3 sheet piling~rolled steel sections that are capable of \nbeing interlocked, forming a continuous wall when individual \npieces are driven side by side. \n3.1.4 bars-rounds, squares, and hexagons, of all sizes; flats \n13 /64 in. (0.203 in.) and over [over 5 mm] in specified thickness, \nnot over 6 in. [150 mm] in specified width; and flats 0.230 in. \nand over [over 6 mm] in specified thickness, over 6 to 8 in. \n[150 to 200 mm] inclusive, in specified width. \n3.1.5 exclusive-when used in relation to ranges, as for \nranges of thickness in the tables of permissible variations in \ndimensions, is intended to exclude only the greater value of the \n6 \nrange. Thus, a range from 60 to 72 in. [1500 to 1800 mm] \nexclusive includes 60 in. [1500 mm], but does not include 72 \nin. [1800 mm]. \n3.1.6 rimmed steel-steel containing sufficient oxygen to \ngive a continuous evolution of carbon monoxide during \nsolidification, resulting in a case or rim of metal virtually free \nof voids. \n3.1.7 semi-killed steel-incompletely deoxidized steel con­\ntaining sufficient oxygen to form enough carbon monoxide \nduring solidification to offset solidification shrinkage. \n3.1.8 capped steel-rimmed steel in which the rimming \naction is limited by an early capping operation. Capping is \ncarried out mechanically by using a heavy metal cap on a \nbottle-top mold or chemically by an addition of aluminum or \nferrosilicon to the top of the molten steel in an open-top mold. \n3.1.9 killed steel-steel deoxidized, either by addition of \nstrong deoxidizing agents or by vacuum treatment, to reduce \nthe oxygen content to such a level that no reaction occurs \nbetween carbon and oxygen during solidification. \n3.1.10 mill edge-the normal edge produced by rolling \nbetween horizontal finishing rolls. A mill edge does not \nconform to any definite contour. Mill edge plates have two mill \nedges and two trimmed edges. \n3.1.11 universal mill edge-the normal edge produced by \nrolling between horizontal and vertical finishing rolls. Univer­\nsal mill plates, sometimes designated UM Plates, have two \nuniversal mill edges and two trimmed edges. \n3.1.12 sheared edge-the normal edge produced by shear­\ning. Sheared edge plates are trimmed on all edges. \n3.1.13 gas cut edge-the edge produced by gas flame \ncutting. \n3.1.14 special cut edge-usually the edge produced by gas \nflame cutting involving special practices such as pre-heating or \npost-heating, or both, in order to minimize stresses, avoid \nthermal cracking and reduce the hardness of the gas cut edge. \nIn special instances, special cut edge is used to designate an \nedge produced by machining. \n3.1.15 sketch-when used to describe a form of plate, \ndenotes a plate other than rectangular, circular, or semi­\ncircular. \n3.1.16 normalizing-a heat treating process in which a steel \nplate is reheated to a uniform temperature above the upper \ncritical temperature and then cooled in air to below the \ntransformation range. \n3. 1. 17 plate-as-rolled-when used in relation to the location \nand number of tests, the term refers to the unit plate rolled from \na slab or directly from an ingot. It does not refer to the \ncondition of the plate. \n3 .1.18 fine grain practice-a steelmaking practice that is \nintended to produce a killed steel that is capable of meeting the \nrequirements for fine austenitic grain size. \n3.1.18.1 Discussion-It normally involves the addition of \none or more austenitic grain refining elements in amounts that \nhave been established by the steel producer as being sufficient. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0058.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5822,
  "bestTextAlphaRatio": 0.7503
}