{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 604,
  "globalPageIndex": 604,
  "width": 633.96,
  "height": 870.36,
  "text": "SA-352/SA-352M ASME BPVC.II.A-2025 \nvalidated for use under the construction codes. \nXl.3 No assurance is offered that compliance with these \nrequirements will provide a material that will resist brittle \nfailure under all possible conditions of service to as low as the \nspecified impact test temperature. It may eventually be possible \nthat other types of tests will provide greater assurance of \nmaterial suitability for low-temperature services, but at this \ntime there is insufficient knowledge for agreement and general \nacceptance of some test other than the Charpy impact test. \nX 1.4 Attention is directed to the following subjects which \nhave a bearing on the value of Charpy impact tests: \nXl .4.1 Much of the original work in the field of notch \ntoughness was done on wrought materials that had definite \ndirectional grain flow parallel to the axis of the bar, and the \nspecimens were taken with the longitudinal axis of the speci­\nmen parallel to the axis of the bar. It has been well established \nthat the results from impact of tbe same piece of steel \nmay vary considerably, depending upon the orientation of the \nspecimen to the direction of grain flow. Although it is known \nthat specimens taken with their axis transverse to the direction \nof grain flow will have lower values depending on the amount \nof cross rolling or forging the material has received, there were \ninsufficient test data to permit specific mandatory requirements \non the impact properties of wrought materials determined in \nany direction other than parallel to the direction of grain flow. \nExcept in special cases this limitation still exists. \nXl .4.2 It is acknowledged that notched bar impact tests are \nof a qualitative rather than a quantitative nature. As yet, except \npossibly for ship steel, no satisfactory correlation has been \npossible between tests on small standardization specimens and \nthe behavior of a structural under any given conditions of \nloading in service. The required values as determined by the \nCharpy V-notch impact test are arbitrary values which can be \nmet by carbon and low-alloy constructional steels when tested \nat temperatures above that where their behavior changes from \ntough to brittle as judged by this test. The acceptability of this \ndividing line seems to be justified by service experience on \ncarbon and certain low-alloy steels. \nXl.4.3 The literature shows that notched bar impact \nstrengths in constructional steels differ widely in accordance \nwith many variables. Consequently, there is bound to be some \ndiscrepancy between an individual test bar and the entire part \nthat it represents. No system of test bar selection can guarantee \nthat every sample would meet minimum requirements. Test bar \nselection must be a compromise to generally represent the \nproduct. \n552 \nXl .4.4 The committees responsible for these material speci­\nfications have had as an objective the selection of test speci­\nmens that will represent the properties of the materials, in the \nform in which they will be used. However, accomplishment of \nthis objective has only partially been realized. At this time it is \nimpossible to select samples for testing that will represent all \nparts and sizes of the product involved. Particularly in fen'itic \nsteels, it is impractical to remove the test bars from heavy \nsections over about 4 in. [100 mm] and expect them to show \nresults as high as tests from light sections of the same material. \nThe practical commercial limits on the amount of testing \npossible, as well as limits to knowledge of what results may be \nexpected from testing in non-standard locations, have been \nconsidered in drafting these specifications. With time and \nincreased knowledge, it may be possible to require more \nrepresentative testing. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0604.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3783,
  "bestTextAlphaRatio": 0.802
}