{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 201,
  "globalPageIndex": 201,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-53/SA-53M \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall apply only when specified in the purchase order. \nThe purchaser may specify a different frequency of test than is provided in the supplementary \nrequirement. Subject to agreement between the purchaser and manufacturer, retest and retreatment \nprovisions of these supplementary requirements may also be modified. \nSl. Flattening Test, Seamless Pipe \nSl.1 A test specimen at least 2½ in. [60 mm] in length shall \nbe flattened cold between parallel plates in two steps. During \nthe first step, which is a test for ductility, except as allowed by \nS 1.3, S 1.4, and S 1.5, no cracks or breaks on the inside, outside, \nor end surfaces shall be present before the distance between the \nplates is less than the value of H calculated as follows: \nH = (1 +e)tl(e+t!D) \nwhere: \nH = distance between flattening plates, in. [mm], \ne = deformation per unit length (constant for a given grade \nof steel, 0.09 for Grade A, and 0.07 for Grade B), \nt = specified wall thickness, in. [mm], and \nD = specified outside diameter, in. [mm] \nThe H values have been calculated for standard-weight and \nextra-heavy weight pipe from NPS 2V2 to NPS 24 [DN 65 to \nDN 600], inclusive, and are given in Table X2.1. \nSl.2 During the second step, which is a test for soundness, \nthe flattening shall be continued until the test specimen breaks \nor the opposite sides of the test specimen meet. Evidence of \nlaminated or unsound material that is revealed during the entire \nflattening test shall be cause for rejection. \nSl.3 Surface imperfections in the test specimen before \nflattening, but revealed during the first step of the flattening \ntest, shall be judged in accordance with the finish requirements \nin Section 12. \nS 1.4 Superficial ruptures as a result of surface imperfections \nshall not be cause for rejection. \nSl.5 For pipe with a D-to-t ratio less than 10, because the \nstrain imposed due to geometry is unreasonably high on the \ninside surface at the 6 and 12 o'clock locations, cracks at such \nlocations shall not be cause for rejection. \nSl.6 One test shall be made on test specimens taken from \none length of pipe from each lot of each pipe size. A lot shall \ncontain no more than one heat, and at the option of the \nmanufacturer shall contain no more than 500 lengths of pipe \n(as initially cut after the final pipe-forming operation, prior to \nany further cutting to the required ordered lengths) or 50 tons \n[ 45 Mg] of pipe. \nS 1. 7 If the results of a test for a lot fail to conform to the \napplicable requirements, the lot shall be rejected unless tests of \nadditional pipe from the affected lot of double the number \noriginally tested are subsequently made and each such test \nconforms to the specified requirements. Only one retest of any \nlot will be permitted. Any individual length of pipe that \nconforms to the test requirements is acceptable. Any individual \nlength of pipe that does not conform to the test requirements \nmay be resubmitted for test and will be considered acceptable \nif tests taken from each pipe end conform to the specified \nrequirements. \nAPPENDIXES \n(Nonmandatory Information) \nXl. DEFINITIONS OF TYPES OF PIPE \nXl.1 Type F, Furnace-Butt-Welded Pipe, Continuous-\nWelded Pipe-Pipe produced in multiple lengths from \ncoiled skelp and subsequently cut into individual lengths, \nhaving its longitudinal butt joint forge welded by the mechani­\ncal pressure developed in rolling the hot-formed skelp through \na set of round pass welding rolls. \nXl.2 Type E, Electric-Resistance-Welded Pipe-Pipe pro­\nduced in single lengths, or in multiple lengths from coiled \nskelp and subsequently cut into individual lengths, having a \n149 \nlongitudinal butt joint wherein coalescence is produced by the \nheat obtained from resistance of the pipe to the flow of electric \ncurrent in a circuit of which the pipe is a part, and by the \napplication of pressure. \nXl.3 Type S, Seamless Pipe-Pipe made without a welded \nseam. It is manufactured by hot working steel and, if necessary, \nby subsequently cold finishing the hot-worked tubular product \nto produce the desired shape, dimensions, and properties. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0201.json",
  "tabulaTablesCsv": "tables_tabula/page-0201.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0201.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4214,
  "bestTextAlphaRatio": 0.7717
}