{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 565,
  "globalPageIndex": 565,
  "width": 601.08,
  "height": 845.28,
  "text": "ASME BPVC.11.A-2025 SA-335/SA-335M (ASTM A335/A335M) \nTABLE 7 Permissible Variations in Outside Diameter \nOver Under \nNPS [DN] Designator in. mm in. mm \n1/s to 1 ½ [6 to 40], incl. 1/64 (0.015) 0.40 1 /54 (0.015) 0.40 \nOver 1 ½ to 4 [40 to 100], 1/32 (0.031) 0.79 1/32 (0.031) 0.79 \nincl.· \nOver 4 to 8 [100 to 200], 1 /16 (0.062) 1.59 1/32 (0.031) 0.79 \nincl. \nOver 8 to 12 [200 to 300], %2 (0.093) 2.38 1/32 (0.031) 0.79 \nincl. \nOver 12 [300] ± 1 % of the \nspecified \noutside \ndiameter \nTABLE 8 Permitted Variations in Wall Thickness \nNPS [DN] Designator \n1/s to 2½ [6 to 65] incl., all t/D ratiosA \nAbove 2½ [65], t/D :5 5 %A \nAbove 2½ [65], t/D > 5 %A \nTolerance, % from Specified \nOver Under \n20.0 12.5 \n22.5 12.5 \n15.0 12.5 \nA t = Specified Wall Thickness; D = Specified Outside Diameter. \n13. Nondestructive Examination \n13.1 When required by 12.1.2 or 12.2 above, or when \nspecified in the purchase order in addition to the hydrostatic \ntest (12.2.3), each pipe shall be examined by a nondestructive \nexamination method in accordance with Practice E213, Prac­\ntice E309, or Practice E570. Except for Grades P91 Type 1 and \nType 2, P92, P93, P115, P911, Pl22, and P128, the type of \nnondestructive examination shall be at the option of the \nmanufacturer, unless otherwise specified in the order. Grades \nP91 Type 1 and Type 2, P92, P115, P911, P122, and P128 shall \nbe examined by an examination method in accordance with \nPractice E213. When specified in the order, pipe of Grades P91 \nType 1 and Type 2, P92, P93, P115, P911, P122, and P128 shall \nbe examined by an examination method in accordance with \nPractices E309 or E570, in addition to the examination method \nin accordance with Practice E213. The range of pipe sizes that \nmay be examined by each method shall be subject to the \nlimitations in the scope of the respective practices. \n13.2 Following conditions apply in lieu or in addition to \nthose in Specification A999/A999M: \n13.2.1 The width of the notch shall not exceed the depth. \n13.2.2 If upon any standardization, the reference signal \namplitude has decreased by more than 25 % (2 db), the test \napparatus shall be considered out of standardization. The test \nsystem settings may be changed, or the transducer(s), coil(s) or \nsensor(s) adjusted, and the unit restandardized, but all pipe \ntested since the last acceptable standardization shall be re­\ntested. \n13.2.3 Pipes producing a signal equal to or greater than the \nsignal produced by the reference standard shall be subject to \none of the following four dispositions: \n13.2.3.1 The pipes may be rejected without further \nexamination, at the discretion of the manufacturer. \n13.2.3.2 The pipes shall be rejected if the test signal was \nproduced by imperfections which cannot be identified, or was \nproduced by cracks or crack-like imperfections. \n13.2.3.3 The pipes may be repaired by grinding (in accor­\ndance with 7.2.1), welding (in accordance with 7.6) or section­\ning (in accordance with 7.2.3). To be accepted, a repaired pipe \nmust pass the same nondestructive examination by which it \nwas rejected, and it must meet the remaining wall thickness \nrequirements of this specification. \n13.2.3.4 If the test signals were produced by visual imper­\nfections such as those listed below, the pipes may be evaluated \nin accordance with the provisions of Section 7: \n( a) Scratches, \n(b) Surface roughness, \n(c) Dings, \n( d) Straightener marks, \n( e) Cutting chips, \n(f) Steel die stamps, \n( g) Stop marks, or \n(h) Pipe reducer ripple. \n14. Mechanical Tests Required \n14.1 Lot-For mechanical testing, a lot is all pipe of the \nsame nominal size and wall thickness ( or schedule) which is \nproduced from the same heat of steel and subjected to the same \nfinishing treatment in a continuous furnace; when final heat \ntreatment is in a batch-type furnace, the lot shall include only \nthat pipe which is heat treated in the same furnace charge. \n14.2 Transverse or Longitudinal Tension Test and Flatten­\ning or Bend Test-For material heat treated in a batch-type \nfurnace, tests shall be made on 5 % of the pipe from each \ntreated lot. For small lots, at least 1 pipe shall be tested. For \nmaterial heat treated by the continuous process, tests shall be \nmade on a sufficient number of pipe to constitute 5 % of the lot, \nbut in no case less than 2 pipe. Unless otherwise specified, the \nflattening test or bend test shall be chosen at the manufacturer's \noption. \n513 \n14.3 Hardness Test: \n14.3.1 The Vickers hardness testing shall be made in accor­\ndance with Test Method E92. \n14.3.2 For pipes with wall thickness 0.200 in. [5.1 mm] or \nover, either the Brinell or Rockwell hardness test shall be used. \nWhen Brinell hardness testing is used, a 10-mm ball with 3000, \n1500, or 500-kg load shall be used at the option of the \nmanufacturer. \n14.3.3 For pipes with wall thickness 0.065 in. [1.7 mm] or \nover, but less than 0.200 in. [5.1 mm], the Rockwell hardness \ntest shall be used. \n14.3.4 For pipes with wall thickness less than 0.065 in. [1.7 \nmm], the hardness test shall not be required. \n14.3.5 The Brinell test shall be made, at the option of the \nmanufacturer, on the outside of the pipe near the end, on the \noutside of a specimen cut from the pipe, or on the wall cross \nsection of a specimen cut from the pipe. This test shall be made \nso that the center of the impression to the edge of the specimen \nis at least 2.5 times the diameter of the impression. \n14.3.6 The Rockwell hardness test shall, at the option of the \nmanufacturer, be made on the inside surface, on the wall cross \nsection, or on a flat of the outside surface. \n14.3.7 For pipe of Grades P23, P24, P36, P91 Type 1 and \nType 2, P92, P93, P115, Pl22, P128, and P911, Brinell, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0565.json",
  "tabulaTablesCsv": "tables_tabula/page-0565.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0565.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5735,
  "bestTextAlphaRatio": 0.675
}