{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 695,
  "globalPageIndex": 1493,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA·985/SA-985M \nA 751 Test Methods, Practices, and Terminology for \nChemical Analysis of Steel Products \nA 800 / A 800M Practice for Steel Casting, Austen tic Alloy, \nEstimating Ferrite Content Thereof \nA 903 I A 903M Specification for Steel Castings, Surface \nAcceptance Standards, Magnetic Particle and Liquid \nPenetrantinspection \nA 941 Terminology Relating to Steel, Stainless Steel, \nRelated Alloys, and Ferroalloys \nA 991 / A 991M Test Method for Conducting Temperature \nUniformity Surveys of Furnaces Used to Heat Treat \nSteel Products \nE 29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE 94 Guide for Radiographic Examination \nE 125 Reference Photographs for Magnetic Particle Indica­\ntions on Ferrous Castings \nE 165 Test Method for Liquid Penetrant Examination \nE 186 Reference Radiographs for Heavy-Walled (2 to \n4½ in. (51 to 114 mm)) Steel Castings \nE 192 Reference Radiographs for Investment Steel Cast­\nings of Aerospace Applications \nE 208 Test Method for Conducting Drop-Weight Test to \nDetermine Nil-Ductility Transition Temperature of Fer­\nritic Steels \nE 280 Reference Radiographs for Heavy-Walled (4½ to \n12 in. (114 to 305 mm)) Steel Castings \nE 340 Test Method for Macroetching Metals and Alloys \nE 353 Test Methods for Chemical Analysis of Stainless, \nHeat-Resisting, Maraging, and Other Similar Chro­\nmium-Nickel-Iron Alloys \nE 354 Test Methods for Chemical Analysis of High-Tem­\nperature, Electrical, Magnetic, and Other Similar Iron, \nNickel, and Cobalt Alloys \nE 446 Reference Radiographs for Steel Castings Up to 2 in. \n(51 mm) in Thickness \nE 709 Guide for Magnetic Particle Examination \n2.2 ANSI Standard: \nB16.5 Steel Pipe Flanges and Flanged Fittings \n2.3 ASME Standard: \nASME Boiler and Pressure Vessel Code, Section III, \nNB-2546 \n2.4 Standards of the Manufacturer's Standardization \nSociety of the Valve and Fitting Industry: \nMSS SP 53 Quality Standard for Steel Castings for Valves, \nFlanges and Fittings, and Other Piping Components (Dry \nMagnetic Particle Inspection Method) \nMSS SP 54 Quality Standard for Steel Castings for Valves, \nFlanges and Fittings, and Other Piping Components \n(Radiographic Inspection Method) \n2.5 SAE Aerospace Recommended Practice: \nARP 1341 Determining Decarburization and Carburization \nin Finished Parts of Carbon and Low-Alloy Steel \n3. Terminology \n3.1 Definitions - The definitions in Test Methods and \nDefinitions A 370 and Terminology A 941 are applicable \nto this specification and those listed in 1.1. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.1 heat, n - all the molten metal poured from a \nsingle furnace or all of the molten metal from two or more \nfurnaces poured into a single ladle or casting prior to the \nreplenishing of the furnace(s). \n3.2.2 investment casting, n - a metal casting that is \nproduced in a mold obtained by investing (surrounding) \nan expendable pattern with a ceramic slurry, which is \nallowed to solidify. The expendable pattern may consist \nof wax, plastic, or other material and is removed prior to \nfilling the mold with liquid metal. \n3.2.3 master heat, n - a single furnace charge of \nalloy that may be either poured directly into castings or \ninto remelt alloy for individual melts. \n3.2.4 subheat, n - a portion of master heat remelted \nwith only minor additions for deoxidation for pouring into \ncastings. Syn. melt, production heat. \n4. Materials and Manufacture \n4.1 Melting Process - Master heats shall be made by \nthe electric furnace process with or without separate refin­\ning such as argon-oxygen-decarburization (AOD), vac­\nuum-oxygen-degassing (VOD), vacuum-induction­\nmelting (VIM), and so forth, unless otherwise specified in \nthe individual specification or agreed upon between the \ncustomer and producer. Master heats may be used directly \nfor producing castings or converted into ingot, bar, shot, \nor other suitable form, not including gates and risers from \ncasting production, for later remelting as a subheat. \n4.2 Re-Melting Process - Subheats shall be produced \nfrom master heat metal in suitable batch sizes by electric \ninduction furnace, with or without atmosphere protection, \nsuch as vacuum or inert gas unless otherwise agreed upon \nbetween the customer and producer. Revert (gates, sprues, \nrisers, and rejected castings) shall not be remelted except \nin master heats. \n4.3 Heat Treatment: \n4.3.1 Ferritic and martensitic steel shall be cooled \nafter pouring to provide substantially complete transforma­\ntion of austenite prior to heat treatment to enhance mechani­\ncal properties. \n4.3.2 Castings shall be heat treated in the working \nzone of a furnace that has been surveyed in accordance \nwith Test Method A 991/A 991M. \n1435 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1493.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4759,
  "bestTextAlphaRatio": 0.7615
}