{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 597,
  "globalPageIndex": 1395,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.11.A·2025 SA·815/SA·815M \nMSS SP-95 Swage(d) Nipples and Bull Plugs \nMSS SP-97 Integrally Reinforced Forged Branch Outlet \nFittings-Socket Welding, Threaded and Buttwelding \nEnds \n2.4 ASME Boiler and Pressure Vessel Codes: \nSection VIII Division I, Pressure Vessels \nSection IX, Welding and Brazing Qualifications \n2.5 ASNT Standard: \nSNT-TC-lA Recommended Practice for Nondestructive \nTesting Personnel Qualification and Certification \n3. Common Requirements and Ordering Information \n3.1 Material furnished to this specification shall conform to \nthe requirements of Specification A960/A960M including any \nsupplementary requirements that are indicated in the purchase \norder. Failure to comply with the common requirements of \nSpecification A960/A960M constitutes nonconformance with \nthis specification. In case of conflict between this specification \nand Specification A960/ A960M, this specification shall pre­\nvail. \n3.2 Specification A960/A960M identifies the ordering infor­\nmation that should be complied with when purchasing material \nto this specification. \n4. Materials \n4.1 The material for fittings shall consist of forgings, bars, \nplates, or seamless or welded tubular products that conform to \nthe chemical requirements in Table 1. \n4.2 The steel shall be melted by one of the following \nprocesses: \n4.2.1 Electric furnace (with separate degassing and refining \noptional), \n4.2.2 Vacuum furnace, or \n4.2.3 Electric furnace followed by vacuum or electroslag­\nconsumable remelting. \n4.3 If secondary melting is employed, the heat shall be \ndefined as all ingots remelted from a primary heat. \n5. Manufacture \n5.1 Forming-Forging or shaping operations may be per­\nformed by hammering, pressing, piercing, extruding, upsetting, \nrolling, bending, fusion welding, machining or by combination \nof two or more of these operations. The forming procedure \nshall be so applied that it will not produce surface discontinui­\nties deeper than 5 % of the specified nominal thickness of the \nfitting. \n5.2 All classes of fittings shall be heat treated in accordance \nwith Section 6. \n5.3 Fittings ordered as Class WP-S shall be of seamless \nconstruction and shall meet all requirements of Specification \nA960/ A960M. \n5.4 Fittings ordered as Class WP-W shall meet the require­\nments of Specification A960/ A960M and (J) shall have all \nwelds made by. the fitting manufacturer and all pipe welds \nmade with the addition of filler metal radiographically exam­\nined throughout the entire length in accordance with Paragraph \nUW-51 of Section VIII, Division 1, of the ASME Boiler and \nPressure Vessel Code; and (2) shall not require radiography of \nthe starting pipe weld if the pipe was welded without the \naddition of filler metal. In place of radiographic examination, \nwelds made by the fitting manufacturer may be ultrasonically \nexamined in accordance with the code requirements stated in \n5.6. \n5.5 Fittings ordered as Class WP-WX shall meet the re­\nquirements of Specification A960/A960M and shall have all \nwelds, whether made by the fitting manufacturer or the starting \nmaterial manufacturer, radiographically examined throughout \ntheir entire length in accordance with Paragraph UW-51 of \nSection VIII, Division I of the ASME Boiler and Pressure \nVessel Code. The radiography of welds for this class of fittings \ncan be done either prior to or after forming at the option of the \nmanufacturer. \n5.6 Fittings ordered as Class WP-WU shall meet the re­\nquirements of Specification A960/ A960M and shall have all \nwelds, whether made by the fitting manufacturer or the starting \nmaterial manufacturer, ultrasonically examined throughout \ntheir entire length in accordance with Appendix 12 of Section \nVIII, Division 1 of ASME Boiler and Pressure Vessel Code. \n5.7 The radiography or ultrasonic examination for this class \nof fittings may be done at the option of the manufacturer, either \nprior to or after forming. \n5.8 Personnel performing NDE examinations shall be quali­\nfied in accordance with SNT-TC- lA. \n5.9 Deleted \n5.10 All classes of fittings shall have the welders, welding \noperators, and welding procedures qualified under the provi­\nsions of Section IX of the ASME Boiler and Pressure Vessel \nCode except that starting pipe welds made without the addition \nof filler metal do not require such qualification. \n5.11 All joints welded with filler metal shall be finished in \naccordance with the requirements of Paragraph UW-35 (a) of \nSection VIII, Division 1, of the ASME Boiler and Pressure \nVessel Code. \n5.12 Fittings machined from bar shall be restricted to NPS 4 \nor smaller. \n5.12.1 All caps machined from bar shall be examined by \nliquid penetrant in accordance with Practice E165. \n5.13 Weld buildup is permitted to dimensionally correct \nunfilled areas produced during cold forming of stub ends. \nRadiographic examination of the weld buildup shall not be \nrequired provided that all of the following steps are adhered to: \n5.13.l The weld procedure and welders or welding opera­\ntors meet the requirements of 5.10, \n5.13.2 Heat-treatment is performed after welding and prior \nto machining, \n1333 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1395.json",
  "tabulaTablesCsv": "tables_tabula/page-1395.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1395.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5135,
  "bestTextAlphaRatio": 0.7725
}