{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 508,
  "globalPageIndex": 1306,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-751 ASME BPVC.II.A-2025 \n4. Concerning Specification of Chemical Composition \nReq1drements \n4.1 It is recommended that Guide B1282 be consulted as a \nguide for specifying the chemical compositions for steels. \n4.2 The recommended practice for specifying chemical \ncomposition limits is to limit the number of significant figures \nfor each element so that the number of figures to the right of the \ndecimal point conforms to the following: \nChemical Concentration \nMaximum Number of \nFigures to Right of Decimal Point \nUp to 0.010 %, incl. 0.XXXX or may be expressed as ppm \nOver 0.010 % to 0.10 %, incl 0.XXX \nOver 0.1 O % to 3.0 %, incl 0.XX \nOver 3.0 % O.X \n4.3 For those cases in which the composition range spans \neither 0.10 or 3.0 %, the number of figures to the right of the \ndecimal is to be determined by that indicated by the upper \nlimit. \n4.4 Technical considerations may dictate the employment of \nless than the number of figures to the right of the decimal as \npreviously recommended. \nNoTE 3-The recommendations should be employed to reduce the \nnumber of significant figures, such as from 18.00 to 18.0 %, but a \nsignificant figure should never be added unless there is a technical reason \nfor so doing. \n5. Cast or Heat Analysis \n5.1 The producer shall perform analyses for those elements \nspecified in the material specification. The results of such \nanalyses shall conform to the requirements specified in the \nmaterial specification. \n5.1.1 For multiple heats, either individual heat or cast \nanalysis, or an average heat or cast analysis, shall be reported. \nIf significant variations in heat or cast size are involved, a \nweighted average heat or cast analysis, based on the relative \nquantity of metal in each heat or cast, shall be reported. \n5.1.2 For consumable electrode remelted material, a heat is \ndefined as all the ingots remelted by the same process from a \nprimary heat. The heat analysis shall be obtained from one \nremelted ingot, or the product of one remelted ingot, from each \nprimary melt. If this heat analysis does not meet the heat \nanalysis requirements of the specification, one sample from the \nproduct of each remelted ingot shall be analyzed, and the \nanalyses shall meet the heat analysis requirements. \n5.2 If the test samples taken for the heat analysis are lost, \ninadequate, or not representative of the heat, a product analysis \nof the semifinished or finished product may be used to establish \nthe heat analysis. \n5.2.1 If a product analysis is made to establish the heat \nanalysis, the product analysis shall meet the specified limits for \nheat analysis and the product analysis tolerances described in \nSection 6 do not apply. \n5.3 Unless otherwise specified, compositions shall be \nreported in mass fraction percent (wt%). \n6. Product Analysis Requirements \n6.1 For product analysis, the range of the specified chemical \ncomposition is normally greater ( designated product analysis \ntolerances) than that applicable to heat analyses to take into \naccount deviations associated with analytical reproducibility \nand the heterogeneity of the steel. If several determinations of \nany element in the heat are made, they may not vary both \nabove and below the specified range. \n6.2 Product analysis tolerances may not be used to deter­\nmine conformance to the specified heat or cast analysis unless \npermitted by the individual material specification. \n6.3 Product analysis tolerances, where available, are given \nin the individual material specifications or in the general \nrequirement specifications. \n7. Unspecified Elements (Note 4) \n7 .1 Reporting analyses of unspecified elements is permitted. \nNoTE 4--All commercial metals contain small amounts of various \nelements in addition to those which are specified. It is neither practical nor \nnecessary to specify limits for every unspecified element that might be \npresent, despite the fact that the presence of many of these elements is \noften routinely determined by the producer. \n7.2 Analysis limits shall be established for specific elements \nrather than groups of elements such as \"all others,\" \"rare \nearths,\" and \"balance.\" \n8. Sampling \n8.1 Cast or Heat Analyses: \n8.1.1 Samples shall be taken, insofar as possible, during the \ncasting of a heat, at a time which, in the producer's judgment, \nbest represents the composition of the cast. \n8.1.2 In case the heat analysis samples or analyses are lost \nor inadequate, or when it is evident that the sample does not \ntruly represent the heat, representative samples may be taken \nfrom the semifinished or finished product, in which case such \nsamples may be analyzed to satisfy the specified requirements. \nThe analysis shall meet the specified limits for heat analysis. \n8.2 Check, Product, or Verification Analyses-Unless other­\nwise specified, the latest revision of Practice B1806 shall be \nused as a guide for sampling. \n9. Test Methods \n9.1 This section lists some test methods that have been \nfound acceptable for chemical analysis of steels. \n9 .1.1 The following ASTM wet chemical test methods have \nbeen found acceptable as referee test methods and as a base for \nstandardizing instrumental analysis techniques. \nTest Methods \nE350 \nE352 \nE353 \nE354 \nE1019 \nGeneral Description \nBasic wet chemical procedure for steels. \nWet chemical procedure for tool steels. \nWet chemical procedure for stainless steels. \nWet chemical procedure for high nickel steels. \nDetermination of carbon, sulfur, nitrogen, oxygen, and \nhydrogen, in steel and in iron, nickel, and cobalt alloys. \n9 .1.2 The following ASTM instrumental test methods, \npractices, and guides may be employed for chemical analysis \nof steels or may be useful as a guide in the calibration and \nstandardization of instrumental equipment for routine sampling \nand analysis of steels. \n1236 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1306.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5818,
  "bestTextAlphaRatio": 0.7724,
  "noteOcrPath": "note_ocr/page-1306.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 3—The recommendations should be employed to reduce the"
  ]
}