{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 883,
  "globalPageIndex": 1681,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.Il.A-2025 \n(b) the temperature range of intended application \n(c) whether cyclic service is to be considered \n( d) whether external pressure is to be considered \nThe inquirer shall identify all product forms, size \nranges, and specifications or specification requirements \nfor the material for which approval is desired. When \navailable, the inquirer shall furnish information describ­\ning service experience in the temperature range \nrequested. \nIV-300 CHEMICAL COMPOSITION \nThe inquirer shall recommend to the BPV .Committee \non Materials whether the chemical composition specified \nin the reference specification applies or whether restric­\ntions to this composition shall be imposed for the in­\ntended application. All elements required by the \nspecification shall be reported. Elements within the speci­\nfied compositional range that are known to influence \nstrength, ductility, toughness, weldability, and behavior \nunder service conditions shall also be reported. The \nmethod used for chemical analysis shall be sufficiently \nprecise to provide an accurate measurement of the ele­\nments at the level at which they should be reported. \nFurthermore, note the following: \n[a) It is not required that all elements be analyzed by \nthe same technique. \n(b) The existence of interferences between elements \nduring analysis shall be considered. \n(c) If standards traceable to national standards labora­\ntories are not available or not used, the applicant should \ndescribe the method or methods used and how precision \nand detection limits were determined. \nAfter review of the submitted data, the Committee re­\nserves the right to request additional data (see IV-1700) \nor to modify the permitted compositional ranges for key \nelements so that they more accurately reflect the range \nof the elements of the submitted test heats. \nIV-400 METALLURGICAL STRUCTURE AND \nHEAT TREATMENT \nWhen applicable for the proposed material, the in­\nquirer shall indicate the intended metallurgical struc­\ntures, including the desired grain size range, to be \nachieved in order to comply with the mechanical proper­\nties requirements and, where applicable, fully describe \nthe heat treatment (including cooling methods) to be ap­\nplied to achieve these structures, the mechanical proper­\nties, and the expected behavior under service conditions. \nThe inquirer shall report the melting and forming prac­\ntices used to produce the evaluated product form(s). \nThe heat treatment temperatures shall be representative \nof the proposed range. \nAn explanation for the proposed heat treatment tem­\nperature ranges shall be furnished. When such concepts \napply, metallurgical transformation curves and informa­\ntion on the transformation points and conditions for ap­\npearance of the major phases in the microstructure \n( e.g., continuous cooling transformation diagram or time­\ntemperature precipitation plots) would be beneficial for \nthe Committee's consideration. \nIV-500 MECHANICAL PROPERTIES \nTest methods employed for the properties tested shall \nbe those referenced in or by the material specifications, or \nshall be the appropriate ASTM test methods, recommend­\ned practices, or test methods described in accepted inter­\nnational standards. The test methods used shall be \nindicated in the data package. \nIt is desired that the data be obtained using material re­\npresentative of the range of effects of the key variables of \ncomposition, thickness, mechanical working, and heat \ntreatment. It is desirable that, when applicable, test data \nalso be provided for the range of heat treatment expo­\nsures that may influence properties such as tensile \nstrength, toughness, and stress rupture behavior. After \nconsideration of the submitted data, the Committee re­\nserves the right to modify the specification requirements. \nIV-600 DEFINITIONS FOR DATA \nCOLLECTION PURPOSES \ncasting lot: single production pour from a master heat. \nheat: quantity of metal with one chemical composition, \nproduced by a recognized production process from a sin­\ngle primary melt of the metal. Remelted ingot material is \nnot recognized as a separate heat unless it is produced \nfrom a melt having a different chemical composition than \nthe other heats. \nhot isostatically pressed component lot: a number of parts \nmade from a single powder blend consolidated in the \nsame hot isostatic press using the same pressure, tem­\nperature, and time parameters, and heat treated in the \nsame final heat-treatment charge. \npowder blend: a homogeneous mixture of powder from \none or more heats of the same grade. The term \"powder \nblend\" shall be substituted for the term \"heat\" for hot iso­\nstatically pressed powder material in IV-300, IV-700, \nIV-900, IV-1200, IV-1400, and IV-1800. \nwrought lot: quantity of metal made by melting followed \nby working or by working and heat treatment as a unique \nbatch. Different lots may come from the same heat and \nmay be made into different product forms. Lot definitions \nare expected to be found in the applicable material \nspecifications. \n1627 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1681.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5049,
  "bestTextAlphaRatio": 0.7994
}