{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 121,
  "globalPageIndex": 121,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-20/SA-20M \n1.5 Appendix X4 provides information on cold bending of \nplates, including suggested minimum inside radii for cold \nbending. \n1.6 These materials are intended to be suitable for fusion \nwelding. When the steel is to be welded, it is presupposed that \na welding procedure suitable for the grade of steel and intended \nuse or service will be utilized. \n1.7 In case of any conflict in requirements, the requirements \nof the applicable product specification prevail over those of this \ngeneral requirements specification. \n1.8 Additional requirements that are specified in the pur­\nchase order and accepted by the supplier are permitted, \nprovided that such requirements do not negate any of the \nrequirements of this general requirements specification or the \napplicable product specification. \n1.9 For purposes of determining conformance with this \ngeneral requirements specification and the applicable product \nspecification, values are to be rounded to the nearest unit in the \nright-hand place of figures used in expressing the limiting \nvalues in accordance with the rounding method of Practice \nE29. \n1. 10 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.11 This general requirements specification and the appli­\ncable product specification are expressed in both inch-pound \nunits and SI units; unless the order specifies the applicable \"M\" \nspecification designation (SI units), the plates are to be \nfurnished to inch-pound units. \n1.12 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA203/A203M Specification for Pressure Vessel Plates, Alloy \nSteel, Nickel \nA204/A204M Specification for Pressure Vessel Plates, Alloy \nSteel, Molybdenum \nA225/A225M Specification for Pressure Vessel Plates, Alloy \nSteel, Manganese-Vanadium-Nickel \nA263 Specification for Stainless Chromium Steel-Clad Plate \nA264 Specification for Stainless Chromium-Nickel Steel­\nClad Plate \nA265 Specification for Nickel and Nickel-Base Alloy-Clad \nSteel Plate \n69 \nA285/A285M Specification for Pressure Vessel Plates, Car­\nbon Steel, Low- and Intermediate-Tensile Strength \nA299/A299M Specification for Pressure Vessel Plates, Car­\nbon Steel, Manganese-Silicon \nA302/A302M Specification for Pressure Vessel Plates, Alloy \nSteel, Manganese-Molybdenum and Manganese­\nMolybdenum-Nickel \nA353/ A353M Specification for Pressure Vessel Plates, Alloy \nSteel, Double-Normalized and Tempered 9 % Nickel \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA387/A387M Specification for Pressure Vessel Plates, Alloy \nSteel, Chromium-Molybdenum \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA455/ A455M Specification for Pressure Vessel Plates, Car­\nbon Steel, High-Strength Manganese \nA515/A515M Specification for Pressure Vessel Plates, Car­\nbon Steel, for Intermediate- and Higher-Temperature Ser­\nvice \nA516/A516M Specification for Pressure Vessel Plates, Car­\nbon Steel, for Moderate- and Lowe.r-Temperature Service \nAS 17 / A517M Specification for Pressure Vessel Plates, Alloy \nSteel, High-Strength, Quenched and Tempered \nA533/ A533M Specification for Pressure Vessel Plates, Alloy \nSteel, Quenched and Tempered, Manganese-Molybdenum \nand Manganese-Molybdenum-Nickel \nA537/A537M Specification for Pressure Vessel Plates, Heat­\nTreated, Carbon-Manganese-Silicon Steel \nA542/ A542M Specification for Pressure Vessel Plates, Alloy \nSteel, Quenched-and-Tempered, Chromium-\nMolybdenum, and Chromium-Molybdenum-Vanadium \nA543/A543M Specification for Pressure Vessel Plates, Alloy \nSteel, Quenched and Tempered Nickel-Chromium­\nMolybdenum \nA553/A553M Specification for Pressure Vessel Plates, Alloy \nSteel, Quenched and Tempered 7, 8, and 9 % Nickel \nA562/A562M Specification for Pressure Vessel Plates, Car­\nbon Steel, Manganese-Titanium for Glass or Diffused \nMetallic Coatings \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \nA612/A612M Specification for Pressure Vessel Plates, Car­\nbon Steel, High Strength, for Moderate and Lower Tem­\nperature Service \nA645/ A645M Specification for Pressure Vessel Plates, 5 % \nand 5½ % Nickel Alloy Steels, Specially Heat Treated \nA662/ A662M Specification for Pressure Vessel Plates, \nCarbon-Manganese-Silicon Steel, for Moderate and \nLower Temperature Service \nA 700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA724/A724M Specification for Pressure Vessel Plates, \nCarbon-Manganese-Silicon Steel, Quenched and \nTempered, for Welded Pressure Vessels ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0121.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5249,
  "bestTextAlphaRatio": 0.7765
}