{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 565,
  "globalPageIndex": 1363,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-790/SA-790M (ASTM A790/A790M) \nTABLE 4 Pipe and Filler Metal Specification \nPipe \nUNS Designation \nS31803 \nS32205 \nS31200 \nS82441 \nFiller Metal \nAWS A5.9 Class UNS Designation \nER2209 S39209 \nER2209 S39209 \nER2553 S39553 \nER2209 S39209 \n15.4 Pipes that have had weld seam repairs with filler metal \nshall be identified with the symbol \"WR\" and shall be so stated \nand identified on the certificate of tests. If filler metal other \nthan that listed in Table 4 is used, the filler metal shall be \nidentified on the certificate of tests. \n15.5 Weld repairs shall be completed prior to any heat \ntreatment. \n16. Product Marking \n16.1 In addition to the marking prescribed in Specification \nA999/ A999M, the marking shall include the manufacturer's \nprivate identifying mark and whether the pipe is seamless or \nwelded. If specified in the purchase order, the marking for pipe \nlarger than NPS 4 shall include the weight. \n17. Keywords \n17.1 duplex stainless steel; ferritic/austenitic stainless steel; \nseamless steel pipe; stainless steel pipe; steel pipe; welded steel \npipe \nSUPPLEMENTARY REQUIREMENTS \nFOR PIPE REQUIRING SPECIAL CONSIDERATION \nOne or more of the following supplementary requirements shall apply only when specified in the \npurchase order. The purchaser may specify a different frequency of test or analysis than is provided \nin the supplementary requirement. Subject to agreement between the purchaser and manufacturer, \nretest and retreatment provisions of these supplementary requirements may also be modified. \nSl. Product Analysis \nS 1.1 For all pipe over NPS 5 there shall be one product \nanalysis made of a representative sample from one piece for \neach ten lengths or fraction thereof from each heat of steel. \nS 1.2 For pipe smaller than NPS 5 there shall be one product \nanalysis made from ten lengths per heat of steel or from 10 % \nof the number of lengths per heat of steel, whichever number \nis smaller. \nS 1.3 Individual lengths failing to conform to the chemical \nrequirements specified in Section 7 shall be rejected. \nS2. Transverse Tension Tests \nS2.1 There shall be one transverse tension test made from \none end of 10 % of the lengths furnished per heat of steel. This \napplies only to pipe over NPS 8. \nS2.2 If a specimen from any length fails to conform to the \ntensile properties specified that length shall be rejected. \nS3. Flattening Test \nS3.1 The flattening test of Specification A999/A999M shall \nbe made on a specimen from one end or both ends of each pipe. \nCrops ends may be used. If this supplementary requirement is \nspecified, the number of tests per pipe shall also be specified. \nIf a specimen from any length fails because of lack of ductility \nprior to satisfactory completion of the first step of the flattening \ntest requirement, that pipe shall be rejected subject to retreat­\nment in accordance with Specification A999/ A999M and \nsatisfactory retest. If a specimen from any length of pipe fails \nbecause of a lack of soundness that length shall be rejected, \nunless subsequent retesting indicates that the remaining length \nis sound. \nS4. Etching Tests \nS4.1 The steel shall be homogeneous as shown by etching \ntests conducted in accordance with the appropriate portions of \nMethod E381. Etching tests shall be made on a cross section \nfrom one end or both ends of each pipe and shall show sound \nand reasonably uniform material free of injurious laminations, \ncracks, and similar objectionable defects. If this supplementary \nrequirement is specified, the number of tests per pipe required \nshall also be specified. If a specimen from any length shows \nobjectionable defects, the length shall be rejected, subject to \nremoval of the defective end and subsequent retests indicating \nthe remainder of the length to be sound and reasonably uniform \nmaterial. \n1301 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1363.json",
  "tabulaTablesCsv": "tables_tabula/page-1363.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1363.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3847,
  "bestTextAlphaRatio": 0.7635
}