{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 284,
  "globalPageIndex": 1082,
  "width": 621.72,
  "height": 799.2,
  "text": "SA-568/SA-568M (ASTM A568/A568M) ASME BPVC.II.A-2025 \nTABLE 2 Tolerances for Product Analysis \nTolerance \nElement Limit, or Maximum of Under Over \nSpecified Element, % Minimum Maximum \nLimit Limit \nCarbon to 0.15 incl 0.02 0.03 \nover 0.15 to 0.40 incl 0.03 0.04 \nover 0.40 to 0.80 incl 0.03 0.05 \nover 0.80 0.03 0.06 \nManganese to 0.60 incl 0.03 0.03 \nover 0.60 to 1.15 incl 0.04 0.04 \nover 1.15 to 1.65 incl 0.05 0.05 \nPhosphorus A 0.01 \nSulfur A 0.01 \nSilicon to 0.30 incl 0.02 0.03 \nover 0.30 to 0.60 incl 0.05 0.05 \nCopper 0.02 A \nNickel to 1.00 incl A 0.03 \nChromium to 0.90 incl A 0.04 \nMolybdenum to 0.20 incl A 0.01 \nVanadium to 0.10 incl 0.01 6 o.o1s \nColumbium (Niobium) to 0.10 incl 0.01 6 0,01s \nTitanium to 0.15 incl 0.01A 0,01s \nAluminum to 0.10 incl 0.03° A \nNitrogen to 0.030 incl 0.005 0.005 \nA Where an ellipsis ( ... ) appears in the table, the requirements have not been \ndefined. \n6 If the minimum of the range is 0.01 %, the under tolerance is 0.005 %. \n0 If the minimum of the range is 0.01 %, the under tolerance is 0.005 % and if the \nminimum of the range is 0.02 %, the under tolerance is 0.01 %. \nthe amounts in Table 2. The several determinations of any \nelement in a cast shall not vary both above and below the \nspecified range. \n5.4 Sampling for Product Analysis: \n5.4.1 To indicate adequately the representative composition \n_ ou ca§!_by_groduct analysis_,_ it is_general practice. to-select-­\nsamples to represent the steel, as fairly as possible, from a \nminimum number of pieces as follows: 3 pieces for lots up to \n15 tons incl, and 6 pieces for lots over 15 tons (see Practice \nE59). \n5.4.2 When the steel is subject to tension test requirements, \nsamples for product analysis may be taken either by drilling \nentirely through the used tension test specimens themselves, or \nas covered in 5.4.3. \n5.4.3 When the steel is not subject to tension test \nrequirements, the samples for analysis must be taken by \nmilling or drilling entirely through the sheet in a sufficient \nnumber of places so that the samples are representative of the \nentire sheet or strip. The sampling may be facilitated by folding \nthe sheet both ways, so that several samples may be taken at \none drilling. Steel subjected to certain heating operations by \nthe purchaser may not give chemical analysis results that \nproperly represent its original composition. Therefore, users \nmust analyze chips taken from the steel in the condition in \nwhich it is received from the steel manufacturer. \n5.5 Specimen Preparation-Drillings or chips must be taken \nwithout the application of water, oil, or other lubricant, and \nmust be free of scale, grease, dirt, or other foreign substances. \nThey must not be overheated during cutting to the extent of \ncausing decarburization. Chips must be well mixed and those \ntoo coarse to pass a No. 10 sieve or too fine to remain on a \nNo. 30 sieve are not suitable for proper analysis. Sieve size \nnumbers are in accordance with Specification E 11. \n5.6 Test Methods-In case a referee analysis is required and \nagreed upon to resolve a dispute concerning the results of a \nchemical analysis, the procedure of performing the referee \nanalysis must be in accordance with the latest issue of Test \nMethods, Practices, and Terminology A751, unless otherwise \nagreed upon between the manufacturer and the purchaser. \n6. Mechanical Properties \n6.1 The mechanical property requirements, number of \nspecimens, test locations, and specimen orientation shall be in \naccordance with the applicable product specification. \n6.2 Unless otherwise specified in the applicable product \nspecification, test specimens must be prepared in accordance \nwith Test Methods and Definitions A370. \n6.3 Mechanical tests shall be conducted in accordance with \nTest Methods and Definitions A370. \n6.4 Bend tests where required shall be conducted in com­\npliance with Test Methods E290. \n6.5 To determine conformance with the product \nspecification, a calculated value should be rounded to the \nnearest 1 ksi tensile strength and yield point or yield strength, \nand to the nearest unit in the right hand place of figures used in \nexpressing the limiting value for other values in accordance \nwith the rounding off method given in Practice E29. \n6.6 Structural sheet steels are commonly fabricated by cold \nbending. There are many interrelated factors that affect the \nability of a given steel to cold form over a given radius under \nshop conditions. These factors include thickness, strength \nlevel, degree of restraint, relationship to rolling direction, _ \nchemistry, and microstructure. Each of the appropriate product \nspecifications lists in the appendix the suggested minimum \ninside radius for cold bending. These radii should be used as \nminima for 90° bends. They presuppose \"hard way\" bending \n(bend axis parallel to rolling direction) and reasonably good \nshop forming practices. Where possible, the use of larger radii \nor \"easy way\" bends are recommended for improved perfor­\nmance. \n6. 7 Fabricators should be aware that cracks may initiate \nupon bending a sheared or burned edge. This is not considered \nto be a fault of the steel but is rather a function of the induced \ncold-work or heat-affected zone. \n7. General Requirements for Delivery \n7.1 The products covered by this specification are produced \nto inch-pound or metric decimal thickness only and the \nappropriate thickness tolerances apply. \n982 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1082.json",
  "tabulaTablesCsv": "tables_tabula/page-1082.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1082.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5429,
  "bestTextAlphaRatio": 0.7289
}