{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 455,
  "globalPageIndex": 455,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-268/SA-268M \nTABLE 2 Number of Tubes in a Lot Heat Treated by the \nContinuous Process \nSize of Lot \nSize of Tube \n2 in. [50.8 mm] and over in outside diameter and not more than 50 tubes \n0.200 in. [5.1 mm] and over in wall thickness \nLess than 2 in. [50.8 mm] b·ut over 1 in. [25.4 mm] not more than 75 tubes \nin outside diameter or over .1 in. [25.4 mm] in \noutside diameter and under 0.200 in. [5.1 mm] in \nwall thickness \n1 in. [25.4 mm] or less in outside diameter not more than 125 tubes \ninclude all tubes of the same size and heat, heat treated in the \nsame furnace at the same temperature, time at heat, and furnace \nspeed. \n4. Ordering Information \n4.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for material ordered under this \nspecification. Such requirements may include, but are not \nlimited to, the following: \n4.1.1 Quantity (feet, metres, or number of lengths), \n4.1.2 Name of material (seamless or welded tubes), \n4.1.3 Grade (Table 1), \n4.1.4 Size (outside diameter and nominal wall thickness), \n4.1.5 Length (specific or random), \n4.1.6 Optional requirements (hydrostatic or nondestructive \nelectric test, Section 16), \n4.1.7 Test report required (Certification Section of Specifi-\ncation Al016/A1016M), \n4.1.8 Specification designation, \n4.1.9 lntergranular corrosion test, and \n4.1.10 Special requirements. \n5. General Requirements \n5.1 Material furnished under this specification shall con­\nform to the applicable requirements of Specification Al016/ \nAl016M unless otherwise provided herein. \n6. Manufacture \n6.1 The tubes shall be made by the seamless or welded \nprocess with no filler metal added. \n7. Heat Treatment \n7.1 As a final heat treatment, tubes shall be reheated to a \ntemperature of 1200 °P [650 °C] or higher and cooled (as \nappropriate for the grade) to meet the requirements of this \nspecification. \n7.2 The martensitic grade UNS S 41500 shall be reheated to \na temperature of 950 °P [510 °C] or higher and cooled as \nappropriate to meet the requirements of this specification. \n8. Chemical Composition \n8.1 The steel shall conform to the chemical requirements \nprescribed in Table 1. \n9. Product Analysis \n9 .1 An analysis of either one billet or one length of flatrolled \nstock or one tube shall be made from each heat. The chemical \ncomposition thus determined shall conform to the requirements \nspecified. \n9 .2 The product analysis tolerance of the Chemical Require­\nments Table of A480/ A480M shall apply. The product analysis \ntolerance is not applicable to the carbon content for material \nwith a specified maximum carbon of 0.04 % or less. \n9.3 If the original test for product analysis fails, retests of \ntwo additional billets, lengths of flat-rolled stock or tubes shall \nbe made. Both retests for the elements in question shall meet \nthe requirements of the specification; otherwise all remaining \nmaterial in the heat or lot shall be rejected or, at the option of \nthe producer, each billet or tube may be individually tested for \nacceptance. Billets, lengths of flat-rolled stock or tubes which \ndo not meet the requirements of the specification shall be \nrejected. \n10. Tensile Requirements \n10.1 The material shall conform to the tensile properties \nprescribed in Tables 3 and 4. \n11. Hardness Requirements \n11.1 The tubes shall have a hardness number not to exceed \nthose prescribed in Table 5. \n12. Permissible Variations in Dimensions \n12.1 Variations in outside diameter, wall thickness, and \nlength from those specified shall not exceed the amounts \nprescribed in Table 6. \n12.2 The permissible variations in outside diameter given in \nTable 6 are not sufficient to provide for ovality in thin-walled \ntubes, as defined in the Table. In such tubes, the maximum and \nminimum diameters at any cross section shall deviate from the \nnominal diameter by no more than twice the permissible \nvariation in outside diameter given in Table 6; however, the \nmean diameter at that cross section must still be within the \ngiven permissible variation. \n12.3 When the specified wall is 2 % or less of the specified \noutside diameter, the method of measurement is in accordance \nwith the agreement between the purchaser and the manufac­\nturer (see Note 1). \n403 \nNoTE 1-Very thin wall tubing may not be stiff enough for the outside \ndiameter to be accurately measured with a point contact test method, such \nas with the use of a micrometer or caliper. When very thin walls are \nspecified, \"go\"-\"no go\" ring gages are commonly used to measure \ndiameters of 1 ½ in. (38.1 mm] or less. A 0.002-in. (0.05-mm] additional \ntolerance is usually added on the \"go\" ring gage to allow clearance for \nsliding. On larger diameters, measurement is commonly performed with a \npi tape. Other test methods such as optical test methods may also be \nconsidered. \n13. Surface Condition \n13.1 All tubes shall be free of excessive mill scale, suitable \nfor inspection. A slight amount of oxidation will not be ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0455.json",
  "tabulaTablesCsv": "tables_tabula/page-0455.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0455.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5032,
  "bestTextAlphaRatio": 0.739,
  "noteOcrPath": "note_ocr/page-0455.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0455.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}