{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 756,
  "globalPageIndex": 1554,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-1008/SA-1008M (ASTM A1008/A1008M) ASME BPVC.II.A-2025 \n4.1.10 High-strength Low-alloy Steel (HSLAS, in Classes 1 \nand 2, in Grades 45 [310], 50 [340], 55 [380], 60 [410], 65 \n[450], and 70 [480] in Classes 1 and 2). \n4.1.11 High-strength Low-alloy Steel with Improved Form­\nability (HSLAS-F Grades 50 [340], 60 [410], 70 [480], and 80 \n[550]). \n4.1.11.1 HSLAS-F steel has improved formability when \ncompared to HSLAS. The steel is fully deoxidized, made to \nfine grain practice and includes microalloying elements such as \ncolumbium, vanadium, zirconium, and so forth. The steel shall \nbe treated to achieve inclusion control. \n4.1.12 Solution Hardened Steel (SHS). \n4.1.13 Bake Hardenable Steel (BHS). \n4.1.14 Required Hardness Steel (RHS). \n4.1.15 Full Hard Steel (FHS). \n4.2 When required for HSLAS and HSLAS-F steels, limi­\ntations on the use of one or more of the microalloy elements \nshall be specified on the order. \n4.3 Cold-rolled steel sheet is supplied for either exposed or \nunexposed applications. Within the latter category, cold-rolled \nsheet is specified either \"temper rolled\" or \"annealed last\" or \n\"full hard.\" For details on processing, attributes and \nlimitations, and inspection standards, refer to Specification \nA568/ A568M. \n5. Ordering Information \n5.1 It is the purchaser's responsibility to specify in the \npurchase order all ordering information necessary to describe \nthe required material. Examples of such information include, \nbut are not limited to, the following: \n5.1.1 ASTM specification number and year of issue. \n5.1.2 Name of material and designation (cold-rolled steel \nsheet) (include grade, type, and class, as appropriate, for CS, \nDS, DDS, EDDS, SFS, SS, HSLAS, HSLAS-F, RHS, FHS, \nSHS, or BHS) (see 4.1). \n5.1.2.1 When a Chemistry grade is specified in accordance \nwith Specification A568/A568M Table X2.3, the grade shall be \nfurnished as CS Type B - 1008, DS Type A - 1005, and so \nforth. \n5.1.2.2 When a Chemistry grade is specified in accordance \nwith Specification A568/ A568M Table X2; 1, with no reference \nto CS Type A, CS Type B, DS Type A, DS Type B, or SFS, the \ngrade shall be furnished as CS - 1005, CS - 1008, CS - 1020, \nand so forth, and meet chemistry specified in accordance with \nSpecification A568/A568M Table X2.l. \n5.1.2.3 When a type is not specified for CS or DS and there \nis no reference to a chemistry grade such as 1005, 1006, and so \nforth, Type B will be furnished (see 4.1). \n5.1.2.4 When SFS is specified, a chemistry grade designa­\ntion shall also be specified in accordance with Specification \nA568/A568M Table X2.1 (that is, 1010, 1020, and so forth), or \ncarbon and manganese in accordance with Specification A568/ \nA568M Table X2.2 (that is, C 0.12 % to 0.18 %, Mn 0.50 % to \n0.80 %, and so forth). The characteristics identifying the \nenhanced formability or mechanical properties shall be speci­\nfied by the user or purchaser, on the purchase order. If \nrequested, the producer or seller shall provide verification of \nspecial practices or mechanical properties supporting enhanced \nformability. \n5.1.2.5 When a class is not specified for HSLAS, Class 1 \nwill be furnished (see 4.1). \n5.1.2.6 When a type is not specified for SS 33 [230] and SS \n40 [275], Type 1 will be furnished (see 4.1). \n5.1.3 Classification (either exposed, unexposed, temper \nrolled, or annealed last) (see 4.3). \n5.1.4 Finish (see 9.1). \n5.1.5 Oiled or not oiled, as required (see 9.2). \n5.1.6 Dimensions (thickness, width, and whether cut lengths \nor coils). \nNorn 1-Not all producers are capable of meeting all the limitations of \nthe thickness tolerance tables in Specification A568/A568M. The pur­\nchaser should contact the producer regarding possible limitations prior to \nplacing an order. \n5.1.7 Coil size (must include inside diameter, outside \ndiameter, and maximum weight). \n5.1.8 Copper bearing steel (if required). \n5.1.9 Quantity. \n5.1.10 Application (part identification and description). \n5.1.11 A report of heat analysis will be supplied, if \nrequested, for CS, DS, DDS, EDDS, SFS, RHS, and FHS. For \nmaterials with required mechanical properties, SS, HSLAS, \nHSLAS-F, SHS, and BHS, a report is required of heat analysis \nand mechanical properties as determined by the tension test. \n5.1.12 Special requirements (if any). \n5 .1.12.1 When the purchaser requires thickness tolerances \nfor 3 /s in. [10 mm] minimum edge distance (see Supplementary \nRequirement in Specification A568/A568M), this requirement \nshall be specified in the purchase order or contract. \n5.1.12.2 Tighter requirements can be specified based on \nagreement between seller and purchaser. \nNorn 2-A typical ordering description is as follows: \nASTM Al008-XX, cold rolled steel sheet, CS Type A, exposed, matte \nfinish, oiled, 0.035 in. by 30 in. by coil, ID 24 in., OD 48 in., max weight \n15 000 lbs, 100 000 lb, for part No. 4560, Door Panel; or \nASTM A 1008M-XX, cold-rolled steel sheet, SS Grade 275, \nunexposed, matte finish, oiled, 0.88 mm by 760 mm by 2440 mm, \n10 000 kg, for shelf bracket. \n6. General Requirements for Delivery \n6.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A568/A568M unless otherwise provided herein. \n7. Chemical Composition \n7 .1 The heat analysis of the steel shall conform to the \nchemical composition requirements of the appropriate desig­\nnation shown in Table 1 for CS, DS, DDS, EDDS, and SFS, \nand in Table 2 for SS, HSLAS, HSLAS-F, SHS, and BHS. \n7 .2 Each of the elements listed in Tables 1 and 2, and \nSpecification A568/ A568M Table X2.3 shall be included in the \nreport of the heat analysis. When the amount of copper, nickel, \nchromium, or molybdenum is less than 0.02 %, report the \nanalysis as <0.02 % or the actual determined value. When the \namount of vanadium, columbium, or titanium is less than \n1500 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1554.json",
  "tabulaTablesCsv": "tables_tabula/page-1554.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1554.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5887,
  "bestTextAlphaRatio": 0.6851
}