{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 2,
  "globalPageIndex": 800,
  "width": 612.48,
  "height": 792.0,
  "text": "Date of Issuance: July 1, 2025 \nThis international code or standard was developed under procedures accredited as meeting the criteria for \nAmerican National Standards and it is an American National Standard. The standards committee that approved \nthe code or standard was balanced to ensure that individuals from competent and concerned interests had an op­\nportunity to participate. The proposed code or standard was made available for public review and comment, \nwhich provided an opportunity for additional public input from industry, academia, regulatory agencies, and \nthe public-at-large. \nASME does not \"approve,\" \"certify,\" \"rate,\" or \"endorse\" any item, construction, proprietary device, or activity. \nASME does not take any position with respect to the validity of any patent rights asserted in connection with \nany items mentioned in this document, and does not undertake to insure anyone utilizing a standard against lia­\nbility for infringement of any applicable letters patent, nor does ASME assume any such liability. Users of a code or \nstandard are expressly advised that determination of the validity of any such patent rights, and the risk of infrin­\ngement of such rights, is entirely their own responsibility. \nParticipation by federal agency representatives or persons affiliated with industry is not to be interpreted as \ngovernment or industry endorsement of this code or standard. \nASME accepts responsibility for only those interpretations of this document issued in accordance with the es­\ntablished ASME procedures and policies, which precludes the issuance of interpretations by individuals. \nThe endnotes and preamble in this document (if any) are part of this American National Standard. \n~ \n~ \nASME Collective Membership Mark \nASME Single Certification Mark \nThe ASTM standards included within this ASME publication have been reproduced \nthrough a license agreement with ASTM International. \nAll rights reserved. \"ASME\" and the above ASME symbols are registered trademarks of The American Society of Mechanical Engineers. No \npart of this document may be copied, modified, distributed, published, displayed, or otherwise reproduced in any form or by any means, \nelectronic, digital, or mechanical, now known or hereafter invented, without the express written permission of ASME. No works derived from \nthis document or any content therein may be created without the express written permission of ASME. Using this document or any content \ntherein to train, create, or improve any artificial intelligence and/or machine learning platform, system, application, model, or algorithm is \nstrictly prohibited. \nLibrary of Congress Catalog Card Number: 56-3934 \nAdopted by the Council of The American Society of Mechanical Engineers, 1914; latest edition 2025. \nThe American Society of Mechanical Engineers \nTwo Park Avenue, New York, NY 10016-5990 \nCopyright © 2025 by \nTHE AMERICAN SOCIETY OF MECHANICAL ENGINEERS \nAll rights reserved \nPrinted in U.S.A. \n-~ \n·-------✓-",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0800.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2995,
  "bestTextAlphaRatio": 0.7997
}