{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 679,
  "globalPageIndex": 1477,
  "width": 613.92,
  "height": 793.2,
  "text": "~ \n-----\nASME BPVC.II.A-2025 SA-962/SA-962M \nTABLE 2 Cone Proof Load Using 120° Hardened \nSteel Cone-MetricA \nCone Proof Load, kN \nNominal Thread Stress Based on Proof Stress Shown in \nSize, mm Pitch Area, mm 2 Column Header Below \n825 895 930 1035 1205 \nMPa MPa MPa MPa MPa \nM6 1 20.1 15.4 16.7 17.4 19.3 22.5 \nM8 1.25 36.6 27.3 29.6 30.8 34.3 39.9 \nM10 1.5 58.0 42.1 45.7 47.5 52.8 61.5 \nM12 1.75 84.3 59.5 64.5 67 74.5 87 \nM14 2 115 79 86 89.5 99.5 115.5 \nM16 2 157 104.5 113.5 117.5 131 152.5 \nM20 2.5 245 153 167 173 193 224 \nM22 2.5 303 184 200 208 231 269 \nM24 3 353 207 224 233 260 302 \nM27 3 459 256 278 289 322 374 \nM30 3.5 561 296 322 334 372 432 \nM36 4 817 382 416 432 480 558 \nABased upon the following equation (this equation should not be used for \nextrapolating values beyond the size ranges listed in this table) and rounded to \nnearest 3.5 MPa equivalent: \nCPL= (1 - 0.0120) X fXAsX0.001 \nwhere: \nCPL Cone stripping proof load, kN, \nD Nominal diameter of nut, mm, \nf Minimum proof stress of nut, MPa, \nAs Tensile stress area of nut, mm 2 = 0.7854 [D - 0.9382P] 2 , and \np Thread pitch, mm. \n15.2 Tension Tests, and, When Applicable, Impact Tests, \nBar, Rod, or Wire or Components, or Both, Machined from \nHeat Treated Bar, Rod, or Wire-Batch processing: One test \nper lot as defined in 3.1.10.1. Continuous processing as defined \nin 3.1.10.2: Not fewer than two tension and, when applicable, \nimpact tests are required for each lot containing 20 000 lb \n[9000 kg] or less. Every additional 10 000 lb [4500 kg] or \nfraction thereof requires one additional test. \n15.3 Tension Tests, Components Produced as Defined in \n8.6-The number of machined specimens or full size bolting \ncomponents tested shall be as follows: \nLot Size (pc) \n50 and less \n51 to 500 \n501 to 35 000 \nOver 35 000 \nSample Size \n2 \n3 \n5 \n8 \n15.4 Decarburization I Carburization Test, Carbon and \nAlloy Steel, Components Produced as Defined in 8.6 and Studs \nMachined from Cold or Hot Rolled and Heat Treated Bar \nWhose Diameter Prior to Machining Threads is Within 0.06 in. \n[1.5 mm] in Diameter of the Maximum Thread Diameter-One \ntest per lot (see 3.1.10). \n15.5 Hardness Tests: \n15.5.1 Hardness Tests, Bar, Rod, or Wire-One test per lot. \n15.5.2 Hardness Tests, Components-The minimum num-\nber of bolting components that must be hardness tested per lot, \nregardless of the manufactudng production process, shall \nconform to 15.3. \n15.6 Macroetch, Carbon and Alloy Steels Only-One test \nper lot. A lot in this case is defined as a single diameter of a \nsingle heat or the largest diameter of a single heat. \n15.7 Impact Tests-Three impact test specimens shall be \nmade for each lot when impact testing is required by the \nproduct specification. \n15.8 Other Tests-The number of tests shall be as specified \nby the purchaser or the individual product specification. \n16. Retests and Rework \n16.1 If the results of a mechanical test do not conform to \nspecified requirements, the manufacturer may perform a \ndouble retest in compliance with the applicable governing test \nmethods. If both retests pass, then the associated lot will be \nconsidered acceptable. In the case of impact testing, a single \nretest, consisting of three additional test specimens, may be \nperformed. However, each individual impact value must be \ngreater than the minimum specified average value. \n16.2 A lot may undergo a full reheat treatment no more than \ntwice. After reheat treatment, all required mechanical tests \nshall be performed. \n16.3 Rework-Repair by welding is prohibited. \n17. Inspection \n17 .1 The supplier shall afford the purchaser or inspector \nrepresenting the purchaser all reasonable facilities necessary to \nsatisfy him that the matedal is being produced and furnished in \naccordance with this specification and the applicable product \nspecification. Site inspection required by the purchaser shall \nnot interfere unnecessadly with the supplier's operations. \n17 .2 Personnel performing the nondestructive examination \nshall be qualified and certified in accordance with a wdtten \nprocedure conforming to ASNT Recommended Practice No. \n1419 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1477.json",
  "tabulaTablesCsv": "tables_tabula/page-1477.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1477.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4122,
  "bestTextAlphaRatio": 0.6601
}