{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 429,
  "globalPageIndex": 429,
  "width": 635.52,
  "height": 871.68,
  "text": ". '---\" \nASME BPVC.II.A-2025 SA-263 \nedges parallel. In reducing the thickness of the specimen, both \nthe alloy cladding and the base steel shall be machined so as to \nmaintain the same ratio of clad metal to base steel as is \nmaintained in the plate, except that the thickness of the clad \nmetal need not be reduced below Vs in. (3.1 mm). The sides of \nthe bend test specimen used for bond strength determination \nmay have the corners rounded to a radius not over V16 in. (1.6 \nmm) for plates, 2 in. (50 mm) and under in thickness, and not \nover Vs in. (3.1 mm) for plates over 2 in. (50 mm) in thickness. \n10. Product Analysis \n10.1 Product analysis may be required for the cladding alloy \non the finished product. Chemical analysis may be accom­\nplished by wet chemical or instrumental procedures. If wet \nchemical procedures are used, millings may be taken only \nwhen the composite plate thickness is sufficient to permit \nobtaining millings without danger of contamination from the \nadjacent layer. If spectrometric procedures are used, the sample \nshall be exposed on the center line of the cladding when there \nis sufficient cladding thickness available so that there is no \ncontamination from the adjacent base metal. \n10.2 If product analysis is specified by the purchaser for the \ncladding alloy, it shall be made from drillings or millings taken \nfrom the final piece or a broken test specimen. For wet \nchemical analysis, in order to avoid contamination by the base \nplate metal, millings of cladding samples shall be taken from \nthe test coupon by removal and discard of all the base metal \nplate material, plus 40 % of the cladding thickness from the \nbonded side, not to exceed V16 in. (1.6 mm). The material shall \nbe chemically cleaned and sufficient millings shall be taken to \nrepresent the full cross-section of the remainder. If there is \ninsufficient cladding thickness available to spectrographically \nexpose on the center line of the cladding without \ncontamination, 50 % of the cladding shall be removed and the \nsample exposed on this surface. \n10.3 Methods and practices relating to chemical analysis \nrequired by this specification shall be in accordance with the \nTest Methods, Practices, and Terminology of A751. \n10.4 Results of the product analysis shall conform to the \nrequirements of Section 7 of Specification A480/A480M. \n10.5 Results of the product analysis for the backing steel \nwhen required shall conform to the requirements of Section 7 \nof Specification A20/A20M. \n11. Permissible Variations \n11.1 Permissible variations except for thickness shall be in \naccordance with Specification A20/ A20M. \n11.2 Minimum thickness of the alloy cladding metal and of \nthe backing steel, or of the total composite plate shall be as \nrequired by purchase order documents when ordered to mini­\nmum thicknesses. \n11.3 Permissible variation in thickness when ordered to \nnominal thicknesses shall be 0.01 in. (0.3 mm) under each for \nbacking steel or total composite, and 0.03 in. (0.8 mm) under \nfor the alloy cladding . \n11.4 Permissible variations for excess thickness of the total \ncomposite shall be the greater of 0.125 in. (3 mm) or 10 % of \nthe total composite thickness ordered and may occur in either \nbacking steel, cladding, or both, provided the minimum for \neach is met. \n11.5 More restrictive or less restrictive permissible varia­\ntions may be agreed upon by the purchaser and the manufac­\nturer. \n12. Workmanship, Finish, and Appearance \n12.1 The material shall be free of injurious defects, shall \nhave a workmanlike appearance, and shall conform to the \ndesignated finish. \n12.2 Plate alloy surfaces shall be blasted (descaled by \nmeans such as sand or stainless grit, shot or wire, or \nequivalent), pickled, blast-cleaned and pickled, or 100 % \nconditioned. \n13. Bond Quality \n13.1 The cladding metal shall be integrally and continu­\nously bonded to the base metal. \n13.2 Inspection: \n13.2.1 Clad plates less than 3/s in. (10 mm) total minimum \ncomposite thickness shall be visually inspected for bond \nintegrity prior to shipment. \n13.2.2 Clad plates 3/s in. (10 mm) and thicker total minimum \ncomposite thickness, and when specified by the purchaser, clad \nplates less than 3/s in. (10 mm) total minimum composite \nthickness, shall be ultrasonically inspected for bond integrity \nprior to shipment in accordance with the Procedures and \nMethods of Specification A578/A578M. \n13.2.3 Areas of non-bond detected visually shall be ex­\nplored ultrasonically to determine the extent of the condition in \naccordance with 13.2.2. For purposes of defining non-bond, the \ncladding shall be interpreted to be unbonded when there is \ncomplete loss of back reflection accompanied by an echo \nindication from the plane of the interface of the clad and \nbacking steel. Areas within 1 in. (25 mm) of a cut edge on the \nplate that contain indications exceeding 50 % of the back \nreflection at the bond interface shall be considered to be \nunbonded. \n13.2.4 Extent of ultrasonic examination shall be at the \ndiscretion of the manufacturer and sufficient enough to provide \nthe quality level required by the purchaser. Plates may be \nordered with 100 % coverage (Supplementary Requirements \nS12). \n13.3 Quality Levels: \n377 \n13.3.1 Class I-No single unbonded area exceeding 1 in. \n(25 mm) in its longest dimension with total unbonded area not \nto exceed 1 % of the total cladded surface area. \n13.3.2 Class 3-No single unbonded area exceeding 3 in. \n(75 mm) in its longest dimension with total unbonded area not \nto exceed 3 % of the total cladded surface area. \n13.3.3 • Class 5-No single unbonded area exceeding 9 in.2 \n(58 cm 2 ) with total unbonded area not to exceed 5 % of the \ntotal cladded surface area. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0429.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5742,
  "bestTextAlphaRatio": 0.7503
}