{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 651,
  "globalPageIndex": 651,
  "width": 597.72,
  "height": 842.88,
  "text": "ASME BPVC.II.A-2025 SA-370 \nTABLE 5 Approximate Hardness Conversion Numbers for Austenitic Steels (Rockwell B to other Hardness Numbers) \nRockwell Superficial Hardness \nRockwell B \nScale, 100 kgf Load, Brinell Indentation Brinell Hardness, Rockwell A Scale, \n15T Scale, 30T Scale, 45T Scale, \nV1s- Diameter, mm 3000 kg! Load, 60 kgf Load, \n15 kgf Load, 30 kgf Load, 45 kg! Load, \nin. (1.588 mm) Ball 10 mm Ball Diamond Penetrator 1/win. (1.588 mm) 1/15-in. (1.588 mm) Ball \n100 3.79 256 61.5 \n99 3.85 248 60.9 \n98 3.91 240 60.3 \n97 3.96 233 59.7 \n96 4.02 226 59.1 \n95 4.08 219 58.5 \n94 4.14 213 58.0 \n93 4.20 207 57.4 \n92 4.24 202 56.8 \n91 4.30 197 56.2 \n90 4.35 192 55.6 \n89 4.40 187 55.0 \n88 4.45 183 54.5 \n87 4.51 178 53.9 \n86 4.55 174 53.3 \n85 4.60 170 52.7 \n84 4.65 167 52.1 \n83 4.70 163 51.5 \n82 4.74 160 50.9 \n81 4.79 156 50.4 \n80 4.84 153 49.8 \nhardness numbers shall be followed by the symbol HBW, and \nbe supplemented by an index indicating the test conditions in \nthe following order: \n17.5 .1.1 Diameter of the ball, mm, \n17.5.1.2 A value representing the applied load, kgf, and, \n17.5.1.3 The applied force dwell time, s, if other than 10 to \n15 s. \n17 .5 .1.4 The only exception to the above requirement is for \nthe HBW 10/3000 scale when a 10 to 15 s dwell time is used. \nOnly in the case of this one Brinell hardness scale may the \ndesignation be reported simply as HBW. \n17.5.1.5 Examples: 220 HBW = Brinell hardness of 220 \ndetermined with a ball of 10 mm diameter and with a test force \nof 3000 kgf applied for 10 to 15 s; 350 HBW 5/1500 = Brinell \nhardness of 350 determined with a ball of 5 mm diameter and \nwith a test force of 1500 kgf applied for 10 to 15 s. \n17.6 Detailed Procedure-For detailed requirements of this \ntest, reference shall be made to the latest revision of Test \nMethod El0. \n18. Rockwell Test \n18.1 Description: \n18.1.1 In this test a hardness value is obtained by determin­\ning the depth of penetration of a diamond point or a tungsten \ncarbide ball into the specimen under certain arbitrarily fixed \nconditions. A minor load of 10 kgf is first applied which causes \nan initial penetration, sets the penetrator on the material and \nholds it in position. A major load which depends on the scale \nbeing used is applied increasing the depth of indentation. The \nmajor load is removed and, with the minor load still acting, the \nRockwell number, which is proportional to the difference in \npenetration between the major and minor loads is determined; \nthis is usually done by the machine and shows on a dial, digital \n1/15-in. (1.588 mm) Ball Ball \n91.5 80.4 70.2 \n91.2 79.7 69.2 \n90.8 79.0 68.2 \n90.4 78.3 67.2 \n90.1 77.7 66.1 \n89.7 77.0 65.1 \n89.3 76.3 64.1 \n88.9 75.6 63.1 \n88.6 74.9 62.1 \n88.2 74.2 61.1 \n87.8 73.5 60.1 \n87.5 72.8 59.0 \n87.1 72.1 58.0 \n86.7 71.4 57.0 \n86.4 70.7 56.0 \n86.0 70.0 55.0 \n85.6 69.3 54.0 \n85.2 68.6 52.9 \n84.9 67.9 51.9 \n84.5 67.2 50.9 \n84.1 66.5 49.9 \ndisplay, printer, or other device. This is an arbitrary number \nwhich increases with increasing hardness. The scales most \nfrequently used are as follows: \nB \nC \nPenetrator \n1/15-in. tungsten carbide ball \nDiamond brale \nMaior \nLoad, kg! \n100 \n150 \n10 \n10 \n18 .1.2 Rockwell superficial hardness machines are used for \nthe testing of very thin steel or thin surface layers. Loads of 15, \n30, or 45 kgf are applied on a tungsten carbide ( or a hardened \nsteel) ball or diamond penetrator, to cover the same range of \nhardness values as for the heavier loads. Use of a hardened \nsteel ball is permitted only for testing thin sheet tin mill \nproducts as found in Specifications A623 and A623M using \nHR15T and HR30T scales with a diamond spot anvil. (Testing \nof this product using a tungsten carbide indenter may give \nsignificantly different results as compared to historical test data \nobtained using a hardened steel ball.) The superficial hardness \nscales are as follows: \nScale Maior Minor \nSymbol Penetrator Load, kgf Load, kg! \n15T 1/1B·in. tungsten carbide or steel ball 15 3 \n30T 1/1a-in. tungsten carbide or steel ball 30 3 \n45T 1/1s-in. tungsten carbide ball 45 3 \n15N Diamond brale 15 3 \n30N Diamond brale 30 3 \n45N Diamond brale 45 3 \n18.2 Reporting Hardness-In recording hardness values, the \nhardness number shall always precede the scale symbol, for \nexample: 96 HRBW, 40 HRC, 75 HR15N, 56 HR30TS, or 77 \nHR30TW. The suffix W indicates use of a tungsten carbide ball. \nThe suffix S indicates use of a hardened steel ball as permitted \nin 18.1.2. \n599 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0651.json",
  "tabulaTablesCsv": "tables_tabula/page-0651.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0651.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4489,
  "bestTextAlphaRatio": 0.5937
}