{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 354,
  "globalPageIndex": 354,
  "width": 638.88,
  "height": 874.32,
  "text": "SA-216/SA-216M (ASTM A216/A216M) ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall not apply unless specified in the purchase order. \nLists of standardized supplementary requirements for use at the option of the purchaser are included \nin Specifications A 703/ A 703M and A985/ A985M. Those which are ordinarily considered suitable for \nuse with this specification are given below. Others enumerated in Specifications A703/A703M and \nA985/A985M may be used with this specification upon agreement between the manufacturer and \npurchaser. \nSl. Unspecified Elements \nS2 .. Destruction Tests \nS3. Bend Test \nS4. Magnetic Particle Inspection \nSS. Radiographic Inspection \nSlO. Examination of Weld Preparation \nSlS. Quench and Temper Heat Treatment \nS50. Carbon Equivalent \nS50.1 When specified in the order, the maximum carbon \nequivalent shall be: \nGrade Carbon Equivalent, max \nWCA 0.50 \nWCB 0.50 \nwee o.55 \nS50.2 Carbon equivalent (CE) shall be determined as fol­\nlows: \nMn Cr+ Mo+ V Ni+ Cu \nCE= C+6+ 5 +-1-5-\nSSl. Requirements for Carbon Steel Castings for Hydro­\nfluoric Acid Alkylation Service \nS51.1 The maximum carbon equivalent shall be as follows: \nCE maximum \nMaximum specified section thickness less than or equal to 1 in. 0.43 \n[25mm] \nMaximum specified section thickness greater than 1 in. [25 mm] 0.45 \nS51.2 Determine the carbon equivalent (CE) as follows: \nMn (Cr+Mo+V) (Ni+Cu) \nCE=C+6+ 5 + 15 \nS51.3 Vanadium and niobium maximum content based upon \nheat analysis shall be: \nNoTE !-Niobium= columbium \nMaximum vanadium \nMaximum niobium \nMaximum vanadium plus niobium \n0.02 wt.% \n0.02 wt.% \n0.03wt. % \nS51.4 The sum of the nickel and copper contents for the \ncasting base metal, based upon heat analysis, shall not exceed \n0.15 wt.%. For weld filler metals used for repairs, the sum of \nthe chromium, nickel, and copper content, based on heat \nanalysis, shall not exceed 0.15 wt. %. \nS51.5 The minimum carbon content for the casting base \nmetal shall be 0.18 wt.%. The maximum carbon content shall \nbe as required for the appropriate grade. \nS51.6 Welding consumables for repair welds shall be of the \nlow-hydrogen type. E60:XX electrodes shall not be used. \nS51. 7 In addition to the requirements for product marking in \nthe specification, an \"HF-N\" stamp or marking shall be \nprovided on each casting to identify that the casting complies \nwith this supplementary requirement. \nS52. Lower Sulfur Maximum \nS52.l When specified in the order, the maximum sulfur \ncontent of Grade WCA, or Grade WCB, or Grade WCC shall \nnot exceed 0.030. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A216/A216M-18) that may impact the use of this standard. (Approved Sept. 1, 2021.) \n(1) Updated Supplementary Requirements S51.4 to S51.6 to \nmake base metal and weld filler metal chemistry requirements \nmore clear. \n302 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0354.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2937,
  "bestTextAlphaRatio": 0.7242
}