{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 472,
  "globalPageIndex": 472,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-278/SA-278M ASME BPVC.II.A-2025 \n, ' l I \nt \n' \nI I \nI I t I \nI I f I \nI ' I f I \n' \nI I I \nI I I I \nI I I I \n' \nI I I \nI I I J I t I \n\"·-'\"' \n\\..,_J \n...-w-+) () 1--w---f O ,- .. \nNumber of test bars in a single mold-2 suggested. \nL-see Table 1. \nD-see Table 1. \nW-not less than diameter, D. \n: I , ' J I \nI I \n' ' ' ' l ' I f \n,._ __ ) \nP-2 in. (50-mm) suggested \nN- 5/10 in. (8-mm) in diameter, suggested \nM-1.5 N, suggested \nFIG. 1 Suitable Design and Dimensions for Mold for Separately Cast Cylindrical Test Bars for Gray Iron \n11. Workmanship, Finish, and Appearance \n11.1 All castings shall be made in a workmanlike manner \nand shall confom1 to the dimensions on drawings furnished by \nthe purchaser. If the pattern is supplied by the purchaser \nwithout drawings, the dimensions of the casting shall be as \npredicted by the pattern. \n11.2 The surface of the casting shall be free of adhering \nsand, scale, cracks, and hot tears as determined by visual \nexamination. Other surface discontinuities shall meet the visual \nacceptance standards specified in the order. \n12. Sampling \n12.1 A lot shall consist of one of the following: \n12.l.l AH the metal poured from a single heating in a batch \ntype melting ft.u-nace, \n12.1.2 All the metal from two or more batch type melting \nfurnaces poured into a single ladle or single casting, or \n12.1.3 All the metal poured from a continuous melting \nfurnace for a given peliod of time between changes in charge, \nprocessing conditions, or aim-for chemistry or 4 h, whichever \nis the shorter period. \n12.1.3.1 The purchaser may agree to extend the 4-h time \nperiod to 8 h if the manufacturer can demonstrate sufficient \nprocess control to warrant such an extension. \n13. Tension Test Specimens \n13.1 Tension test specimens A and B in Fig. 2 shall be \nmachined from test bars A and B in Table 1, respectively. \n13.2 The purchaser shall specify whether test specimen B or \nC is to be machined from test bar C. If no choice is made, the \nmanufacturer shall make the selection. \n13.3 The size of the test specimen to be machined from test \nbar S shall be as agreed upon between the manufacturer and \npurchaser. \n420 \n14. Number of Tests and Retests \n14.l One tension test shall be pe1formed on each lot in \naccordance with Test Method ES and conform to the tensile \nrequirements specified. \n14.2 If the results of a valid test fail to conform to the \nrequirements of this specification, two retests shall be made. If \neither retest fails to meet the specification requirements, the \ncastings represented by these test specimens shall be rejected. \n14.3 If, after testing, a test specimen shows evidence of a \ndefect, the results of the test may be invalidated and another \nmade on a specimen from the same lot. \n15. Repair \n15.1 Any repairs performed on castings produced to this \nspecification shall be agreed upon between the manufacturer \nand purchaser. \n16. Certification \n16.1 When requested by the purchaser, the manufacturer \nshall furnish his certification stating that the matelial was \nmanufactured, sampled, tested, and inspected in accordance \nwith this specification including the year date. The certification \nshall also include the results of all tests performed. \n16.2 A signature is not required on the certification. How­\never, the document shall clearly identify the organization \nsubmitting the certification and the authorized agent of the \nmanufacturer who certified the test results. Notwithstanding \nthe absence of a signature, the organization submitting the \ncertification is responsible for its content. \n17. Inspection \n17. l All tests and inspections required by this specification \nshall be pe1fom1ed by nhe manufacturer or other reliable \nsources whose services have been contracted for by the ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0472.json",
  "tabulaTablesCsv": "tables_tabula/page-0472.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0472.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3711,
  "bestTextAlphaRatio": 0.743,
  "camelotTablesPath": "camelot_tables/page-0472.json",
  "camelotTablesCsv": "camelot_tables/page-0472.csv",
  "camelotTableCount": 1,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0472.txt",
  "gapOcrHighDpiLength": 3722
}