{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 759,
  "globalPageIndex": 1557,
  "width": 615.48,
  "height": 794.4,
  "text": ",,,,~. \nASME BPVC.II.A-2025 SA-1008/SA-1008M (ASTM A1008/A1008M) \nTABLE 5 Mechanical Property RequirementsA,a for Cold Rolled Steel Sheet Designations SHS and BHS \nYield Strength, min Tensile Strength, min \nElongation in Bake Hardening Index, min \nDesignation 2 in. or Upper Yield/Lower Yield \n50 mm, min., \nksi [MPa] ksi [MPa] % ksi [MPa] \nSHS: \nGrade 26 [180] 26 [180] 43 [300] 32 \nGrade 31 [210] 31 [210] 46 [320] 30 \nGrade 35 [240] 35 [240] 50 [340] 26 \nGrade 41 [280] 41 [280] 53 [370] 24 \nGrade 44 [300] 44 [300] 57 [390] 22 \nBHS: \nGrade 26 [180] 26 [180] 43 [300] 30 4/3 25/20 \nGrade 31 [210] 31 [210] 46 [320] 28 4/3 25/20 \nGrade 35 [240] 35 [240] 50 [340] 24 4/3 25/20 \nGrade 41 [280] 41 [280] 53 [370] 22 4/3 25/20 \nGrade 44 [300] 44 [300] 57 [390] 20 4/3 25/20 \nA Where an ellipsis ( ... ) appears in the table, there is no requirement. \n8 For coil products, testing by the producer is limited to the end of the coil. Mechanical properties throughout the coil shall comply with the minimum values specified. \ntesting is performed on a per-coil basis, only one test shall be \nmade for each master coil. \n(1) Requirements specified in 8.2.3.2 are minimum testing \nrequirements. Additional testing may be performed at the \nproducer's option, or upon agreement between producer and \nuser or seller and purchaser. \n(2) Testing of non-strength required grades may also be \nperformed as described in 8.2.3.2, for each specific non­\nstrength grade ordered. \n8.2.3.3 Tension test specimens shall be taken at a point \nimmediately adjacent to the material to be qualified. \n8.2.3.4 Tension test specimens shall be taken from the full \nthickness of the sheet. \n8.2.3.5 Tension test specimens shall be taken from a loca­\ntion approximately halfway between the center of the sheet and \nthe edge of the material as rolled. \n8.2.3.6 Tension test samples shall be taken with the length­\nwise axis of the test specimen parallel to the rolling direction \n(longitudinal test). \n8.2.3.7 Test Method-Yield strength shall be determined by \neither the 0.2 % offset method or the 0.5 % extension under \nload method unless otherwise specified. \n8.2.3.8 Bake hardenable steel shall conform to bake hard­\nening index requirements included in Table 5 for the grade \nspecified. The method for measuring the bake hardening index \nis described in Annex Al. Bake hardenable steel shall exhibit \na minimum increase in yield strength of 4 ksi [25 MPa] as \nbased on the upper yield point or 3 ksi [20 MPa] as based on \nthe lower yield stress, after a prestrained specimen has been \nexposed to a standard bake cycle (340 °F [170 °C]) for 20 min. \n8.2.4 Bending Properties: \n8.2.4.l The suggested minimum inside radii for cold bend­\ning are listed in Appendix Xl and is discussed in more detail \nin Specification A568/A568M (Section 6). Where a tighter \nbend radius is required, where curved or offset bends are \ninvolved, or where stretching or drawing are also a \nconsideration, the producer shall be consulted. \n8.3 RHS and FHS: \n8.3.1 The available hardness grades for RHS and FHS are \nshown in Table 6. \n8.3.2 The steel represented by RHS grades and FHS shall \nmeet the specified hardness shown in Table 6, as determined at \nthe time of shipment. \n8.3.2.1 Based on chemistry and processing parameters such \nas method of annealing ( continuous or box annealing), and \nrolling practice, RHS grades may be subject to aging and \npotentially exhibit greater hardness when tested at a later date. \n8.3.2.2 Due to the non-recrystallized microstructure, FHS is \nnot expected to be subject to aging. \n8.3.3 Hardness testing shall be performed by the producer, \nat the final processing step, prior to shipment, at a location not \nless than 1 in. [25 mm] from the edge of the sheet. \n9. Finish and Appearance \n9.1 Surface Finish: \n9.1.1 Unless otherwise specified, the sheet shall have a \nmatte finish. When required, specify the appropriate surface \ntexture and condition. For additional information, see the \nFinish and Condition section of Specification A568/A568M \n(may not apply when steel is ordered full hard (FHS), since the \nfinal process step is typically the cold reduction mill). For \nadditional information see \"Finish and Condition\" section of \nSpecification A568/ A568M. \n9.2 Oiling: \n9.2.1 Unless otherwise specified, the sheet shall be oiled \n(may not apply when steel is ordered full hard (FHS), since the \nfinal process step is typically the cold reduction mill). \n9.2.2 When required, specify the sheet to be furnished not \noiled (dry). \n10. Retests and Disposition of Non-Conforming Material \n10.1 Retests, conducted with the requirements of Subsec­\ntion 11.1 of Specification A568/ A568M, are permitted when an \nunsatisfactory test result is suspected to be the consequence of \nthe test method procedure. \n10.2 Disposition of non-conforming material shall be sub­\nject to the requirements of Subsection 11.2 of Specification \nA568/ A568M. \n1503 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1557.json",
  "tabulaTablesCsv": "tables_tabula/page-1557.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1557.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4934,
  "bestTextAlphaRatio": 0.6861
}