{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 288,
  "globalPageIndex": 1086,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-568/SA-568M (ASTM A568/A568M) ASME BPVC.II.A-2025 \nTABLE 13 Flatness TolerancesA of Temper Rolled, Levelled/=\" or \nPickled Hot-Rolled Sheet Cut Lengths 8 (All Designations) \nFlatness Tolerances, c in. \nSpecified Ordered Yield Strength, \nSpecified Ordered Specified Ordered min, ksi \nMinimum Thickness, Over \nin. Width, in. Under 45 to 55 to 80 to \n45 55° Under 100° \nao 0 \n0.027 to 0.057 incl To 36 incl ½ ¾ 1 1¼ \nover 36 to 60 incl ¾ 11/s 1½ 1¾ \nover 60 1 1½ 1¾ 2 \n0.057 to 0.180 excl To 60 incl ½ ¾ 1¼ \nover 60 to 72 incl ¾ 11/a 1½ 1¾ \nover 72 1 1½ 1¾ 2 \n0.180 to 0.230 excl To 60 incl ½ ¾ 1¼ \nover 60 to 72 incl ¾ 11/a 1 1h 1¾ \nover 72 1 1½ 1¾ 2 \nA The above table also applies to lengths cut from coils by the consumer when \nadequate flattening operations are performed. \n8 Application of this table to product in coil form is not appropriate unless the coil \nhas been rolled out and adequately flattened with all coil set removed. \nc Maximum deviation from a horizontal flat surface. \n0 0.071 minimum thickness of HSLA. \nE The term Levelled also includes but is not limited to Tension Levelled, Stretcher \nLevelled, Roller Levelled, & 2-Mill \nTABLE 14 Flatness TolerancesA of Non-Processed Hot-rolled \nSheet Cut Lengths 8 (All Designations) \nFlatness Tolerances,c in. \nSpecified Ordered Yield Strength, \nSpecified Ordered Specified Ordered min, ksi \nOver Minimum Thickness, in. Width, in. Under 45 to 55 to 80 to \n45 55° Under 100° \nao 0 \n0.027 to 0.057 incl To 36 incl 1½ 2¼ 2½ 2¾ \nover 36 to 60 incl 2¼ 3% 3½ 3¾ \nover 60 3 4½ 4¾ 5 \nover 0.057 to 0.180 excl over 12 to 60 incl 1½ 2¼ 2½ 2¾ \nover 60 to 72 incl 2¼ 3% 3½ 3¾ \nover 72 3 4½ 4¾ 5 \n0.180 to 0.230 excl over 12 to 60 incl 1½ 2¼ 2½ 2¾ \nover 60 to 72 incl 2¼ 3% 3½ 3¾ \nover 72 3 4½ 4¾ 5 \nA The above table also applies to lengths cut from coils by the consumer when \nadequate flattening operations are performed. \n8 Application of this table to product in coil form is not appropriate unless the coil \n-------1t=ia~s bel!ITTOlled\"outmll:f~y-flattenoow1thwlcoil set removed. \nc Maximum deviation from a horizontal flat surface. \n0 0.071 minimum thickness of HSLA. \n9.6.2 Hot-rolled pickled or descaled sheet is customarily \nfurnished oiled. If the product is not to be oiled, it must be so \nspecified since the cleaned surface is prone to rusting. \n9.6.3 Cold-rolled products covered by this specification can \nbe furnished oiled or not oiled as specified. \n9.7 Sheet steel in coils or cut lengths may contain surface \nimperfections that can be removed with a reasonable amount of \nmetal finishing by the purchaser. \n10. Workmanship \n10.1 Cut lengths shall have a workmanlike appearance and \nshall not have imperfections of a nature or degree for the \nproduct, the grade, class, and the quality ordered that will be \ndetrimental to the fabrication of the finished part. \n10.2 Coils may contain some abnormal imperfections that \nrender a portion of the coil unusable since the inspection of \ncoils does not afford the producer the same opportunity to \nremove portions containing imperfections, as in the case with \ncut lengths. \n10.3 Surface Conditions: \n10.3.1 Exposed cold-rolled sheet is intended for applica­\ntions where surface appearance is of primary importance, that \nis, exposed applications. Unexposed or annealed cold-rolled \nsheet is intended for applications where surface appearance is \nnot of primary importance, that is, unexposed applications. \n10.3.2 Cut lengths for exposed applications shall not in­\nclude individual sheets having major surface imperfections \n(holes, loose slivers, and pipe) and repetitive minor surface \nimperfections. Cut lengths may contain random minor surface \nimperfections that can be removed with a reasonable amount of \nmetal finishing by the purchaser. These imperfections shall be \nacceptable to the purchaser within the manufacturer's pub­\nlished standards. \n10.3.3 For coils for exposed applications, it is not possible \nto remove the surface imperfections listed in 10.3.2. Coils will \ncontain such imperfections which shall be acceptable to the \npurchaser within the manufacturer's published standards. Coils \ncontain more surface imperfections than cut lengths because \nthe producer does not have the same opportunity to sort \nportions containing such imperfections, as is possible with cut \nlengths. \n10.3.4 Cut lengths for unexposed applications shall not \ninclude individual sheets having major surface imperfections \nsuch as holes, loose slivers, and pipe. In addition, unexposed \ncut lengths can be expected to contain more minor imperfec­\ntions such as pits, scratches, sticker breaks, edge breaks, \npinchers, cross breaks, roll marks, and other surface imperfec­\ntions than exposed. These imperfections shall be acceptable to \nthe purchaser without limitation. \n10.3.5 For coils for unexposed applications, it is not pos­\nsible to remove the surface imperfections listed in 10.3.4. Coils \nwiH-eontain smface impetfecti~~r=ep-arrna·:..-_-------f \n986 \nable. Minor imperfections shall be acceptable to the purchaser \nwithin the manufacturer's published standards. Unexposed \ncoils contain more surface imperfections than exposed coils. \n11. Retests and Disposition of Non-Conforming Material \n11.1 Retests: \n11.1.1 Unless otherwise prohibited by the product \nspecification, retests are permitted under the following circum­\nstances: \n11.1.1.1 If any tension test specimen shows defective ma­\nchining or develops flaws, it must be discarded and another \nspecimen substituted. \n11.1.1.2 If the percent elongation of any tension test speci­\nmen is less than that specified and any part of the fracture is \nmore than ¾ in. [20 mm] from the center of the gauge length \nof a 2-in. [50-mm] specimen, or is outside the middle half of ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1086.json",
  "tabulaTablesCsv": "tables_tabula/page-1086.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1086.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5748,
  "bestTextAlphaRatio": 0.7208
}