{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 283,
  "globalPageIndex": 1081,
  "width": 627.84,
  "height": 804.24,
  "text": "Major imperfections: \nCut lengths \nCoils \nMinor imperfections: \nCut lengths \nCoils \nFinish \nSpecial oils \nThickness, width and length tolerance: \nStandard \nRestricted \nFlatness tolerance: \nStandard \nRestricted squareness \nCoil wraps \nCoil welds \nOutside inspection \nSpecial testing \nASME BPVC.II.A-2025 SA-568/SA-568M (ASTM A568/A568M) \nTABLE 1 Cold-Rolled Sheet Steel Class Comparison \nExposed \nMill rejects \nPurchaser accepts within the manufacturer's published \nstandards (policy) \nMill rejections repetitive imperfections. May contain random \nimperfections which the purchaser accepts within the \nmanufacturer's published standards (policy) \nPurchaser accepts within the manufacturer's published \nstandards (policy) \nMatte unless otherwise specified \nMay be specified \nWill be met \nMay be specified \nWill be met \nMay be specified \nPurchaser accepts within the manufacturer's published \nstandards {policy) \nPurchaser accepts within the manufacturer's published \nstandards (policy) \nMay be specified \nMay be specified \nUnexposed \nMill rejects \nPurchaser accepts within the manufacturer's published \nstandards (policy) \nPurchaser accepts all minor imperfections \nPurchaser accepts all minor imperfections \nPurchaser accepts all finishes \nMay not be specified \nWill be met \nMay not be specified \nWill be met {temper rolled) Not guaranteed-normally \nwithin twice standard {annealed last) \nMay not be specified \nPurchaser accepts all \nPurchaser accepts within the manufacturer's published \nstandards (policy) \nMay not be specified \nMay not be specified \nAfter annealing, cold-rolled sheet is generally given a light sitions are required for carbon steel, they shall be prepared in \nskin pass to impart shape or may be given a heavier skin pass accordance with Appendix X2. \nor temper pass to prevent the phenomenon known as stretcher 5.1.2 Where the material is used for fabrication by welding, \nstraining or fluting, when formed. Temper passing also pro- care must be exercised in selection of chemical composition or \nvides a required surface texture. mechanical properties to assure compatibility with the welding \n4.5 Temper Rolling: process and its effect on altering the properties. \n4.5.1 Unless otherwise specified, cold-rolled sheet for ex- 5.2 Cast or Heat Analysis: \nposed applications shall be temper rolled and is usually 5.2.1 An analysis of each cast or heat of steel shall be made \n~~~~~~ 7 s~pe;,;c:-ifi-,;,_e;:;:dr'wanindliYfurnTI1,· s_h_ed~in~th_e_s_tr_am_· ~fr_e_e_c_o_ndi_'_ti_o_n_a_s_s_hi~·p_._p_ed~~b~y~th~e\", steel manufacturer to determine the percentage of \n(see Appendix XI). elements specified or restricted-by-the-applieahle.speGHi~\"\"onlh--~~~-'-\n4.5.2 Cold-rolled sheet for unexposed applications may be 5.2.2 When requested, cast or heat analysis for elements \nspecified and furnished \"annealed last\" or \"temper rolled.\" listed or required shall be reported to the purchaser or to his \n\"Annealed last\" is normally produced without temper rolling representative. The steel manufacturer, or the hot roll \nbut may be lightly temper rolled during oiling or rewinding. manufacturer, cold roll manufacturer, or processor, if different \nUnexposed temper-rolled material may be specified strain-free from the steel manufacturer, is responsible for providing this \nor nonfluting. Where specific hardness range or limit or a information to the purchaser or his representative as requested. \nspecified surface texture is required, the application is consid-\nered as exposed. 5.3 Product, Check, or Verification Analysis: \n5.3.1 Non-killed steels such as capped or rimmed steels are NOTE 3-Skin-passed sheet is subject to an aging phenomenon (see \nAppendix Xl). Unless special killed (nonaging) steel is specified, it is to not technologically suited to product analysis due to the \nthe user's interest to fabricate the sheet as soon as possible, for optimum nonuniform character of their chemical composition; therefore, \nperformance. the tolerances in Table 2 do not apply. Product analysis is \n5. Chemical Composition \n5.1 Limits: \n5.1.1 The chemical composition shall be in accordance with \nthe applicable product specification. However, if other compo-\n981 \nappropriate on these types of steel only when misapplication is \napparent or for copper when copper steel is specified. \n5.3.2 For steels other than non-killed (capped or rimmed), \nproduct analysis may be made by the purchaser. The chemical \nanalysis shall not vary from the limits specified by more than ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1081.json",
  "tabulaTablesCsv": "tables_tabula/page-1081.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1081.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4485,
  "bestTextAlphaRatio": 0.7835,
  "noteOcrPath": "note_ocr/page-1081.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1081.txt",
  "noteOcrHighDpiCount": 1,
  "noteOcrHighDpiNotes": [
    "Note 3—Skin-passed sheet is subject to an aging phenomenon (see"
  ]
}