{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 694,
  "globalPageIndex": 694,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-376/SA-376M ASME BPVC.II.A-2025 \nNPS [DN] Designator Hole Diameter \n0.039 in. [1 mm] \nabove ½ to 1 ¼ [15 to 32] 0.055 in. [1.4 mm] \nabove 1 ¼ to 2 [32 to 50] 0.071 in. [1.8 mm] \nabove 2 to 5 [50 to 125] 0.087 in. [2.2 mm] \nabove 5 [125] 0.106 in. [2.7 mm] \n10.10.3.2 Transverse Tangential Notch-Using a round tool \nor file with a ¼-in. [6.4-rmn] diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the pipe. Said notch shall have a depth not \nexceeding 12½ % of the specified nominal wall thickness of \nthe pipe or 0.004 in. [0.102 mm], whichever is greater. \n10.10.3.3 Longitudinal Notch-A notch 0.031 in. [0.8 mm] \nor less in width shall be machined in a radial plane parallel to \nthe tube axis on the outside surface of the pipe, to have a depth \nnot exceeding 12½ % of the specified wall thickness of the \npipe or 0.004 in. [0.1 mm], whichever is greater. The length of \nthe notch shall be compatible with the testing method. \n10.10.3.4 More or smaller reference discontinuities, or both, \nmay be used by agreement between the purchaser and the \nmanufacturer. \n10.11 Standardization Procedure: \n10.11.1 The test apparatus shall be standardized at the \nbeginning and end of each series of pipes of the same size \n(NPS or diameter and schedule or wall thickness), grade and \nheat treatment condition, and at intervals not exceeding 4 h. \nMore frequent standardization may be performed at the manu­\nfacturer's option or may be required upon agreement between \nthe purchaser and the manufacturer. \n10.11.2 The test apparatus shall also be standardized after \nany change in test system settings; change of operator; equip­\nment repair; or interruption due to power loss, process \nshutdown, or when a problem is suspected. \n10.11.3 The reference standard shall be passed through the \ntest apparatus at the same speed and test system settings as the \npipe to be tested. \n10.11.4 The signal-to-noise ratio for the reference standard \nshall be 2½ to 1 or greater. Extraneous signals caused by \nidentifiable causes such as dings, scratches, dents, straightener \nmarks, and so forth, shall not be considered noise. The \nrejection amplitude shall be adjusted to be at least 50 % of full \nscale of the readout display. \n10.11.5 If upon any standardization, the rejection amplitude \nhas decreased by 29 % (3 dB) of peak height from the last \nstandardization, the pipe since the last calibration shall be \nrejected. The test system settings may be changed, or the \ntransducer(s), coil(s) or sensor(s) adjusted, and the unit \nrestandardized, but all pipe tested since the last acceptable \nstandardization must be retested for acceptance. \n10.12 Evaluation of Imperfections: \n10.12.1 Pipes producing a signal equal to or greater than the \nlowest signal produced by the reference standard(s) shall be \nidentified and separated from the acceptable pipes. The area \nproducing the signal may be reexamined. \n10.12.2 Such pipes shall be rejected if the test signal was \nproduced by imperfections that cannot be identified or was \nproduced by cracks or crack-like imperfections. These pipes \nmay be repaired in accordance with Sections 12 and 13. To be \naccepted, a repaired pipe must pass the same nondestructive \n644 \ntest by which it was rejected, and it must meet the minimum \nwall thickness requirements of this specification. \n10.12.3 If the test signals were produced by visual imper-\nfections such as: \n(I) Scratches, \n(2) Surface roughness, \n(3) Dings, \n( 4) Straightener marks, \n(5) Cutting chips, \n(6) Steel die stamps, \n(7) Stop marks, or \n(8) Pipe reducer ripple. \nThe pipe may be accepted based on visual examination \nprovided the imperfection is less than 0.004 in. [0.1 mm] or \n12½ % of the specified wall thickness (whichever is greater). \n10.12.4 Rejected pipe may be reconditioned and retested \nproviding the wall thickness is not decreased to less than that \nrequired by this or the product specification. The outside \ndiameter at the point of grinding may be reduced by the amount \nso removed. To be accepted, retested pipe shall meet the test \nrequirement. \n10.12.5 If the imperfection is explored to the extent that it \ncan be identified as non-rejectable, the pipe may be accepted \nwithout further test providing the imperfection does not en­\ncroach on the minimum wall thickness. \n11. Mechanical Tests Required \n11.1 Lot-For tension and flattening tests, the term \"lot\" \nshall be as follows: \n11.1.1 Where the final heat treated condition is obtained in \na continuous furnace or by quenching after hot forming, the \nterm lot shall apply to all pipes of the same specified outside \ndiameter and specified wall thickness (or schedule) of the same \nheat, heat treated in the same furnace at the same temperature, \ntime at heat, and furnace speed in the same production run, or \nall pipes of the same specified outside diameter and specified \nwall thickness (schedule) of the same heat, hot formed and \nquenched in the same production run. \n11.1.2 Where the final heat treated condition is obtained in \na batch-type furnace equipped with recording pyrometers and \nautomatically controlled within a 50 °F [30 °C] or lesser range, \nthe term lot shall apply to all pipes of the same specified \noutside diameter and specified wall thickness (schedule) of the \nsame heat, subjected to the same finishing temperature within \nthe same production run. \n11.1.3 Where the final heat treated condition is obtained in \na batch-type furnace not equipped with recording pyrometers \nand automatically controlled within a 50 °F [30 °C] or lesser \nrange, the term lot shall apply to the larger of: (I) each 200 ft \n[60 m ] or fraction thereof and (2) those pipes heat treated in \nthe same furnace batch charge for pipes of the same specified \noutside diameter and specified wall thickness (or schedule) that \nare produced from the same heat of steel and are subjected to \nthe same finishing temperature within the same production run. \n11.2 Transverse or Longitudinal Tension Test-One tension \ntest shall be made on a specimen for lots of not more than 100 \npipes. Tension tests shall be made on specimens from two tubes \nfor lots of more than 100 pipes. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0694.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6206,
  "bestTextAlphaRatio": 0.737
}