{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 588,
  "globalPageIndex": 588,
  "width": 619.08,
  "height": 858.72,
  "text": "SA-350/SA-350M (ASTM A350/A350M} ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nIn addition to any supplementary requirements of Specification A961/A961M, the following \nsupplementary requirements shall apply only when specified by the purchaser in the order: \nSl. Other Impact Test Temperatures \nS 1.1 Impact test temperatures lower or higher than the \nstandard temperature in Table 4 of this specification shall be \nused. \nS 1.1.1 When higher test temperatures are employed, the \nactual test temperature may not be higher than that given in \nTable Sl.1.1. \nS 1.2 The test temperature shall be specified by the pur­\nchaser. When subsize specimens are used, the manufacturer \nshall adjust the test temperature in accordance with the size \nrestrictions of 7.2.4.2 and 7.2.4.3. \nSl.3 The forging shall be marked with the specified test \ntemperature in accordance with 15.1.5. A lower temperature \nshall not be marked on the forging because of the use of \nsubsize specimens. \nS 1 .4 The test results shall comply with Table 3 for standard \nsize specimens, and with Table 5 for subsize specimens. \nS2. Stress-Relieved Test Specimens \nS2. l The test specimens shall be stress relieved. Stress \nrelieving shall be done after heat treatment in 5.4 and before \nmachining the specimens from the heat-treated test material. \nS2.2 The purchaser shall furnish the forging manufacturer \nwith details of the stress-relief treatment desired. \nS3. Lateral Expansion \nS3.l Lateral expansion of the Charpy V-notch test shall be \nmeasured and reported. \nTABLE S1.1.1 Maximum Supplemental Test Temperatures \nGrade \nLF1 \nLF2, Class 1 \nLF3, Classes 1 and 2 \nLF5, Classes 1 and 2 \nLF6, Classes 1 and 2 \nLF9 \nLF787, Class 2 \nLF787, Class 3 \nLF2 Class 2 \nLF6 Class 3 \nMaximum Test Temperature, \"F [\"CJ \n-10 [-23] \n-35 [-37] \n-125 [-87] \n-60 [-51] \n-40 [-40] \n-80 [-62] \n-60 [-51] \n-80 [-62] \n+10 [-12) \n+10 [-12] \nS4. Vacuum Carbon-Deoxidized Steels \nS4.1 Material made to Grades LFl, LF2, LF3, LF5, and LF9 \nshall be vacuum carbon-deoxidized, in which case the silicon \ncontent shall be 0.12 % maximum. The test report shall \nindicate that the steel was vacuum carbon-deoxidized. \nSS. Special Impact Test Requirements for Flanges (Note \nSS.1) \nS5.l Charpy test specimens shall be cut from an actual \nflange representing each size, heat, and heat-treatment lot. If \nmore than one size flange is represented by the same heat and \nheat-treatment lot, the maximum size flange shall be consid­\nered representative. \n536 \nS5.2 The number, location, and orientation of the test \nspecimens shall be stated on the order. \nS5.3 The test results shall comply with Table 3 for standard \nsize specimens, and with Table 5 for subsize specimens. \nNorn S5.1-These special requirements should be considered for \nservices when the applied stresses approach the maximum permissible \nlimits of the governing code, or the installation is subject to severe cyclic \nconditions (7000 or more cycles over the expected life of the installation), \nor both. \nS6. Carbon Equivalent \nS6.l The maximum carbon equivalent based on heat analy­\nsis shall be as shown in Table S6.1. \nTABLE S6.1 Maximum Carbon Equivalent Value \nGrade \nLF1 \nLF2 CL 1 and CL2 \nLF6 CL1 \nLF6 CL2 \nMax. Thickness Less \nThan or Equal to 2 in. \n0.45 \n0.47 \n0.45 \n0.47 \nMax. Thickness \nGreater Than 2 in. \n0.46 \n0.48 \n0.46 \n0.48 \nS6.2 Determine the carbon equivalent (CE) as follows: \nCE = C + Mn/6 + (Cr + Mo + V)/5 + (Ni + Cu)/15 \nS6.3 A lower maximum carbon equivalent may be agreed \nupon between the supplier and the purchaser. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0588.json",
  "tabulaTablesCsv": "tables_tabula/page-0588.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0588.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3549,
  "bestTextAlphaRatio": 0.7044
}