{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 121,
  "globalPageIndex": 919,
  "width": 620.16,
  "height": 798.0,
  "text": "L \nASME BPVC.II.A-2025 SA-484/SA-484M \n7.3.2.2 Process annealing shall consist of completing hot \nworking above the minimum annealing temperature required \nfor each grade as indicated in Table 2, and cooling rapidly \nenough to prevent unacceptable precipitation of intermetallic \nphases. \n7.4 Ferritic Grades-Ferritic grades shall be annealed to \nmeet their respective mechanical testing requirements as \nshown in the applicable product specification. \n7.5 Martensitic Grades: \n7.5.1 All martensitic grades shall be supplied in either the \nannealed condition or in the tempered condition as specified by \nthe purchaser. Tempered material shall be normalized, or shall \nbe liquid quenched from 1700 °F [925 °C], minimum, fol­\nlowed by tempering in accordance with 7.5.2, 7.5.3, or 7.5.4. \n7.5.2 Types 403 and 410 tempered material shall be held at \nthe tempering temperature for at least 1 h/in. [25.4 mm] of \ncross section as follows: \n7.5.2.1 Condition 1-1250 °F [675 °C] minimum; 1400 °F \n[760 °C] maximum. \n7.5.2.2 Condition 2-1100 °F [595 °C] minimum, 1400 °F \n[760 °C] maximum. \n7.5.2.3 Condition 3-1050 °F [565 °C] minimum, 1400 °F \n[760 °C] maximum. \n7.5.3 Types XM-30, 414, and 431 tempered materials shall \nbe held at 1100 °F [595 °C], minimum for at least 1 h/in. \n[25 mm] of cross section. Maximum tempering temperature \nshall be 1400 °F [7 60 °C]. \n7.5.4 S41500 shall be heated to 1750 °F [955 °C] minimum, \nair cooled to 200 °F [95 °C] or lower prior to any optional \nintermediate temper and prior to the final temper. The final \ntemper shall be between 1050 and 1150 °F [565 and 620 °C]. \n7.5.5 When the purchaser elects to perform the hardening \nand tempering heat treatment, martensitic materials shall be \nsupplied by the manufacturer in the annealed condition (see \n7.5.1). In this case the purchaser shall be responsible to apply \nthe proper heat treatment and to conduct the tests deemed \nnecessary to assure that the required properties are obtained. \n8. Finish \n8.1 The following types of finishes are permitted, as appli­\ncable to the product ordered: \n8.1.1 Hot-finished Bars-Hot-finished bars shall have the \nsurface finish that results from hot processing, with or without \ncertain additional surface modification. Hot-finished bars are \ncommonly produced by hot rolling, forging, pressing, \nextruding, or similar hot working procedures applied to ingots, \nblooms, or billets. The resulting products are typically subject \nto various additional operations affecting the surface of the \nbars, including but not limited to one or more of the following: \nannealing or other heat treatment; cleaning by blasting, \npickling, or other descaling methods; rough turning; and \nmachine straightening. The producer is permitted to use \ncenterless grinding, polishing, or other operations commonly \nassociated with cold finishing in order to provide improved \ndimensional tolerances or surface condition for the hot-finished \nbar. The dimensional tolerances applicable to hot-finished bars \nare less stringent than those applicable to cold-finished bars. \n8.1.2 Bars Cut from Strip or Plate-Bars cut from flat-rolled \nstainless steel products shall have two surfaces that are pickled \nor descaled, and two cut surfaces, except when the bar is heat \ntreated subsequent to cutting, in which case all surfaces shall \nbe descaled or pickled. \n8.1.3 Cold-finished Bar-Cold-finished bars shall have the \nsurface finish that results from hot-finished bars being further \nprocessed by additional mechanical operations on the surface \nof the bar, including but not limited to light cold drawing, \nburnishing, centerless grinding, and polishing to provide closer \ntolerances and improved surface finish. The dimensional tol­\nerances applicable to cold-finished bars are more stringent than \nthose applicable to hot-finished bars. \n8.1.4 Bars and Billets or Other Semi-finished Material for \nReforging-Material intended for reforging shall be delivered \nin the hot-finished condition or in the cold-drawn condition. \nThe cold-drawn condition alternative is only permitted for \naustenitic and austenitic-ferritic stainless steel forgings. When \ndelivered in the hot-finished condition, it is permitted to \ncondition the surface by removing surface defects provided \nthat the depth of the conditioning does not exceed that which \naffects the surface condition or dimensions of the article to be \nforged from the bar or billet. When delivered in the cold-drawn \ncondition, it is permitted to hot forge forgings from cold-drawn \nbar provided this bar has been cold-drawn from material in the \nsolution-annealed condition. \n8.1.5 Shapes-Shapes shall be descaled by machining, \ngrinding, blasting, or pickling. \n8.1.5.1 Shapes shall be subject to either Class A or Class C \nsurface preparation as specified on the purchase order. Class A \nconsists of grinding for the removal of imperfections of a \nhazardous nature, such as fins, tears, and jagged edges, \nprovided the underweight tolerance is not exceeded and the \nmaximum depth of grinding at any one point does not exceed \n10 % of the thickness of the section. Class C consists of \ngrinding for the removal of all visible surface imperfections, \nprovided that the underweight tolerance is not exceeded and \nthe maximum depth of grinding at any point does not exceed \n10 % of the thickness of the section. \n8.1.6 Forgings-Forgings shall be descaled by machining, \nblasting, or pickling. The selection of the descaling methods \nshall be at the option of the producer unless a particular \ndescaling method is specified in the purchase order. \n819 \n9. Dimensions, Mass, and Permissible Variations \n9.1 Unless otherwise specified on the purchase order, the \nmaterial shall conform to the permitted variations in dimen­\nsions as specified in the following: \n9.1.1 Bars-Tables 3-12. \n9.1.2 Shapes-Tables 13-19 and Figs. 1 and 2. \n9.1.3 Forgings-As specified in the purchase order, or in \nprints or sketches accompanying the purchase order. \n9.1.4 Billets or Other Semi-finished Material for \nReforging-Billets and other semi-finished material shall con­\nform to the shape and dimensions specified by the purchaser \nwithin a permitted variation of ±5 %. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0919.json",
  "tabulaTablesCsv": "tables_tabula/page-0919.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0919.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6197,
  "bestTextAlphaRatio": 0.7512
}