{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 646,
  "globalPageIndex": 646,
  "width": 620.76,
  "height": 859.92,
  "text": "SA-370 ASME BPVC.II.A-2025 \nlengths over 2 in. A percentage scale reading to 0.5 % of the \ngauge length may be used. The elongation is the increase in \nlength of the gauge length, expressed as a percentage of the \n01iginal gauge length. In recording elongation values, give both \nthe percentage increase and the original gauge length. \n14.4.2 If any part of the fracture takes place outside of the \nmiddle half of the gauge length or in a punched or scribed mark \nwithin the reduced section, the elongation value obtained may \nnot be representative of the material. If the elongation so \nmeasured meets the minimum requirements specified, no \nfurther testing is indicated, but if the elongation is less than the \nminimum requirements, discard the test and retest. \n14.4.3 Automated tensile testing methods using extensom­\neters allow for the measurement of elongation in a method \ndescribed below. Elongation may be measured and reported \neither this way, or as in the method described above, fitting the \nbroken ends together. Either result is valid. \n14.4.4 Elongation at fracture is defined as the elongation \nmeasured just prior to the sudden decrease in force associated \nwith fracture. For many ductile materials not exhibiting a \nsudden decrease in force, the elongation at fracture can be \ntaken as the strain measured just prior to when the force falls \nbelow 10 % of the maximum force encountered during the test. \n14.4.4.1 Elongation at fracture shall include elastic and \nplastic elongation and may be determined with autographic or \nautomated methods using extensometers verified over the \nstrain range of interest. Use a class B2 or better extensometer \nfor materials having less than 5 % elongation; a class C or \nbetter extensometer for materials having elongation greater \nthan or equal to 5 % but less than 50 %; and a class D or better \nextensometer for materials having 50 % or greater elongation. \nIn all cases, the extensometer gauge length shall be the nominal \ngauge length required for the specimen being tested. Due to the \nlack of precision in fitting fractured ends together, the elonga­\ntion after fracture using the manual methods of the preceding \nparagraphs may differ from the elongation at fracture deter­\nmined with extensometers. \n14.4.4.2 Percent elongation at fracture may be calculated \ndirectly from elongation at fracture data and be reported \ninstead of percent elongation as calculated in 14.4.1. However, \nthese two parameters are not interchangeable. Use of the \nelongation at fracture method generally provides more repeat­\nable results. \n14.5 Reduction of Area-Fit the ends of the fractured \nspecimen together and measure the mean diameter or the width \nand thickness at the smallest cross section to the same accuracy \nas the original dimensions. The difference between the area \nthus found and the area of the original cross section expressed \n594 \nas a percentage of the original area is the reduction of area. \nR \n(l m \nFIG. 7 Stress-strain Diagram Showing Yield Point Corresponding \nWith Top of Knee \nn \n:I: \nI \nR. ---------------~-~-~-~-~--~-u---~•~ \n1r \nI \nI \nl \nI \nI \nl \nI \n\\ \nI \nl \nI \nI \nI \nI \nI \nI \nI \nI \nI \nl \nI \n' I \nI \nI \nI \nI \n0 Strain :m \n!•--------- ·-•---. ------ ....: \nom = Extension Under J.oad ' \nFIG. 8 Stress-strain Diagram Showing Yield Point or Yield \nStrength by Extension Under Load Method ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0646.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3364,
  "bestTextAlphaRatio": 0.7524
}