{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 455,
  "globalPageIndex": 1253,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-705/SA-70SM \n5.3 When specified on the order, sample forging may be \nsectioned and etched to show flow lines and the condition in \nregard to internal imperfections. When so specified, the \nquestion of acceptable and unacceptable metal flow shall \nbe subject to agreement between the manufacturer and the \npurchaser prior to order entry. \n5.4 When specified on the order, the manufacturer shall \nsubmit for approval of the purchaser a sketch showing the \nshape of the rough forging before machining, or before \nheat treating for mechanical properties. \n5.5 The grain size shall be as fine as practicable and \nprecautions shall be taken to minimize grain growth. \n5.6 Material of types other than XM-9 shall be fur­\nnished in the solution-annealed condition, or in the equal­\nized and over-tempered condition, as noted in Table 2 \nunless otherwise specified by the purchaser. ' \n5.6.1 Types 630, XM-16, and XM-25 may be fur­\nnished in the solution-annealed or age-hardened condition. \n6. Chemical Composition \n6.1 The steel shall conform to the chemical composition \nlimits specified in Table 1. \n6.2 Methods and practices relating to chemical analysis \nrequired by this specification shall be in accordance with \nTest Methods, Practices, and Terminology A 751. \n7. Mechanical Properties \n7 .1 The material, as represented by mechanical test \nspecimens, shall conform to the mechanical property \nrequirements specified in Table 2 and shall be capable of \ndeveloping the properties in Table 3 when heat treated as \nspecified in Table 3. \n7 .2 The yield strength shall be determined by the offset \nmethod as described in the current edition of Test Methods \nand Definitions A 370. The limiting permanent offset shall \nbe 0.2% of the gage length of the specimen. \n7.3 The impact strength shall be determined at 70 to \n80°F [20 to 25°C], by Charpy V-notch specimen Type A \nas described in Test Methods and Definitions A 370. \n7 .4 Material tensile tested and, when specified, impact \ntested in the transverse direction (perpendicular to the forg­\ning flow lines) and meeting the requirements shown in \nTable 3 need not be tested in the longitudinal direction. \n7.5 Samples cut from forging shall conform to the \nmechanical properties of Table 3 when heat treated as \nspecified in Table 2 and Table 3 and tested in accordance \nwith Test Methods and Definitions A 370. \n8. Prolongations for Tests \n8.1 Subject to Section 7, the forgings shall be produced \nwith prolongations for testing, unless otherwise. specified. \nThe producer may elect to submit an extra forging to repre­\nsent each test lot instead of prolongations, or the test speci­\nmens can be taken from the forgings themselves. \n9. Number of Tests \n9.1 For all classes of forgings weighing from 5000 to \n7000 lb [2300 to 3200 kg] each, at least one tension test \nshall be made from each forging. \n9.2 For all classes of forgings weighing more than 7000 \nlb [3200 kg] each, one tension test shall be made from \neach end of each forging. In the case of ring forgings, the \ntension test specimen shall be removed from each of two \nlocations on the periphery, approximately 180° apart, or \ninsofar as practicable, from opposite ends of the forging. \n9.3 For forgings weighing less than 5000 lb [2300 \nkg] each, one tension test shall be made from each size \nclassification for each heat . in each heat treating charge. \nWhere continuous heat treating furnaces are used, tests \nshall be made on 10% of the forgings of each size classifi­\ncation from each heat subjected to the same heat treatment \npractice. \n10. Keywords \n10.1 age-hardening stainless steel; precipitation hard­\nening stainless steel; stainless steel forgings \n1167 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1253.json",
  "tabulaTablesCsv": "tables_tabula/page-1253.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1253.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3705,
  "bestTextAlphaRatio": 0.7541
}