{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 615,
  "globalPageIndex": 615,
  "width": 648.72,
  "height": 882.36,
  "text": "ASME BPVC.II.A-2025 SA-354 \n14.1.9 Country of origin, and \n14.1.10 Title and signature of the individual assigned certi­\nfication responsibility by the company officers, with complete \nmailing address. \n14.2 Failure to include all the required information on the \ntest report shall be cause for rejection. \n15. Product Marking \n15.1 Manufacturers Identification -All products shall be \nmarked by the manufacturer with a unique identifier to identify \nthe manufacturer. \n15.2 Grade Identification: \n15.2.1 All Grade BC products shall be marked \"BC\". \n15.2.2 All Grade BD products shall be marked \"BD\". In \naddition to the \"BD\" marking, the product may be marked with \n6 radial lines 60° apart if manufactured from alloy steel \nconforming to the requirements of this specification. \n15.3 Marking Location and Methods: \n15.3.1 Bolts shall be marked on the top of the bolt head. \n15.3.2 Where studs have both coarse and fine threads, all \nmarkings shall appear on the coarse thread end or, if preferred, \nthe manufacturer's identification shall appear on the fine thread \nend and the grade marking on the coarse thread end. \n15.3.3 Continuous thread studs may be marked on either \nend. \n15.3.4 All markings may be raised or depressed at the \nmanufacturer's option. \n15.3.5 Grade and manufacturer's identification shall \nshall be separate and distinct. The two identifications \nshall preferably be in different locations and \nwhen on the same level shall be separated by at least two \nspaces. \n16. Packaging and Package Marking \n16.1 Packaging: \n16.1.1 Unless otherwise specified, packaging shall be in \naccordance with Practice D3951. \n16.1.2 When special packaging requirements are required, \nthey shall be defined at the time of the inquiry and order. \n16.2 Package Marking: \n16.2.1 Each shipping unit shall include or be plainly marked \nwith the following information: \n16.2.1.1 ASTM designation and grade, \n16.2.1.2 Size, \n16.2.1.3 Name and brand or trademark of the manufacturer, \n16.2.1.4 Number of pieces, \n16.2.1.5 Purchase order number, and \n16.2.1.6 Country of origin. \n17. Keywords \n17 .1 alloy steel; bolts; steel; studs \nSUPPLEMENTARY REQUIREMENTS \nSl. Marking \nS 1. 1 Studs that are continuously threaded with the same \nclass of thread shall be marked on each end with the marking \nin accordance with Section 15. \n563 \nS1.2 Marking small sizes (customarily less than 0.375 in. \n(9.525 mm) may not be practical. Consult the producer for the \nminimum size that can be marked. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0615.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2484,
  "bestTextAlphaRatio": 0.7222
}