{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 232,
  "globalPageIndex": 1030,
  "width": 627.84,
  "height": 804.24,
  "text": "SA-542/SA-542M ASME BPVC.II.A-2025 \nSpecification for \nPressure Vessel Plates, Alloy Steel, Quenched-and­\nTempered, Chromium-Molybdenum, and Chromium­\nMolybdenum-Vanadium \n1. Scope \n1.1 This specification covers two types of2¼ Cr-1 Mo and \nthree types of Cr-Mo-V alloy steel plates for use in the \nquenched-and-tempered condition, intended for the fabrication \nof welded pressure vessels and components. \n1.2 Material under this specification is available in five \ntypes, designated \"A,\" \"B,\" \"C,\" \"D,\" and \"E.\" Type B is \nidentical to Type A except for restrictive limits for carbon, \nphosphorus, sulfur, and nickel. The material is also available in \nfive classes having the following strength levels. Type E is \navailable only as Class 4 and 4a. \nClass Minimum Tensile Strength, ksi [MPa] \n1 105 [725] \n2 115 [795] \n3 95 [655] \n4 and 4a 85 [585] \n1.3 The maximum thickness of plates is limited only by the \ncapacity of the chemical composition to meet the specified \nmechanical property requirements. \n1.4 The minimum thickness of plates is limited to 3/16 in. [5 \nmm]. \n1.5 The material is intended to be suitable for fusion \nwelding. Welding technique is of fundamental importance and \nit is presupposed that welding procedures will be in accordance \nwith approved methods. \n1.6 These alloy steel plates in the as-rolled condition are \nsensitive to cracking during flame cutting, transit, and han­\ndling. They should be shipped in the as-rolled condition only \nwith the mutual agreement of the manufacturer and the \npurchaser or fabricator. \n1.7 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents, therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with this specifi­\ncation. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n930 \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA387 / A387M Specification for Pressure Vessel Plates, Alloy \nSteel, Chromium-Molybdenum \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Material supplied to this material s ecification shall \ncon orm to pec1 cation A20/A20M. These requirements out­\nline the testing and retesting methods and procedures, permit­\nted variations in dimensions, and mass, quality and repair of \ndefects, marking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1030.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3313,
  "bestTextAlphaRatio": 0.7658
}