{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 61,
  "globalPageIndex": 859,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-453/SA-453M \nTABLE 1 Continuous Heat-Treatment Charge Sizes \nDiameter, in. [mm] \nTo 1%[44] \nOver 1% [44] to 2½ [63] \nOver 2½ [63] \nTABLE 2 Lot Sizes \nWeight, lb [kg] \n3000 [1400] \n6000 [2700] \n12000 [5400] \nDiameter, in. [mm] Maximum Lot Size, lb [kg] \n1 ½ [38] and under \nOver 1½ [38] to 1% [44], incl \nOver 1% [44] to 2½ [63], incl \nOver 2½ [63] \n4.1.10 Test location option, if any, \n4.1.11 Rejection option, if any, and \n200 [90] \n300 [140] \n600 [270] \n20 pieces \n4.1.12 If stress-rupture testing is not required, except for \nGrade 660 Class D and Grade 668 (see 8.2.1). \n5. Common Requirements \n5.1 Bolting materials and bolting components supplied to \nthis specification shall conform to the requirements of Speci­\nfication A962/ A962M. These requirements include test \nmethods, finish, thread dimensions, marking, certification, \noptional supplementary requirements, and others. Failure to \ncomply with the requirements of Specification A962/A9.62M \nconstitutes nonconformance with this specification. In case of \nconflict between the requirements of this specification and \nSpecification A962/ A962M, this specification shall prevail. \n6. Materials and Manufacture \n6.1 Finishing Process: \n6.1.1 Threads may be formed by machining or rolling. \nThreads may be formed after precipitation heat treatment or \nafter solution anneal but prior to precipitation heat treatment. \nType designations are as follows: \nType Ml-threads formed by machining after precipitation \nheat treatment. \nType M2-threads formed by machining after solution \nanneal but prior to precipitation heat treatment. \nType RI-threads formed by rolling after precipitation heat \ntreatment. \nType R2-threads formed by rolling after solution anneal \nbut prior to precipitation heat treatment. \nWhen not specified by the purchaser, the type supplied shall \nbe the option of the manufacturer. \n6.2 Heat Treatment-Each grade and class shall be heat \ntreated as prescribed in Table 4. \n7. Chemical Composition \n7 .1 Each alloy shall conform to the chemical composition \nrequirements prescribed in Table 3. \n8. Mechanical Properties \n8.1 Tension Test: \n8.1.1 Requirements-Bolting material in each heat­\ntreatment charge shall conform to the room-temperature tensile \nrequirements in Table 5. \n8.1.2 Number of Specimens: \n8.1.2.1 Heat-Treated Bars-When not more than two sizes \nof bars are heat treated in the same load, one tension test shall \nbe made from each size in each heat of material in the \nheat-treatment charge (see 3.1.1). When more than two sizes of \nbars are treated in the same charge, one tension test shall be \nmade from one bar of each of the two largest diameters from \neach heat of material in the heat-treating charge. \n8.1.2.2 Finished Bolting Components-One tension test \nshall be made if the lot consists of parts of the same nominal \ndiameter. If the lot consists of components of more than one \nnominal diameter, one tension test shall be made from each \nnominal diameter of each heat involved in the lot (see Section \n3). \n8.2 Stress-Rupture Test: \n8.2.1 Requirements-Bolting material shall conform: to the \nstress-rupture requirements prescribed in Table 6 for design \ntemperatures above 800 °F [427 °C]. Bolting material not \nstress-rupture tested shall be permanently stamped NR. Grade \n660 Class D and Grade 668 do not require stress-rupture and \nshall be stamped NR. \n8.2.2 The number of specimens shall be the same as the \nrequired number of tension test specimens. \n8.2.3 The test location and orientation shall be the same as \nthat required for the tension test specimens. \n8.2.4 Test Method: \n8.2.4.1 The rupture test shall be performed in accordance \nwith Practice El39. \nNOTE 1-Fig. 1 is taken from Test Method E292. This is to facilitate \ndetection of notch sensitivity. The specimen found in Practice El39 does \nnot include a notch. The specimen in Fig. 1 is to be used only to determine \nif the material is notch sensitive. Actual testing is to Practice E139, not \nTest Method E292, so the additional test data required by Test Method \nE292 is not to be determined or reported. \n8.2.4.2 A combination smooth and notched test specimen, \nmachined to the dimensions prescribed in Fig. 1 and Table 7, \nshall be tested in accordance with the stress-rupture require­\nments prescribed in Table 6. The test shall be continued to \nrupture. The rupture shall occur in the smooth section of the \nbar. \n8.2.4.3 As an alternative procedure and, when specifically \napproved by the purchaser, separate smooth and notched test \nspecimens, machined from adjacent sections of the same piece, \nwith gage sections conforming to the respective dimensions of \nTable 7, may be tested under the above conditions. The notched \nspecimen need not be tested to rupture but shall not rupture in \nless time than the companion smooth specimen. \n8.2.4.4 When the minimum specified time to rupture in \nTable 6 has been achieved, incremental loading may be used to \naccelerate the time to rupture. At intervals of 8 to 16 h, \npreferably 8 to 10 h, the stress shall be increased in increments \nof 5000 psi [34.5 MPa]. Rupture location, and elongation \nrequirements shall be as prescribed in Table 6, 8.2.4.2, and \n8.2.4.3. \n8.3 Hardness Test: \n757 \n8.3.1 Requirements-Bolting material shall conform to the \nroom temperature hardness requirements prescribed in Table 5. \n8.3.2 Number of Tests: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0859.json",
  "tabulaTablesCsv": "tables_tabula/page-0859.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0859.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5387,
  "bestTextAlphaRatio": 0.7269
}