{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 184,
  "globalPageIndex": 184,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-47 /SA-47M ASME BPVC.II.A-2025 \n7.4.7 Tension test results, obtained in accordance \nwith the above subsections, must conform to the values of \nTable 1 for acceptance under this specification except as \nprovided in 7.4.3. \n7 .4.8 When agreed upon between manufacturer and \npurchaser, tested specimens or unbroken test bars shall be \npreserved by the manufacturer for a period of three months \nafter the date of the test report. \n1.5 Hardness Test- If the purchase agreement requires \nhardness testing, the acceptable hardness range shall be \nstated and a test location clearly shown on the covering \ndrawing(s). \n7.5.1 Hardness Test Method - The Brinell method \nof hardness testing in accordance with Test Method E 10 \nshall be employed whenever possible. \n7.5.2 For castings of such size or shape that do not \npermit Brinell testing with the standard 3000-kgf load, the \n500 kgf may be employed, the hardness number being \nreported as HB 10/500/15. In very unusual cases where it \nis impossible to use the Brinell method, the Rockwell \ntest may be substituted, using Test Methods E 18 with \nan appropriate Rockwell scale. Conversions of hardness \nvalues from one method to another according to Standard \nE 140, which does not specifically cover cast irons, are \napproximate only and, therefore, are generally inadvisable. \n7.5.3 Sufficient material shall be removed from the \ncast surface to ensure that the measured surface is represen­\ntative. \n7 .5.4 Sampling procedures and the frequency of \nhardness testing shall be fully detailed on the purchase \nagreement. Otherwise, hardness tests shall be performed \nat the discretion of the producer. \n7 .5.5 Castings failing to conform to the required \nhardness range may be reheat treated and retested. If after \nreheat treating they still fail the hardness requirements, \nthey shall be rejected. \n7.5.6 Typical hardness maximums for this grade of \nmalleable iron are listed in Table 2. \n8. Microstructure Requirements \n8.1 The microstructure of the malleable iron shall con­\nsist of temper carbon nodules distributed through a ferritic \nmatrix and shall be free of excessive pearlite, massive \ncarbides, and primary. graphite. \n8.2 When agreed upon by the purchaser and producer, \nthe maximum decarburization at any as-cast surface after \nheat treatment may be stipulated in writing, as measured \nby visual depletion of combined carbon after polishing, \netching in nital, and viewing at lOOX. \n132 \n8.3 In reference work, the metallographic practice rec­\nommended in Test Method A 247 shall be followed. \n9. Soundness Requirements \n9.1 All castings, on visual examination, shall be sound \nand free of obvious shrinkage and porosity. \n9.2 If the purchaser requires soundness tests to be per­\nformed, it shall be so stated in the purchase agreement, and \nthe method and soundness requirements shall be detailed. \n10. Dimensional Requirements \n10.1 The castings shall conform to the dimensions \ngiven on drawings furnished by the purchaser, or to the \ndimensions established by the pattern equipment supplied \nby the purchaser, or as agreed upon in specific cases to \ngages supplied by the purchaser. Variations in any solid \ndimensions will be permitted, as shown in Table 3, unless \notherwise agreed upon by the foundry and purchaser. \n11. Workmanship, Finish and Appearance \n11.1 The surface of the casting shall be inspected visu­\nally, particularly in critical areas, for such surface defects \nas cracks, hot tears, adhering sand and scale, cold shuts, \nand gas holes. \n11.2 No repairing or plugging of any kind shall be \npermitted unless written permission is granted by the pur­\nchaser. Welding or brazing is not permitted under any \ncircumstances. \n11.3 DELETED \n12. Responsibility for Inspection \n12.1 Unless otherwise specified in the contract or pur­\nchase order, the manufacturer shall be responsible for car­\nrying out all the tests and inspections required by this \nspecification, using his own or other reliable facilities, and \nhe shall maintain complete records of all such tests and \ninspections. Such records shall be available for review by \nthe purchaser. \n12.2 The purchaser reserves the right to perform any \ninspection set forth in the specification where such inspec­\ntions are deemed necessary to ensure that supplies and \nservices conform to the prescribed requirements. \n13. Rejection and Rehearing \n13.1 Any casting or lot of castings failing to comply \nwith the requirements of this specification may, where \npossible, be reprocessed, retested, and reinspected. If the ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0184.json",
  "tabulaTablesCsv": "tables_tabula/page-0184.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0184.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4547,
  "bestTextAlphaRatio": 0.7748
}