{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 798,
  "globalPageIndex": 1596,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-1058 ASME BPVC.II.A-2025 \nTest Methods for \nMechanical Testing of Steel Products-Metric \n1. Scope \n1. 1 These test methods cover mechanical tests described in \nASTM, EN, ISO, and ITS standards that utilize the SI system \nof units. The test methods in each system are not exact \nequivalents. Each standards system (ASTM, EN, ISO, and ITS) \nshall be used independently of the other. Combining require­\nments from any two or more systems may result in noncon­\nformance with the purchase order. \n1.2 These test methods cover procedures for the mechanical \ntesting of steels, stainless steels, and related alloys. The various \nmechanical tests herein described are used to determine prop­\nerties required in the product specifications. Variations in \ntesting methods are to be avoided, and standard methods of \ntesting are to be followed to obtain reproducible and compa­\nrable results. In those cases in which the testing requirements \nfor certain products are unique or at variance with these general \nprocedures, the product specification testing requirements shall \ncontrol. \n1.3 Only one of the testing procedure tracks shall be \nfollowed: ASTM, EN, ISO, or ITS. When a test method or \npractice is not available in one of the tracks then an appropriate \ntest method or practice from an alternative track shall be used. \nThe respective tests are listed in the column shown in Table 1. \nNOTE 1-The test methods in each system are not exact equivalents. \n1.4 The values stated in SI units are to be regarded as \nstandard. No other units of measurement are included in this \nstandard. \n1.5 Attention is directed to Practice ISO 17025 when there \nmay be a need for information on criteria for evaluation of \ntesting laboratories. \n1.6 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \n1542 \nA833 Test Method for Indentation Hardness of Metallic \nMaterials by Comparison Hardness Testers \nA956/ A956M Test Method for Leeb Hardness Testing of \nSteel Products \nA1038 Test Method for Portable Hardness Testing by the \nUltrasonic Contact Impedance Method \nE8/E8M Test Methods for Tension Testing of Metallic Ma­\nterials \nEl0 Test Method for Brinell Hardness of Metallic Materials \nE18 Test Methods for Rockwell Hardness of Metallic Ma­\nterials \nE23 Test Methods for Notched Bar Impact Testing of Me­\ntallic Materials \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nEll0 Test Method for Rockwell and Brinell Hardness of \nMetallic Materials by Portable Hardness Testers \nEl 90 Test Method for Guided Bend Test for Ductility of \nWelds ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1596.json",
  "tabulaTablesCsv": "tables_tabula/page-1596.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1596.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3213,
  "bestTextAlphaRatio": 0.7874
}