{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 446,
  "globalPageIndex": 1244,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-703/SA-703M ASME BPVC.II.A-2025 \npenetrants to be used, developing procedure, and basis for \nacceptance shall be agreed upon between the manufacturer and \npurchaser. A specification that may be used as a basis for such \nagreement is Specification A903/ A903M. \nS6.2 Personnel performing the examination shall be quali­\nfied in accordance with an acceptable written practice. \nS7. Ultrasonic Inspection \nS7 .1 Castings shall be examined for internal defects by \nmeans of ultrasonic inspection. The inspection procedure shall \nbe in accordance with Practice A609/ A609M. Extent of \nexamination, methods of testing, and basis for acceptance shall \nbe agreed upon between the manufacturer and purchaser. A \npractice that may be used as a basis for such agreement is \nPractice A609/A609M. \nS7 .2 Ultrasonic examination of castings shall be performed \nafter at least one heat treatment above the critical temperature \nrange but need not be repeated after subsequent heat treatment. \nS7.3 Personnel performing the examination shall be quali­\nfied in accordance with an acceptable written practice. \nS8. Charpy Impact Test \nS8.1 Charpy impact test properties shall be determined on \neach heat from a set of three Charpy V-notch specimens made \nfrom a test coupon in accordance with Test Methods and \nDefinitions A370 or Test Methods A1058, as applicable, and \ntested at a test temperature agreed upon by the manufacturer \nand purchaser. The acceptance requirements shall be either \nenergy absorbed, lateral expansion, or percent shear area, or all \nthree, and shall be those agreed upon by the manufacturer and \npurchaser. Test specimens shall be prepared as Type A and \ntested in accordance with Test Methods and Definitions A370 \nor Test Methods A1058, as applicable. \nS8.2 Absorbed Energy-Average energy value of three \nspecimens shall be not less than specified, with not more than \none value permitted to fall below the minimum specified, and \nno value permitted below the minimum specified for a single \nspecimen. \nS8.3 Lateral Expansion-Lateral expansion value shall be \nagreed upon by the manufacturer and purchaser. \nS8.4 Percent Shear Area-Percent shear area shall be \nagreed upon by the manufacturer and purchaser. \nS9. Drop Weight Tests \nS9.1 Drop weight test properties shall be determined from \neach heat by preparing and testing either Type Pl, P2, or P3 \nspecimens in accordance with Test Method E208. The crack \nstarter weld shall be deposited on the surface of the specimen \nthat was nearest to the casting surface. Each test shall consist \nof at least two specimens tested at a temperature agreed upon \nby the manufacturer and purchaser. Each specimen shall \nexhibit \"no break\" performance. \nS10. Examination of Weld Preparation \nS10.1 Magnetic particle or liquid penetrant examination of \ncavities prepared for welding shall be performed to verify \nremoval of those discontinuities found unacceptable by the \ninspection method specified for the casting. The method of \nperforming magnetic particle or liquid penetrant examination \nshall be in accordance with Guide E709 or Practice E165/ \nE165M. Unless other degrees of shrinkage or types of discon­\ntinuities found in the cavities are specified, Type II, Internal \nShrinkage, of Reference Photographs E125, of Degree 2 in \nsections up to 2 in. [50 mm] thick and of Degree 3 in sections \nover 2 in. [50 mm] thick shall be acceptable. \nS11. \n(This number not assigned to a supplementary requirement.) \nS12. Prior Approval of Major Weld Repairs \nS 12.1 Major weld repairs shall be subject to the prior \napproval of the purchaser. \nS13. Hardness Test \nS 13 .1 A hardness test shall be made in accordance with Test \nMethods and Definitions A370 or Test Methods A1058, as \napplicable. The test location and the hardness requirements \nshall be agreed upon between the manufacturer and the \npurchaser. \nS14. Tension Test from Each Heat and Heat Treatment \nCharge \nSl4.1 One tension test shall be made for each heat and heat \ntreatment charge. \nS15. Quench and Temper Heat Treatment \nS15.1 The castings shall be quenched and tempered. Cast­\nings so treated shall be marked \"QT.\" \nS16. \n(This number not assigned to a supplementary requirement.) \nS17. Tension Test from Castings \nS 17 .1 In addition to the tensile test required in Section 6, \ntest material shall be cut from heat-treated castings. The \nmechanical properties and location for the test material shall be \nagreed upon by the manufacturer and purchaser. \nS18. Tension Test for Castings Each Weighing 10 000 lb \n[ 4500 kg] or More \nS18.1 Two tensile tests shall be made for each casting. The \ntest specimens shall be prepared in accordance with Section 6. \nThe location of the test specimens shall be agreed upon by the \nmanufacturer and purchaser. \nS19. \n(This number not assigned to a supplementary requirement.) \nS20. Weld Repair Charts \nS20.1 Unless other criteria are agreed upon between the \nmanufacturer and the purchaser, weld repairs made to correct \nleakage on hydrostatic testing, or weld repairs for which the \ndepth of the cavity required for welding exceeds 40 % of the \nactual wall thickness, or weld repairs for which the area of the \ncavity required for welding: \n1158 \n--__/ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1244.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5212,
  "bestTextAlphaRatio": 0.768
}