{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 346,
  "globalPageIndex": 1144,
  "width": 618.6,
  "height": 796.8,
  "text": "SA-612/SA-612M (ASTM A612/A612M) ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall not apply unless specified in the purchase order. \nA list of standardized supplementary requirements for use at the option of the purchaser are included \nin Specification A20/ A20M. Those that are considered suitable for use with this specification are listed \nby title. \nS 1. Vacuum Treatment, \nS2. Product Analysis, \nS8. Ultrasonic Examination in accordance with Specifica­\ntion A435/A435M, \nS3. Simulated Post-Weld Heat Treatment of Test Coupons, \nS4. l Additional Tension Test, \nS9. Magnetic Particle Examination, \nS 11. Ultrasonic Examination in accordance with Specifica­\ntion A577 / A577M, S5. Charpy V-Notch Impact Test, \nS6. Drop Weight Test (for Material 0.625 in. [16 mm] and \nover in Thickness), \nS12. Ultrasonic Examination in accordance with Specifica­\ntion A578/A578M, and \nS7. High Temperature Tension Test, S 17. Vacuum Carbon-Deoxidized Steel. \nSUMMARY OF CHANGES \nCommittee AO I has identified the location of selected changes to this standard since the last issue \n(A612/A612M-12 (2019)) that may impact the use of this standard. (Approved May 1, 2020.) \n( 1) Revised 1.2 to delete maximum thickness of 1 in. [25 mm]. \n(2) Revised Table 2 to delete maximum thickness of l in. \n[25 mm]. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed eve,y five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (tax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n1050 \n~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1144.json",
  "tabulaTablesCsv": "tables_tabula/page-1144.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1144.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2862,
  "bestTextAlphaRatio": 0.7411
}