{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 564,
  "globalPageIndex": 1362,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-790/SA-790M (ASTM A790/A790M) ASME BPVC.II.A-2025 \ngreater. The width of the notch shall not exceed twice the \ndepth. Notches shall be placed on both the OD and ID surfaces. \n14.9.2 For Eddy-Current Testing, the reference standard \nshall contain, at the option of the manufacturer, any one of the \nfollowing discontinuities: \n14.9.2.1 Drilled Hole-The reference standard shall contain \nthree or more holes equally spaced circumferentially around \nthe pipe and longitudinally separated by a sufficient distance to \nallow distinct identification of the signal from each hole. The \nholes shall be drilled radially and completely through the pipe \nwall, with care being taken to avoid distortion of the pipe while \ndrilling. One hole shall be drilled in the weld, if visible. \nAlternately, the producer of welded pipe may choose to drill \none hole in the weld and run the calibration standard through \nthe test coils three times with the weld turned at 120° on each \npass. The hole diameter shall vary with NPS as follows: \nNPS Designator Hole Diameter \n0.039 in. [1 mm] \nabove ½ to 1 ¼ 0.055 in. [1.4 mm] \nabove 1 ¼ to 2 0.071 in. [1.8 mm] \nabove 2 to 5 0.087 In. [2.2 mm] \nabove 5 0.106 in. [2.7 mm] \n14.9.2.2 Transverse Tangential Notch-Using a round tool \nor file with a ¼-in. [6.4-mm] diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the pipe. Said notch shall have a depth not \nexceeding 12 ½ % of the specified nominal wall thickness of \nthe pipe or 0.004 in. [0.102 mm], whichever is greater. \n14.9.2.3 Longitudinal Notch-A notch 0.031 in. or less in \nwidth shall be machined in a radial plane parallel to the tube \naxis on the outside surface of the pipe to have a depth not \nexceeding 12 ½ % of the specified wall thickness of the pipe or \n0.004 in., whichever is greater. The length of the notch shall be \ncompatible with the testing method. \nMore or smaller reference discontinuities, or both, may be \nused by agreement between the purchaser and the manufac­\nturer. \n14.10 Standardization Procedure: \n14.10.1 The test apparatus shall be standardized at the \nbeginning and end of each series of pipes of the same size \n(NPS or diameter and schedule or wall thickness, grade, and \nheat treatment condition), and at intervals not exceeding 4 h. \nMore frequent standardization may be performed at the manu­\nfacturer's option or may be required upon agreement between \nthe purchaser and the manufacturer. \n14.10.2 The test apparatus shall also be standardized after \nany change in test system settings, change of operator, equip­\nment repair, or interruption due to power loss, process shut­\ndown, or when a problem is suspected. \n14.10.3 The reference standard shall be passed through the \ntest apparatus at the same speed and test system settings as the \npipe to be tested. \n14.10.4 The signal-to-noise ratio for the reference standard \nshall be 2 ½ to 1 or greater. Extraneous signals caused by \nidentifiable causes such as dings, scratches, dents, straightener \nmarks, and so forth shall not be considered noise. The rejection \namplitude shall be adjusted to be at least 50 % of full scale of \nthe readout display. \n14.10.5 If upon any standardization, the rejection amplitude \nhas decreased by 29 % (3 dB) of peak height from the last \nstandardization, the pipe since the last calibration shall be \nrejected. The test system settings may be changed or the \ntransducer(s), coil(s), or sensor(s) adjusted and the unit restan­\ndardized. But all pipe tested since the last acceptable standard­\nization must be retested for acceptance. \n14.11 Evaluation of Impeifections: \n14.11.1 Pipes producing a signal equal to or greater than the \nlowest signal produced by the reference standard(s) shall be \nidentified and separated from the acceptable pipes. The area \nproducing the signal may be reexamined. \n14.11.2 Such pipes shall be rejected if the test signal was \nproduced by imperfections that cannot be identified or was \nproduced by cracks or crack-like imperfections. These pipes \nmay be repaired per Sections 12 and 13. To be accepted, a \nrepaired pipe must pass the same non-destructive test by which \nit was rejected, and it must meet the minimum wall thickness \nrequirements of this specification. \n14.11.3 If the test signals were produced by visual imper­\nfections such as: (1) scratches, (2) surface roughness, (3) dings, \n(4) straightener marks, (5) cutting chips, (6) steel die stamps, \n(7) stop marks, or (8) pipe reducer ripple. The pipe may be \naccepted based on visual examination, provided the imperfec­\ntion is less than 0.004 in. [0.1 mm] or 12 ½%of the specified \nwall thickness (whichever is greater). \n14.11.4 Rejected pipe may be reconditioned and retested \nproviding the wall thickness is not decreased to less than that \nrequired by this or the product specification. The outside \ndiameter at the point of grinding may be reduced by the amount \nso removed. To be accepted, retested pipe shall meet the test \nrequirement. \n14.11.5 If the imperfection is explored to the extent that it \ncan be identified as non-rejectable, the pipe may be accepted \nwithout further test providing the imperfection does not en­\ncroach on the minimum wall thickness. \n15. Repair by Welding \n15.1 For welded pipe of size NPS 6 or larger with a \nspecified wall thickness of 0.188 in. [4.8 mm] or more, weld \nrepairs made with the addition of compatible filler metal may \nbe made to the weld seam with the same procedures specified \nfor plate defects in the section on Repair by Welding of \nSpecification A999/ A999M. \n15.2 Weld repairs of the weld seam shall not exceed 20 % of \nthe seam length. \n15.3 Except as allowed by 15.3.1, weld repairs shall be \nmade only with the gas tungsten-arc welding process using the \nsame classification of bare filter rod qualified to the most \ncurrent AWS Specification A5.9 as the grade of pipe being \nrepaired as given in Table 4. \n15.3.1 Subject to approval by the purchaser, it shall be \npermissible for weld repairs to be made with the gas tungsten­\narc welding process using a filler metal more highly alloyed \nthan the base metal, if needed for corrosion resistance or other \nproperties. \n1300 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1362.json",
  "tabulaTablesCsv": "tables_tabula/page-1362.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1362.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6210,
  "bestTextAlphaRatio": 0.742
}