{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 403,
  "globalPageIndex": 1201,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-672/SA-672M \n2 in. [50 mm] thick; and greater than 3/16 in. [5 mm] long for \nmaterials 2 in. [50 mm] thick or greater. \nS6.2.2 Rounded indications with dimensions greater than \n1/s in. [3 mm] for thicknesses less than 5/s in. [16 mm] and \ngreater than 3/16 in. [5 mm] for thicknesses 5/s in. [16 mm] and \ngreater. \nS6.2.3 Four or more indications in any line separated by \n1/16 in. [l mm] or less edge-to-edge. \nS6.2.4 Ten or more indications in any 6 in.2 [39 cm 2 ] of \nsurface with the major dimension of this area not to exceed 6 \nin. [150 mm] when it is taken in the most unfavorable \norientation relative to the indications being evaluated. \nS7. Magnetic Particle Examination of Weld Metal \nS7 .1 All accessible weld shall be examined in accordance \nwith Practice E709. Accessible is defined as: All outside \nsurfaces, all inside surfaces of pipe less than 24 in. [600 mm] \nin diameter for a distance of one pipe diameter from the ends. \nS7 .2 Acceptance Criteria-The following relevant indica­\ntions are unacceptable: \nS7 .2.1 Any cracks and linear indications. \nS7.2.2 Rounded indications with dimensions greater than \n3/16 in. [5 mm]. \nS7.2.3 Four or more indications in any line separated 1/16 in. \n[l mm] or less edge-to-edge. \nS7.2.4 Ten or more indications in any 6 in.2 [39 cm 2 ] of \nsurface with the major dimension of this area not to exceed 6 \nin. [150 mm] when it is taken in the most unfavorable \norientation relative to the indications being evaluated. \nS8. Liquid Penetrant Examination of Base Metal \nS8.1 All accessible surfaces of the pipe shall be examined in \naccordance with Test Method E165. Accessible is as defined in \nS6.1. \nS8.2 The acceptance criteria shall be in accordance with \nS6.2. \nS9. Liquid Penetrant Examination of Weld Metal \nS9.1 All accessible surfaces of the pipe shall be examined in \naccordance with Test Method E165. Accessible is as defined in \nS7.1 \nS9.2 The acceptance criteria shall be in accordance with \nS7.2 \nSlO. Straight Beam Ultrasonic Examination of Flat \nPlate-UT 1 \nSlO.l The plate shall be examined and accepted in accor­\ndance with Specification A435/ A435M except that 100 % of \none surface shall be scanned by moving the search unit in \nparallel paths with not less than 10 % overlap. \nSll. Straight Beam Ultrasonic Examination of Flat \nPlate-UT 2 \nS 11.1 The plate shall be examined in accordance with \nSpecification A578/A578M except that 100 % of one smface \nshall be scanned and the acceptance criteria shall be as follows: \nS 11.2 Any area, where one or more discontinuities produce \na continuous total loss of back reflection accompanied by \ncontinuous indications on the same plane that cannot be \nencompassed within a circle whose diameter is 3 in. [75 mm] \nor ½ of the plate thickness, whichever is greater, is unaccept­\nable. In addition, two or more discontinuities on the same plane \nand having the same characteristics but smaller than described \nabove shall be unacceptable unless separated by a minimum \ndistance equal to the largest diameter of the larger discontinuity \nor unless they may be collectively encompassed by the circle \ndescribed above. \nS12. Angle-Beam Ultrasonic Examination (Plate Less than \n2 in. [50 mm)] Thick)-UT 3 \nSl2.1 The plate shall be examined in accordance with \nSpecification A577 / A577M except that the calibration notch \nshall be V-shaped and the acceptance criteria shall be as \nfollows: Any area showing one or more reflectors producing \nindications whose amplitude exceeds that of the calibration \nnotch is unacceptable. \nS13. Repair Welding \nS 13 .1 Repair of base metal defects by welding shall be done \nonly with customer approval. \nS14. Description of Term \nS 14.1 lot-all pipe of the same mill heat of plate material \nand wall thickness (within ±¼ in. [6 mm]) heat treated in one \nfurnace charge. For pipe that is not heat treated or that is heat \ntreated in a continuous furnace, a lot shall consist of each 200 \nft [60 m] or fraction thereof of all pipe of the same mill heat of \nplate material and wall thickness (within ±¼ in. [6 mm]), \nsubjected to the same heat treatment. For pipe heat treated in a \nbatch-type furnace that is automatically controlled within a 50 \n°F [30 °C] range and is equipped with recording pyrometers so \nthat heating records are available, a lot shall be defined the \nsame as for continuous furnaces. \nS15. ASME Section III Construction \nS 15 .1 Products furnished under this specification that are \nintended for application under the rules of Section III of the \nASME Boiler and Pressure Vessel Code shall be manufactured \nby holders of the appropriate ASME Certificate of Authoriza­\ntion and Certification Mark. The product is subject to all \napplicable requirements of Section III, including welding, heat \ntreatment, nondestructive examination, authorized inspection \nat the point of manufacture, and application of the Certification \nMark. \nS15.2 The applicable ASME Partial Data Report form, \nsigned by an Authorized Nuclear Inspector, and a material test \nreport shall be furnished for each lot of pipe. \nS15.3 The plate used to fabricate the pipe shall conform to \nthe applicable SA specification in ASME Boiler and Pressure \nVessel Code, Section II. The welded joints shall be full \npenetration butt welds as obtained by double welding or by \nother means that will obtain the same quality of deposited weld \nmetal on the inside and outside. Welds using metal backing \nstrips that remain in place are prohibited. \nS15.4 In addition to the requirements of S14 and Section 13 \n(Product Marking), each length of pipe shall be so marked as \nto identify each such piece of pipe with the lot and the material \ntest report. \n1111 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1201.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5706,
  "bestTextAlphaRatio": 0.7438
}