{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 40,
  "globalPageIndex": 838,
  "width": 615.48,
  "height": 794.4,
  "text": "(25) PREFACE \nThe American Society of Mechanical Engineers (ASME) and the American Society for Testing and Materials (ASTM) \nhave cooperated for more than fifty years in the preparation of material specifications adequate for safety in the field \nof pressure equipment for ferrous and nonferrous materials, contained in Section II (Part A - Ferrous and Part B -\nNonferrous) of the ASME Boiler and Pressure Vessel Code. \nThe evolution of this cooperative effort is contained in Professor A. M. Greene's \"History of the ASME Boiler Code,\" \nwhich was published as a series of articles in Mechanical Engineering from July 1952 through August 1953 and is \nnow available from ASME in a special bound edition. The following quotations from this history, which was based upon \nthe minutes of the ASME Boiler and Pressure Vessel Committee, will help focus on the cooperative nature of the speci­\nfications found in Section II, Material Specifications. \n\"General discussion of material specifications comprising Paragraphs 1 to 112 of Part 2 and the advisability of having \nthem agree with ASTM specifications,\" (1914). \n\"ASME Subcommittee appointed to confer with ASTM,\" (1916). \n\"Because of this cooperation the specifications of the 1918 Edition of the ASME Boiler Code were more nearly in agree­\nment with ASTM specifications. In the 1924 Edition of the Code, 10 specifications were in complete agreement with ASTM \nspecifications, 4 in substantial agreement and 2 covered materials for which ASTM had no corresponding specifications.\" \n\"In Section II, Material Specifications, the paragraphs were given new numbers beginning with S-1 and extending to \nS-213,\" {1925). \n\"Section II was brought into agreement with changes made in the latest ASTM specifications since 1921,\" (1932). \n\"The Subcommittee on Material Specifications arranged for the introduction of the revisions of many of the specifications \nso that they would agree with the latest form of the earlier ASTM specifications ... ,\" (1935). \nFrom the preceding, it is evident that many of the material specifications were prepared by the Boiler and Pressure \nVessel Code Committees, then subsequently, by cooperative action, modified and identified as ASTM specifications. Sec­\ntion II, Parts A and B, currently contain many material specifications that are identical with the corresponding ASTM \nspecifications and some that have been modified for Code usage. Many of these specifications are published in dual for­\nmat. That is, they contain both U.S. Customary units and SI units. The metrication protocols followed in the specifications \nare those adopted by ASTM, and are usually to the rules of IEEE/ ASTM SI 10-1997, Standard for the Use of the Inter­\nnational System of Units (SI): The Modern Metric System. \nIn 1969, the American Welding Society began publication of specifications for welding rods, electrodes, and filler me­\ntals, hitherto issued by ASTM. The Boiler and Pressure Vessel Committee has recognized this new arrangement, and is \nnow working with A WS on these specifications. Section II, Part C, contains the welding material specifications approved \nfor Code use. \nIn 1992, the ASME Board of Pressure Technology Codes and Standards endorsed the use of non-ASTM material for \nBoiler and Pressure Vessel Code applications. It is the intent to follow the procedures and practices currently in use \nto implement the adoption of non-ASTM materials. \nThe specifications prepared and copyrighted by ASTM, AWS, and other originating organizations are reproduced in \nthe Code with the permission of the respective Society. The ASME Boiler and Pressure Vessel Committee has given care­\nful consideration to each new and revised specification, and has made such changes as they deemed necessary to make \nthe specification adaptable for Code usage. In addition, ASME has furnished ASTM with the basic requirements that \nshould govern many proposed new specifications. Joint action will continue an effort to make the ASTM, AWS, and ASME \nspecifications identical. \nTo assure that there will be a clear understanding on the part of the users of Section II, ASME publishes both the iden­\ntical specifications and those amended for Code usage every 2 years. \nThe ASME Boiler and Pressure Vessel Code has been adopted into law by 50 states and many municipalities in the \nUnited States and by all of the Canadian provinces. \nxl ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0838.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4392,
  "bestTextAlphaRatio": 0.7917
}