{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 375,
  "globalPageIndex": 375,
  "width": 625.68,
  "height": 863.76,
  "text": "ASME BPVC.II.A-2025 SA-232/SA-232M \nfrom a test specimen preferably taken during the pouring \nof the heat. When requested, this shall be reported to the \npurchaser and shall conform to the requirement of Table 2. \n5.3 Product Analysis - An analysis may be made by \nthe purchaser from finished wire representing each heat of \nsteel. The average of all the separate determinations made \nshall be within the limits specified in the analysis column. \nIndividual determinations may vary to the extent shown \nin the product analysis tolerance column, except that the \nseveral determinations of a single element in any one heat \nshall not vary both above and below the specified range. \n5.4 For referee purposes, Test Methods, Practices and \nTerminology A 751 shall be used. \n6. Mechanical Requirements \n6.1 Annealed and Cold Drawn - When purchased in \nthe annealed and cold-drawn condition, the wire shall have \nbeen given a sufficient amount of cold working to meet the \npurchaser's coiling requirements and shall be in a suitable \ncondition to respond properly to heat treatment. In special \ncases the hardness, if desired, shall be stated in the pur­\nchase order. \n6.2 Oil Tempered - When purchased in the oil-tem­\npered condition, the tensile strength and minimum percent \nreduction of area, sizes 2.50 mm [0.105 in.] and coarser, \nof the wire shall conform to the requirements prescribed \nin Table 1. \n6.2.1 Number of Tests - One test specimen shall be \ntaken for each five coils, or fraction thereof, in a lot. Each \nheat in a given lot shall be tested. \n6.2.2 Location of Tests - Test specimens shall be \ntaken from either end of the coil. \n6.2.3 Test Method - The tension test shall be made \nin accordance with Test Methods and Definitions A 370. \n6.3 Wrap Test: \n6.3.1 Oil-tempered or cold-drawn wire 4.00 mm \n[0.162 in.] and smaller in diameter shall wind on itself as \nan arbor without breakage. Larger diameter wire up to \nand including 8.00 mm [0.312 in.] in diameter shall wrap \nwithout breakage on a mandrel twice the wire diameter. \nThe wrap test is not applicable to wire over 8.00 mm \n[0.312 in.] in diameter. \n6.3.2 Number of Tests - One test specimen shall be \ntaken for each five coils or fraction thereof, in a lot. Each \nheat in a given lot shall be tested. \n6.3.3 Location of Test - Test specimens shall be \ntaken from either end of the coil. \n6.3.4 Test Method -The wrap test shall be made in \naccordance with Test Methods and Definitions A 370. \n7. Metallurgical Requirements \n7.1 Su,face Condition: \n7.1.1 The surface of the wire as received shall be \nfree of imperfections such as pits, die marks, scratches, \nseams, and other defects tending to impair the fatigue value \nof the springs. \n7.1.2 Number of Tests - One test specimen shall be \ntaken from each end of every coil. \n7.1.3 Test Method - The surface shall be examined \nafter etching in a solution of equal parts of hydrochloric \nacid and water that has been heated to approximately 80°C \nfor a sufficient length of time to remove up to approxi­\nmately 1 % of the diameter of the wire. Test ends shall be \nexamined using 10 X magnification. \n7 .2 Decarburization: \n7.2.1 Transverse sections of the wire properly \nmounted, polished, and etched shall show no completely \ndecarburized (carbon-free) areas when examined at a mag­\nnification of 100 diameters. Partial decarburization shall \nnot exceed a depth of 0.025 mm [0.001 in.] on wire \n5.00 mm [0.192 in.] and smaller or 0.038 mm [0.0015 in.] \non larger than 5.00 mm [0.192 in.]. \n7.2.2 To reveal the decarburization more accurately \nin the untempered wire, the specimen shall be hardened \nand tempered before microscopical examination. Prior to \nhardening, the specimen shall be filed flat on one side \nenough to reduce the diameter at least 20%. The subsequent \nmounted specimen shall show the flattened section, as well \nas the original wire edge. Any decarburization on this \nflattened section shall necessitate a new specimen for exam­\nination. \n323 \n7.2.3 Number of Tests - One test specimen shall be \ntaken for each five coils, or fraction thereof, in a lot. Each \nin a given lot shall be tested. \n7.2.4 Location of Tests - Test specimens may be \ntaken from either end of the coil. \n8. Dimensions and Permissible Variations \n8.1 The permissible variations in the diameter of the \nwire shall be specified in Table 3. \n8.2 Number of Tests - One test specimen shall be taken \nfrom each end of every coil. \n9. Workmanship, Finish, and Appearance \n9.1 Annealed and Cold Drawn - The wire shall not be \nkinked or improperly cast. To test for cast, a few convolu­\ntions of wire shall be cut loose from the coil and placed \non a flat surface. The wire shall lie substantially flat on \nitself and not spring up nor show a wavy condition. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0375.json",
  "tabulaTablesCsv": "tables_tabula/page-0375.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0375.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4767,
  "bestTextAlphaRatio": 0.7386
}