{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 360,
  "globalPageIndex": 360,
  "width": 640.44,
  "height": 875.52,
  "text": "SA-217 /SA-217M (ASTM A217 /A217M} ASME BPVC.II.A-2025 \nNoTE 4-The role of alloying elements in the development of Grade \nCl2A has been extensively investigated. V and Nb contribute to precipi­\ntation strengthening by forming fine and coherent precipitation of M(C, \nN)X carbo-nitrides in the ferrite matrix. V also precipitates as VN during \ntempering or during creep. The two elements are more effective in \ncombination. Therefore, the addition of strong nitride-forming elements, \nthose with a stronger affinity for nitrogen than Nb and V, as deoxidation \nagents, interferes with these high-temperature strengthening mechanisms. 5 \n7. Mechanical Properties \n7 .1 Steel used for the castings shall conform to the require­\nments as to tensile properties given in Table 2. \n7.2 C12A castings shall be hardness tested in accordance \nwith Supplementary Requirement Sl3, and shall have a Brinell \nhardness of 185-248 HBW. \n8. Quality \n8.1 The surface of the casting shall be examined visually \nand shall be free of adhering sand, scale, cracks, and hot tears. \nOther surface discontinuities shall meet the visual acceptance \nstandards specified in the order. Practice A802/ A802M or other \nvisual standards may be used to define acceptable surface \ndiscontinuities and finish. Unacceptable visual surface discon­\ntinuities shall be removed and their removal verified by visual \nexamination of the resultant cavities. When methods involving \nhigh temperatures are used in the removal of discontinuities, \ncastings shall be preheated to at least the minimum tempera­\ntures in Table 3. \n8.2 Hollow castings of Grade C12A, larger than NPS 4 [DN \n100], and whose internal surfaces are not accessible to the \nvisual examination in 8.1, shall be examined by the ultrasonic \nexamination prescribed in Supplementary Requirement S7. \nCastings producing a signal equal to or greater than the lowest \nsignal produced by the referenced discontinuities shall be \nidentified and separated from the acceptable castings. The area \nproducing the signal may be re-examined. Such castings shall \nbe rejected if the test signals were produced by imperfections \n5 Viswanathan, R. and Bakker, W. T., Materials for Ultra Supercritical Fossil \nPower Plants, EPRI, Palo Alto, CA, 2000. TR-114750. \nTABLE 3 Minimum Preheat Temperatures \nGrade \nWC1 \nWC4 \nWC5 \nWC6 \nWC9 \nWC11 \nC5 \nC12 \nC12A \nCA15 \nThickness, in. [mm] \n5/a and under \nOver % [15.9] \nAll \nAll \nAll \nAll \nAll \nAll \nAll \nAll \nAll \nMinimum \nPreheat \nTemperature, \nOF [OC] \n50 [10] \n250 [120] \n300 [150] \n300 [150] \n300 [150] \n400 [200] \n300 [150] \n400 [200] \n400 [200] \n400 [200] \n400 [200] \nthat cannot be identified or were produced by cracks or \ncrack-like imperfections. Such castings may be repaired. To be \naccepted, a repaired casting shall pass the ultrasonic examina­\ntion and shall meet the minimum wall thickness requirements \nof the purchase order. \n8.3 When additional inspection is desired, Supplementary \nRequirements S4, S5, and SlO may be ordered. \n8.4 The castings shall not be peened, plugged, or impreg­\nnated to stop leaks. \n9. Repair by Welding \n9.1 Repairs shall be made using procedures and welders \nqualified under Practice A488/ A488M. \n9.2 All repair welds in Cl2A castings shall be made with \none of the following welding processes and consumables: \nSMAW, A5.5/A5.5M E90:XX-B9; SAW, A5.23/A5.23M EB9 + \nNeutral Flux; GTAW, A5.28/A5.28M ER90S-B9; and FCAW, \nA5.29/A5.29M E91Tl-B9. In addition, the sum of the Ni+ Mn \ncontent in all welding consumables used to weld repair Cl2A \ncastings shall not exceed 1.0 %. Weld-repaired Grade Cl2A \ncastings shall be post-weld heat treated at 1350 to 1470 °F [730 \nto 800 °C]. \n9.3 Weld repairs shall be inspected to the same quality \nstandards that are used to inspect the castings. When castings \nTABLE 2 Tensile RequirementsA are produced with Supplementary Requirement S4 specified, _____________ _,_ __________ _ \nTensile \nStrength, Yield \nGrade Strength, ksi ksi [MPa] 8 \n[MPa] \nElonga-\nlion in \n2 in. \n[50mm], \n%c \nReduc-\nlion of \nArea, \n% \nweld repairs shall be inspected by magnetic particle examina­\ntion to the same standards that are used to inspect the castings. \nWhen castings are produced with Supplementary Requirement \nS5 specified, weld repairs on castings that have leaked on \n------------------------ hydrostatic test, or on castings in which the depth of any cavity WC1 65-90 35 [240] 24 35 \n[450-620] \nWC4, WC5, WC6, WC9 70-95 \n[485-655] \nWC11 80-105 \n[550-725} \nC5, C12 90-115 \n[620-795] \nC12A 85-110 \n[585-760] \nCA15 90-115 \n40 [275] 20 \n50 [345] 18 \n60 [415] 18 \n60 [415] 18 \n65 [450] 18 \n35 \n45 \n35 \n45 \n30 \nprepared for repair welding exceeds 20 % of the wall thickness \nor 1 in. [25 mm], whichever is smaller, or on castings in which \nany cavity prepared for welding is greater than approximately \n10 in.2 [65 cm 2 ], shall be radiographed to the same standards \nthat are used to inspect the castings. \n9.4 Weld repairs shall be considered major in the case of a \ncasting that has leaked on hydrostatic test, or when the depth of \n[620-795] ________ _;_ __ ,.;,_ ____________ the cavity prepared for welding exceeds 20 % of the wall \nA All values are minimums unless a range is provided. \n8 Determine by either 0.2 % offset method or 0.5 % extension-under-load method. \nc When !Cl test bars are used in tensile testing as provided for in Specification \nA703/A703M, the gage length to reduced section diameter ratio shall be 4 to 1. \n308 \nthickness or 1 in. [25 mm], whichever is smaller, or when the \nextent of the cavity exceeds approximately 10 in.2 [65 cm 2 ]. \nAll castings with major repair welds shall be thermally stress \nrelieved or completely reheat treated. This mandatory stress ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0360.json",
  "tabulaTablesCsv": "tables_tabula/page-0360.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0360.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5564,
  "bestTextAlphaRatio": 0.71
}