{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 348,
  "globalPageIndex": 348,
  "width": 632.28,
  "height": 868.92,
  "text": "SA-214/SA-214M ASME BPVC.11.A-2025 \nSpecification for \nElectric-Resistance-Welded Carbon Steel Heat-Exchanger \nand Condenser Tubes \n1. Scope \n1.1 This specification covers minimum-wall-thickness, \nelectric-resistance-welded, carbon steel tubes to be used for \nheat exchangers, condensers, and similar heat-transfer appara­\ntus. \n1.2 The tubing sizes usually furnished to this specification \nare to 3 in. [76.2 mm] in outside diameter, inclusive. Tubing \nhaving other dimensions may be furnished, provided such \ntubes comply with all other requirements of this specification. \n1.3 Mechanical property requirements do not apply to \ntubing smaller than 1/s in. [3.2 mm] in inside diameter or 0.015 \nin. [0.4 mm] in thickness. \n1.4 The purchaser shall specify in the order the outside \ndiameter and minimum wall thickness. The inside diameter \nshall not be specified. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA450/ A450M Specification for General Requirements for \nCarbon and Low Alloy Steel Tubes \n3. Ordering Information \n3.1 Orders for material under this specification should \ninclude the following, as required, to describe the desired \nmaterial adequately: \n3.1.l Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material (electric-resistance-welded tubes), \n3.1.3 Size (outside diameter and minimum wall thickness), \n3.1.4 Length (specific or random), \n3.1.5 Optional requirements (Section 8 and 10.5), \n3.1.6 Test report required (see Certification Section of \nSpecification A450/A450M), \n296 \n3.1.7 Specification designation, and \n3.1.8 Special requirements. \n4. General Requirements \n4.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A450/ A450M, unless otherwise provided herein. \n5. Manufacture \n5 .1 Tubes shall be made by electric-resistance welding. \n6. Heat Treatment \n6.1 After welding, all tubes shall be heat treated at a \ntemperature of 1650°F [900°C] or higher and followed by \ncooling in air or in the cooling chamber of a controlled \natmosphere furnace. Cold drawn tubes shall be heat treated \nafter the final cold-draw pass at a temperature of 1200°F \n[650°C] or higher. • ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0348.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3020,
  "bestTextAlphaRatio": 0.7526
}