{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 125,
  "globalPageIndex": 125,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-20/SA·20M \nfor the applicable grade, class, and type, product analyses shall \nconform to the applicable product analysis limits given in \nTable 1. \n7.3 Referee Analysis-For referee purposes, Test Methods, \nPractices, and Terminology A751 shall be used. \n8. Metallurgical Structure \n8.1 Where austenitic grain size testing is required, such \ntesting shall be a McQuaid Ehn test in accordance with Test \nMethods El12 and at least 70 % of the grains in the area \nexamined shall meet the specified grain size requirement. \n8.2 Coarse Austenitic Grain Size-Where coarse austenitic \ngrain size is specified one austenitic grain size test per heat \nshall be made and the grain size number so determined shall be \nin the range of 1 to 5 inclusive. \n8.3 Fine Austenitic Grain Size: \n8.3.1 Except as allowed in 8.3.2, and when fine austenitic \ngrain size is specified, or when the producer elects to determine \nthe grain size, one McQuaid Ehn test per heat shall be made \nand the austenitic grain size number so determined shall be 5 \nor higher, and the chemical requirements of 8.3.2 do not apply. \nNoTE 1-Such austenitic grain size numbers may be achieved with \nlower contents of austenitic grain refining elements than 8.3.2 requires for \naustenitic grain size testing to be waived. \n8.3.2 Unless testing for fine austenitic grain size is specified \nin the purchase order or the producer elects to test for fine \naustenitic grain size, the austenitic grain size test need not be \nmade for any heat that has, by heat analysis, one or more of the \nfollowing: \n8.3.2.1 A total aluminum content of 0.020 % or more. \n8.3.2.2 An acid soluble aluminum content of 0.015 % or \nmore. \n8.3.2.3 A content for an austenitic grain refining element \nthat exceeds the minimum value agreed to by the purchaser as \nbeing sufficient for austenitic grain size testing to be waived. \n8.3.2.4 Contents for the combination of two or more auste­\nnitic grain refining elements that exceed the applicable mini­\nmum values agreed to by the purchaser as being sufficient for \naustenitic grain size testing to be waived. \n8.3.2.5 The analysis for the elements mentioned in 8.3.2.1, \n8.3.2.2, 8.3.2.3, or 8.3.2.4 shall be included in the test report. \n9. Quality \n9.1 General-Plates shall be free of injurious defects and \nshall have a workmanlike finish. \n9.2 Surface Impeifections: \n9.2.1 For plates produced from plate-as-rolled, all injurious \nsurface imperfections shall be removed by the manufacturer. \nFor plates produced from coil, all injurious surface imperfec­\ntions shall be removed by the processor. \n9.2.1.1 Shallow imperfections shall be ground to sound \nmetal; the ground area shall be well faired and the thickness of \nthe ground plate shall not be reduced below the minimum \nthickness permitted. \n9 .2.1.2 All surface imperfections, the removal of which will \nreduce the plate thickness below the minimum thickness \npermitted, shall be cause for rejection of the plate, except that, \n73 \nby agreement with the purchaser, the metal so removed may be \nreplaced with weld metal (see 9.4). \n9.3 Edge Impeifections: \n9.3.1 Laminar-type discontinuities 1 in. [25 mm] and less in \nlength visible to the unaided eye on an edge of a plate as \nprepared for shipment by the manufacturer or processor are \nacceptable and do not require exploration. \n9.3.2 All larger discontinuities shall be explored to deter­\nmine their depth and extent. Discontinuities shall be considered \ncontinuous when located in the same plane within 5 % of the \nplate thickness and separated by a distance less than the length \nof the smaller of two adjacent discontinuities. \n9.3.3 Indications visible to the unaided eye on the cut edges \nof a plate as prepared for shipment by the manufacturer or \nprocessor shall not exceed the limits given in Columns 1 and 2 \nof Table Al.14 [A2.14]. \n9.3.4 Larger indications shall be removed by the manufac­\nturer or processor by grinding, provided that the resultant \ncavity does not exceed the limits given in Columns 3 and 4 of \nTable Al.14 [A2.14]. \n9.3.5 Indications of greater magnitude shall be cause for \nrejection of the plate, except that, by agreement with the \npurchaser, the defects may be removed and replaced with weld \nmetal (see 9.4). \n9.3.6 Indications on the edges of a plate cut during the \nfabrication shall be cause for rejection of the plate at the \ndiscretion of the purchaser if the magnitude exceeds the limits \ngiven in Columns 5 and 6 of Table Al .14 [ A2. l 4]. The defects \nmay be removed and replaced with weld metal (see 9.4). \n9.3.7 Fabricators should be aware that edge cracks may \ninitiate upon bending a sheared or burned edge during the \nfabrication process. This is not considered to be a fault of the \nsteel, but is rather a function of the induced cold work or heat \naffected zone. \n9.4 Repair by Welding: \n9.4.1 Repair welding shall be permitted only with the \napproval of the purchaser. \n9.4.2 Preparation for repair welding shall include inspection \nto confirm complete removal of the defect. \n9.4.3 Repairs shall be made utilizing welding procedures \nqualified in accordance with Section IX of the \nASME Boiler and Pressure Vessel Code and repair welding \nshall be done by welders or welding operators meeting the \nqualification requirements of Section IX. \n9.4.4 The weld metal shall have the A-number analysis \ncorresponding to the equivalent ASME P-number of the plate, \nexcept that A-1 or A-2 analysis weld metal may be employed \nfor P-1 plates. Other weld metals may be employed that are \ncompatible with the plate being repaired, if so approved by the \npurchaser. Such weld metals shall be qualified in accordance \nwith the requirements of Section IX of the \nASME Boiler and Pressure Vessel Code. \n9.4.5 If Charpy impact tests of the plate are required, the \nwelding procedure qualification tests shall also include Charpy \nimpact tests of the weld, the heat-affected zone, and the plate, \nand the test results shall be reported to the purchaser. \n9 .4.6 If the plate is subjected to normalizing, quenching and \ntempering, hot forming, or post-weld heat treating, the welding ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0125.json",
  "tabulaTablesCsv": "tables_tabula/page-0125.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0125.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6133,
  "bestTextAlphaRatio": 0.7551,
  "camelotTablesPath": "camelot_tables/page-0125.json",
  "camelotTablesCsv": "camelot_tables/page-0125.csv",
  "camelotTableCount": 1
}