{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 295,
  "globalPageIndex": 295,
  "width": 620.76,
  "height": 859.92,
  "text": "ASME BPVC.II.A-Z0Z5 SA-193/SA-193M \nwhere: \nw = \nTs = \nAt = \nminimum wedge tensile load without fracture, \ntensile strength specified in ksi or MPa in Tables 2 and \n3, and \nstress area of the thread section, square inches or square \nmillimetres, as shown in the Cone Proof Load Tables in \nSpecification A962/A962M. \n9.2 Hardness Requirements: \n9.2.1 The hardness shall conform to the requirements pre­\nscribed in Tables 2 and 3. Hardness testing shall be performed \nin accordance with either Specification A962/ A962M or with \nTest Methods F606/F606M. \n9.2.2 Grade B7M-The maximum hardness of the grade \nshall be 235 HBW or 99 HRB. The minimum hardness shall \nnot be less than 200 HBW or 93 HRB. Conformance to this \nhardness shall be ensured by testing the hardness of each stud \nor bolt by Brinell or Rockwell B methods in accordance with \n9 .2.1. The use of 100 % electromagnetic testing for hardness as \nan alternative to 100 % indentation hardness testing is permis­\nsible when qualified by sampling using indentation hardness \ntesting. Each lot tested for hardness electromagnetically shall \nbe 100 % examined in accordance with Practice E566. Follow­\ning electromagnetic testing for hardness, a random sample of a \nminimum of 100 pieces of each heat of steel in each lot (as \ndefined in 12.1.1) shall be tested by indentation hardness \nmethods. All samples must meet hardness requirements to \npermit acceptance of the lot. If any one sample is outside of the \nspecified maximum or minimum hardness, the lot shall be \nrejected and either reprocessed and resampled or tested 100 % \nby indentation hardness methods. \n9.2.2.l Surface preparation for indentation hardness testing \nshall be in accordance with Test Methods E18. Hardness tests \nshall be performed on the end of the bolt or stud. When this is \nimpractical, the hardness test shall be performed elsewhere. \n10. Workmanship, Finish, and Appearance \n10.1 Bolts, screws, studs, and stud bolts shall be pointed and \nshall have a workmanlike finish. Points shall be flat and \nchamfered or rounded at option of the manufacturer. Length of \npoint on studs and stud bolts shall be not less than one nor more \nthan two complete threads as measured from the extreme end \nparallel to the axis. Length of studs and stud bolts shall be \nmeasured from first thread to first thread. \n10.2 Unless otherwise specified in the purchase order, bolt \nheads shall be in accordance with the dimensions of ASME \nBl8.2.1 or ASME B18.2.3.3M. Unless otherwise specified in \nthe purchase order, the Heavy Hex Screws Series should be \nused for nominal body diameters of l ¼ in. [30 mm] and less. \nFor larger sizes, the Heavy Hex Screw Series should be used, \nexcept the maximum body diameter and radius of fillet may be \nthe same as for the Heavy Hex Bolt Series. The body diameter \nand head fillet radius for sizes of Heavy Hex Cap Screws and \nBolts that are not shown in their respective tables in ASME \nB18.2.l or ASME B18.2.3.3M may be that shown in the \ncorresponding Hex Cap Screw and Bolt Tables respectively. \nSocket head screws or bolts shall be in accordance with ASME \nB18.3 or ASME B18.3.1M. \n11. Retests \n11.1 If the results of the mechanical tests of any test lot do \nnot conform to the requirements specified, the manufacturer \nmay retreat such lot not more than twice, in which case two \nadditional tension tests shall be made from such lot, all of \nwhich shall conform to the requirements specified. \n12. Test Specimens \n12.1 Number of Tests-For heat-treated bars, one tension \ntest shall be made for each diameter of each heat represented in \neach tempering charge. When heat treated without interruption \nin continuous furnaces, the material in a lot shall be the same \nheat, same prior condition, same size, and subjected to the \nsame heat treatment. Not fewer than two tension tests are \nrequired for each lot containing 20 000 lb [9000 kg] or less. \nEvery additional 10 000 lb [4500 kg] or fraction thereof \nrequires one additional test. \n12. l.1 For studs, bolts, screws, and so forth, one tension test \nshall be made for each diameter of each heat involved in the \nlot. Each lot shall consist of the following: \nDiameter, in. [mm] \n11/s [30] and under \nOver 11/s (30] to 1¾ (42], incl \nOver 1¾ (42] to 2½ (64], incl \nOver 2½ (64] \nLot Size \n1500 lb (680 kg] or fraction thereof \n4500 lb [2000 kg] or fraction thereof \n6000 lb [2700 kg] or fraction thereof \n100 pieces or fraction thereof \n12.1.2 Tension tests are not required to be made on bolts, \nscrews, studs, or stud bolts that are fabricated from heat-treated \nbars furnished in accordance with the requirements of this \nspecification and tested in accordance with 12.1, provided they \nare not given a subsequent heat treatment. \n243 \n12.1.3 Full Size Specimens, Headed Bolting COmponents­\nHeaded bolts or screws 1 ½ in. in body diameter and smaller, \nwith body length three times the diameter or longer, and that \nare produced by upsetting or forging (hot or cold) shall be \nsubjected to full size testing in accordance with 9.1.2. This \ntesting shall be in addition to tensile testing as specified in \n9.1.1. Wedge tensile testing shall be limited to product with \nsocket head cap screw, hexagon, square, hex flange, or twelve \npoint flange heads. The lot size shall be as shown in 12.1.1. \nFailure shall occur in the body or threaded section with no \nfailure, or indications of failure, such as cracks, at the junction \nof the head and shank. Wedge tensile testing is not required for \nflat countersunk head or socket button products. \n13. Nuts \n13.1 Bolts, studs, and stud bolts shall be furnished with \nnuts, when specified in the purchase order. Nuts shall conform \nto Specification A194/Al94M. \n14. Certification \n14.1 Certification is required. In addition to the require­\nments of Specification A962/ A962M the rep01i shall include \nresults of the chemical analysis, macroetch examination (Car­\nbon and Alloy Steels Only), and mechanical tests, and state the \nmethod of heat treatment employed. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0295.json",
  "tabulaTablesCsv": "tables_tabula/page-0295.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0295.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6020,
  "bestTextAlphaRatio": 0.7409
}