{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 182,
  "globalPageIndex": 980,
  "width": 626.4,
  "height": 803.04,
  "text": "SA•522/SA-522M ASME BPVC.II.A-2025 \nSPECIFICATION FOR FORGED OR ROLLED 8 AND 9% \nNICKEL ALLOY STEEL FLANGES, FITTINGS, VALVES, \nAND PARTS FOR LOW-TEMPERATURE SERVICE \nSA-522/SA-522M cO \nINTERNATIONAL \nStandards Worldwide \n(Identical with ASTM Specification A 522/ A 522M-07.) \n1. Scope \n1.1 This specification covers 8 and 9% nickel-alloy \nsteel forged or rolled flanges, fittings, valves, and parts \nintended for use in welded pressure vessels for low-temper­\nature service. The specification is applicable to forgings \nwith maximum section thickness of 3 in. [75 mm] in the \ndouble normalized and tempered condition and 5 in. \n[125 mm] in the quenched and tempered condition. Forg­\nings under this specification are intended for service at \noperating temperatures not lower than -320°F [-196°C] \nfor Type I or -275°F [-170°C] for Type II or higher than \n250°F [121 °C]. \n1.2 Material under this specification is available in two \ntypes having different chemical compositions as follows: \nType \nI \nII \nNominal Nickel Content, % \n9 \n8 \n1.3 This specification is expressed in both inch-pound \nunits and SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the \nmaterial shall be furnished to inch-pound units. \n1.4 The values stated in either inch-pound units or SI \nunits are to be regarded separately as standard. Within the \ntext, the SI units are shown in brackets. The values stated \nin each system are not exact equivalents; therefore, each \nsystem must be used independently of the other. Combining \nvalues from the two systems may result in nonconformance \nwith the specification. \n2. Referenced Documents \n2.1 ASTM Standards: \nA 370 Test Methods and Definitions for Mechanical Test­\ning of Steel Products \n880 \nA 788/A 788M Specification for Steel Forgings, General \nRequirements \nA 961/A 961M Specification for Common Requirements \nfor Steel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \n3. General Requirements and Ordering \nInformation \n3.1 Product furnished to this specification shall conform \nto the requirements of Specification A 961, including any \nsupplementary requirements that are indicated in the pur­\nchase order. Failure to comply with the requirements of \nSpecification A 961 constitutes nonconformance with this \nspecification. \n3.2 It is the purchaser's responsibility to specify in \nthe purchase order all ordering information necessary to \nfurnish the needed material. Examples of such information \ninclude but are not limited to the ordering information in \nSpecification A 961 and following: \n3.2.1 Any supplementary requirements, and \n3.2.2 Additional requirements, (See 4.5, 5.2, 6.1, 7 .2, \nand 10.3). \n4. Materials and Manufacture \n4.1 The steel shall be produced in accordance with the \nmelting process section of Specification A 788. \n4.2 Material for forgings shall consist of ingots, or \neither forged or rolled blooms, billets, or bars. \n4.3 The finished product shall be a forging as defined \nin the Terminology Section of Specification A 788. \n4.4 Except for flanges of all types, hollow cylindrically \nshaped parts may be made from hot-rolled or forged bar, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0980.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3176,
  "bestTextAlphaRatio": 0.7469
}