{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 218,
  "globalPageIndex": 218,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-105/SA-10SM ASME BPVC.II.A-2025 \nTABLE 2 Mechanical RequirementsA \nTensile strength, min, ksi [MPa] \nYield strength, min, ksi [MPa] 8 \nElongation in 2 in. or 50 mm, min, %: \nBasic minimum elongation for walls o/,e in. [7.9 mm] \nand over in thickness, strip tests. \nWhen standard round 2-in. or 50-mm gauge length or \nsmaller proportionally sized specimen with the gauge \nlength equal to 4D is used \nFor strip tests, a deduction for each V.2 -in. [0.8-mm] \ndecrease in wall thickness below o/1e in. [7.9 mm] \nfrom the basic minimum elongation \nof the percentage points of Table 3 \nReduction of area, min, % 0 \nHardness, HBW, max \nA For small forgings, see 8.3.4. \n70 [485] \n36 [250] \n30 \n22 \n30 \n197 \n8 Determined by either the 0.2 % offset method or the 0.5 % extension-under-load \nmethod. \nc See Table 3 for computed minimum values. \n° For round specimens only. \nTABLE 3 Computed Minimum Values \n______ W_a_ll_T_h_ic_kn_e_ss ______ Elongation in 2 in. or 50 \nin. \no/,e (0.312) \n%2 (0.281) \n¼(0.250) \n7 /32 (0.219) \n'½e (0.188) \n%2(0.156) \n1/e (0.125) \n%2(0.094) \n1/,e (0.062) \nmm \n7.9 \n7.1 \n6.4 \n5.6 \n4.8 \n4.0 \n3.2 \n2.4 \n1.6 \nmm, min,% \n30.00 \n28.50 \n27.00 \n25.50 \n24.00 \n22.50 \n21.00 \n19.50 \n18.00 \nNote-The above table gives the computed minimum elongation values for \neach V.2-in. [0.8-mm] decrease in wall thickness. Where the wall thickness lies \nbetween two values shown above, the minimum elongation value is determined by \nthe following equation: \nE = 48T+ 15.00 \nwhere: \nE = elongation in 2 in. or 50 mm, %, and \nT = actual thickness of specimen, in. \nthis positioning, the test specimen shall be positioned as near as \npossible to the prescribed location. \n8.3 Tension Tests: \n8.3.1 One tension test shall be made for each heat of \nas-forged components. \n8.3.2 One tension test shall be made from each heat-treating \ncharge. If more than one heat is included in such a charge, each \nheat shall be tested. \n8.3.2.1 When forgings of different shapes are included in the \nsame heat-treating charge, the test specimen shall be obtained \nfrom the heaviest cross-section of the thickest forging, except \nfor hubbed flanges (see 8.3.3). The test specimen shall repre­\nsent all forgings from the same heat and heat-treating charge \nwhose maximum thicknesses do not exceed the thickness of the \ntest forging. \n8.3.2.2 When the heat-treating temperatures are the same \nand the furnaces (either batch or continuous type), are con­\ntrolled within ±25 °F [±14 °C] and equipped with recording \npyrometers so that complete records of heat treatment are \navailable, then one tension test from each heat is required \ninstead of one test from each heat in each heat-treatment \ncharge. The test specimen material shall be included with a \nfurnace charge. \n8.3.3 Testing shall be performed as specified in Specifica­\ntion A961/A961M. The largest feasible round specimen shall \nbe used except when hollow cylindrically shaped parts are \nmachined from seamless tubulars, When hollow cylindrically \nshaped parts are machined from seamless tubular materials, \nstrip tests may be used. The tension test specimen shall be \nobtained from a production forging, or from an integral \nprolongation representative of the hub location of a flange, or \nthe heaviest cross section of a fitting, valve, or other part within \nthe scope of this specification. \n8.3.4 Forgings too small to permit obtaining a subsize \nspecimen of 0.250 in. [6.35 mm] diameter or larger parallel to \nthe dimension of maximum working, and produced in equip­\nment unsuitable for the production of a separately forged test \nbar such as an automatic or semi-automatic press, may be \naccepted on the basis of hardness only. One percent of the \nforgings per lot, where a lot is the product from a heat, or, if \nheat treated, the product of a heat per furnace charge, or ten \nforgings, whichever is the lesser number, shall be selected at \nrandom, prepared, and tested using the standard Brinell test. \nThe locations of the indentations shall be at the option of the \nmanufacturer but shall be selected to be representative of the \nforging as a whole. One indentation per forging shall be \nrequired but additional indentations may be made to establish \nthe representative hardness. The hardness of all forgings so \ntested shall be 137 to 197 HBW inclusive. \n8.4 Hardness Tests: \n8.4.1 Two hardness tests shall be made for each heat of \nas-forged components. When more than one forging is pro­\nduced from each heat, a minimum of two forgings shall be \ntested with one reading from each forging. When only one \nforging is produced, it shall be tested in two locations. \n8.4.2 Except when only one forging is produced, a mini­\nmum of two forgings shall be hardness tested per batch or \ncontinuous run as defined in 8.3.2.2 to ensure that forgings are \nwithin the hardness limits given in Table 2. When only one \nforging is produced, it shall be hardness tested in two locations \nto ensure it is within the hardness limits given in Table 2. \n166 \n8.4.3 Testing shall be as specified in Specification A961/ \nA961M. The purchaser may verify that the requirement has \nbeen met by testing at any location on the forging, provided \nsuch testing does not render the forging useless. \n9. Hydrostatic Tests \n9.1 Such tests shall be conducted by the forging manufac­\nturer only when Supplementary Requirement S57 in Specifi­\ncation A961/A961M is specified. \n10. Retreatment \n10.1 If the results of the mechanical tests do not conform to \nthe requirement specified, the manufacturer may heat treat or \nreheat treat the forgings as applicable and repeat the test \nspecified in Section 8. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0218.json",
  "tabulaTablesCsv": "tables_tabula/page-0218.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0218.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5623,
  "bestTextAlphaRatio": 0.7147
}