{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 505,
  "globalPageIndex": 505,
  "width": 597.72,
  "height": 842.88,
  "text": "ASME BPVC.II.A-2025 SA-312/SA-312M (ASTM A312/A312M) \n2.3 A WS Standard: \nA5.9 Corrosion-Resisting Chromium and Chromium-Nickel \nSteel Welding Rods and Electrodes 5 \n2.4 Other Standard: \nSAE J1086 Practice for Numbering Metals and Alloys \n(UNS) 6 \n3. Terminology \n3.1 Definitions: \n3.1.1 The definitions in Specification A999/ A999M and \nTerminology A941 are applicable to this specification. \n4. Ordering Information \n4.1 Orders for material to this specification shall conform to \nthe requirements of the current edition of Specification A999/ \nA999M. \n5. General Requirements \n5.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A999/ A999M unless otherwise provided herein. \n6. Materials and Manufacture \n6.1 Manufacture: \n6.1.1 The pipe shall be manufactured by one of the follow­\ning processes: \n6.1.2 Seamless (SML) pipe shall be made by a process that \ndoes not involve welding at any stage of production. \n6.1.3 Welded (WLD) pipe shall be made using an automatic \nwelding process with no addition of filler metal during the \nwelding process. \n6.1.4 Heavily cold-worked (HCW) pipe shall be made by \napplying cold working of not less than 35 % reduction in \nthickness of both wall and weld to a welded pipe prior to the \nfinal anneal. No filler shall be used in making the weld. Prior \nto cold working, the weld shall be 100 % radiographically \ninspected in accordance with the requirements of ASME Boiler \nand Pressure Vessel Code, Section VIII, Division 1, latest \nrevision, Paragraph UW-51. \n6.1.5 Welded pipe and HCW pipe of NPS 14 and smaller \nshall have a single longitudinal weld. Welded pipe and HCW \npipe of a size larger than NPS 14 shall have a single \nlongitudinal weld or shall be produced by forming and welding \ntwo longitudinal sections of flat stock when approved by the \npurchaser. All weld tests, examinations, inspections, or treat­\nments shall be performed on each weld seam. \n6.1.6 At the option of the manufacturer, pipe shall be either \nhot finished or cold finished. \n6.1.7 The pipe shall be free of scale and contaminating \nexogenous iron particles. Pickling, blasting, or surface finish­\ning is not mandatory when pipe is bright annealed. The \npurchaser is permitted to require that a passivating treatment be \napplied to the finished pipe. \n5 Available from American Welding Society (AWS), 550 NW LeJeune Rd., \nMiami, FL 33126, http://www.aws.org. \n6 Available from Society of Automotive Engineers (SAE), 400 Commonwealth \nDr., Warrendale, PA 15096-0001, http://www.sae.org. \n6.2 Heat Treatment-All pipe shall be furnished in the \nheat-treated condition in accordance with the requirements of \nTable 2. Alternatively, for seamless pipe, immediately follow­\ning hot forming while the temperature of the pipes is not less \nthan the minimum solution treatment temperature specified in \nTable 2, pipes shall be individually quenched in water or \nrapidly cooled by other means (direct quenched). \n7. Chemical Composition \n7 .1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n8. Product Analysis \n8.1 At the request of the purchaser, an analysis of one billet \nor one length of flat-rolled stock from each heat, or two pipes \nfrom each lot shall be made by the manufacturer. A lot of pipe \nshall consist of the following number of lengths of the same \nsize and wall thickness from any one heat of steel: \nNPS Designator \nUnder 2 \n2 to 5 \n6 and over \nLengths of Pipe in Lot \n400 or fraction thereof \n200 or fraction thereof \n100 or fraction thereof \n8.2 The results of these analyses shall be reported to the \npurchaser or the purchaser's representative, and shall conform \nto the requirements specified in Section 7. \n8.3 If the analysis of one of the tests specified in 8.1 does \nnot conform to the requirements specified in Section 7, an \nanalysis of each billet or pipe from the same heat or lot may be \nmade, and all billets or pipe conforming to the requirements \nshall be accepted. \n9. Permitted Variations in Wall Thickness \n9.1 In addition to the implicit limitation of wall thickness \nfor seamless pipe imposed by the limitation on weight in \nSpecification A999/ A999M, the wall thickness for seamless \nand welded pipe at any point shall be within the tolerances \nspecified in Table 3, except that for welded pipe the weld area \nshall not be limited by the \"Over\" tolerance. The wall thickness \nand outside diameter for inspection for compliance with this \nrequirement for pipe ordered by NPS and schedule number is \nshown in Table Xl.1. \n10. Tensile Requirements \n10.1 The tensile properties of the material shall conform to \nthe requirements prescribed in Table 4. \n453 \n11. Mechanical Tests, Grain Size Determinations, and \nWeld Decay Tests Required \n11.1 Mechanical Testing Lot Definition-The term lot for \nmechanical tests shall be as follows: \n11.1.1 Where the final heat treated condition is obtained, \nconsistent with the requirements of 6.2, in a continuous furnace \nor by quenching after hot forming, the term lot for mechanical \ntests shall apply to all pipes of the same specified outside \ndiameter and specified wall thickness ( or schedule) of the same \nheat, heat treated in the same furnace at the same temperature, \ntime at heat, and furnace speed in the same production run, or \nall pipes of the same specified outside diameter and specified ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0505.json",
  "tabulaTablesCsv": "tables_tabula/page-0505.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0505.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5430,
  "bestTextAlphaRatio": 0.7552
}