{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 297,
  "globalPageIndex": 297,
  "width": 604.32,
  "height": 847.68,
  "text": "ASME BPVC.II.A-2025 SA-193/SA-193M \nSUPPLEMENTARY REQUIREMENTS \nThese requirements shall not apply unless specified in the order and in the Ordering Information, \nin which event the specified tests shall be made before shipment of the product. \nSl. High Temperature Tests \nS 1. 1 Tests to determine high temperature properties shall be \nmade in accordance with Test Methods E21, E139, and E292, \nand Practices E150 and E151. \nS2. Charpy Impact Tests \nS2.1 Charpy impact tests based on the requirements of \nSpecification A320/ A320M, Sections 6 and 7, shall be made as \nagreed between the manufacturer and the purchaser. When \ntesting temperatures are as low as those specified in Specifi­\ncation A320/A320M, bolting should be ordered to that speci­\nfication in preference to this specification. \nS3. 100 % Hardness Testing of Grade B7M \nS3.1 Each Grade B7M bolt or stud shall be tested for \nhardness by indentation method and shall meet the require­\nments specified in Tables 2 and 3. \nS4. Hardness Testing of Grade B16 \nS4.1 For bolts or studs 2½ in. [65 mm] or smaller, the \nhardness for Grade B 16 shall be measured on or near the end \nof each bolt or stud using one of the methods prescribed in \n9.2.1 for the Brinell or Rockwell C test. The hardness shall be \nin the range 253-319 HBW or 25-34 HRC. \nSS. Product Marking \nS5.1 Grade and manufacturer's identification symbols shall \nbe applied to one end of studs and to the heads of bolts and \nscrews of all sizes. (If the available area is inadequate, the \ngrade symbol may be marked on one end and the manufactur­\ner's identification symbol marked on the other end.) For bolts \nand screws smaller than¼ in. [6 mm] in diameter and studs \nsmaller than 3/s in. [10 mm] in diameter and for ¼ in. [6 mm] \nin diameter studs requiring more than a total of three symbols, \nthe marking shall be a matter of agreement between the \npurchaser and the manufacturer. \nS6. Stress Relieving \nS6.1 A stress-relieving operation shall follow straightening \nafter heat treatment. \nS6.2 The minimum stress-relieving temperature shall be \n100 °F [55 °C] below the tempering temperature. Tests for \nmechanical properties shall be performed after stress relieving. \nS7. Magnetic Particle Inspection \nS7.1 Bars shall be magnetic particle examined in accor­\ndance with Guide E709. Bars with indications of cracks or \nseams are subject to rejection if the indications extend more \nthan 3 % of the diameter into the bar. \nSS. Stress-Relaxation Testing \nS8.1 Stress-Relaxation Testing, when required, shall be \ndone in accordance with Test Methods E328. The test shall be \nperformed at 850 °F [ 454 °C] for a period of 100 h. The initial \nstress shall be 50 M psi [345 MPa]. The residual stress at 100 \nh shall be 17 M psi [117 MPa] minimum. \nS9. Grain Size Requirements for Non H Grade Austenitic \nSteels Used Above 1000 °F \nS9.1 For design metal temperatures above 1000 °F [540 \n0 C], the material shall have a grain size of No. 7 or coarser as \ndetermined in accordance with Test Methods Ell2. The grain \nsize so determined shall be reported on the Certificate of Test. \nSlO. Hardness Testing of Class 2 Bolting for ASME \nApplications \nS 10.1 The maximum hardness shall be Rockwell C35 im­\nmediately under the thread roots. The hardness shall be taken \non a flat area at least 1/s in. [3 mm] across, prepared by \nremoving threads, and no more material than necessary shall be \nremoved to prepare the flat areas. Hardness determinations \nshall be made at the same frequency as tensile tests. \nSll. Thread Forming \nSll.1 Threads shall be formed after heat treatment. Appli­\ncation of this supplemental requirement to grade B7M or the \ngrades listed in 6.2.4 is prohibited. \n245 \nS12. Stress Rupture Testing of Grade B16 \nS12.l One test shall be made for each heat treat lot. Testing \nshall be conducted using a combination test bar in accordance \nwith Test Methods E292. Rupture shall occur in the smooth \nsection of each test specimen. The test shall be conducted at \n1100 °F [595 °C] and 20 ksi [140 MPa]. The test shall be \ncontinued until the sample ruptures. Rupture life shall be 25 h \nminimum. Testing is not required on material less than ½ in. \n[12 mm] thick. \nSl2.2 When a purchase order for bolting components in­\nvokes S12, the grade symbol applied shall be \"B16R.\" \nS13. Coatings on Bolting Components \nS13.1 It is the purchaser's responsibility to specify in the \npurchase order all information required by the coating facility. \nExamples of such information may include but are not limited \nto the following: \nS 13 .1.1 Reference to the appropriate coating specification \nand type, thickness, location, modification to dimensions, and \nhydrogen embrittlement relief. \nSl3.l.2 Reference to Specifications A153/A153M, B633, \nB695, B696, B766, orF1941/F1941M, F2329/F2329M, or Test \nMethod F1940, or other standards. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0297.json",
  "tabulaTablesCsv": "tables_tabula/page-0297.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0297.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4857,
  "bestTextAlphaRatio": 0.7303
}