{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 322,
  "globalPageIndex": 1120,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-587 ASME BPVC.II.A-2025 \n6.2 Flattening Test: \n6.2.1 A section of pipe not less than 4 in. (102 mm) in length \nshall be flattened cold between parallel plates in two steps. The \nweld shall be placed 90° from the direction of the applied \nforce. During the first step, which is a test for ductility, no \ncracks or breaks, except as provided for in 6.2.5, shall occur on \nthe inside or outside surfaces until the distance between the \nplates is less than the value of H, calculated by the following \nequation: \nH = [(1 +e)t]l[e+t!D] (1) \nwhere: \nH = distance between flattening plates, in., \nt = specified wall thickness of the pipe, in., \nD = specified outside diameter of the pipe, in., and \ne = deformation per unit length (0.09 for low-carbon steel). \n6.2.2 During the second step, which is a test for soundness, \nthe flattening shall be continued until the specimen breaks or \nthe opposite walls of the pipe meet. Evidence of laminated or \nunsound material, or of incomplete weld that is revealed during \nthe entire flattening test shall be cause for rejection. \n6.2.3 Surface imperfections in the test specimens before \nflattening, but revealed during the first step of the flattening \ntest, shall be judged in accordance with the finish requirements. \n6.2.4 Superficial ruptures resulting from surface imperfec­\ntions shall not be cause for rejection. \n6.2.5 When low D-to- t ratio tubulars are tested, because the \nstrain imposed due to geometry is unreasonably high on the \ninside surface at the 6 and 12 o'clock locations, cracks at these \nlocations shall not be cause for rejection if the D-to-t ratio is \nless than 10. \n6.3 Reverse Flattening Test-A section 4 in. ( 102 mm) in \nlength of pipe in sizes down to and including 13 /16 in. (20.6 mm) \nin outside diameter shall be split longitudinally 90° on each \nside of the weld and the sample opened and flattened with the \nweld at the point of maximum bend. There shall be no evidence \nof cracks or lack of penetration or overlaps resulting from flash \nremoval in the weld. \n6.4 Flange Test-A section of pipe not less than 4 in. (102 \nmm) in length shall be capable of having a flange turned over \nat a right angle to the body of the pipe without cracking or \nshowing flaws. This flange, as measured from the outside of the \npipe, shall be not less than Vs in. (3.2 mm) nor more than½ in. \n(12.7 mm). Within these limits, the width of the flange shall be \nnot less than the percentages specified in Table 4. \n7. Dimensions and Permissible Variations \n7.1 Permissible Variations in Outside Diameter and Wall \nThickness-The outside diameter and wall thickness variations \nshall not exceed the limits prescribed in Table 1. \nTABLE 4 Flange Requirements \nOutside Diameter of Pipe, in. \nOver ¾ to 2½, Incl \nOver 2½ to 3¾, incl \nOver 3¾ to 4½, incl \nOver 4½ to 6%, incl \nover6% \nWidth of Flange, % of OD \n15 \n12½ \n10 \n7½ \n5 \n7 .2 Permissible Variations in Straightness-Bach pipe shall \nbe straight within 0.030 in. (0.76 mm) maximum deflection in \nany 3 ft (0.91 m) length to 8 NPS. For 8 NPS and above, pipe \nshall be straight within 0.060 in. (1.52 mm) maximum deflec­\ntion in any 3 ft (0.91 m) length. Galvanized pipe shall be \nreasonably straight. \n7.3 Lengths: \n7.3.1 Pipe may be ordered in definite cut lengths or in \nrandom lengths as provided herein. \n7.3.2 When ordered in definite cut lengths, the variation in \nlength shall not exceed the amounts prescribed in Table 5. \n7.3.3 If definite lengths are not required, pipe may be \nordered in single random lengths of 16 to 22 ft (4.9 to 6.7 m) \nwith 5 % 12 to 16 ft (3.7 to 4.9 m), or in double random lengths \nwith a minimum average of 35 ft (10.7 m) and a minimum \nlength of 22 ft (6.7 m) with 5 % 16 to 22 ft (4.9 to 6.7 m). \n8. Workmanship, Finish, and Appearance \n8.1 The finished pipe shall be free of injurious defects and \nshall have a workman-like finish. Minor defects may be \nremoved by grinding, provided the wall thickness is not \nreduced to less than the minimum thickness permitted for the \nordered nominal wall thickness. \n8.2 The pipe shall have smooth ends free of burrs and free \nof scale except that the pipe may have a superficial \"blue\" \noxide film on the surfaces. \n8.3 For NPS ½ to 1 ½ inclusive, the inside diameter welding \nflash shall be removed so that the remaining flash does not \nexceed 0.006 in. (0.15 mm). For NPS over 1 ½, the remaining \ninside diameter welding flash shall not exceed 0.010 in. (0.25 \nmm). \n8.4 For all nominal sizes, the outside diameter welding flash \nshall be removed flush with the outside diameter contour. \n8.5 Undercut flash must be smoothly blended into the pipe \nwall. \n8.6 The intent of the flash conditions as prescribed in 8.3, \n8.4, and 8.5 is to obtain a surface contour suitable for flanging. \n9. Number of Tests \n9.1 Two tensile tests as specified in 6.1 shall be made from \neach heat. \n9 .2 The flattening test as specified in 6.2 shall be made on \ntwo lengths of pipe from each lot of 250 lengths or fraction \nthereof. \nTABLE 5 Permissible Variations in LengthA \nOutside Diameter, in. \nUnder2 \n2 and over \nCut Length, in. (mm) \nOver \n1/e (3.2) \no/10 (4.8) \nUnder \n0 \n0 \nA These permissible variations In length apply to pipe before bending. They \napply to cut lengths up to and including 24 ft (7.3 m). For lengths over 24 ft, an \nadditional over-tolerance of 1/a in. for each 1 O ft (3.0 m) or fraction thereof shall be \npermissible, up to a maximum of½ in. (12.7 mm). \n1026 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1120.json",
  "tabulaTablesCsv": "tables_tabula/page-1120.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1120.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5459,
  "bestTextAlphaRatio": 0.7078,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-1120.txt",
  "gapOcrHighDpiLength": 5446,
  "camelotTablesPath": "camelot_tables/page-1120.json",
  "camelotTablesCsv": "camelot_tables/page-1120.csv",
  "camelotTableCount": 3
}