{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 294,
  "globalPageIndex": 1092,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-568/SA-568M (ASTM A568/A568M) ASME BPVC.II.A-2025 \nTABLE S1.6 Thickness Tolerances [Metric] for Cold-Rolled Sheet (All Designatlons)A-10-mm Minimum Edge Distance \nNoTE I-Thickness is measured at any point across the width not less than 10 mm from a side edge. \nNoTE 2-Widths up to and including 300 mm in this table apply to widths produced by slitting from wider sheet. \nNoTE 3-Micrometers used for measurement of thickness shall be constructed with anvils and spindles having minimum diameters of 0.188 in. \n[4.80 mm]. The tip of the spindle shall be flat, and the tip of the anvil shall be flat or rounded with a minimum radius of curvature of 0.10 in. [2.55 mm]. \nMicrometers with pointed tips are not suitable for thickness measurements. \nNOTE 4-This table was used to construct Table Al.12 by multiplying the values in this table by 0.50 and rounding to 2 decimal places using standard \nASTM practice. \nNOTE 5-The thickness of material <25-mm wide shall be measured at mid-width. \nSpecified Width, mm \nOver Through \n1800 \n2000 \n1800 \n2000 \nD \nThrough 0.4 \n0.10 \nD \nD \nSpecified Ordered Thickness, mm 8 \nOver 0.4 to 1.0, Incl Over 1.0 to 1.2, incl Over 1.2 to 2.5, incl Over 2.5 to 4.0, Incl \nThickness Tolerances Over, mm, No Tolerance Under 0 \n0.15 0.20 0.25 0.30 \n0.15 0.20 0.30 0.35 \n0.30 0.30 0.35 0.40 \nA 0.55-mm minimum thickness for high-strength low-alloy. \n8 The specified thickness range captions apply independent of whether the ordered thickness is stated as a nominal or minimum. \n0 The tolerances provided in the table are based on minimum thickness (tolerance over, no tolerance under). For nominal thickness, the tolerance Is divided equally over \nand under. \n0 Where an ellipsis ( ... ) appears in the table, the requirements have not been defined. \nANNEX \n(Mandatory Information) \nAl. PERMISSIBLE VARIATIONS IN DIMENSIONS AND MASS IN SI UNITS \nListed in Tables Al.l-Al.17 are permissible variations in dimensions and mass expressed in the International System of Units (SI) \nterminology. \nTABLE A1.1 Thickness Tolerances [Metric] for Hot-Rolled Sheet \n(Carbon and Structural Steel Only)-15-mm (Cut Edge) and \n25-mm (Mill Edge) Minimum Edge Distance (Coils and Cut \nLengths, Including Pickled) \nNoTE I-Thickness is measured at any point across the width not less \nthan 15 mm from a cut edge and not less than 25 mm from a mill edge. \nThis table does not apply to the uncropped ends of mill edge coils. \nNOTE 2-Micrometers used for measurement of thickness shall be \nconstructed with anvils and spindles having minimum diameters of \n0.188 in. [4.80 mm]. The tip of the spindle shall be flat, and the tip of the \n-----------------~an=v'°',...-1 -c,sh'='all 6eflat or rounded with a mm1mum radms of curvature of . \nin. [2.55 mm]. Micrometers with pointed tips are not suitable for thickness \nmeasurements. \nNoTE 3-The thickness of material <50 mm wide shall be measured at \nmid-width. \nSpecified Ordered Thickness, mmA \nThrough 2.0 Over 2.0 to Over 2.5 to 4.5 to 6.0, \nSpecified Width, mm 2.5, incl 4.5, excl excl \nThickness Tolerances Over, mm, \nNo Tolerance Under 8 \nTo 600 0.22 0.22 0.26 0.30 \nOver 600 to 1200, incl 0.22 0.26 0.30 0.34 \nOver 1200 to 1500, incl 0.26 0.26 0.30 0.38 \nOver 1500 to 1800, incl 0.26 0.30 0.30 0.42 \nOver 1800 0.26 0.30 0.30 0.45 \nA The specified thickness range captions apply independent of whether the \nordered thickness is stated as a nominal or minimum. \n8 The tolerances provided In the table are based on minimum thickness (tolerance \nover, not tolerance under). For nominal thickness, the tolerance is divided equally \nover and under. \n992 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 3,
  "tabulaTablesPath": "tables_tabula/page-1092.json",
  "tabulaTablesCsv": "tables_tabula/page-1092.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1092.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3602,
  "bestTextAlphaRatio": 0.6835
}