{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 161,
  "globalPageIndex": 161,
  "width": 617.04,
  "height": 795.6,
  "text": "~ \nASME BPVC.II.A-2025 SA-29/SA-29M \nTABLE 3 Heat Analysis Chemical Ranges and Limits of Carbon \nElement \nCarbonA \nManganese \nPhosphorus \nSulfur \nSilicone \nCopper \nLead 0 \nBismuthE \nCalciumE \nSeleniumE \nTelluriumE \nSteel Bars \nChemical Ranges and Limits, % \nWhen Maximum of Specified \nElements is: \nto 0.12, incl \nover 0.12 to 0.25, incl \nover 0.25 to 0.40, incl \nover 0.40 to 0.55, incl \nover 0.55 to 0.80, incl \nover 0.80 \nto 0.40, incl \nover 0.40 to 0.50, incl \nover 0.50 to 1.65, incl \nto 0.040, Incl \nover 0.040 to 0.08, incl \nover 0.08 to 0.13, incl \nto 0.050, incl \nover 0.050 to 0.09, incl \nover 0.09 to 0.15, incl \nover 0.15 to 0.23, incl \nover 0.23 to 0.50, incl \nto 0.10, incl \nover 0.1 0 to 0.15, incl \nover 0.15 to 0.20, incl \nover 0.20 to 0.30, incl \nover 0.30 to 0.60, incl \nWhen copper is required 0.20 \nmin is generally used \nWhen lead is required, a range \nof 0.15 to 0.35 is specified \nRange \n0.05 \n0.06 \n0.07 \n0.10 \n0.13 \n0.15 \n0.20 \n0.30 \n0.03 \n0.05 \n0.03 \n0.05 \n0.07 \n0.09 \n0.08 \n0.10 \n0.15 \n0.20 \nLowest \nMaximum \n0.06 \n0.35 \n0.040 8 \n0.050 8 \n0.10 \nA The carbon ranges shown in the column headed \"Range\" apply when the \nspecified maximum limit for manganese does not exceed 1.1 0 %. When the \nmaximum manganese limit exceeds 1.1 0 %, add 0.01 to the carbon ranges shown \nabove. \n8 For steels produced in merchant quality the phosphorus maximum is 0.04 % and \nthe sulfur maximum is 0.05 %. \nc It is not common practice to produce a rephosphorized and resulfurized carbon \nsteel to specified limits for silicon because of its adverse effect on machinability. \n0 A cast or heat analysis is not determinable when lead is added to the ladle \nstream. \nE Element specification range as agreed upon between purchaser and supplier. \n6. Mechanical Property Requirements \n6.1 Test Specimens: \n6.1.1 Selection-Test specimens shall be selected in accor­\ndance with the requirements of the applicable product specifi­\ncation or in accordance with Supplement I of the latest issue of \nTest Methods and Definitions A370, in the sequence named. \n6.1.2 Preparation-Unless otherwise specified in the appli­\ncable product specification, test specimens shall be prepared in \naccordance w1th the latest issue of Test Methods and Defini­\ntions A370, and especially Supplement I thereof. \n6.2 Methods of Mechanical Testing-All mechanical tests \nshall be conducted in accordance with the latest issue of Test \nMethods and Definitions A370, and especially Supplement I \nthereof, on steel bar products. \n6.3 Retests: \n6.3.1 If any test specimen shows defective machining or \ndevelops flaws, the specimen may be discarded and another \nsubstituted. \n6.3.2 If the percentage elongation of any tension specimen \nis less than that specified and any part of the fracture is more \nthan ¾ in. [20 mm] from the center of a 2 in. [50 mm] \nspecimen, or is outside the middle half of the gage length of an \n8 in. [200 mm] specimen as indicated by scribe scratches \nmarked on the specimen before testing, a retest shall be \nallowed. \n6.3.3 For \"as-wrought\" material, if the results for any \noriginal tension specimen are within 2000 psi [14 MPa] of the \nrequired tensile strength, within 1000 psi [7 MPa] of the \nrequired yield point, or within 2 % of the required elongation, \nretesting shall be permitted. If the original testing required only \none test, the retest shall consist of two random tests from the \nheat or lot involved. If the original testing required two tests of \nwhich one failed by the amounts listed in this paragraph, the \nretest shall be made on one random test from the heat or lot. If \nthe results on the retest specimen or specimens meet the \nspecified requirements, the heat or test lot will be accepted. If \nthe results of one retest specimen do not meet the specified \nrequirements, the material is subject to rejection. \n6.3.4 For thermally treated bars, if the results of the me­\nchanical tests do not conform to the requirements specified, \ntwo more tests may be selected for each bar failing, and each \nof these retests shall conform to the requirements of the \nproduct specification. \n6.3.5 If a bend specimen fails, due to conditions of bending \nmore severe than required by the specification, a retest shall be \npermitted from the heat or test lot involved for which one \nrandom specimen for each original specimen showing failure \nshall be used. If the results on the retest specimen meet the \nrequirements of the specification, the heat or test lot will be \naccepted. \n7. Dimensions, Mass, and Permissible Variations \n7 .1 Hot-Wrought Bars-The permissible variations for di­\nmensions of hot-wrought carbon and alloy steel bars shall not \nexceed the applicable limits stated in Annex Al for inch-pound \nvalues and Annex A2 for metric values. \n8. Workmanship, Finish, and Appearance \n8.1 The material shall be free of injurious defects and shall \nhave a workmanlike finish. \n9. Rework and Retreatment \n109 \n9.1 For thermally treated bars only, the manufacturer may \nretreat a lot one or more times, and retests shall be made in the \nsame manner as the original tests. Each such retest shall \nconform to the requirements specified. \n10. Inspection \n10.1 The inspector representing the purchaser shall have \nentry, at all times while work on the contract of the purchaser ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0161.json",
  "tabulaTablesCsv": "tables_tabula/page-0161.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0161.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5289,
  "bestTextAlphaRatio": 0.7086
}