{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 232,
  "globalPageIndex": 232,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-134/SA-134M ASME BPVC.II.A-2025 \nSpecification for \nPipe, Steel, Electric-Fusion (Arc)-Welded (Sizes NPS 16 and \nOver) \n1. Scope \n1.1 This specification covers electric-fusion (arc)-welded \nstraight seam or spiral seam steel pipe NPS 16 and over in \ndiameter (inside or outside as specified by purchaser), with \nwall thicknesses up to ¾ in. [19 mm], inclusive. Pipe having \nother dimensions may be furnished provided such pipe com­\nplies with all other requirements of this specification. The pipe \nis available in various grades based on the ASTM specification \nordered (Section 4). \nNoTE I-Acceptability for many services may be controUed by codes \nor standards such as those published by the American National Standards \nInstitute and American Society of Mechanical Engineers. \nNoTE 2-For testing methods not specifically covered in this \nspecification, reference can be made to Test Methods and Definitions \nA370, with particular reference to Annex A2 on Steel Tubular Products. \nNoTE 3-A comprehensive listing of standardized pipe dimensions is \ncontained in ANSI B 36.10. \n1.2 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. In this \nspecification hard or rationalized conversions apply to \ndiameter, lengths, and tensile properties. Soft conversion ap­\nplies to other SI measurements. \nNoTE 4--The dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiameter,\" \"size,\" and \"nominal size.\" \n1.3 The following caveat pertains specifically to Section 5 \nof this specification. This standard does not purport to address \nall of the safety concerns, if any, associated with its use. It is \nthe responsibility of the user of this standard to establish \n180 \nappropriate safety, health, and environmental practices and \ndetermine the applicability of regulatory limitations prior to \nuse. \nl.4 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA36/A36M Specification for Carbon Structural Steel \nA283/ A283M Specification for Low and Intermediate Ten­\nsile Strength Carbon Steel Plates \nA285/ A285M Specification for Pressure Vessel Plates, Car­\nbon Steel, Low- and Intermediate-Tensile Strength \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA1011/A1011M Specification for Steel, Sheet and Strip, \nHot-Rolled, Carbon, Structural, High-Strength Low­\nAlloy, High-Strength Low-Alloy with Improved \nFormability, and Ultra-High Strength \nA1018/A1018M Specification for Steel, Sheet and Strip, \nHeavy-Thickness Coils, Hot-Rolled, Carbon, \nCommercial, Drawing, Structural, High-Strength Low­\nAlloy, High-Strength Low-Alloy with Improved \nFormability, and Ultra-High Strength \nAl058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \n2.2 ASME Boiler and Pressure Vessel Code: \nSection Ill \nSection IX ",
  "words": [],
  "tableCount": 0,
  "noteCount": 4,
  "bestTextPath": "best_text/pages/page-0232.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3663,
  "bestTextAlphaRatio": 0.7802
}