{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 129,
  "globalPageIndex": 129,
  "width": 621.72,
  "height": 799.2,
  "text": "ASME BPVC.II.A-2025 SA-20/SA-ZOM \n72 in. [1800 mm] or less shall be in at least one place on each \nfinished plate, approximately midway between the center and \nan edge of the plate. \n13.4 Subdivided Plates: \n13.4.1 By agreement between the purchaser and the manu­\nfacturer or processor, each subdivided plate (a plate separated \nfrom a master plate) shall be legibly marked with the name, \nbrand, or trademark of the organization that subdivided the \nplate plus a code traceable to the required markings, provided \nthat the information required in 13.1, cross referenced to that \ncode, is furnished with the plates. \n13.4.2 By agreement between the purchaser and the manu­\nfacturer or processor, subdivided plates that are from the same \nmaster plate and placed in secured lifts shall have the infor­\nmation required in 13.1 paint marked on the top piece of each \nlift or shown on a substantial tag attached to each lift. \n13.5 Bar Coding-In addition to the requirements of 13.1 to \n13.4 inclusive, the manufacturer or processor shall have the \noption of using bar coding as a supplementary identification \nmethod. \nNorn 3-Bar coding should be consistent with AIAG Standard B 1. \n14. Permissible Variations in Dimensions or Mass \n14.1 One cubic foot of rolled steel shall be assumed to \nweigh 490 lb, unless otherwise stated in the applicable product \nspecification. One cubic metre of rolled steel is assumed to \nhave a mass of 7850 kg, unless otherwise stated in the \napplicable product specification. \n14.2 For carbon steel plates the permissible variations for \ndimensions shall not exceed the applicable limits stated in \nAnnex Al, Table Al.I to Table Al.9, and Table Al.13 [Annex \nA2, Table A2.1 to Table A2.9, and Table A2.13]. \n14.3 For alloy steel plates the permissible variations for \ndimensions shall not exceed the applicable limits stated in \nAnnex 1, Table Al.I to Table Al.4, Table Al.8, and Table \nAl.IO to Table Al.13 [Annex 2, Table A2.l to Table A2.4, \nTable A2.8 and Table A2.10 to Table A2.13]. \n14.4 Permitted vaiiations on length and width for plates \nsupplied on other than strip mills as mill edge shall be at the \ndiscretion of the manufacturer unless otherwise agreed to with \nthe purchaser. For mill edge carbon steel, high-strength low­\nalloy, and alloy plates produced on strip mills, the permitted \nvariation in width shall not exceed the applicable limit stated in \nTable Al.17 [A2.16]. For mill edge carbon steel, high-strength \nlow-alloy, and alloy plates produced on mill other than strip \nmills the permitted variation in width stated in Table Al.17 \n[A2.16] may be specified only upon agreement between the \nmanufacturer and the purchaser. Mill edge plates as delivered \nshall be capable of being trimmed by the purchaser to the \nrequired final rectangular size ordered. \n14.5 Conversions of Permitted Variations from Fractions of \nan Inch to Decimals-Pennitted variations in dimensions for \nproducts covered by this specification are generally given as \nfractions of inch and these remain the official permitted \nvariations, where so stated. If the material is to be measured by \nequipment reporting dimensions as decimals, conversion of \n77 \npermitted variations from fractions of an inch to decimals shall \nbe made to three decimal places; using the rounding method \nprescribed in Practice E29. \n15. Inspection and Testing \n15.1 The inspector representing the purchaser shall have \nentry at all times while work on the contract of the purchaser \nis being pe1formed, to all parts of the manufacturer's works \nthat concern the manufacture of the plate ordered. The manu­\nfacturer shall afford the inspector all reasonable facilities to be \nsatisfied that the plate is being furnished in accordance with \nthis general requirements specification, the applicable product \nspecification, and the purchase order. All tests (except product \nanalysis) and inspection shall be made at the place of manu­\nfacture prior to shipment, unless otherwise specified, and shall \nbe so conducted as not to inte1fere unnecessarily with the \noperation of the manufacturer's works. \n15.2 If plates are produced from coil, 15.1 shall apply to the \n\"processor\" instead of to the \"manufacturer\" and the \"place of \nprocess\" shall apply instead of the \"place of manufacture.\" If \nplates are produced from coil and the processor is different \nfrom the manufacturer, the inspector representing the purchaser \nshall have free entry, at all times while work on the contract of \nthe purchaser is being performed, to all parts of the manufac­\nturer's works that concern the manufacture of the plate \nordered. \n16. Retests \n16.1 Tension Test-In addition to the prov1s1ons of Test \nMethods and Definitions A370, the following retest provisions \nshall apply: \n16.1.1 If any test specimen shows defective machining, or \ndevelops flaws, it may be discarded and another test specimen \nsubstituted. \n16.1.2 If the percentage of elongation of any tension test \nspecimen is less than that specified, and any part of the fracture \nis more than ¾ in. [20 mm] from the center of the gage length \nof a 2-in. [50-mm] test specimen or is outside the middle half \nof the gage length of an 8-in. [200-mm] test specimen as \nindicated by scribe marks on the test specimen before testing, \none retest shall be allowed. \n16.1.3 If the results from an original tension test specimen \nfail to meet the specified requirements but are within 2 ksi [10 \nMPa] of the required tensile strength or within 1 ksi [5 MPa] \nof the required yield strength or yield point, or within 2 \npercentage points of the required elongation or reduction of \narea, one retest shall be pennitted to replace the failing test. \n16.1.4 The results of the retest shall meet the specified \nrequirements. \n16.2 Charpy V-Notch Tests: \n16.2.1 The retest provisions of Test Methods and Defini­\ntions A370 shall apply, except that the 5 ft·lbf [7 J] absolute \nminimum for an individual specimen shall not apply if two \nthirds of the specified minimum average is less than 5 ft-lbf [7 \nJ]. \n16.2.2 If Charpy V-notch impact test lateral expansion \nvalues are specified, if the value of one specimen falls below \nthe specified minimum value and not below 2/3 of the specified ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0129.json",
  "tabulaTablesCsv": "tables_tabula/page-0129.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0129.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6223,
  "bestTextAlphaRatio": 0.7612
}