{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 123,
  "globalPageIndex": 123,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-20/SA-20M \naccount current production and processing capabilities. To \nqualify any plate to a particular product specification requires \nthat all appropriate and necessary tests be performed and that \nthe results meet the limits prescribed in that product specifi­\ncation. If the necessary tests required by a product specification \ncan not be conducted, the plate can not be qualified to that \nspecification. This general requirements specification contains \npermitted variations for the commonly available sizes. Permit­\nted variations for other sizes are subject to agreement between \nthe purchaser and the manufacturer or processor, whichever is \napplicable. \n3.1.11 precipitation heat treatment-a subcritical tempera­\nture thermal treatment performed to cause precipitation of \nsubmicroscopic constituents, and so forth, to result in enhance­\nment of some desirable property. \n3.1.12 processor-the organization that directly controls, or \nis responsible for, operations involved in the processing of coil \ninto finished plates. Such processing operations include \ndecoiling, leveling, cutting to length, testing, inspection, \nconditioning, heat treatment (if applicable), packaging, \nmarking, loading for shipment, and certification. \n3.1.12.1 Discussion-The processing operations need not be \ndone by the organization that did the hot rolling of the coil. If \nonly one organization is involved in the hot rolling and \nprocessing operations, that organization is termed the manu­\nfacturer for the hot rolling operation and the processor for the \nprocessing operations. If more than one organization is in­\nvolved in the hot rolling and processing operations, the \norganization that did the hot rolling is termed the manufacturer \nand the organization that does one or more processing opera­\ntions is termed a processor. \n3.2 Refer to Terminology A941 for additional terms used in \nthis standard. \n4. Ordering Information \n4.1 Orders should include the following information, as \nnecessary, to adequately describe the desired product. \n4.1.1 Quantity (weight [mass] or number of plates), \n4.1.2 Dimensions, \n4.1.3 Name of product (for example, plates, carbon steel; \nplates, alloy steel), \n4.1.4 Specification designation (including type, class, and \ngrade as applicable) and year-date, \n4.1.5 Condition (as-rolled, normalized, quenched and \ntempered, etc. If heat treatment of plate is to be performed by \nthe fabricator, this is to be stated. Also, if purchaser specifies a \nheat-treatment cycle, this is to be stated), \n4.1.6 Impact test requirements, if any (see Section 12). (For \nCharpy V-notch test, include test specimen orientation, testing \ntemperature, and acceptance criteria. For drop-weight test, give \ntesting temperature), \n4.1.7 Exclusion of either plates produced from coil or plates \nproduced from plate-as-rolled, if applicable. (See 5.4 and \nAppendix XL) \n4.1.8 Limits for grain refining elements other than \naluminum, if applicable (see 8.3.2), \n4.1.9 Paint marking (see 13.2.1), \n71 \n4.1.10 Supplementary requirements, if any (test specimen \nheat treatment, special impact test requirements, etc.), \n4.1.11 Provisions for delivery with mill edges and any \nspecial permissible variations (see 14.4), and \n4.1.12 Additional requirements, if any. \n5. Materials and Manufacture \n5.1 The steel shall be made in an open-hearth, basic-oxygen, \nor electric-arc furnace, possibly followed by additional refining \nin a ladle metallurgy furnace (LMF), or by another method; or \nsecondary melting by vacuum-arc remelting (VAR), electro­\nslag remelting (ESR), or another method. \n5.2 The steel may be strand cast or cast in stationary molds. \n5.2.1 Strand Cast Slabs: \n5.2.1.1 If heats of the same nominal chemical composition \nare consecutively strand cast at one time, the heat number \nassigned to the cast product (slab) may remain unchanged until \nall of the steel in the slab is from the following heat. \n5.2.1.2 When two consecutively strand cast heats have \ndifferent nominal chemical composition ranges, the manufac­\nturer shall remove the transition material by any established \nprocedure that positively separates the grades. \n5.3 The ratio of reduction of thickness from a strand-cast \nslab to plate shall be at least 3.0:1, except that reduction ratios \nas low as 2.0: 1 are permitted if all of the following limitations \nare met: \n5.3.1 The purchaser agrees to the use of such reduction \nratios. \n5.3.2 The applicable product specification is A299/A299M, \nA515/A515M, A516/A516M, A537/A537M, A662/A662M, or \nA737/A737M. \n5.3.3 The specified plate thickness is 3.0 in. [75 mm] or \nmore. \n5.3.4 One or more of the following low hydrogen practices \nare used: vacuum degassing during steelmak:ing; controlled \nsoaking of the slabs or plates; or controlled slow cooling of the \nslabs or plates. \n5.3.5 The sulfur content is 0.004 % or less, based upon heat \nanalysis. \n5.3.6 One or more of the following practices are used: \nelectromagnetic stirring during strand casting; soft reduction \nduring strand casting; heavy pass reductions or other special \npractices during plate rolling; or combined forging and rolling \nduring plate rolling. \n5.3.7 The plates are ultrasonically examined in accordance \nwith Specification A578/A578M, Level C based on continuous \nscanning over 100 % of the plate surface. \n5.3.8 The plates are through-thickness tension tested in \naccordance with Specification A770/A770M. \n5.4 Unless otherwise specified in the purchase order, plates \nshall be produced from plate-as-rolled or from coil. \n5.5 Coils are excluded from qualification to the applicable \nproduct specification until they are decoiled, leveled, cut to \nlength, and tested by the processor in accordance with the \nspecified requirements (see Sections 9, 10, 11, 12, 13, 14, 15, \n16, and 20.) ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0123.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5828,
  "bestTextAlphaRatio": 0.7524
}