{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 712,
  "globalPageIndex": 1510,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-988/SA-988M ASME BPVC.II.A-2025 \nSpecification for \nHot lsostatically-Pressed Stainless Steel Flanges, Fittings, \nValves, and Parts for High Temperature Service \n1. Scope \n1.1 This specification covers hot isostatically-pressed, pow­\nder metallurgy, stainless steel piping components for use in \npressure systems. Included are flanges, fittings, valves, and \nsimilar parts made to specified dimensions or to dimensional \nstandards, such as in ASME specification B16.5. \n1.2 Several grades of martensitic, austenitic, age hardening, \nand austenitic-ferritic stainless steels are included in this \nspecification. \n1.3 Supplementary requirements are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified individually by the purchaser in the order. \n1.4 This specification is expressed in both inch-pound units \nand in SI units. Unless the order specifies the applicable \"M\" \nspecification designation (SI units), however, the material shall \nbe furnished to inch-pound units. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as the standard. Within the text, \nthe SI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n1.6 The following safety hazards caveat pertains only to test \nmethods portions 8.1, 8.2, 9.5 - 9.7, and Section 10 of this \nspecification: This standard does not purport to address all of \nthe safety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety and health practices and determine the applica­\nbility of regulatory limitations prior to use. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA745/A745M Practice for Ultrasonic Examination of Aus­\ntenitic Steel Forgings \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA923 Test Methods for Detecting Detrimental Intermetallic \nPhase in Duplex Austenitic/Ferritic Stainless Steels \nA961/A961M Specification for Common Requirements for \nSteel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \nB311 Test Method for Density of Powder Metallurgy (PM) \nMaterials Containing Less Than Two Percent Porosity \nE112 Test Methods for Determining Average Grain Size \nE165/E165M Practice for Liquid Penetrant Examination for \nGeneral Industry \nE340 Practice for Macroetching Metals and Alloys \nE606/E606M Test Method for Strain-Controlled Fatigue \nTesting \nG48 Test Methods for Pitting and Crevice Corrosion Resis­\ntance of Stainless Steels and Related Alloys by Use of \nFerric Chloride Solution \n2.2 MSS Standard: \nSP 25 Standard Marking System for Valves, Fittings, \nFlanges, and Unions \n1456 \n• ~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1510.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3401,
  "bestTextAlphaRatio": 0.7815
}