{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 117,
  "globalPageIndex": 117,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-6/SA-6M \norder to obtain a higher level of confidence in avoiding cold \ncracking, the chemistry controls in S3 l are available. A \npurchaser who specifies the use of S31. should be aware that \nthere are several factors involved in the judicious selection of \na maximum CE value, such as the following: \nX3 .4.1 Actual production joint restraint/base metal \nthickness(es), \nX3.4.2 Filler metal and base metal strength compatibility, \nX3.4.3 Deposited weld metal diffusible hydrogen content, \nX3.4.4 Preheat and interpass temperatures, \nX3.4.5 Filler metal and base metal cleanliness, and \nX3.4.6 Heat input. \nX3.5 Though it is widely believed that low CE steels are \nimmune to weld cracking problems, failure to consider these \nfactors and others have resulted in weld or base metal HAZ \n(heat affected zone) cracks in such steels.11 \nX3.6 It is important to note that carbon equivalence is only \na qualitative assessment of potential welding problems, and \nshould never be solely relied on to ensure weld integrity. The \nproper use of welding specifications, coupled with the knowl­\nedge of actual construction conditions, must also be used. \nX4. RADIUS FOR COLD BENDING \nX4.1 Suggested minimum inside bend radii for cold form­\ning are referenced to Group Designations A to F inclusive as \ndefined in Table X4. l. The suggested radii listed in Table X4.2 \nshould be used as minimums in typical shop fabrication. \nMaterial that does not form satisfactorily when fabricated in \naccordance with Table X4.2 may be subject to rejection \npending negotiation with the steel supplier. When tighter bends \nare required, the manufacturer should be consulted. \nX4.2 The bend radius and the radius of the male die should \nbe as liberal as the finished part will permit. The width across \nthe shoulders of the female die should be at least eight times \nthe plate thickness. Higher strength steels require larger die \nopenings. The surface of the dies in the area of radius should \nbe smooth. \nX4.2.1 Since cracks in cold bending commonly originate \nfrom the outside edges, shear burrs and gas cut edges should be \nremoved by grinding. Sharp comers on edges and on punched \nor gas cut holes should be removed by chamfering or grinding \nto a radius. \nX4.2.2 If possible, parts should be formed such that the \nbend line is perpendicular to the direction of final rolling. If it \nis necessary to bend with the bend line parallel to the direction \nof final rolling, a more generous radius is suggested (1 ½ times \napplicable value given in Table X4.2 for bend lines perpen­\ndicular to the direction of rolling). \nX4.3 References \nX4.3.1 Holt, G.E., et al., \"Minimum Cold Bend Radii \nProject-Final Report,\" Concurrent Technologies Corporation, \nJanuary 27, 1997. \nX4.3.2 Brockenbrough, R.L., \"Fabrication Guidelines for \nCold Bending,\" R.L. Brockenbrough & Associates, June 28, \n1998. \n65 \nTABLE X4.1 Group Designations for Cold Bending \nSpecification \nA36/A36M \nA131/A131M \nA242/A242M \nA283/A283M \nA514/A514M \nA529/A529M \nA572/A572M \nA573/A573M \nA588/A588M \nA633/A633M \nA656/A656M \nA678/A678M \nA709/A709M \nA710/A710M \nA808/A808M \nA852/A852M \nA871/A871M \nA945/A945M \nGrade \nB \nA, 8, D, cs and E \nA, 8, D, CS arid E (all cold flanging) \nAH32, DH32, EH32 and FH32 \nAH36, DH36, EH36 and FH36 \nAH40, DH40, EH40 and FH40 \nB \nAor8 \nC or D \nany \n50 [345] or 55 [380] \n42 [290] \n50 [345] \n55 [380] \n60 [415] or 65 [450] \n58 [400] or 65 [450] \n70 [485] \nany \nany \n50 [345] \n60 [415] \n70 [485] \n80 [550] or 100 [690] \nAor8 \nCorD \n36 [250] \n50 [345], SOW [345W] or HPS 50W \n[HPS 345W] \nHPS 70W [HPS 485W] \nHPS 100W [HPS 690W] \nA \nB \nB \n60 [415] or 65 [450] \n50 [345] or 65 [450] \nGroup \nDesignatlonA \n8 \n8 \n8 \nC \nC \nC \nC \nA \nEi \nF \nC \n8 \nC \nD \nE \n8 \nC \nC \n8 \n8 \nD \nE \nF \nC \nD \n8 \nC \nD \nF \nF \nC \nD \nE \n8 \nA Steels having a ratio of specified minimum tensile strength to specified minimum \nyield strength of 1.15 or less are in Group F; other steels are in Groups A to E \ninclusive, which are grouped on the basis of their having similar specified values \nfor minimum elongation in 2 in. [50 mm]. \n8 Grade designations are not applicable for this specification. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0117.json",
  "tabulaTablesCsv": "tables_tabula/page-0117.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0117.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4153,
  "bestTextAlphaRatio": 0.6658
}