{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 167,
  "globalPageIndex": 965,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-513/SA-513M (ASTM A513/A513M) \nAPPENDIX \n(Nonmandatory Information) \nXl. MEASURING MICROINCH FINISH \nXl.1 The procedure for making microinch readings on \ninterior surfaces of cold worked tubing (not polished or \nground) ½-in. [12.7-mm] inside diameter and larger is as \nfollows: \nXl.1.1 Measurements on tubing with longitudinal or no \npredominant lay should be circumferential on the inside \nsurface of the straight tube, prior to any fabrication, on a plane \napproximately perpendicular to the tube axis. Measurements \non tubing with circumferential lay should be longitudinal. \nXl.1.2 Measurements should be made not less than 1 in. \n[25.4 mm] from the end. \nXl.1.3 Measurements should be made at four positions \napproximately 90° apart or over a complete circumference if \nthe trace should otherwise overlap. \nX 1.1.4 The length of trace should be in accordance with the \nlatest revision of Section 4.5 of ASME B46.1 (not less than \n0.600 in. [15.24 mm] long). \nXl.1.5 A minimum of three such measurements should be \nmade spaced not less than ¼ in. [6.4 mm] apart along the \nlongitudinal axis. \nXl.1.6 The numerical rating shall be the arithmetical aver­\nage microinch of all readings taken. Each reading to be \naveraged should be the mean position of the indicator during \nthe trace; any momentary meter excursions occupying less than \n10 % of the total trace should be ignored. \nXl.1.7 A deviation in numerical rating in various parts of a \ntube may be expected. Experience to date indicates that a \nvariation of about ±35 % is normal. \nXl.2 Instruments should meet the specifications given in the \nlatest revision of ASME B46.1. \nXl.3 Mecharucal tracing is preferred. If hand tracing is \nused, the speed of trace should not vary by more than ±20 % \nfrom the required to give the appropriate cutoff. The 0.030-in. \n[0.76 mm] roughness width cutoff should be used. \nXl.4 Microinch [0.0000254 mm] determinations only refer \nto roughness of areas that do not contain a defect, injurious or \notherwise. Such defects as seams, slivers, pits, laps, etc., are \nsubject to ordinary visual inspection in accordance with \napplicable specifications or trade customs, and have no rela­\ntionship to roughness. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue, \nA513/A513M- 20, that may impact the use of this standard. (Approved July 1, 2020.) \n( 1) Changed 1.3.1 to allow indeterminate wall thicknesses. \neommittee-Ae-l-has--:identi-fi:ed-the-foeation----of----seleetecl---ehanges-te-thls-spee-i-fie-atien--sinee---the--la-s-t-i~u.v;,.------------+­\nA513/ A513M - l 9, that may impact the use of this specification. (Approved May 1, 2020.) \n( 1) Added 1.4 to the Scope to incorporate various grades types \nand thermal conditions. \n(2) Corrected conversion errors in Table S5.1. \nCommittee A0l has identified the location of selected changes to this specification since the last issue, \nA513/A513M-18, that may impact the use of this specification. (Approved March 1, 2019.) \n(1) Corrected seven conversion errors in Table 10. 0.109 in. \nwas incorrectly identified as 1.77 mm. \n865 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0965.json",
  "tabulaTablesCsv": "tables_tabula/page-0965.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0965.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3169,
  "bestTextAlphaRatio": 0.7217
}