{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 776,
  "globalPageIndex": 1574,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-1011/SA-1011M (ASTM A1011/A1011M) ASME BPVC.II.A-2025 \nTABLE 3 Typical Ranges of Mechanical PropertiesA \n. (Nonmandatory) 8 for Hot-rolled Steel Sheet and Strip \nDesignations CS and DS {Includes Grades In Accordance With \nSpecification A568/A568M, Table X2.3) \nDesignation \ncs Types A, B, \nC, and D \nDS Types A and \nB \nYield Strength 0 \nksi MPa \n30-SO \n3Q-45 \n(205-340] \n(205-310] \nElongation in 2 \nin. [50 mm] % 0 \n2:25 \n2:28 \nA The yield strength tends to increase and the elongation tends to decrease as the \nsheet thickness decreases. These properties represent those typical of material in \nthe thickness range of 0.100 to 0.150 in. [2.5 to 3.5 mm] for CS Types A, B, and \nDS Types A and Band in the thickness ranges of 0.060 to 0.075 in. (1.5 to 1.9 mm] \nfor CS Type D. \n8 The typical mechanical property values presented here are nonmandatory. They \nare provided to assist the purchaser in specifying a suitable steel for a given \napplication. Values outside these ranges are to be expected. \n0 Yield strength and elongation are measured in the longitudinal direction in \naccordance with Test Methods and Definitions A370. \n8.2.1.1 For SS, HSLAS, HSLAS-F, and UHSS, a report is \nrequired of mechanical properties as determined by the tension \ntest. \n8.2.2 Tension Tests: \n8.2.2.1 Requirements-Material as represented by the test \nspecimen shall conform to the mechanical property require­\nments specified in Table 4. These requirements do not apply to \nthe uncropped ends of unprocessed coils. \n8.2.2.2 Number of Tests-Two tension tests shall be made \nfrom each heat or from each 50 tons [45 000 kg]. When the \namount of finished material from a heat is less than 50 tons \n[45 000 kg], one tension test shall be made. When material \nrolled from one heat differs 0.050 in. [1.27 mm] or more in \nthickness, one tension test shall be made from the thickest and \nthinnest material regardless of the weight represented. \n8.2.2.3 Tension test specimens shall be taken at a point \nimmediately adjacent to the material to be qualified. \n8.2.2.4 Tension test specimens shall be taken from the full \nthickness of the sheet as-rolled. \n8.2.2.5 Tension test specimens shall be taken from a loca­\ntion approximately halfway between the center of sheet and the \nedge of the material as-rolled. \n8.2.2.6 Tension test specimens shall be taken with the \nlengthwise axis of the test specimen parallel to the rolling \ndirection (longitudinal test). \n8.2.2.7 Test Method-Yield strength shall be determined by \neither the 0.2 % offset method or the 0.5 % extension under \nload method unless otherwise specified. \n8.2.3 Bending Properties: \n8.2.3.1 The suggested minimum inside radii for cold bend­\ning are listed in Appendix Xl and is discussed in more detail \nin Specifications A568/A568M (6.6) and A749/A749M (7.6). \nWhere a tighter bend radius is required, where curved or offset \nbends are involved, or where stretching or drawing are also a \nconsideration, the producer shall be consulted. \n9. Finish and Appearance \n9.1 Surface Finish: \n9.1.1 Unless otherwise specified, the material shall be fur­\nnished as rolled, that is, without removing the hot-rolled oxide \nor scale. \n9.1.2 When required, it is permissible to specify that the \nmaterial be pickled or blast cleaned (descaled). \n9.2 Oiling: \n9.2.1 Unless otherwise specified, as-rolled material shall be \nfurnished not oiled (that is, dry), and pickled or blast cleaned \nmaterial shall be furnished oiled. \n9.3 Edges: \n9.3.1 Steel sheet is available with mill edge or cut edge. \n9.3.2 Steel strip is available with mill edge or cut edge. \n10. Retests and Disposition of Non-Conforming Material \n10.1 Retests, conducted. in accordance with the require­\nments of Section 11.1 of Specification A568/ A568M, are \npermitted when an unsatisfactorily test result is suspected to be \nthe consequence of the test method procedure. \n10.2 Disposition of non-conforming material shall be sub­\nject to the requirements of Section 11.2 of Specification \nA568/ A568M. \n11. Product Marking \n11.1 In addition to the requirements of Specification A568/ \nA568M for sheet and Specification A749/A749M for strip, \neach lift or coil shall be marked with the designation shown on \ntheorder(CS (Type A, B, orC), OS (TypeAorB), SFS (Grade, \nCarbon or Manganese or both), SS (Grade and for SS36, Type), \nHSLAS (Grade and Class), HSLAS-F (Grade), or UHSS (Type \nand Grade)). The designation shall be legibly stenciled on the \ntop of each lift or shown on a tag attached to each coil or \nshipping unit. \n12. Keywords \n12.1 carbon steel sheet; carbon steel strip; commercial steel; \ndrawing steel; special forming steel; high strength-low alloy \nsteel; high strength-low alloy steel with improved formability; \nhot-rolled steel sheet; hot-rolled steel strip; steel sheet; steel \nstrip; structural steel; ultra-high strength steel \n1520 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1574.json",
  "tabulaTablesCsv": "tables_tabula/page-1574.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1574.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4858,
  "bestTextAlphaRatio": 0.7207
}