{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 744,
  "globalPageIndex": 1542,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-999 /SA-999M ASME BPVC.II.A-2025 \n4.1.1 The definitions in Terminology A941, except as modi­\nfied in this specification or in its referenced product \nspecifications, are applicable to this specification. \n5. Ordering Information \n5.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for products ordered under the \napplicable product specification and this general requirements \nspecification. Such requirements to be considered include, but \nare not limited to, the following: \n5.1.1 ASTM product specification and year-date, \n5.1.2 Name of product (for example, stainless steel pipe), \n5.1.3 Quantity (feet, metres, or number of pieces), \n5.1.4 Method of manufacture, where applicable (seamless \nor welded), \n5.1.5 Specific type of melting, if required (see 3.4), \n5.1.6 Grade or UNS number, \n5.1.7 Size (NPS and outside diameter and schedule number, \naverage (nominal) wall thickness (see 9.1 and 10.1), or \nminimum wall thickness (see 9.2 and 10.1.l), or minimum \ninside diameter (see 11.1)), \n5.1.8 Length (specific or random), \n5.1.9 End finish, \n5.1.10 Optional requirements, \n5.1.11 Specification designation and year of issue, and \n5.1.12 Special requirements or any supplementary \nrequirements, or both. \n6. Chemical Composition \n6.1 Chemical Analysis-Samples for chemical analysis and \nmethod of analysis shall be in accordance with Test Methods, \nPractices, and Terminology A 7 51. \n6.2 Heat Analysis-An analysis of each heat of steel shall be \nmade by the steel manufacturer to determine the percentages of \nthe specified elements. If secondary melting processes are \nemployed, the heat analysis shall be obtained from one \nremelted ingot or the product of one remelted ingot of each \nprimary melt. The chemical composition thus determined, or \nthat determined from a product analysis made by the tubular \nproduct manufacturer shall conform to the requirements speci­\nfied. \n6.2.1 For steels ordered under product specifications refer­\nencing this specification of general requirements, the steel shall \nnot contain an unspecified element, other than nitrogen for \nstainless steels, for the ordered grade to the extent that the steel \nconforms to the requirements of another grade for which that \nelement is a specified element having a required minimum \ncontent. For this requirement, a grade is defined as an alloy \ndescribed individually and identified by its own UNS designa­\ntion in a table of chemical requirements within any specifica­\ntion listed within the scope as being covered by this specifi­\ncation. \n6.3 Product Analysis-Product analysis requirements and \noptions, if any, shall be as contained in the applicable product \nspecification. \n7. Mechanical Properties \n7.1 Method of Mechanical Tests-The specimens and me­\nchanical tests required shall be in accordance with Test \nMethods and Definitions A370, especially Annex A2 thereof, \nor Test Methods A1058. \n7 .1.1 Unless otherwise specified in the ordering \nrequirements, Test Methods Al 058 shall apply when the metric \nversion of the product specification is specified. \n- 7 .2 Specimens shall be tested at room temperature. \n7.3 Small or subsize specimens as described in Test Meth­\nods and Definitions A370 or Test Methods Al058 may be used \nonly when there is insufficient material to prepare one of the \nstandard specimens. When using small or subsize specimens, \nthe largest one possible shall be used. \n8. Tensile Requirements \n8.1 The material shall conform to the requirements as to \ntensile properties in the applicable product specification. \n8.2 The yield strength, if specified, shall be determined \ncorresponding to a permanent offset of 0.2 % of the gauge \nlength or to a total extension of 0.5 % of the gauge length under \nload. \n8.3 If the percentage of elongation of any test specimen is \nless than that specified and any part of the fracture is more than \n¾ in. [19.0 mm] from the center of the gauge length, as \nindicated by scribe marks on the specimen before testing, a \nretest shall be allowed. \n9. Permissible Variation in Mass for Seamless Pipe \n9.1 Except as allowed by 9.2, the mass of any length of \nseamless pipe in sizes NPS 12 and smaller shall not vary more \nthan 10 % over or more than 3.5 % under that specified. For \npipe in sizes larger than NPS 12, the mass of any length of pipe \nshall not vary more than 10 % over or more than 5 % under that \nspecified. Unless otherwise specified, the mass of lengths of \npipe in sizes NPS 4 and smaller shall be determined separately \nor in convenient lots; the mass of lengths of pipe in sizes larger \nthan NPS 4 shall be determined separately. \n9.2 Minimum Wall-If the wall thickness of the pipe is \nspecified as minimum wall in the purchase order, the mass of \nany length of seamless pipe shall not vary more than 16 % over \nthat calculated in accordance with 14.3. Unless otherwise \nspecified, the mass of pipe in sizes NPS 4 and smaller shall be \ndetermined separately or in convenient lots; the mass of pipe in \nsizes larger than NPS 4 shall be determined separately. \n9.3 The specified mass of pipe shall be detennined by \nmultiplying its specified or calculated mass per unit length (see \n14.3) by its measured length. \n10. Permissible Variations in Wall Thickness \n10.1 Seamless and Welded-Except as required by 10.l.l, \nthe minimum wall thickness at any point shall not be more than \n12.5 % under the nominal wall thickness specified. The mini­\nmum wall thickness on inspection is shown in Table Xl.1. \n1488 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1542.json",
  "tabulaTablesCsv": "tables_tabula/page-1542.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1542.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5517,
  "bestTextAlphaRatio": 0.7557
}