{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 736,
  "globalPageIndex": 1534,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-99S/SA-99SM ASME BPVC.II.A-202S \nSpecification for \nCastings, Austenitic-Ferritic (Duplex) Stainless Steel, for \nPressure-Containing Parts \n1. Scope \n1.1 This specification covers austenitic-ferritic (duplex) \nstainless steel castings for valves, flanges, fittings, and other \npressure-containing parts. \n1.2 The duplex stainless steels offer a combination of \nenhanced mechanical properties and corrosion resistance when \nproperly balanced in composition and properly heat treated. \nFerrite levels are not specified, but these grades will develop a \nrange of approximately 30 to 60 % ferrite with the balance \naustenite. It is the responsibility of the purchaser to determine \nwhich grade shall be furnished depending on design and \nservice conditions, mechanical properties, and corrosion­\nresistant characteristics. \nNom I-Because of the possibility of precipitation of embrittling \nphases, the grades included in this specification are not recommended for \nservice at temperatures above 600 °F [315 °C]. \n1.3 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in nonconformance \nwith the standard. \n1.4 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA488/A488M Practice for Steel Castings, Welding, Qualifi­\ncations of Procedures and Personnel \nA703/A703MSpecification for Steel Castings, General \nRequirements, for Pressure-Containing Parts \nE125 Reference Photographs for Magnetic Particle Indica­\ntions on Ferrous Castings \nE165/E165M Practice for Liquid Penetrant Testing for Gen­\neral Industry \nE562 Test Method for Determining Volume Fraction by \nSystematic Manual Point Count \nG48 Test Methods for Pitting and Crevice Corrosion Resis­\ntance of Stainless Steels and Related Alloys by Use of \nFerric Chloride Solution \n3. Terminology \n3 .1 Definitions of Terms Specific to This Standard: \n3.1.1 duplex stainless steel-an iron-chrornium-nickel­\nmolybdenum alloy that, when properly heat treated, consists of \napproximately 30 to 60 % ferrite with the balance austenite. \n4. General Conditions for Delivery \n4.1 Material furnished to this specification shall conform to \nthe applicable requirements of Specification A 703/ A 703M, \nincluding the supplementary requirements that are indicated on \nthe purchaser order. Failure to comply with the general \nrequirements of Specification A 703/ A 703M constitutes non­\nconformance with this specification. In case of conflict be­\ntween the requirements of this specification and Specification \nA 703/ A 703M, this specification shall prevail. \n5. Ordering Information \n5.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for material ordered under this \nspecification. Such requirements may include, but are not \nlimited to, the following: \n5.1.1 A description of the casting by pattern number or \ndrawing ( dimensional tolerances shall be included on the \ncasting drawing), \n5.1.2 Quantity (weight and number of castings), \n5.1.3 Specification designation and date of issue, \n5.1.4 Grade of steel, \n5.1.5 Supplementary requirements including acceptance \ncriteria, and \n1480 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1534.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3629,
  "bestTextAlphaRatio": 0.782
}