{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 291,
  "globalPageIndex": 1089,
  "width": 621.72,
  "height": 799.2,
  "text": "ASME BPVC.II.A-2025 SA-568/SA-568M (ASTM A568/A568M) \nidentification legibly stenciled on top of each lift or shown on \na tag attached to each coil or shipping unit. \n15.2 When specified in the contract or order, and for direct \nprocurement by or direct shipment to the government, marking \nfor shipment in addition to requirements specified in the \ncontract or order, shall be in accordance with MIL-STD-129 \nfor military agencies and in accordance with Fed. Std. No. 123 \nfor civil agencies. \n15.3 Bar coding is acceptable as a supplementary identifi­\ncation method. Bar coding should be consistent with the \nAutomotive Industry Action Group (AIAG) standard prepared \nby the primary metals subcommittee of the AIAG bar code \nproject team. \n16. Packing and Package Marking \n16.1 Unless otherwise specified, the sheet shall be packaged \nand loaded in accordance with Practices A700. \n16.2 When coils are ordered, it is customary to specify a \nminimum or range of inside diameter, maximum outside \ndiameter, and a maximum coil weight, if required. The ability \nof manufacturers to meet the maximum coil weights depends \nupon individual mill equipment. When required, minimum coil \nweights are subject to negotiation. \n17. Keywords \n17 .1 carbon steel sheet; cold rolled steel sheet; general \ndelivery requirements; high strength low alloy steel; hot-rolled \nsteel sheet; steel sheet; structural steel sheet \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall apply only when specified by the purchaser in the \npurchase order or contract. \nSl. Thickness Tolerances \nSl.l See Tables Sl.1-Sl.6. \nTABLE S1.1 Thickness Tolerances for Hot-Rolled Sheet (Carbon and Str.uctural Steel Only)-3/a-in. (Cut Edge) and ¾-in. (Mill Edge) \nMinimum Edge Distance (Coils and Cut Lengths, Including Pickled) \nNoTE 1-Thickness is measured at any point across the width not less than 3/s in. from a cut edge and not less than ¾ in. from a mill edge. This table \ndoes not apply to the uncropped ends of mill edge coils. \nNoTE 2-Micrometers used for measurement of thickness shall be constructed with anvils and spindles having minimum diameters of 0.188 in. \n[4.80 mm]. The tip of the spindle shall be flat, and the tip of the anvil shall be flat or rounded with a minimum radius of curvature of 0.10 in. [2.55 mm]. \nMicrometers with pointed tips are not suitable for thickness measurements. \nNoTE 3-This table was used to construct Table 4 by multiplying the values in this table by 0.75 and rounding to 3 decimal places using standardASTM \npractice. \nNorn 4-The thickness of mateiial <1 in. wide shall be measured at mid-width. \nSpecified Ordered Thickness, in. A \nSpecified Width, in. -----0:027--ilJ0.051~ -cveril:051 to--0.057-;- -Over 0.05-7---to 0,071, -ever G.G71 tG--Q.098,- Over---0.098-to 0.j-80, _0.18Qio 0.230, \nincl incl incl incl excl excl \nTo 20 incl \nOver 20 to 40 incl \nOver 40 to 48 incl \nOver 48 to 60 incl \nOver 60 to 72 incl \nOver 72 \n0.010 \n0.010 \n0.010 \nC \nC \nC \n0.010 \n0.010 \n0.012 \n0.012 \n0.014 \nC \nThickness Tolerances Over, in., No Tolerance Under 8 \n0.012 0.012 0.014 \n0.012 0.014 0.014 \n0.012 0.014 0.016 \n0.014 0.014 0.016 \n0.014 O.D16 0.016 \nC 0.016 0.016 \nA The specified thickness range captions apply independent of whether the ordered thickness is stated as a nominal or minimum. \n0.014 \nO.D16 \nO.D18 \n0.020 \n0.022 \n0.024 \n8 The tolerances provided in the table are based on minimum thickness (tolerance over, no tolerance under). For nominal thickness, the tolerance is divided equally over \nand under. \nc Where an ellipsis( ... ) appears in the table, the requirements have not been defined. \n989 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1089.json",
  "tabulaTablesCsv": "tables_tabula/page-1089.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1089.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3636,
  "bestTextAlphaRatio": 0.6947
}