{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 577,
  "globalPageIndex": 577,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-336/SA-336M (ASTM A336/A336M) \nS8. Forging Requirements \nS8.l Large drum forgings shall be made from solid cast \ningots, punched, bored, or trepanned, or from hollow ingots \ncast in metal molds. The walls of the hollowed or hollow ingots \nshall be reduced in thickness at least one-half by forging on \nmandrels. \nS8.2 Drum forgings with one solid closed end may be \nhollow forged in closed dies or on a draw bench provided the \nmetal is worked thoroughly. \nS8.3 Drum forgings, either with open ends or one solid \nclosed end, may also be produced by hot extrusion provided \nthe metal is worked thoroughly. \nS8.4 Small drum forgings may be made as solid forgings, \nsubsequently bored, provided the purchaser agrees to this \nmethod of forging. The cross-sectional area of the solid \nforgings shall have a reduction by forging from that of the \ningot in the ratio of not less than 3:1. \nS8.5 Small sections or component parts of pressure vessels, \nwhich are to be subsequently assembled to form drums, may be \nmade by expanding on a mandrel under a press or hammer, by \nhot extrusion or by ring rolling methods, provided the wall \nthickness is reduced at least one-half in the process. \nS8.6 Heads or covers shall be forged as disks, upset from \nblocks cut from ingots or billets. The length of block before \nupsetting shall be at least twice the thickness of the as-forged \nhead or cover. \nS9. Individual Forging \nS9.1 Forgings, whether identical or not identical, shall be \nproduced individually. They shall not be forged in multiple and \nseparated prior to or after heat treatment. \nS9.2 The shape and size of individual forgings shall be \nagreed between the manufacturer and the purchaser by means \nof a forging drawing or the purchase order. \nS10. Minimum Cooling Rate \nSlO.l For Grade P91 Type 2 material the heat treatment \nshall ensure that following austenitizing, the rate of cooling \nfrom 1650 °P to 900 °P [900 °C to 480 °C] is no slower than \n9 °P/2nin [5 °C/min]. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A336/A336M- 21) that may impact the use of this standard. (Approved November 1, 2023.) \n(1) Added SlO. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nIn this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and \nIf not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n525 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0577.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3760,
  "bestTextAlphaRatio": 0.7559
}