{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 311,
  "globalPageIndex": 1109,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-574 \n4.2.8 For establishment of a part identifying system, \nsee ASME B 18.24 \n5. Materials and Manufacture \n5.1 The screws shall be fabricated from a steel which \nhas been made by the open-hearth, basic-oxygen, or elec­\ntric-furnace process. \n5.2 The screws shall be fabricated from alloy steel \nmade to a fine grain practice. In the event of controversy \nover grain size, referee tests on finished screws conducted \nin accordance with Test Methods E 112 shall prevail. \n5.3 Unless otherwise specified, the heads of screws \nthrough 1.500 in. diameter shall be fabricated by hot or \ncold forging. Over 1.500 in. diameter, the heads may be \nfabricated by hot or cold forging or by machining. Sockets \nmay be forged or machined. \n5.4 Unless otherwise specified, threads of screws shall \nbe rolled for diameters through 0.625 in. and for screw \nlengths through 4 in. For diameters and lengths other than \nthis, threads may be rolled, cut, or ground. \n5.5 The screws shall be heat treated by oil quenching \nfrom above the transformation temperature and then tem­\npering at a temperature not lower than 650°F. \n5.6 Standard Finishes - Unless otherwise specified, \nthe screws shall be furnished with one of the following \n\"standard surfaces as manufactured\" at the option of the \nmanufacturer: ( 1) bright uncoated, (2) thermal black oxide, \nor (3) chemical black oxide. Hydrogen embrittlement tests \nshall not be required for screws furnished in these condi­\ntions. \n5.1 Protective Coatings: \n5. 7 .1 When a protective finish other than as specified \nin 5.6 is required, it shall be specified on the purchase \norder with the applicable finish specification. \n5.7.2 When protective or decorative coatings are \napplied to the screws, precautions specified by the coating \nrequirements to minimize embrittlement shall be exercised. \n6. Chemical Composition \n6.1 The analysis of the screw material shall conform \nto the chemical composition specified in Table S 1.1. \n6.2 Product analyses may be made by the purchaser \nfrom finished material representing each lot. The chemical \ncomposition, thus determined, shall conform to the require­\nments prescribed for product analysis in Table S 1.1. \n6.3 DELETED \n6.4 Application of heats of steel to which bismuth, \nselenium, tellurium, or lead has been intentionally added \nshall not be permitted. \n6.5 Chemical analyses shall be performed in accor­\ndance with Test Methods, Practices, and Terminology \nA 751. \n7. Mechanical Properties \n7.1 The hardness of finished screws shall be 39 to \n45 HRC for 0.500 in. and smaller and 37 to 45 HRC for \n0.625 in. and larger. This shall be only the mechanical \nrequirements for screws that are shorter than three times \nthe diameter or that have insufficient threads for tension \ntesting. \n7.2 Screws, other than those exempted in 7.1 and 7.3, \nshall meet the proof load and tensile requirements in Table \n2 and Table 3. The screws shall be tension tested with a \nwedge of the angle specified in Table 4 under the head. \nTo meet the requirements of the wedge test, there must be \na tensile failure in the body or thread section. For the. \npurpose of this test, failure means separation into two \npieces. Screws threaded to the head shall pass the require­\nments for this test if the fracture that caused failure origi­\nnated in the thread area, even though it may have \npropagated into the fillet area or the head before separation. \n7 .3 Screws having a diameter larger than 1.500 in. \nshall be preferably tested in full size and shall meet the \nrequirements of Table 2 and Table 3. When equipment of \nsufficient capacity is not readily available, screws shall \nmeet 170 ksi, min, tensile strength, 153 ksi, min, yield \nstrength at 0.2% offset, and 10% elongation on specimens \nmachined in accordance with Test Methods F 606. \n8. Metallurgical Requirement \n8.1 Carburization or Decarburization: \n8.1.1 There shall be no evidence of carburization or \ntotal decarburization on the surfaces of the heat-treated \nscrews when measured in accordance with 12.3. \n8.1.2 The depth of partial decarburization shall be \nlimited to the values in Table 5 when measured as shown \nin Fig. 1 and in accordance with 12.3. \n9. Dimensions \n9.1 Unless otherwise specified, the product shall con­\nform to the requirements of Bl8.3. \n9.2 Unless otherwise specified, threads shall be Unified \nstandard: Class 3A, UNRC and UNRF series for screw \nsizes 0.060 through 1 in. inclusive; Class 2A, UNRC and \nUNRF series for sizes over 1 in. to 1.500 in. inclusive; \nand Class 2A UNRC series for sizes larger than 1.500 in. \nin accordance with B 1. 1. \n1015 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1109.json",
  "tabulaTablesCsv": "tables_tabula/page-1109.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1109.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4627,
  "bestTextAlphaRatio": 0.7454
}