{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 642,
  "globalPageIndex": 1440,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-905 (ASTM A905) ASME BPVC.II.A-2025 \nTABLE 3 Permissible Variations In Dimensions \nThickness in. (mm) \n0.02 to 0.03 (0.51 to 0.76), incl \nOver 0.03 to 0.04 (0.76 to 1.02), incl \nOver 0.04 to 0.06 (1.02 to 1.52), incl \nWidth in. (mm) \n0.08 to 0.16 (2.03 to 4.06), incl \nOver 0.16 to 0.24 (4.06 to 6.10), incl \nOver 0.24 to 0.48 (6.1 O to 12.2), incl \nPermissible Variation, ±in. (mm) \n0.0004 (0.01) \n0.0008 (0.02) \n0.0012 (0.03) \nPermissible Variation, ±in. (mm) \n0.0016 (0.04) \n0.0024 (0.06) \n0.0040 (0.10) \n11. Packaging, Marking, and Loading for Shipment \n11.1 The coil, reel or spool mass, dimensions, and the \nmethod of packaging shall be agreed upon between the \nmanufacturer and purchaser. \n11.2 The size of the wire, purchaser's order number, ASTM \nspecification number, and name or mark of the manufacturer \nshall be marked on a tag securely attached to each coil, reel, or \nspool of wire. \n11.3 Unless otherwise specified in the purchaser's order, \npackaging, marking, and loading for shipments shall be in \naccordance with those procedures recommended by Practices \nA700. \n11.4 For Government Procurement-Marking for shipment \nof material for civil agencies shall be in accordance with Fed. \nStd. No. 123. \n12. Keywords \n12.1 pressure vessel; winding; wire \nSUPPLEMENTARY·REQUIREMENTS \nSupplementary requirements to this specification shall only apply to a product specification when \nspecified by the purchaser in his inquiry, contract or order. Details of the supplementary requirements \nshall be agreed upon in writing between the manufacturer and purchaser. \nSl. Surface Examination \nS 1.1 The surface of the wire shall be examined by the eddy \ncurrent method in accordance with Practice E309. The accep­\ntance criteria shall be mutually agreed upon by the purchaser \nand manufacturer. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A905 - 04 (2017)) that may impact the use of this standard. (Approved Sept. 1, 2019.) \n(]) Removed Test Methods E30, MIL-STD-163, and AIAG \nB-5 from Referenced Documents. \n(2) Added Test Methods A751 to Referenced Documents. \n( 3) Combined Specifications A510 and A510M into A510/ \nA510M in Referenced Documents. Updated references \nthroughout. \n(4) Revised subsections 5.2, 5.3, 5.4, 11.4, and footnote 3. \n(5) Removed subsection 11.5. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed eve,y five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; httpJ/www.copyright.com/ \n1378 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1440.json",
  "tabulaTablesCsv": "tables_tabula/page-1440.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1440.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3900,
  "bestTextAlphaRatio": 0.7036,
  "camelotTablesPath": "camelot_tables/page-1440.json",
  "camelotTablesCsv": "camelot_tables/page-1440.csv",
  "camelotTableCount": 2
}