{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 196,
  "globalPageIndex": 196,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-53/SA-53M ASME BPVC.II.A-2025 \nI t =·specified wall thickness! \n- \\J ]jil/2% ;-OR LESS \nB (BUTTRESS) NOTCH \nVIQNOTCH \n□J20%t--ORLESS \nAREA OF EACH SIDE, 0.006 ln. 2 [3.9 mm 2 ) MAX \n-\n1 0.Q<l~,n. [1.0 \nMAX \nDEPTH rure:t!:!. \n10% t, :1:15% \nWITH MIN OF \n0.012 :t 0,002 In, \n(0.3 = 0.05 mm] \nLENGTH \nFOR EDDY CURRENT - 1.5 In. [38 mmJ MAX \nTotal Length \nFOR DIVERTED FLlJ)( \nAND UL1RASON1C ~ 2 In. [SO mm} MAX \nat Full Depth \nti!!2!:'!Q!9:! \n-I hl/sln. I [3.2.mmJ \n~ \nFIG. 1 Calibration Standards \nType Notch \nN10, V10 \nB,P \nTABLE 3 Acceptance Limits \nSize of Hole \nin. mm \n3.2 \nAcceptance \nLimit \nSignal,% \n100 \n80 \nproduce a signal greater than the acceptance limit signal given \nin Table 3 shall be considered a defect unless the pipe \nmanufacturer can demonstrate that the imperfection does not \nreduce the effective wall thickness beyond 12.5 % of the \nspecified wall thickness. \n9.2 Type S Pipe-As an alternative to the hydrostatic test at \nthe option of the manufacturer or if specified in the purchase \norder, the full body of each seamless pipe shall be tested with \na nondestructive electric test in accordance with Practice E213, \nE309, or E570. In such cases, each length so furnished shall \ninclude the mandatory marking of the letters \"NDE.\" Except as \nallowed by 9.2.6.2, it is the intent of this nondestructive electric \ntest to reject pipe with imperfections that produce test signals \nequal to or greater than those produced by the applicable \ncalibration standards. \n9.2.1 If the nondestructive electric test has been performed, \nthe lengths shall be marked with the letters \"NDE.\" The \ncertification, if required, shall state Nondestructive Electric \nTested and shall indicate which of the tests was applied. Also, \nthe letters NDE shall be appended to the product specification \nnumber and grade shown on the certification. \n9 .2.2 The following information is intended to facilitate the \nuse of this specification: \n9.2.2.1 The calibration standards defined in 9.2.3 through \n9.2.5 are convenient standards for calibration of nondestructive \ntesting equipment. The dimensions of such standards are not to \nbe construed as the minimum sizes of imperfections detectable \nby such equipment. \n9.2.2.2 The ultrasonic testing referred to in this specification \nis capable of detecting the presence and location of significant \nlongitudinally or circumferentially oriented imperfections; \nhowever, different techniques need to be employed for the \ndetection of differently oriented imperfections. Ultrasonic test­\ning is not necessarily capable of detecting short, deep imper­\nfections. \n9.2.2.3 The eddy current examination referenced in this \nspecification has the capability of detecting significant \ndiscontinuities, especially of the short abrupt type. \n9.2.2.4 The flux leakage examination referred to in this \nspecification is capable of detecting the presence and location \nof significant longitudinally or transversely oriented disconti­\nnuities. The provisions of this specification only require \nlongitudinal calibration for flux leakage. Different techniques \nneed to be employed for the detection of differently oriented \nimperfections. \n9.2.2.5 The hydrostatic test referred to in 8.2 has the \ncapability of finding imperfections of a size permitting the test \nfluid to leak through the tube wall and may be either visually \nseen or detected by a loss of pressure. Hydrostatic testing is not \nnecessarily capable of detecting very tight through-the-wall \nimperfections or imperfections that extend an appreciable \ndistance into the wall without complete penetration. \n144 \n9.2.2.6 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of imperfections that are \ncapable of being detected in the specific application of these \nexaminations is directed to discuss this with the manufacturer \nof the tubular product. \n9.23 For ultrasonic testing, the calibration reference \nnotches shall be at the option of the manufacturer, and shall be \nany one of the three common notch shapes shown in Practice \nE213. The depth of notch shall not exceed 12.5 % of the \nspecified wall thickness of the pipe or 0.004 in. [0.1 mm], \nwhichever is the greater. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0196.json",
  "tabulaTablesCsv": "tables_tabula/page-0196.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0196.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4208,
  "bestTextAlphaRatio": 0.749
}