{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 436,
  "globalPageIndex": 436,
  "width": 599.4,
  "height": 844.08,
  "text": "SA-264 ASME BPVC.II.A-2025 \n13.3.3 Class 5-No single unbonded area exceeding 9 in.2 \n(58 cm 2 ) with total unbonded area not to exceed 5 % of the \ntotal cladded surface area. \n13.3.4 The class to be supplied should be listed on the \npurchase order. When none has been specified, plates shall be \nfurnished as Class 5 at the option of the manufacturer. \n14. Welding \n14.1 All welding which is part of the delivered product, \nincluding any made in the fabrication of the cladding alloy \ncomponent, shall be performed with a procedure and welders \nor welding operators that are qualified in accordance with \nSection IX of the ASME Code. \n14.2 The material manufacturer may repair defects in clad­\nding by welding provided the following requirements are met: \n14.2.1 When specified in the purchase order, prior approval \nshall be obtained from the purchaser. \n14.2.2 The defective area shall be removed and the area \nprepared for repair shall be examined by a liquid penetrant \nmethod to ensure that all of the defective area has been \nremoved. Method of test and acceptance standard shall be as \nagreed upon between the purchaser and the manufacturer. \n14.2.3 The repair weld shall be deposited in accordance \nwith a welding procedure and welding materials suitable for \nthe cladding material. The surface condition of the repaired \narea shall be restored to a condition similar to the rest of the \ncladding. \n14.2.4 The repaired area shall be examined by a liquid \npenetrant method. \n14.2.5 The location and extent of the weld repairs together \nwith the repair procedure and examination results shall be \ntransmitted as a part of the certification. \n15. General Requirements for Delivery \n15.1 Material furnished under this specification shall con­\nform to the applicable requirements of Specification A20/ \nA20M. \n16. Certification \n16.1 The chemical analysis of the base metal and the alloy \ncladding shall be certified to the purchaser by the clad plate \nmanufacturer. \n16.2 The results of the tests in Section 7 and any other tests \nrequired by the purchase order shall be reported to the \npurchaser. \n16.3 Compliance with the clad quality level of 13.3 shall be \ncertified. Reports shall include the results of ultrasonic inspec­\ntion when Supplementary Requirement S12 is specified. \n16.4 Compliance with any applicable construction code \nshall be certified and the appropriate documentation provided \nwhen appropriate in the case of explosively bonded clad \nproduced using welded alloy cladding components (see 4.1.10 \nand 4.1.12). \n17. Product Marking \n17 .1 Except as specified in 17 .2, plates shall be marked in \naccordance with the requirements of Specification A20/ A20M \nfor the backing steel and the type number of the alloy cladding \nmetal and this specification number. \n17.2 For double-clad material or for material under ¼ in. \n(6.35 mm) in thickness, the marking specified in 17.1 shall be \nlegibly stenciled instead of stamped. \n18. Keywords \n18.1 alloy cladding; backing steel; bond strength; carbon \nsteel; clad steel plate; low-alloy steel; pressure vessel; shear \nstrength; stainless chromium-nickel steel \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall not apply unless specified on the order. A list of standardized \nsupplementary requirements for use at the option of the purchaser are included in Specification \nA20/ A20M. Several of those considered suitable for use with this specification are listed below by \ntitle. Other tests may be performed by agreement between the supplier and the purchaser. \nS2. Product Analysis \nS3. Simulated Post-Weld Heat Treatment of Mechanical \nTest Coupons \nSS. Charpy V-Notch Impact Test \nSl2. Ultrasonic Examination in accordance with Specifica­\ntion A578/ A578M \n384 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0436.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3746,
  "bestTextAlphaRatio": 0.7635
}