{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 224,
  "globalPageIndex": 224,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-106/SA-106M ASME BPVC.II.A-2025 \nTABLE 2 Tensile Requirements \nTensile strength, min, psi [MPa) \nYield strength, min, psi [MPa] \nGrade A \n48 000 [330) \n30 000 [205) \nGrade B \n60 000 [415) \n35 000 [240] \nGrade C \n70 000 [485) \n40 000 [275) \nLongitu- Transverse Longitu- Transverse Longitu- Transverse \ndinal dinal dinal \nElongation in 2 in. [50 mm], min, %: \nBasic minimum elongation transverse strip tests, and for all small 35 25 30 16.5 30 16.5 \nsizes tested in full section \nWhen standard round 2-in. [50-mm] gauge length test specimen is 28 20 22 12 20 12 \nused \nFor longitudinal strip tests A A A \nFor transverse strip tests, a deduction for each 1/a2-in. [0.8-mm) 1.25 1.00 1.00 \ndecrease in wall thickness below o/is in. [7.9 mm] from the basic \nminimum elongation of the following percentage shall be made \nA The minimum elongation in 2 in. [50 mm) shall be determined by the following equation: \ne = 625000A 0 •2 / U 0 ·• \nfor inch-pound units, and \ne = 1 940A 0 •2 / U 0 ·• \nfor SI units, \nwhere: \ne minimum elongation in 2 in. [50 mm], %, rounded to the nearest 0.5 %, \nA cross-sectional area of the tension test specimen, in. 2 [mm 2 ], based upon specified outside diameter or nominal specimen width and specified wall thickness, \nrounded to the nearest 0.01 in. 2 [1 mm 2 ). (II the area thus calculated is equal to or greater than 0.75 in.2 [500 mm\"], then the value 0.75 in.2 [500 mm 2 ] \nshall be used.), and \nU specified tensile strength, psi [MPa]. \nwithout developing cracks. When ordered for close coiling, the \npipe shall stand being bent cold through 180° around a \ncylindrical mandrel, the diameter of which is eight times the \noutside diameter (as shown in ASME B 36.lOM) of the pipe, \nwithout failure. \n11.2 For pipe whose diameter exceeds 25 in. [635 mm] and \nwhose diameter to wall thickness ratio, where the diameter to \nwall thickness ratio is the specified outside diameter divided by \nthe nominal wall thickness, is 7 .0 or less, the bend test shall be \nconducted. The bend test specimens shall be bent at room \ntemperature through 180° with the inside diameter of the bend \nbeing 1 in. [25 mm] without cracking on the outside portion of \nthe bent portion. \nExample: For 28 in. [711 mm] diameter 5.000 in. [127 mm] \nthick pipe the diameter to wall thickness ratio = 28/5 = 5.6 \n[711/127 = 5.6]. \n12. Flattening Tests \n12.1 Although testing is not required, pipe shall be capable \nof meeting the flattening test requirements of Supplementary \nRequirement S3, if tested. \n13. Hydrostatic Test \n13.1 Except as allowed by 13.2, 13.3, and 13.4, each length \nof pipe shall be subjected to the hydrostatic test without \nleakage through the pipe wall. \n13.2 As an alternative to the hydrostatic test at the option of \nthe manufacturer or where specified in the purchase order, it \nshall be permissible for the full body of each pipe to be tested \nwith a nondestructive electric test described in Section 14. \n13.3 Where specified in the purchase order, it shall be \npermissible for pipe to be furnished without the hydrostatic test \nand without the nondestructive electric test in Section 14; in \n172 \nthis case, each length so furnished shall include the mandatory \nmarking of the letters \"NH.\" It shall be permissible for pipe \nmeeting the requirements of 13.1 or 13.2 to be furnished where \npipe without either the hydrostatic or nondestructive electric \ntest has been specified in the purchase order; in this case, such \npipe need not be marked with the letters \"NH.\" Pipe that has \nfailed either the hydrostatic test of 13.1 or the nondestructive \nelectric test of 13.2 shall not be furnished as \"NH\" pipe. \n13.4 Where the hydrostatic test and the nondestructive \nelectric test are omitted and the lengths marked with the letters \n\"NH,\" the certification, where required, shall clearly state \"Not \nHydrostatically Tested,\" and the letters \"NH\" shall be ap­\npended to the product specification number and material grade \nshown on the certification. \n14. Nondestructive Electric Test \n14.1 As an alternative to the hydrostatic test at the option of \nthe manufacturer or where specified in the purchase order as an \nalternative or addition to the hydrostatic test, the full body of \neach pipe shall be tested with a nondestructive electric test in \naccordance with Practice E213, E309, or E570. In such cases, \nthe marking of each length of pipe so furnished shall include \nthe letters \"NOE.\" It is the intent of this nondestructive electric \ntest to reject pipe with imperfections that produce test signals \nequal to or greater than that produced by the applicable \ncalibration standard. \n14.2 Where the nondestructive electric test is performed, the \nlengths shall be marked with the letters \"NOE.\" The \ncertification, where required, shall state \"Nondestructive Elec­\ntric Tested\" and shall indicate which of the tests was applied. \nAlso, the letters \"NDE\" shall be appended to the product \nspecification number and material grade shown on the certifi­\ncation. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0224.json",
  "tabulaTablesCsv": "tables_tabula/page-0224.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0224.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4993,
  "bestTextAlphaRatio": 0.7136
}