{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 720,
  "globalPageIndex": 720,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-401/SA-401M ASME BPVC.II.A-2025 \n7.2.2 Location of Tests-It shall be permissible to take test \nspecimens from either end of the coil. \n7.2.3 Test Method-The tension test shall be made in \naccordance with Test Methods and Definitions A370. For \nshaped wires, cross sectional area shall be calculated either by \nusing the procedure in Test Methods E8/E8M for uniform but \nnonsymmetrical cross-sections, or by measuring width and \nthickness and multiplying by a shape factor. Reduction of area \nfor shaped wires shall be calculated by using this shape factor. \nMeasure the maximum and minimum dimension on the necked \ndown section and multiply by the shape factor to estimate the \ncross sectional area for use in the standard reduction of area \ncalculation. \n7.2.4 Upon agreement between purchaser and supplier, the \nshape factor for the cross section design provided by the wire \nmill shall be permissible to be adopted for use. In other \nsituations, if the shape factor is not available from the wire \nmill, the shape factor shall be calculated by measuring the \ncross sectional area in accordance with Test Methods E8/E8M \nand dividing by the width and thiclmess. \n7.3 Wrap Test: \n7.3.1 Quench and tempered or cold drawn wire 4.00 mm \n[0.157 in.] and smaller in diameter shall wind on itself as an \narbor without breakage. Larger diameter wire up to and \nincluding 8.00 mm [0.315 in.] in diameter shall wrap without \nbreakage on a mandrel twice the wire diameter. The wrap test \nis not applicable to wire over 8.00 mm [0.315 in.] in diameter \nor to shaped and flat rolled wires. \n7.3.2 Number of Tests-One test specimen shall be taken for \neach 10 coils, or fraction thereof, in a lot. Each heat in a given \nlot shall be tested. \n7.3.3 Location of Test-It shall be permissible to take test \nspecimens from either end of the coil. \n7.3.4 Test Method-The wrap test shall be made in accor­\ndance with Test Methods and Definitions A370. \n8. Metallurgical Requirements \n8.1 Surface Condition: \n8.1.1 On the whole, the surface of the wire as received shall \nbe free of rust and excessive scale. Based upon examination of \nend specimens, no serious die marks, scratches, or other \ncontinuous surface imperfections shall be present. Based upon \nexamination of etched-end specimen, seams shall not exceed \n3.5 % of the wire diameter, or 0.25 mm [0.010 in.], whichever \nis the smaller as measured on a transverse section. \n8.1.2 Number of Tests-For the purpose of examination of \netched-end specimens, one test specimen shall be taken for \neach 10 coils, or fraction thereof, in a lot. Each cast or heat in \na given lot shall be tested. \n8.1.3 Location of Test-Test specimens shall be taken from \neither or both ends of the coil. \n8.1.4 Test Method-The surface shall be examined after \netching in a solution of equal parts of hydrochloric acid and \nwater that has been heated to approximately 80°C for up to two \nminutes in order to remove the oxide scale layer from the wire \nsurface. Test ends shall be examined using lOx magnification. \nAny specimens showing the presence of a questionable surface \nimperfection shall have a transverse section taken from the \n670 \nunetched area, properly mounted and polished and examined to \nmeasure the depth of the smface imperfection. \n8.2 Decarburization: \n8.2.1 The depth of complete decarburization (free ferrite) \nshall not exceed 0.75 % of the equivalent round wire diameter. \nThe total affected depth (free ferrite plus partial decarburiza­\ntion) shall not exceed 2.0 % of the equivalent round wire \ndiameter on all sizes of wire. \n8.2.2 Test Method-Decarburization shall be determined by \netching a suitably polished transverse section of wire with \nnital. The entire periphery to be examined should be in a single \nplane with no edge rounding. \n8.2.3 The entire periphery shall be examined at a magnifi­\ncation of no less than lO0x for depth of free ferrite and total \naffected depth. Smaller wire sizes may require higher magni­\nfication. Measure the worst area present excluding decarbur­\nization associated with any surface imperfections. Complete \ndecarburization exists when only free ferrite is present. Partial \ndecarburization exists when ferrite is found mixed with pearlite \nor tempered martensite. Structures of 100 % tempered marten­\nsite shall be defined as not decarburized. \n8.2.4 Decarburization shall be checked on annealed wire by \ngiving a wire sample an austenitize, oil quench and temper heat \ntreatment. A flat shall be ground on the test sample prior to heat \ntreatment. The flat shall have a minimum width equal to one \nhalf of the wire diameter. Any decarburization visible on this \nground section shall necessitate a retest with new samples. If \nno decarburization is visible on the ground flat, evaluate the \ncomplete wire section in accordance with 8.2.3. \n9. Dimensions and Permissible Variations \n9 .1 The permissible variations in the diameter of the wire \nshall be as specified in Table 3. Any definition of shaped \ntolerances shall be agreed upon by the producer and the \npurchaser. \n10. Workmanship, Finish, and Appearance \n10.1 Annealed and Cold Drawn-The wire shall not be \nkinked or improperly cast. To test for cast, a few convolutions \nof wire shall be cut loose from the coil and placed on a flat \nTABLE 3 Permissible Variations in Wire Diameter4 \nDiameter \n0.80 to 2.00, incl \nOver 2.00 to 11.0, incl \nOver 11.00 \nDiameter \n0.032 to 0.075, incl \nOver 0.075 to 0.438, incl \nOver 0.438 \nSI Units \nPermissible Permissible Out-\nVariations, ±mm of-Round \n0.03 0.03 \n0.05 0.05 \n0.07 0.07 \nInch-Pound Units \nPermissible \nVariations, +in. \n0.001 \n0.002 \n0.003 \nPermissible Out­\nof-Round \n0.001 \n0.002 \n0.003 \nA For purposes of determining conformance with this specification, all specified \nlimits are absolute as defined in Practice E29. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0720.json",
  "tabulaTablesCsv": "tables_tabula/page-0720.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0720.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5814,
  "bestTextAlphaRatio": 0.7477
}