{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 649,
  "globalPageIndex": 1447,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-941 \nD1scussroN-Unlike burning, it may be possible to restore the \noriginal properties/microstructure by further heat treatment or mechani­\ncal working, or a combination thereof. \npatenting, n-in wire making, heat treatment of a medium­\ncarbon or high-carbon steel wire or wire rod that includes \nheating to a temperature above Ac 3 but below normal hot \nworking temperatures, followed directly without hot work­\ning by controlled cooling to achieve a uniform microstruc­\nture suitable for cold working and typically characterized by \npearlite having a fine interlamellar spacing. \nDiscussION-The method used for controlled cooling is often used to \ndescribe the type of patenting. Examples include but are not limited to, \nair patenting, salt patenting, fluidized bed patenting, and lead patenting. \nFurthermore, double lead patenting describes a patenting process in \nwhich molten lead is used not only for the controlled cooling, but also \nfor the heating to a temperature above Ac 3 • \nplate-as-rolled, n-the quantity of plate product rolled at one \ntime, either from a)l individual slab or directly from an ingot. \nDiscuss10N-This term does not refer to the surface condition or the \nheat-treatment state of the material; a plate-as-rolled may be in the \nas-rolled condition, or may have received one or more surface \ntreatments or heat treatments, or both. \npost-weld heat treatment, n-heating weldments immediately \nafter welding, to provide tempering, stress relieving, or a \ncontrolled rate of cooling to prevent formation of a hard or \nbrittle microstructure. \nprecipitation hardening, n-hardening caused by the pre­\ncipitation of a constituent from a supersaturated solid so~u­\ntion. \nprecipitation heat treatment, n-artificial aging in which a \nconstituent precipitates from a supersaturated solid solution. \npreheating, n-heating before welding, a mechanical \ntreatment, or some further thermal treatment. \npreheating, n-for tool steels, heating to an intermediate \ntemperature immediately before final austenitizing. \nprimary heat, n-the product of a single cycle of a batch \nmelting process. \nDiscussroN-In the investment casting industry, the term master heat \nis used. \nprocess annealing, n-in the sheet and wire industries, heating \na steel object to a temperature close to, but below, Ac 1 and \nthen cooling it, in order to soften it for further cold working. \nproduct analysis, n-a chemical analysis of a specimen taken \nfrom the semi-finished product or the finished product. \nprogressive aging, n-aging by increasing the temperature in \nsteps, or continuously, during the aging cycle. \nquench aging, n-aging associated with quenching after \nsolution heat treatment. \nquench hardening, n-hardening a steel object by austen­\nitizing it, and then cooling it rapidly enough that some or all \nof the austenite transforms to martensite. \nDiscussioN-The austenitizing temperature is usually above Ac 3 for \nhypoeutectoid steels and between Ac 1 and Accm for hypereutectoid \nsteels. \nquenching, n-rapid cooling in a fluid at a rate sufficient to \npreserve or produce desired material characteristics. \nDiscussmN-Where applicable, it is preferred that the following \nmore specific terms be used: fog quenching, hot quenching, inter­\nrupted quenching, selective quenching, spray quenching, and time \nquenching. Quenching is often used in solution heat treatment of \naustenitic steels to retain certain constituents in solution. Quenching is \nalso used for ferritic steels to develop desired characteristics ( such as \nmicrostructure or toughness) in thicker sections that can otherwise only \nbe achieved in thinner sections. Liquids and gasses are both fluids. \nrecrystallization, n-the formation of a new grain structure \nthrough a nucleation and growth process. \nDIScussION-This is commonly produced by subjecting a steel \nobject, which may be strained, to suitable conditions of time and \ntemperature. \nrecrystallization annealing, n-annealing a cold-worked \nsteel object to produce a new grain structure without a \nchange in phase. \nrecrystallization temperature, n-the approximate minimum \ntemperature at which recrystallization of a cold-worked steel \nobject occurs within a specified time. \nremelted heat, n-the product of the remelting of a primary \nheat, in whole or in part. \nDrscussroN-In the investment casting industry, the term sub-heat is \nused. \nresidual element, n-in steel, a specified or unspecified \nelement, not intentionally added, originating in the raw \nmaterials, refractories, or surrounding atmospheres used in \nsteel making. \nrimmed steel, n-a steel that contained sufficient oxygen to \ngenerate carbon monoxide at the boundary between the solid \nmetal and the remaining molten metal during solidification, \nresulting in an outer layer low in carbon. \nsecondary hardening, n-the hardening phenomenon that \noccurs during high-temperature tempering of certain steels \ncontaining one or more carbide-forming alloying elements. \nselective heating, n-intentionally heating only certain por­\ntions of a steel object. \nselective quenching, n-quenching only certain portions of a \nsteel object. \nsemicontinuous-conveyance furnace, n-a heating device \nthrough which steel objects are intentionally moved in \naccordance with a predetermined start-stop-start pattern \nduring the thermal processing cycle. \nsemikilled steel, n-an incompletely deoxidized steel that \ncontained sufficient oxygen to form enough entrapped car­\nbon monoxide during solidification to offset solidification \nshrinkage. \nshell hardening, n-a surface hardening process in which a \nsuitable steel object, when heated through and quench \nhardened, develops a martensitic layer or shell that closely \nfollows the contour of the piece and surrounds a core of \nessentially pearlitic transformation product. \n1385 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1447.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5834,
  "bestTextAlphaRatio": 0.8077
}