{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 749,
  "globalPageIndex": 1547,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-999 /SA-999M \nconcern the manufacture of the product ordered. The manufac­\nturer shall afford the inspector all reasonable facilities to be \nsatisfied that the product is being furnished in accordance with \nthis specification. All required tests and inspection shall be \nmade at the place of manufacture prior to shipment, unless \notherwise specified, and shall be conducted so as not to \ninterfere unnecessmily with the manufacturer's operations. \n24. Rejection \n24.1 Each length of pipe received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of the specification based upon the inspection and \ntest method as outlined in the applicable product specification, \nthe length may be rejected and the manufacturer shall be \nnotified. Disposition of rejected pipe shall be a matter of \nagreement between the manufacturer and the purchaser. \n24.2 Pipe that fails in any of the forming operations or in the \nprocess of installation and is found to be defective shall be set \naside and the manufacturer shall be notified for mutual \nevaluation of the suitability of the pipe. Disposition of such \npipe shall be matter for agreement. \n25. Certification \n25.1 The manufacturer or supplier shall furnish to the \npurchaser a certificate of compliance stating that the product \nwas manufactured, sampled, tested, and inspected in accor­\ndance with the specification, including year-date, the supple­\nmentary requirements, and any other requirements designated \nin the purchase order or contract, and has been found to meet \nsuch requirements. A signature or notarization is not required; \nhowever, the document shall be dated and shall clem·ly identify \nthe organization submitting it. \n25 .1.1 Notwithstanding the absence of a signature or \nnotarization, the certifying organization is responsible for the \ncontents of the document. \n25.2 In addition to the certificate of compliance, the manu­\nfacturer or supplier shall furnish to the purchaser a test report \nthat includes the following information and test results, as \napplicable: \n25.2.1 Heat number, \n25.2.2 Heat analysis, \n25.2.3 Product analysis if specified or required, \n25.2.4 Tensile properties, \n25.2.5 Width in the gauge length, if longitudinal strip \ntension test specimens were used, \n25.2.6 Bend test acceptable, \n25.2.7 Flattening test acceptable, \n25.2.8 Hydrostatic test pressure, \n25.2.9 Nondestructive electric test method, \n25.2.10 Impact test results, and \n25.2.11 Other test results or information required to be \nreported by the applicable product specification. \n25.3 Test results or information required to be reported by \nsupplementary requirements, or other requirements designated \nin the purchase order or contract shall be reported but may be \nreported in a separate document. \n25.4 The test report shall include a statement of explanation \nfor the letter added to the specification number marked on the \ntubes (see 26.5) if all of the requirements of the specification \nhave not been completed. The purchaser must certify that all \nrequirements of the specification have been completed before \nthe removal of the letter (that is, X, Y, or Z). \n25.5 A test report, certificate of compliance, or similar \ndocument printed from or used in electronic form from an \nelectronic data interchange (EDI) shall be regarded as having \nthe same validity as a counterpart printed in the certifying \norganization's facility. The content of the EDI transmitted \ndocument shall meet the requirements of the invoked ASTM \nstandard(s) and conform to any existing EDI agreement be­\ntween the purchaser and the supplier. Notwithstanding the \nabsence of a signature, the organization submitting the EDI \ntransmission is responsible for its content. \n26. Product Marking \n26.1 Each length of pipe shall be legibly marked with the \nmanufacturer's name or brand, the specification number (year \nof issue not required) m1d grade. Marking shall begin approxi­\nmately 12 in. [300 mm] from the end of each length of pipe. \nFor pipe less than NPS 2 and pipe under 3 ft [1 m] in length, \nthe required information may be marked on a tag securely \nattached to the bundle or box in which the pipes are shipped. \n26.2 When pipe marked as specified is rejected, the ASTM \ndesignation shall be canceled. \n26.3 For austenitic steel pipe, the marking paint or ink shall \nnot contain detrimental amounts of harmful metals, or metal \nsalts, such as zinc, lead, or copper, which cause conosive \nattack on heating. \n26.4 Pipes that have been weld repaired in accordance with \n17 .1 shall be marked WR. \n26.5 When it is specified that certain requirements of a \nspecification adopted by the ASME Boiler and Pressure Vessel \nCommittee are to be completed by the purchaser upon receipt \nof the material, the manufacturer shall indicate that all require­\nments of the specification have not been completed by a letter \nsuch as X, Y, or Z, immediately following the specification \nnumber. This letter may be removed after completion of all \nrequirements in accordance with the specification. An expla­\nnation of specification requirements to be completed is pro­\nvided in 25. l. \n27. Packaging, Marking, and Loading \n27.1 If specified in the purchase order, packaging, marking, \nand loading for shipment shall be in accordance with the \nprocedures of Practices A 700. \n28. Government Procurement \n28.1 If specified in the contract or purchase order, the \nfollowing requirements shall be considered in the inquiry, \ncontract, or order for agencies of the U.S. Government where \nscale- free pipe is required. Such requirements shall take \nprecedence if there is a conflict between these requirements \nand those of the applicable product specification. \n1493 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1547.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5759,
  "bestTextAlphaRatio": 0.7758
}