{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 56,
  "globalPageIndex": 854,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-451/SA-451M ASME BPVC.II.A-2025 \n7 .2 It is realized that the foundry may be unable to perform \nthe hydrostatic test pdor to shipment, or that the purchaser may \nwish to defer testing until additional work has been performed \non the casting. In such cases, the foundry is responsible for the \nsatisfactory performance of the casting when it is tested. \n8. Quality \n8.1 The surface of the casting shall be examined visually \nand shall be free from cracks and hot tears. Other surface \ndefects shall be judged in accordance with visual acceptance \ncriteria which may be specified in the order. \n9. Rework and Retreatment \n9.1 Defects as defined in Section 8 shall be removed and \ntheir removal verified by visual inspection of the resultant \ncavities. Defects which are located by inspecting with Supple-• \nmentary Requirement S6 or S7, or both, shall be removed or \nreduced to an acceptable size. \n9 .2 If removal of the defect does not infringe upon the \nminimum wall thickness, the depression may be blended \nuniformly into the surrounding surface. \n9.3 If the cavity resulting from defect removal infringes \nupon the minimum wall thickness, weld repair is permitted \nsubject to the purchasers' approval. The composition of the \nweld rod used shall be suitable for the composition of the metal \nbeing welded. \n9.3.l Only operators and procedures qualified in accordance \nwith ASME Boiler and Pressure Vessel Code, Section IX, shall \nbe used. All repair welds will be inspected to the same quality \nstandards used to inspect the casting. \n9.4 Postweld heat-treatment of the repaired casting is nei­\nther required nor prohibited. \n10. Permissible Variations in Dimensions \n10.1 Thickness-The wall thickness shall not vary over that \nspecified by more than \\Is in. (3 mm). There shall be no \nvariation under the specified wall thickness. \n11. Genera) Requirements \n11.1 Mate1ial furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A999/ A999M, unless otherwise provided herein. \n12. Rejection \n12.1 Each length of pipe received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of the specification based on the inspection and \ntest method as outlined in the specification, the pipe may be \nrejected and the manufacturer shall be notified. Disposition of \nrejected pipe shall be a matter of agreement between the \nmanufacturer and the purchaser. \n13. Rehearing \n13.1 Samples that represent rejected material shall be pre­\nserved for 2 weeks from the date of transmission of the test \nreport In case of dissatisfaction with the results of the tests, the \nmanufacturer may make claim for a rehearing within that time. \n14. Certification \n14.l Upon request of the purchaser in the contract or order, \na manufacturer's certification that the material was manufac­\ntlired and tested in accordance with this specification, together \nwith a report of the test results, shall. be furnished at the time \nof shipment. \n15. Product Marking \n15.l Each length of pipe shall be legibly marked with the \nmanufacturer's name or brand, the letters ASTM, the specifi­\ncation number, and grade. In addition, heat numbers, or serial \nnumbers that are traceable to heat numbers, shall be marked on \neach length of pipe. \n16. Keywords \n16.1 austenitic; centlifugaily cast; height; high-temperature \nservice; stainless steel; steel castings \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall be applied only when specified by the purchaser. Details of the \nsupplementary requirements shall be agreed upon by the manufacturer and purchaser. The specified \ntests shall be performed by the manufacturer prior to shipment of the castings. \nS l. Additional Tension Tests \nSl.l Additional tension tests shall be made at a temperature \nto be specified by the customer, and the properties to be met are \na matter of agreement between purchaser and manufacturer. \nS2. Flattening Test \nS2.1 The flattening test shall be made on specimens from \none or both ends of each length of pipe. If the specimen from \nany end of any length fails to conform to the requirements of \nSpecification A999/ A999M, that length shall be rejected. \n752 \nS3. Photomicrographs \nS3.1 The manufacturer shall furnish one photomicrograph \nat 100 diameters from one specimen of as-finished pipe from \neach heat in each heat-treatment lot. Such photomicrographs \nshall be suitably identified as to pipe size, wall thickness, and \nheat. Such photomicrographs are for information only, to show \nthe actual metal structme of the pipe as furnished. No photo­\nmicrographs for the individual pieces purchased shall be \nrequired except as specified in Supplementary Requirement S4. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0854.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4747,
  "bestTextAlphaRatio": 0.7822
}