{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 60,
  "globalPageIndex": 60,
  "width": 626.4,
  "height": 803.04,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \nconsiders appropriate, provided that the purchaser is informed \nof the procedure followed in heat treating the test coupons. \n6.3 Where the heat treatment is to be performed by the \nmanufacturer or the processor, the structural product shall be \nheat treated as specified in the applicable product specification, \nor as specified in the purchase order, provided that the heat \ntreatment specified by the purchaser is not in conflict with the \nrequirements of the applicable product specification. \n6.4 Where normalizing is to be performed by the fabricator, \nthe structural product shall be either normalized or heated \nuniformly for hot forming, provided that the temperature to \nwhich the structural product is heated for hot forming does not \nsignificantly exceed the normalizing temperature. \n6.5 The use of cooling rates that are faster than those \nobtained by cooling in air to improve the toughness shall be \nsubject to approval by the purchaser, and structural products so \ntreated shall be tempered subsequently in the range from 1100 \nto 1300°F [595 to 705°C]. \n7. Chemical Analysis \n7.1 Heat Analysis: \n7 .1.1 Sampling for chemical analysis and methods of analy­\nsis shall be in accordance with Test Methods, Practices, and \nTerminology A751. \n7.1.2 For each heat, the heat analysis shall include determi­\nnation of the content of carbon, manganese, phosphorus, sulfur, \nsilicon, nickel, chromium, molybdenum, copper, vanadium, \ncolumbium (niobium); any other element that is specified or \nrestricted by the applicable product specification for the \napplicable grade, class, and type; and any austenitic grain \nrefining element whose content is to be used in place of \naustenitic grain size testing of the heat (see 8.3.2). Boron shall \nbe reported if intentionally added. \nNoTE 3-For steels that do not have intentional boron additions for \nhardenability, the boron content will not normally exceed 0.0008 %. \n7.1.3 Except as allowed by 7.1.4 for primary heats, heat \nanalyses shall conform to the heat analysis requirements of the \napplicable product specification for the applicable grade,· class, \nand type. \n7.1.4 Where vacuum-arc remelting or electroslag remelting \nis used, a remelted heat is defined as all ingots remelted from \na single primary heat. If the heat analysis of the primary heat \nconforms to the heat analysis requirements of the applicable \nproduct specification for the applicable grade, class, and type, \nthe heat analysis for the remelted heat shall be determined from \none test sample taken from one remelted ingot, or the product \nof one remelted ingot, from the primary heat. If the heat \nanalysis of the primary heat does not conform to the heat \nanalysis requirements of the applicable product specification \nfor the applicable grade, type, and class, the heat analysis for \nthe remelted heat shall be determined from one test sample \ntaken from each remelted ingot, or the product of each \nremelted ingot, from the primary heat. \n7.2 Product Analysis-For each heat, the purchaser shall \nhave the option of analyzing representative samples taken from \nthe finished structural product. Sampling for chemical analysis \n8 \nand methods of analysis shall be in accordance with Test \nMethods, Practices, and Terminology A751. The product \nanalyses so determined shall conform to the heat analysis \nrequirements of the applicable product specification for the \napplicable grade, class, and type, subject to the permitted \nvariations in product analysis given in Table A. If a range is \nspecified, the determinations of any element in a heat shall not \nvary both above and below the specified range. Rimmed or \ncapped steel is characterized by a lack of homogeneity in its \ncomposition, especially for the elements carbon, phosphorus, \nand sulfur. Therefore, the limitations for these elements shall \nnot be applicable unless misapplication is clearly indicated. \n7 .3 Referee Analysis-For referee purposes, Test Methods, \nPractices, and Terminology A751 shall be used. \n7.4 Grade Substitution-Alloy steel grades that meet the \nchemical requirements of Table 1 of Specification A829/ \nA829M shall not be substituted for carbon steel grades. \n8. Metallurgical Structure \n8.1 Where austenitic grain size testing is required, such \ntesting shall be in accordance with Test Methods E112 and at \nleast 70 % of the grains in the area exaruined shall meet the \nspecified grain size requirement. \n8.1.1 Discussion-Austenitic Grain Size-All requirements \nfor austenitic grain size control in Section 8, Metallurgical \nStructure, refer to a size of austenite grains that form when and \nif the structural product is reheated to a temperature at or above \nthe transformation temperature, Ac 3 , after the product has \nexperienced the complete rolling operation and has cooled to \nambient temperature. The requirements for austenitic grain size \ncontrol in Section 8, including the results of the referenced \ntesting methods, do not measure or control the prior austenitic \ngrain size or the ferritic grain size of the structural product in \nthe as-rolled condition. \n8.2 Coarse Austenitic Grain Size-Where coarse austenitic \ngrain size is specified, one austenitic grain size test per heat \nshall be made and the austenitic grain size number so deter­\nmined shall be in the range of 1 to 5 inclusive. \n8.3 Fine Austenitic Grain Size: \n8.3.1 Where fine austenitic grain size is specified, except as \nallowed in 8.3.2, one austenitic grain size test per heat shall be \nmade and the austenitic grain size number so determined shall \nbe 5 or higher. \nNoTE 4-Such austenitic grain size numbers may be achieved with \nlower contents of austenitic grain refining elements than 8.3.2 requires for \naustenitic grain size testing to be waived. \n8.3.2 Unless testing for fine austenitic grain size is specified \nin the purchase order, an austenitic grain size test need not be \nmade for any heat that has, by heat analysis, one or more of the \nfollowing: \n8.3.2.1 A total aluruinum content of 0.020 % or more. \n8.3.2.2 An acid soluble aluruinum content of 0.015 % or \nmore. \n8.3.2.3 A content for an austenitic grain refining element \nthat exceeds the minimum value agreed to by the purchaser as \nbeing sufficient for austenitic grain size testing to be waived, or ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0060.json",
  "tabulaTablesCsv": "tables_tabula/page-0060.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0060.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6307,
  "bestTextAlphaRatio": 0.7791
}