{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 639,
  "globalPageIndex": 639,
  "width": 615.84,
  "height": 856.2,
  "text": "ASME BPVC.II.A-2025 SA-370 \n3.3 Definition of Terms Specific to the Procedure for Use \nand Control of Heat-cycle Simulation (See Annex A9): \n3.3.1 master chart, n-a record of the heat treatment re­\nceived from a forging essentially identical to the production \nforgings that it will represent. \n3.3.1.1 Discussion-It is a chart of time and temperature \nshowing the output from thermocouples imbedded in the \nforging at the designated test immersion and test location or \nlocations. \n3.3.2 program chart, n-the metallized sheet used to pro­\ngram the simulator unit. \n3.3.2.1 Discussion-Time-temperature data from the master \nchart are manually transferred to the program chart. \n3.3.3 simulator chart, n-a record of the heat treatment that \na test specimen had received in the simulator unit. \n3.3.3.1 Discussion-It is a chart of time and temperature \nand can be compared directly to the master chart for accuracy \nof duplication. \n3.3.4 simulator cycle, n-one continuous heat treatment of a \nset of specimens in the simulator nnit. \n3.3.4.l Discussion-The cycle includes heating from \nambient, holding at temperature, and cooling. For example, a \nsimulated austenitize and quench of a set of specimens would \nbe one cycle; a simulated temper of the same specimens would \nbe another cycle. \n4. Significance and Use \n4.1 The primary use of these test methods is testing to \ndetermine the specified mechanical properties of steel, stainless \nsteel, and related alloy products for the evaluation of confor­\nmance of such products to a material specification under the \njurisdiction of ASTM Committee AOl and its subcommittees as \ndesignated by a purchaser in a purchase order or contract. \n4.1.1 These test methods may be and are used by other \nASTM Committees and other standards writing bodies for the \npurpose of conformance testing. \n4.1.2 The material condition at the time of testing, sampling \nfrequency, specimen location and orientation, reporting \nrequirements, and other test parameters are contained in the \npertinent material specification or in a general requirement \nspecification for the particular product form. \n4.1.3 Some material specifications require the use of addi­\ntional test methods not described herein; in such cases, the \nrequired test method is described in that material specification \nor by reference to another appropriate test method standard. \n4.2 These test methods are also suitable to be used for \ntesting of steel, stainless steel and related alloy materials for \nother purposes, such as incoming material acceptance testing \nby the purchaser or evaluation of components after service \nexposure. \n4.2.1 As with any mechanical testing, deviations from either \nspecification limits or expected as-manufactured properties can \noccur for valid reasons besides deficiency of the original \nas-fabricated product. These reasons include, but are not \nlimited to: subsequent service degradation from environmental \nexposure (for example, temperature, corrosion); static or cyclic \nservice stress effects, mechanically-induced damage, material \ninhomogeneity, anisotropic structure, natural aging of select \nalloys, further processing not included in the specification, \nsampling limitations, and measuring equipment calibration \nuncertainty. There is statistical variation in all aspects of \nmechanical testing and variations in test results from prior tests \nare expected. An understanding of possible reasons for devia­\ntion from specified or expected test values should be applied in \ninterpretation of test results. \n5. General Precautions \n5 .1 Certain methods of fabrication, such as bending, \nforming, and welding, or operations involving heating, may \naffect the properties of the material under test. Therefore, the \nproduct specifications cover the stage of manufacture at which \nmechanical testing is to be performed. The properties shown by \ntesting p1ior to fabrication may not necessarily be representa­\ntive of the product after it has been completely fabricated. \n5.2 Improperly machined specimens should be discarded \nand other specimens substituted. \n5.3 Flaws in the specimen may also affect results. If any test \nspecimen develops flaws, the retest provision of the applicable \nproduct specification shall govern. \n5.4 If any test specimen fails because of mechanical reasons \nsuch as failure of testing equipment or improper specimen \npreparation, it may be discarded and another specimen taken. \n6. Orientation of Test Specimens \n6.1 The terms \"longitudinal test\" and \"transverse test\" are \nused only in material specifications for wrought products and \nare not applicable to castings. When such reference is made to \na test coupon or test specimen, see Section 3 for terms and \ndefinitions. \nTENSION TEST \n7. Description \n7 .1 The tension test related to the mechanical testing of steel \nproducts subjects a machined or full-section specimen of the \nmaterial under examination to a measured load sufficient to \ncause rupture. The resulting properties sought are defined in \nTerminology E6. \n587 \n7.2 In general, the testing equipment and methods are given \nin Test Methods E8/E8M. However, there are certain excep­\ntions to Test Methods E8/E8M practices in the testing of steel, \nand these are covered in these test methods. \n8. Testing Apparatus and Operations \n8.1 Loading Systems-There are two general types of load­\ning systems, mechanical (screw power) and hydraulic. These \ndiffer chiefly in the vaiiability of the rate of load application. \nThe older screw power machines are limited to a small number \nof fixed free running crosshead speeds. Some modern screw \npower machines, and all hydraulic machines permit stepless \nvariation throughout the range of speeds. \n8.2 The tension testing machine shall be maintained in good \noperating condition, used only in the proper loading range, and \ncalibrated periodically in accordance with the latest revision of \nPractices E4. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0639.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5929,
  "bestTextAlphaRatio": 0.792
}