{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 692,
  "globalPageIndex": 692,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-376/SA-376M ASME BPVC.II.A-2025 \nsubsequent exposure to sensitizing conditions in TP321, \nTP321H, TP347, TP347H, TP348, and TP348H. When speci­\nfied by the purchaser, a lower temperature stabilization or \nre-solution anneal shall be used subsequent to the initial high \ntemperature solution anneal (see Supplementary Requirement \nS9). \n5.4 The grain size of grades 304H, 316H, 321H, 347H, and \n348H as determined in accordance with Test Methods El12, \nshall be No. 7 or coarser. \n6. Chemical Composition \n6.1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n7. Product Analysis \n7.1 At the request of the purchaser, an analysis of one billet \nfrom each heat or two pipes from each lot shall be made by the \nmanufacturer. A lot of pipe shall consist of the number of \nlengths as a function of size, as shown below, of the same size \nand wall thickness from any one heat of steel: \nNPS [DN] Designator Lengths of Pipe in Lot \nUnder NPS 2 [DN 50] 400 or fraction thereof \nNPS 2 [DN 50] to NPS 5 200 or fraction thereof \n[DN 125], incl \nOver NPS 5 [DN 125] 100 or fraction thereof \n7 .2 The results of these analyses shall be reported to the \npurchaser or the purchaser's representative, and shall conform \nto the requirements specified in Table 1. \n7.3 If the analysis of one of the tests specified in Section 8 \ndoes not conform to the requirements specified in Section 6, an \nanalysis of each billet or pipe from the same heat or lot may be \nmade, and all billets or pipe conforming to the requirements \nshall be accepted. \n8. Tensile Requirements \n8.1 The material shall conform to the requirements as to \ntensile properties prescribed in Table 2. \n9. Workmanship, Finish, and Appearance \n9 .1 The pipe manufacturer shall explore a sufficient number \nof visual surface impe1fections to provide reasonable assurance \nthat they have been properly evaluated with respect to depth. \nExploration of all surface imperfections is not required but may \nbe necessary to assure compliance with 9.2. \n9.2 Surface imperfections that penetrate more than 12½ % \nof the nominal wall thickness or encroach on the minimum \nwall thickness shall be considered defects. Pipe with such \ndefects shall be given one of the following dispositions: \n9 .2.1 The defect may be removed by grinding provided that \nthe remaining wall thickness is within specified limits. \n9.2.2 Repaired in accordance with the repair welding pro­\nvisions of 9.6. \n9.2.3 The section of pipe containing the defect may be cut \noff within the limits of requirements on length. \n9.2.4 Rejected. \n9.3 To provide a workmanlike finish and basis for evaluat­\ning conformance with 9.2, the pipe manufacturer shall remove \nby grinding the following: \n642 \nTABLE 2 Tensile Requirements \nTensileA Yield Elongation in 2 in. or 50 \nstrength, strength mm \nGrade min, ksi min, (or 4D) min, % [MPa] ksi Longitudinal Transverse [MPa] \nTP304, TP304H, \nTP304LN, TP316, \nTP316H, TP316LN, 75 30 TP347, TP347H, [515] [205] 35 25 \nTP347LN, TP348, \nTP348H, 16-8-2H, \nS31725 \nTP304N, TP316N, 80 35 35 25 S31726 [550] [240] \nS34565 115 60 35 30 \n[790] [415] \nTP321,321H \n:s;0.375 in. 75 30 35 25 \n[9.50 mm] [515] [205] \n>0.375 in. 70 25 35 25 \n[9.50 mm] 8 [480] [170] \nS31266 109 [750] 61 35 25 \n[420] \nAFor grade TP304, NPS8 or larger, and in schedules 140 and heavier, the required \nminimum tensile strength shall be 70 ksi [480 MPa]. \n8 Prior to the issuance of A376/ A376M - 88, the tensile and yield strength values \nwere 75 [520] and 30 [21 OJ respectively, for nominal wall greater than 0.375 in. \n[9.5 mm]. \n9.3.1 Mechanical marks, abrasions (see Note 3), and pits, \nany of which imperfections are deeper than 1/16 in. [1.6 mm]. \nNorn 3-Marks and abrasions are defined as cable marks, dinges, guide \nmarks, roll marks, ball scratches, scores, die marks, and so forth. \n9.3.2 Visual imperfections commonly refened to as scabs, \nseams, laps, tears, or slivers found by exploration in accor­\ndance with 9 .1 to be deeper than 5 % of the nominal wall \nthickness. \n9.4 At the purchaser's discretion, pipe shall be subject to \nrejection if surface imperfections acceptable under 9.2 are not \nscattered, but appear over a large area in excess of what is \nconsidered a workmanlike finish. Disposition of such pipe shall \nbe a matter of agreement between the manufacturer and the \npurchaser. \n9 .5 When imperfections or defects are removed by grinding, \na smooth curved surface shall be maintained, and the wall \nthickness shall not be decreased below that permitted by this \nspecification. The outside diameter at the point of grinding may \nbe reduced by the amount so removed. \n9.5.1 Wall thickness measurements shall be made with a \nmechanical caliper or with a properly calibrated nondestructive \ntesting device of appropriate accuracy. In case of dispute, the \nmeasurement determined by use of the mechanical caliper shall \ngovern. \n9.6 Weld repair shall be permitted only subject to the \napproval of the purchaser and in accordance with Specification \nA999/A999M. \n9.7 The finished pipe shall be reasonably straight. \n9.8 The pipe shall be free of scale and contaminating iron \nparticles. Pickling, blasting, or surface finishing is not manda­\ntory when pipe is bright annealed. The purchaser may request \nthat a passivating treatment be applied. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0692.json",
  "tabulaTablesCsv": "tables_tabula/page-0692.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0692.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5328,
  "bestTextAlphaRatio": 0.7027,
  "noteOcrPath": "note_ocr/page-0692.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 3—Marks and abrasions are defined as cable marks, dinges, guide"
  ]
}