{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 676,
  "globalPageIndex": 1474,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-962/SA-962M ASME BPVC.II.A-2025 \nthe positions shown in Annex A3 of Test Methods and \nDefinitions A370 when inch-pounds are specified and to the \nform and dimension shown in Test Methods F606/F606M \nwhen M suffix (SI units) is specified. Impact tests are not \nrequired on material from externally threaded components \nwhen the thread diameter is ½ in. and under. \n9. Hardness Requirements \n9.1 The material shall conform to the hardness requirements \nprescribed in the product specification. Hardness testing shall \nbe performed in accordance with Test M:ethods and Definitions \nA370 when inch-pound units are specified or to the applicable \ntrack of Test Methods A1058 if SI units are specified. \n9.2 Tensile tests prevail over hardness tests in the event a \nconflict exists relative to minimum strength unless otherwise \nspecified in the product specification. \n10. Tensile Requirements \n10.1 Bars and Specimens Machined From Components­\nThe bolting component material shall conform to the tensile \nproperty requirements prescribed in the product specification. \n10.1.1 When the dimensions of the component material to \nbe tested will permit, the tension test specimens shall be \nmachined to the form and dimensions of the standard 2-in. \n[50-mm] gage length tension test specimen described in Test \nMethods and Definitions A370 when inch-pound units are \nspecified or the standard length tension test specimens de­\nscribed in the applicable track of Test Methods A1058 if SI \nunits are specified. \n10.1.2 When the dimensions of the component material to \nbe tested do not permit full size specimens, small size \nspecimens meeting the requirements of Test Methods and \nDefinitions A370 when inch-pound units are specified or the \nsmall size specimens described in the applicable track of Test \nMethods A1058 if SI units are specified shall be used. \n10.2 Testing of Full Size Components-Full size testing \nshall be as described in Test Methods and Definitions A370 \nwhen inch-pound units are specified or as described in Test \nMethods F606/F606M when SI units are specified. \n11. Proof Load and Cone Proof Requirements \n11.1 Proof Load Test-Nuts shall be assembled on a \nthreaded mandrel or a test bolt as illustrated in Fig. l(a) \nTension Method or (b) Compression Method. The minimum \nproof load required by the product specification shall be \napplied using a free running cross head speed of 1.0 in. [25 \nmm] per minute maximum and shall be held for at least 10 s. \nThe nut shall resist this load without stripping or rupture, and \nshall be removable by hand, without use of tooling, after the \nload is released. A wrench may be used to loosen the nut \none-half turn maximum to start it in motion. The test shall be \ndiscarded if the threads of the mandrel or test bolt are damaged \nduring the test. \n11. 1.1 Mandrels shall have a hardness of 45 HRC minimum \nwith threads of ·the appropriate series and conforming to the \nrequirements of ASME B 1.1 Class 3A or ASME B 1. 13M \ntolerance 4H except that the maximum major diameter shall be \nthe minimum major diameter plus 0.25 times the major \ndiameter tolerance. \n11.1.2 The test bolt shall have threads appropriate to the \nstandard specified for the nut being tested and shall have a \nyield strength in excess of the specified proof load of the nut \nbeing tested. \n11.1.3 The mandreVtension method shall be used when \narbitration is required. \n11.2 Cone Proof Load Test-This test is performed when \nvisible surface discontinuities become a matter of issue. The \ntest uses a conical washer and threaded mandrel to determine \nthe load-carrying ability of hardened steel nuts through 1 ½ in. \n[36 mm] in diameter assembled as shown in Fig. 2. The \nminimum cone proof load required by the product specification \nshall be applied using a free running cross head speed of 0.12 \n0 .. d 0.015 in. [+0.38 mm] \n0.009 In. [ +o.22 mm) \n(a) Tension Method (b) Compression Method \nFIG. 1 Proof Load Testing-Nuts \n1416 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1474.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3962,
  "bestTextAlphaRatio": 0.7569
}