{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 682,
  "globalPageIndex": 1480,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-962/SA-962M ASME BPVC.II.A-2025 \nS58.4 All bolting that are not of the correct material grade \nshall be rejected. \nS58.5 The method of bolting marking after examination \nshall be agreed upon between the manufacturer and purchaser. \nS59. Pressure Equipment Directive-Mechanical Testing \nS59.1 Charpy impact testing shall be done at the lowest \nscheduled operating temperature, but not higher than 20 °C [68 \nOF]. \nS59 .2 The frequency of impact testing shall be the same as \nthat specified in the product specification for the tension test, \nwith three individual Charpy test specimens for each required \ntension test. \nS59.3 The minimum individual energy for the Charpy \nimpact test shall be 20 ft-lb [27 J]. \nS59.4 The minimum elongation in the tension test shall be \nmeasured on a gauge length of five times the diameter of the \ntest specimen, and shall not be less than 14 %. \nS59.5 Impact and tension test results shall be included in the \nproduct certification. \nS60. Heat Treat Charts \nS60.1 The supplier shall provide heat treat charts as a part of \nthe order documentation. \nS61. Hardness Testing \nS61.l Each piece of bolting shall be hardness tested and \nfound to meet the requirements of the product specification or \nthis standard, as applicable. A minimum sample consisting of \n10 % of the pieces in each lot shall be tested using an \nindentation method in accordance with Test Methods and \nDefinitions A370 when inch-pound units are specified or to the \napplicable track of Test Methods A1058 if SI units are \nspecified. Each piece in the sample shall meet the hardness \nrequirements. The balance of the lot may be tested using either \nthe indentation method per Test Methods and Definitions A370 \nwhen inch-pound units are specified or to the applicable track \nof Test Methods A1058 if SI units are specified or electromag­\nnetic sorting in accordance with Practice E566. If any piece in \nthe sample is outside of the specified hardness requirements, \nthen the lot shall be rejected and either reprocessed and \nresampled, or tested 100 % by indentation hardness methods. \nS62. Ultrasonic Examination of Bolting in Sizes Greater \nthan 2 in. [50 mm] in Cross Section \nS62.1 All bolting with a major cross section greater than 2 in. \n[50 mm] shall be subjected to ultrasonic inspection (UT) prior \nto threading. \nS62.2 Ultrasonic inspection shall be carried out using \nL-wave transducers in the radial direction. \nS62.3 Search units shall not exceed 1 in.2 [645 mm 2 ] in area \nand shall have a nominal frequency of 2 or 2¼ MHz. \nS62.4 Inspection sensitivity shall be established using a first \nback reflection set at 80 % of full screen height (FSH). \nS62.5 Indications whose amplitude exceeds 20 % FSH and \nthose which cause the back reflection signal amplitude to \ndecrease to 40 % or less FSH are not acceptable. \nS63. Phosphorus and Sulfur Maximums \nS63.1 The phosphorus and sulfur content of carbon and low \nalloy steels shall be 0.025 % max. \nS64. Product Inspection \nS64. l Sampling for dimensional, thread fit and visual \ninspection of product shall be performed in accordance with \nASME B18.18 Category 2. \nS65. Product Inspection \nS65.l Sampling for dimensional, thread fit and visual \ninspection of product shall be performed in accordance with \nASME Bl8.18 Category 3. \nS66. Marking for Lot Traceability \nS66.1 In addition to the requirements stated in Section 20, \nbolting components (purchaser to designate whether bolts or \nnuts or other specific items apply) shall be individually hard \nmarked with a traceability code that provides full traceability to \nthe lot, with a lot as defined in 3.1.10 for fasteners. The \ntraceability code shall be defined by the bolting manufacturer \nand shall be reported on the certification. \nS67. Eddy Current Inspection \nS67 .1 Eddy current examination shall be applied to 100 % of \nthe lot in accordance with a defined practice approved by the \npurchaser. Reject levels for linear indications shall be based on \nthe alarm response from a surface notch with a maximum depth \nof 0.012 in. [0.030 mm] in a calibration bar. \nS68. Ultrasonic Inspection \nS68.l Ultrasonic examination shall be applied to 100 % of \nthe lot in accordance with a defined practice approved by the \npurchaser. Reject levels for linear indications shall be based on \nthe alarm response from a surface notch with a maximum depth \nof 0.012 in. [0.030 mm] in a calibration bar. \nS69. Sampling For Hardness Testing \nS69.1 Finished components or blanks from each heat treat­\nment charge shall be subjected to hardness testing. The number \nof samples tested shall meet the requirements of Guide F1470, \nTable 3, Sample Size B. \nS70. Maximum Hardness for Carbon and Alloy Steel \nS70.1 The maximum hardness of components shall not \nexceed 32 HRC [302 HBW]. \nS71. Passivation of Stainless Steel Bolting \nS71.1 Stainless Steel Bolting components shall be passivated \nin accordance with Practice A380/A380M or Specification \nA967 / A967M at the option of the manufacturer or shall be \nelectropolished. \n1422 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1480.json",
  "tabulaTablesCsv": "tables_tabula/page-1480.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1480.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5034,
  "bestTextAlphaRatio": 0.7481
}