{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 755,
  "globalPageIndex": 755,
  "width": 604.32,
  "height": 847.68,
  "text": "ASME BPVC.II.A-2025 SA-420 /SA-420M \n17. Rejection and Rehearing \n17 .1 Material that fails to conform to the requirements of \nthis specification shall be rejected. Rejection should be re­\nported to the producer or supplier promptly and in writing. In \ncase of dissatisfaction with the results of the test, the producer \nor supplier shall make claim for a rehearing. \n17 .2 Fittings that develop defects in shop working or \napplication operations shall be rejected. Upon rejection, the \nmanufacturer shall be notified promptly in writing. \n18. Certification \n18.1 Test reports are required for all fittings covered by this \nspecification. Each test report shall meet the requirements for \ncertification in Specification A960/ A960M as well as include \nthe following information specific to this specification: \n18.1.1 Chemical analysis results, Section 8 (Table 1), re­\nported results shall be to the same number of significant figures \nas the limits specified in Table 1 for that element, \n18.1.2 Tensile property results, Section 9 (Table 3) report \nyield strength and tensile strength in ksi [MPa] and elongation \nin percent, and tensile test orientation, \n18.1.3 Impact test results, Section 10 (Table 4 and Table 5), \n18.1.4 Type heat treatment, Section 7, \n18.1.5 Statement regarding radiographic or ultrasonic ex­\namination of welds, Section 15, and \n18.1.6 Any supplementary testing required by the purchase \norder. \n19. Product Marking \n19 .1 In addition to marking requirements of Specification \nA960/ A960M, the following additional marking requirements \nshall apply: \n19.1.1 Fittings shall be marked by any method which will \nidentify the fittings and not result in sharp discontinuities. \nStamping, when used, shall be done with blunt-nosed continu­\nous or blunt-nosed interrupted dot stamps. \n19.1.2 When agreed upon between the purchaser and \nproducer, and specified in the order, the markings shall be \npainted or stenciled on the fitting or stamped on a metal or \nplastic tag which shall be securely attached to the fitting. \n19.1.3 Fittings containing welds that have been ultrasoni­\ncally examined instead of radiography shall be marked U after \nheat identity. \n19.1.4 Threaded or socket welding fittings shall be marked \nwith the pressure class. Plugs and bushings furnished to ASME \nB 16.11 requirements are not required to be marked. \n19.1.5 The impact test temperature shall also be shown if it \nis different from the standard test temperature specified in \nTable 6, for example: WPL-6-60 or WPL3-176. \n19.2 Bar Coding-In addition to the requirements in 19.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. The bar coding system, if applied at \nthe discretion of the supplier, should be consistent with one of \nthe published industry standards for bar coding. If used on \nsmall fittings, the bar code may be applied to the box or a \nsubstantially applied tag. \n20. Keywords \n20.1 pipe fittings; piping applications; pressure containing \nparts; pressure vessel service; temperature service applications, \nlow \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the supplementary requirements appearing in Specification A960/A960M may be \nincluded in the order or contract. When so included, a supplementary requirement shall have the same \nforce as if it were in the body of the specification. Supplementary requirement details not fully \ndescribed shall be agreed upon between the purchaser and the supplier. \nSl. ASME Section III Construction \nS 1.1 Products welded with filler metal furnished under this \nspecification that are intended for application under the rules of \nSection III of the ASME Boiler and Pressure Vessel Code shall \nbe manufactured by holders of the appropriate ASME Certifi­\ncate of Authorization and Certification Mark. The product is \nsubject to all applicable requirements of Section III, including \nwelding, heat treatment, nondestructive examination, autho­\nrized inspection at the point of manufacture, and application of \nthe Certification Mark. \nS 1.2 The applicable ASME Partial Data Report form, \nsigned by an Authorized Nuclear Inspector, and a material test \nreport shall be furnished for each lot of pipe. \n705 \nS 1.3 The material used to fabricate the pipe fitting shall \nconform to the applicable SA specification in ASME Boiler and \nPressure Vessel Code, Section II. The welded joints shall be \nfull penetration butt welds as obtained by double welding or by \nother means that will obtain the same quality of deposited weld \nmetal on the inside and outside. Welds using metal backing \nstrips that remain in place are prohibited. \nS 1.4 Each piece of pipe fitting shall be so marked as to \nidentify each such piece of pipe fitting with the lot and the \nmaterial test report. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0755.json",
  "tabulaTablesCsv": "tables_tabula/page-0755.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0755.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4830,
  "bestTextAlphaRatio": 0.772
}