{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 199,
  "globalPageIndex": 199,
  "width": 613.92,
  "height": 793.2,
  "text": "'-.__.,,. \nASME BPVC.II.A-2025 SA-53/SA-53M \n15. Test Methods \n15.1 The test specimens and the tests required by this \nspecification shall conform to those described in the latest issue \nof Test Methods and Definitions A370. \n15.2 Each longitudinal tension test specimen shall be taken \nfrom a pipe end and shall not be flattened between the gage \nmarks. \n15.3 Test specimens for bend tests and flattening tests shall \nbe taken from pipe. Test specimens for flattening tests shall be \nsmooth on the ends and free from burrs. \n15.4 Tests shall be conducted at room temperature. \n16. Lengths \n16.1 Unless otherwise specified, pipe lengths shall be in \naccordance with the following regular practices: \n16.1.1 Except as allowed by 16.1.2 and 16.1.4, pipe lighter \nthan extra-strong weight shall be in single-random lengths of \n16 to 22 ft [4.88 to 6.71 m], with not more than 5 % of the total \nnumber of threaded lengths furnished being jointers (two \npieces coupled together). \n16.1.2 For plain-end pipe lighter than extra-strong weight, it \nshall be permissible for not more than 5 % of the total number \nof pipe to be in lengths of 12 to 16 ft [3.66 to 4.88 m]. \n16.1.3 Pipe of extra-strong weight or heavier shall be in \nrandom lengths of 12 to 22 ft [3.66 to 6.71 m], except that it \nshall be permissible for not more than 5 % of the total of pipe \nto be in lengths of 6 to 12 ft [1.83 to 3.66 m]. \n16.1.4 For extra-strong weight or lighter pipe ordered in \ndouble-random lengths, the minimum lengths shall be not less \nthan 22 ft [6.71 m] and the minimum average length for the \norder shall be not less than 35 ft [10.67 m]. \n16.1.5 For pipe heavier than extra-strong weight ordered in \nlengths longer than single random, the lengths shall be as \nagreed upon between the manufacturer and the purchaser. \n16.1.6 If pipe is furnished threaded and coupled, the length \nshall be measured to the outer face of the coupling. \n17. Galvanized Pipe \n17 .1 Galvanized pipe ordered under this specification shall \nbe coated with zinc inside and outside by the hot-dip process. \nThe zinc used for the coating shall be any grade of zinc \nconforming to Specification B6. The galvanized pipe shall be \nfree from uncoated areas, blisters, flux deposits, and gross \ndross inclusions. Lumps, projections, globules, or heavy de­\nposits of zinc which will interfere with the intended use of the \nmaterial will not be permitted. \n17.2 Weight (Mass) per Unit Area of Coating-The weight \n(mass) per unit area of zinc coating shall be not less than 1.8 \noz/ft 2 [0.55 kg/m 2 ] as determined from the average results of \nthe two specimens taken for test in the manner prescribed in \n17.5 and not less than 1.6 oz/ft2 [0.49 kg/m 2 ] for each of these \nspecimens. The weight (mass) per unit area of coating, ex­\npressed in ounces per square foot [kilograms per square metre] \nshall be calculated by dividing the total weight (mass) of zinc, \ninside plus outside, by the total area, inside plus oµtside, of the \nsurface coated. Each specimen shall have not less than 1.3 \noz/ft2 [0.40 kg/m 2 ] of zinc coating on each surface, calculated \nby dividing the total weight (mass) of zinc on the given surface \n( outside or inside) by the area of the surface coated ( outside or \ninside). \n17.3 Weight (Mass) per Unit Area of Coating Test-The \nweight (mass) per unit area of zinc coating shall be determined \nby stripping tests in accordance with Test Method A90/ A90M. \n17.4 Test Specimens-Test specimens for determination of \nweight (mass) per unit area of coating shall be cut approxi­\nmately 4 in. [100 mm] in length. \n17.5 Number of Tests-Two test specimens for the determi­\nnation of weight (mass) per unit area of coating shall be taken, \none from each end of one length of galvanized pipe selected at \nrandom from each lot of 500 lengths, or fraction thereof, of \neach size. \n17.6 Retests-If the weight (mass) per unit area of coating \nof any lot does not conform to the requirements specified in \n17 .2, retests of two additional pipes from the same lot shall be \nmade, each of which shall conform to the specified require­\nments. \n17. 7 If pipe ordered under this specification is to be \ngalvanized, the tension, flattening, and bend tests shall be made \non the base material before galvanizing, if practicable. If \nspecified, results of the mechanical tests on the base material \nshall be reported to the purchaser. If it is impracticable to make \nthe mechanical tests on the base material before galvanizing, it \nshall be permissible to make such tests on galvanized samples, \nand any flaking or cracking of the zinc coating shall not be \nconsidered cause for rejection. If galvanized pipe is bent or \notherwise fabricated to a degree that causes the zinc coating to \nstretch or compress beyond the limit of elasticity, some flaking \nof the coating is acceptable. \n18. Inspection \n18.1 The inspector representing the purchaser shall have \nentry, at all times while work on the contract of the purchaser \nis being performed, to all parts of the manufacturer's works \nthat concern the manufacture of the pipe ordered. The manu­\nfacturer shall afford the inspector all reasonable facilities to be \nsatisfied that the pipe is being furnished in accordance with this \nspecification. All tests ( except product analysis) and inspection \nshall be made at the place of manufacture prior to shipment, \nunless otherwise specified, and shall be so conducted as not to \ninterfere unnecessarily with the operation of the works. \n19. Rejection \n19.1 The purchaser is permitted to inspect each length of \npipe received from the manufacturer and, if it does not meet the \nrequirements of this specification based upon the inspection \nand test method as outlined in the specification, the length shall \nbe rejected and the manufacturer shall be notified. Disposition \nof rejected pipe shall be a matter of agreement between the \nmanufacturer and the purchaser. \n19.2 Pipe found in fabrication or in installation to be \nunsuitable for the intended use, under the scope and require­\nments of this specification, shall be set aside and the manufac­\nturer notified. Such pipe shall be subject to mutual investiga­\ntion as to the nature and severity of the deficiency and the \n147 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0199.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6240,
  "bestTextAlphaRatio": 0.7474
}