{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 341,
  "globalPageIndex": 1139,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-609 /SA-609M \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirement shall be applied only when agreed upon between \nthe purchaser and the supplier to achieve an effective examination of a critical casting area \nthat cannot be effectively examined using a longitudinal beam as a result of casting design \nor possible discontinuity orientation. \nS1. Angle Beam Examination of Steel Castings \nS1.1 Equipment: \nS1.1.1 Examination Instrument- Examination shall \nbe conducted with an ultrasonic, pulsed-reflection type of \nsystem generating frequencies of at least 0.4 to 5 MHz. \nProperties of the electronic apparatus shall be the same as \nthose specified in 4.1. \nS1.1.2 Search Units - Angle-beam search units \nshall produce an angle beam ip. steel in the range from 30 \nto 75° inclusive, measured to the perpendicular of the entry \nsurface of the casting being examined. It is preferred that \nsearch units shall have frequency of 0.4 to 5 MHz. \nS1.1.3 Calibration Blocks - A set of blocks, as \nshown in Fig. 4, with as cast surface equivalent to SCRATA \nComparator A3 and of a thickness comparable to the sec­\ntions being examined with side-drilled holes at ¼t, ½t, and \n¾t (where t = thickness of the block) shall be used to \nestablish an amplitude reference line (ARL). \nSl.2 Calibration of Equipment: \nS1.2.1 Construct the distance amplitude correction \ncurve by utilizing the responses from the side-drilled holes \nin the basic calibration block for angle beam examination \nas shown in Fig. 4 and Table 5. \nS1.2.1.1 Resolve and mark the amplitudes of the \n¼t and ½t side-drilled holes from the same surface. The \nside-drilled hole used for the ¼t amplitude may be used \nto establish the ¾t amplitude from the opposite surface or \na separate hole may be used. \nS1.2.1.2 Connect the ¼t, ½t, and ¾t amplitudes to \nestablish the applicable DAC. \nS1.2.2 The basic calibration blocks shall be made \nof material that is acoustically similar to the casting being \nexamined. \nS1.2.3 Do not use basic calibration blocks with as \ncast surface equivalent to SCRA TA Comparator A3 to \nexamine castings with surface rougher than SCRATA \nComparator A3. Use a machined calibration block for \nmachined surfaces. \nS1.2.4 The search unit and all instrument control \nsettings remain unchanged except the attenuator or cali­\nbrated gain control. \nS1.2.4.1 The attenuator or calibrated gain control \nmay be used to change the signal amplitude during exami­\nnation to permit small amplitude signals to be more readily \ndetected. Signal evaluation is made by returning the attenu­\nator or calibrated gain control to its original setting. \nS1.3 Data Reporting - The supplier's report of final \nultrasonic examination shall contain the following data: \nS1.3.1 The total number, location, amplitude, and \narea of all indications equal to or greater than 100% of the \ndistance amplitude curve. \nS1.3.2 The examination frequency, type of instru­\nment, type, and size of search units employed, couplant, \ntransfer method, examination operator, supplier's identi­\nfying numbers, purchase order number, date, and author­\nized signature. \nS1.3.3 A sketch showing the physical outline of the \ncasting, including dimensions of all areas not examined \ndue to geometric configuration, with the location of all \nindications in accordance with S1.3.1. \nS1.4 Acceptance Standards - Acceptance quality lev­\nels shall be established between the purchaser and the \nmanufacturer on the basis of one or more of the following \ncriteria: \nS1.4.1 No indication equal to or greater than the \nDAC over an area specified for the applicable quality level \nof Table 2. \nS1.4.2 Other criteria agreed upon between the pur­\nchaser and the manufacturer. \n1045 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1139.json",
  "tabulaTablesCsv": "tables_tabula/page-1139.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1139.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3741,
  "bestTextAlphaRatio": 0.7648
}