{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 616,
  "globalPageIndex": 1414,
  "width": 613.92,
  "height": 793.2,
  "text": "SA·836/SA-836M ASME BPVC.II.A-2025 \nSpecification for \nTitanium-Stabilized Carbon Steel Forgings for Glass-Lined \nPiping and Pressure Vessel Service \n1. Scope \n1.1 This specification covers nonstandard as-forged fittings, \nvalve components, and parts for glass-lined piping and pres­\nsure vessel service. Mechanical properties are certified on the \nbasis of test material subjected to heat treatments to simulate \nglass-coating operations. \n1.2 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.3 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nA961/A961M Specification for Common Requirements for \nSteel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \n3. Ordering Information \n3.1 Product furnished to this specification shall conform to \nthe requirements of Specification A961/A961M, including any \nsupplementary requirements that are indicated in the purchase \norder. Failure to comply with the requirements of Specification \nA961/A961M constitutes non-conformance with this specifi­\ncation. \n3.2 It is the purchaser's responsibility to specify in the \npurchase order all ordering information necessary to purchase \nthe needed material. Examples of such information include but \nare not limited to the ordering information in Specification \nA961/A961M and the following: \n3.2.1 Supplementary requirements, and \n3.2.2 Additional requirements (see 11.1, 13.1, and 13.2). \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A961/A961M, the \nrequirements of this specification shall prevail. \n4. Materials and,Manufacture \n4.1 The material shall be forged by hammering, pressing, \nrolling, extruding, or upsetting, such that the finished product \nwill be a forging as defined in the Terminology Section of \nSpecification A 788/ A 788M. \n4.2 When specified in the order, the manufacturer shall \nsubmit for approval by the purchaser a sketch showing the \nshape of the rough forging before machining. \n4.3 Forgings shall be protected against sudden or too rapid \ncooling from the rolling or forging while passing through the \ncritical range. \n4.4 Heat treatment of forgings is neither required nor \nprohibited. However, the test material for qualifying the \nforging or the welding procedure shall be heat treated to \nsimulate glass-coating operations. \n5. Chemical Composition \n5.1 An analysis of each heat shall be made by the manufac­\nturer to determine the percentages of the elements specified in \nTable 1. The chemical composition thus determined shall \nconform to the requirements in Table 1. \n6. Mechanical Properties \n6.1 The test material shall conform to the requirements as to \ntensile properties prescribed in Table 2. \n1352 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1414.json",
  "tabulaTablesCsv": "tables_tabula/page-1414.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1414.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3539,
  "bestTextAlphaRatio": 0.7796
}