{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 604,
  "globalPageIndex": 1402,
  "width": 613.92,
  "height": 793.2,
  "text": "SA·832/SA·832M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, Alloy Steel, Chromium­\nMolybdenum-Vanadium \n1. Scope \n1.1 This specification covers chromium-molybdenum­\nvanadium alloy steel plates intended primarily for the fabrica­\ntion of welded pressure vessels. \n1.2 The plates furnished under this specification are re­\nquired to be normalized-and-tempered. Specification A542/ \nA542M includes coverage of the material in the quenched-and­\ntempered condition. \n1.3 The maximum thickness of plates furnished to this \nspecification is limited only by the capacity of the composition \nto meet the specified property requirements. \n1.4 The material is intended to be suitable for fusion \nwelding. Welding technique is of fundamental importance and \nit is presupposed that welding procedures will be in accordance \nwith approved methods. \n1.5 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the mate­\nrial shall be furnished to inch-pound units. \n1.6 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem must be used independentl.{ of the other. Combining \nvalues from the two systems may result in nonconformance \nwith the specification .. \n1.7 This jnternational standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA542/A542M Specification for Pressure Vessel Plates, Alloy \nSteel, Quenched-and-Tempered, Chromium-\nMolybdenum, and Chromium-Molybdenum-Vanadium \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3 .1 Material supplied to this material specification shall \nconform to Specification A20/A20M. These requirements out­\nline the testing and retesting methods and procedures, permis­\nsible variations in dimensions, quality and repair of defects, \nmarking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/ A20M. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/ A20M, the require­\nments of this specification shall prevail. \n4. Manufacture \n4.1 Steelmaking Process-The steel shall be made by one of \nthe processes permitted in Specification A20/A20M. \n1340 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1402.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3402,
  "bestTextAlphaRatio": 0.7878
}