{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 512,
  "globalPageIndex": 512,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-312/SA-312M (ASTM A312/A312M) ASME BPVC.II.A-2025 \nshall be at the option of the manufacturer, unless otherwise \nspecified in the purchase order. \n12.2 The hydrostatic test shall be in accordance with Speci­\nfication A999/A999M, unless specifically exempted under the \nprovisions of 12.3. \n12.3 For pipe whose dimensions equal or exceed NPSlO, \nthe purchaser, with the agreement of the manufacturer, is \npermitted to waive the hydrostatic test requirement when in \nlieu of such test the purchaser performs a system test. Each \nlength of pipe furnished without the completed manufacturer's \nhydrostatic test shall include with the mandatory markings the \nletters \"NH.\" \n12.4 The nondestructive electric test shall be in accordance \nwith Specification A999/A999M. \n13. Lengths \n13.1 Pipe lengths shall be in accordance with the following \nregular practice: \n13.1.1 Unless otherwise agreed upon, all sizes from NPS \n1/s to and including NPS 8 are available in a length up to 24 ft \nwith the permitted range of 15 to 24 ft. Short lengths are \nacceptable and the number and minimum length shall be \nagreed upon between the manufacturer and the purchaser. \n13.1.2 If definite cut lengths ate desired, the lengths re­\nquired shall be specified in the order. No pipe shall be under the \nspecified length and no pipe shall be more than ¼ in. [6 mm] \nover the specified length. \n13.1.3 No jointers are permitted unless otherwise specified. \n14. Workmanship, Finish, and Appearance \n14.1 The finished pipes shall be reasonably straight and \nshall have a workmanlike finish. Removal of imperfections by \ngrinding is permitted, provided the wall thicknesses are not \ndecreased to less than that permitted in the Permissible \nVariations in Wall Thickness section of Specification A999/ \nA999M. \n15. Repair by Welding \n15.1 For welded pipe whose diameter equals or exceeds \nNPS 6, and whose nominal wall thickness equals or exceeds \n0.200, it is permitted to make weld repairs to the weld seam \nwith the addition of compatible filler metal using the same \nprocedures specified for plate defects in the section on Repair \nby Welding of Specification A999/ A999M. \n15.2 Weld repairs of the weld seam shall not exceed 20 % of \nthe seam length. \n15.3 Weld repairs shall be made only with the gas tungsten­\narc welding process using the same classification of bare filler \nrod qualified to the most currentAWS SpecificationA5.9 as the \ngrade of stainless steel pipe being repaired and as shown in \nTable 6. Alternatively, subject to approval by the purchaser, \nweld repairs shall be made only with the gas tungsten-arc \nwelding process using a filler metal more highly alloyed than \nthe base metal when needed for corrosion resistance or other \nproperties. \n15 .4 Pipes that have had weld seam repairs with filler metal \nshall be uniquely identified and shall be so stated and identified \n460 \nTABLE 6 Pipe and Filler Metal Specification \nPipe \nUN8 Grade Designation \nTP201 \nTP201LN \nTP304 \nTP304L \nTP304N \nTP304LN \nTP304H \nTP309Cb \nTP3098 \nTP310Cb \nTP3108 \nTP316 \nTP316L \nTP316N \nTP316LN \nTP316H \nTP321 \nTP347 \nTP348 \nTPXM-19 \nTPXM-29 \nAlloy 20 \n800 \n800H \nAAW8 A5.14 Class. \n820100 \n820153 \n830400 \n830403 \n830451 \n830453 \n830409 \n830601 \n830940 \n830908 \n831040 \n831008 \n831266 \n831272 \n831600 \n831603 \n831651 \n831653 \n831655 \n831609 \n831730 \n831740 \n832100 \n834700 \n834800 \n822100 \n828300 \nN08367 \n835030 \nN08020 \nN08028 \nN08029 \n820400 \nN08800 \nN08810 \nN08811 \nN08925 \nN08926 \nFiller Metal \nAW8A5.9 UN8 Designation \nClass \nER308 830800, W30840 \nER308L 830883, W30843 \nER308 830880, W30840 \nER308L 830883, W30843 \nER308 830880, W30840 \nERNiCrMo-4 N10276 \nERNiCrMo-10 N06022 \nERNiCrMo-13 N06059 \nERNiCrMo-14 N06686 \nERNiCrMo-17 N06200 \nER316 831680, W31640 \nER316L 831683, W31643 \nER316 831680, W31640 \nER316L 831683, W31643 \nER316H 831680, W31640 \nERNiCr-3, or N06082, N06625,N10276 \nERNiCrMo-3, \nor \nERNiCrMo-4 \nERNiCrCoMo-1 N06617, N06625 \nor ERNiCrMo-3 \nER321 832180, W32140 \nER347 834780, W34740 \nER347 834780, W34740 \nER347 834780, W34740 \nER209 820980, W32240 \nER240 823980, W32440 \nN06625 \nERNICr-3 N06082 \nER320 N08021 \nER320LR N08022 \nER383 N08028 \nERNiCrMo-3A N06625 \nERNiCrMo-13A N06059 \nER209 820980, W32240 \nERNiCr-3A N06082 \nERNiCr-3A N06082 \nERNiCr-3A N06082 \nN06625 \nN06625 \non the certificate of tests. When filler metal other than that \nlisted in Table 6 is used, the filler metal shall be identified on \nthe certificate of tests. \n16. Certification \n16.1 In addition to the information required by Specification \nA999/ A999M, the certification shall state whether or not the \nmaterial was hydrostatically tested. If the material was nonde­\nstructively tested, the certification shall so state and shall state \nwhich standard practice was followed and what reference \ndiscontinuities were used. \n17. Marking \n17 .1 In addition to the marking specified in Specification \nA999/ A999M, the marking shall include the NPS (nominal ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0512.json",
  "tabulaTablesCsv": "tables_tabula/page-0512.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0512.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4930,
  "bestTextAlphaRatio": 0.6239
}