{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 192,
  "globalPageIndex": 192,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-53/SA-53M ASME BPVC.II.A-2025 \nSpecification for \nPipe, Steel, Black and Hot-Dipped, Zinc-Coated, Welded and \nSeamless \n1. Scope \n1.1 This specification covers seamless and welded black \nand hot-dipped galvanized steel pipe in NPS 1/s to NPS 26 [DN \n6 to DN 650] (Note 1), inclusive, with nominal wall thickness \n(Note 2) as given in Table X2.2 and Table X2.3. It shall be \npermissible to furnish pipe having other dimensions provided \nthat such pipe complies with all other requirements of this \nspecification. Supplementary requirements of an optional na­\nture are provided and shall apply only when specified by the \npurchaser. \nNoTE 1-The dimensionless designators NPS (nominal pipe size) [DN \n(diameter nominal)] have been substituted in this specification for such \ntraditional terms as \"nominal diameter,\" \"size,\" and \"nominal size.\" \nNoTE 2--The term nominal wall thickness has been assigned for the \npurpose of convenient designation, existing ill name only, and is used to \ndistinguish it from the actual wall thickness, which may vary over or \nunder the nominal wall thickness. \n1.2 This specification covers the following types and \ngrades: \n1.2.1 Type F-Fumace-butt-welded, continuous welded \nGrade A, \n1.2.2 Type &-Electric-resistance-welded, Grades A and B, \nand \n1.2.3 Type S-Seamless, Grades A and B. \nNoTE 3-See Appendix Xl for definitions of types of pipe. \n1.3 Pipe ordered under this specification is intended for \nmechanical and pressure applications and is also acceptable for \nordinary uses in steam, water, gas, and air lines. It is suitable \nfor welding, and suitable for forming operations involving \ncoiling, bending, and flanging, subject to the following quali­\nfications: \n1.3.1 Type Fis not intended for flanging. \n1.3.2 If Type S or Type Eis required for close coiling or \ncold bending, Grade A is the preferred grade; however, this is \nnot intended to prohibit the cold bending of Grade B pipe. \n1.3.3 Type E is furnished either nonexpanded or cold \nexpanded at the option of the manufacturer. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.5 The following precautionary caveat pertains only to the \ntest method portion, Sections 7, 8, 9, 13, 14, and 15 of this \nspecification: This standard does not purport to address all of \nthe safety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory requirements prior to use. \n1.6 The text of this specification contains notes or footnotes, \nor both, that provide explanatory material. Such notes and \nfootnotes, excluding those in tables and figures, do not contain \nany mandatory requirements. \n140 \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA90/A90M Test Method for Weight [Mass] of Coating on \nIron and Steel Articles with Zinc or Zinc-Alloy Coatings \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0192.json",
  "tabulaTablesCsv": "tables_tabula/page-0192.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0192.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3593,
  "bestTextAlphaRatio": 0.7682,
  "noteOcrPath": "note_ocr/page-0192.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0192.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": [],
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0192.txt",
  "gapOcrHighDpiLength": 3483,
  "camelotTablesPath": "camelot_tables/page-0192.json",
  "camelotTablesCsv": "camelot_tables/page-0192.csv",
  "camelotTableCount": 1
}