{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 257,
  "globalPageIndex": 1055,
  "width": 623.28,
  "height": 800.52,
  "text": "ASME BPVC.II.A-2025 SA-563 \n2.2 ANSI Standards: \nANSI B 1.1 Unified Screw Threads \nANSI Bl8.2.2 Square and Hex Nuts \n3. Ordering Information \n3.1 Orders for nuts under this specification shall include \nthe following: \n3.1.1 Quantity (number of nuts), \n3.1.2 Nominal size and thread series of nuts, \n3.1.3 Style of nut (for example, heavy hex), \n3.1.4 Grade of nut, \n3.1.5 Zinc Coating - Specify the zinc-coating pro­\ncess required, for example, hot-dip, mechanically depos­\nited, or no preference (see 4.7), \n3.1.6 Other Finishes - Specify other protective fin­\nish if required, \n3.1.7 ASTM designation and year of issue, and \n3.1.8 Supplementary or special requirements. \nNOTE 3 - An example of an ordering description follows: 1000 1/g-9 \nheavy hex nuts, Grade DH, hot-dip zinc-coated, and lubricated, ASTM \nA 563-XX. \n4. Materials and Manufacture \n4.1 Steel for nuts shall be made by the open-hearth, \nbasic-oxygen, or electric-furnace process except that steel \nfor Grades 0, A, and B nuts may be made by the acid­\nbessemer process. \n4.2 Nuts may be made cold or hot by forrning, pressing, \nor punching or may be machined from bar stock. \n4.3 Grades DH and DH3 nuts shall be heat treated by \nquenching in a liquid medium from a temperature above \nllie trarisfonnationtemperaturtTillld--tempering-at a-tempera~ \nture of at least 800°F. \n4.4 Grades C and D nuts made of steel having carbon \ncontent not exceeding 0.20%, phosphorus not exceeding \n0.04%, and sulfur not exceeding 0.05% by heat analysis \nmay be heat treated by quenching in a liquid medium from \na temperature above the transformation temperature and \nneed not be tempered. When this heat treatment is used, \nthere shall be particular attention to the requirements in \n6.1.1. \n4.5 Grades C, C3, and D nuts made of any steel permit­\nted for these grades may be heat treated by quenching in \na liquid medium from a temperature above the transforma­\ntion temperature and tempering at a temperature of at least \n800°F. \n4.6 Threads shall be formed by tapping or machining. \n4.7 Zinc Coatings, Hot-Dip and Mechanically \nDeposited: \n4.7.1 When zinc-coated fasteners are required, the \npurchaser shall specify the zinc coating process, for exam­\nple, hot-dip, mechanically deposited, or no preference. \n4.7.2 When hot-dip is specified, the fasteners shall \nbe zinc-coated by the hot-dip process in accordance with \nthe requirements of Specification F 2329. \n4.7.3 When mechanically deposited is specified, the \nfasteners shall be zinc coated by the mechanical deposition \nprocess in accordance with the requirements of Class 55 \nof Specification B 695. \n4.7.4 When no preference is specified, the supplier \nmay furnish either a hot-dip zinc coating in accordance \nwith Specification F 2329, or a mechanically deposited zinc \ncoating in accordance with Specification B 695, Class 55. \nThreaded components (bolts and nuts) shall be coated by \nthe same zinc-coating process and the supplier's option is \nlimited to one process per item with no mixed processes \nin a lot. \n4.7.5 Hot-dip zinc-coated nuts shall be tapped after \nzinc coating. \n4.7.6 Mechanically deposited zinc-coated nuts for \nassembly with mechanically deposited zinc-coated bolts \nshall be tapped oversize prior to zinc coating and need not \nbe retapped afterwards. \n4.8 Lubricant: \n4.8.1 Hot-dip and mechanically deposited zinc­\ncoated Grade DH nuts shall be provided with an additional \nlubricant which shall be clean and dry to the touch (see \nSupplementary Requirement S 1 to specify lubrication \nrequirements for plain finish nuts). \n4.8.2 See Supplementary Requirement S2 for option \nto specify a dye in the lubricant. \n5. Chemical Composition \n5.1 Grades 0, A, B, C, D, and DH shall conform to \nthe chemical composition specified in Table 1. \n955 \n5.2 Grades C3 and DH3 shall conform to the chemical \ncomposition specified in Table 2. See Guide G 101 for \nmethods of estimating the atmospheric corrosion resistance \nof low alloy steels. \n5.3 Resulfurized or rephosphorized steel, or both, are \nnot subject to rejection based on product analysis for sulfur \nor phosphorus. \n5.4 Application of heats of steel to which bismuth, \nselenium, tellurium, or lead has been intentionally added \nshall not be permitted for Grades D, DH, and DH3. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1055.json",
  "tabulaTablesCsv": "tables_tabula/page-1055.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1055.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4265,
  "bestTextAlphaRatio": 0.7414
}