{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 520,
  "globalPageIndex": 520,
  "width": 599.4,
  "height": 844.08,
  "text": "SA-320/SA-320M ASME BPVC.Il.A-2025 \nTABLE 2 Impact Test Temperatures and Properties \nTest Temperature CVN Specimen Section Min Average Impact Min Impact Value of a Single \nGrade \nL7M, L70, L71, L72, L73 \nL7, L7A, L7B, L7C, L43 \nL1 \n\"F \n-100 \n-150 \n-100 \n\"C \n-73 \n-101 \n-73 \nF436/F436M Specification for Hardened Steel Washers Inch \nand Metric Dimensions \nF606/F606M Test Methods for Determining the Mechanical \nProperties of Externally and Internally Threaded \nFasteners, Washers, Direct Tension Indicators, and Rivets \n2.2 ASME Standards: \nB 1.1 Screw Threads \nB18.21.l Washers: Helical Spring-Lock, Tooth Lock, and \nPlain Washers (Inch Series) \n3. Ordering Information \n3.l It is the purchaser's responsibility to specify in the \npurchase order all information necessary to purchase the \nneeded materials. Examples of such information include, but \nare not limited to, the following: \n3 .1.1 Quantity and size, \n3.1.2 Heat-treated condition, that is, for the austenitic stain­\nless steels, solution-treated (Class l); solution-treated after \nfinishing (Class IA); and annealed and strain-hardened (Class \n2), \n3.1.3 Description of items required (bars, bolts, screws, or \nstuds), \n3.1.4 Nuts and washers, if required by the purchaser, in \naccordance with Section 10, and \n3.1.5 Special requirements, in accordance with 5.1.1, 5.1.3, \n5.1.4, and 13.1. \n4. Common Requirements \n4.1 Bolting materials and bolting components supplied to \nthis specification shall conform to the requirements of Speci­\nfication A962/ A962M. These requirements include test \nmethods, finish, thread dimensions, macroetch ( carbon and \nalloy steels only) marking, certification, optional supplemen­\ntary requirements, and others. Failure to comply with the \nrequirements of Specification A962/ A962M constitutes non­\nconformance with this specification. In case of conflict be­\ntween the requirements in this specification and Specification \nA962/A962M, this specification shall prevail. \n5. Materials and Manufacture \n5.1 Heat Treatment: \n5.1.1 Bolting materials shall be allowed to cool to room \ntemperature after rolling or forging. Grades L7, L7A, L7B, \nL7C, L7M, L43, Ll, L70, L71, L72, and L73 shall be reheated \nSize, mm Toughness of Three Test Specimen of Set of Three, \nSpecimens, ft-lbf [J] ft-lbf [J] \n10 X 10 20 [27] 15 [20] \n10 X 7.5 16 [22] 12 [16] \n10 X 10 20 [27] 15 [20] \n10 X 7.5 16 [22] 12 [16] \n10 X 10 40 [54] 30 [41] \n10 X 7.5 32 [44] 24 [32] \nto above the upper critical temperature and liquid quenched \nand tempered. Grades B8, B8C, B8M, B8T, B8F, BSP, BSLN, \nand BSMLN shall receive a carbide solution treatment. Prod­\nucts made from such material are described as Class 1. This \nshall consist of holding the bolting material for a sufficient time \nat a temperature at which the chromium carbide will go into \nsolution and then cooling in air or in a liquid medium at a rate \nsufficient to prevent reprecipitation of the carbide. Bolting \nmaterial thus treated is described as Class 1. If specified in the \npurchase order, bolting material shall be solution treated in the \nfinished condition and shall be described as Class lA. \n468 \n5.1.2 Use of water quenching is prohibited for any ferritic \ngrade when heat treatment is performed after heading or \nthreading. \n5.1.3 When increased mechanical properties are desired, \naustenitic bolting shall be solution annealed and strain hard­\nened if specified in the purchase order; material so treated is \nidentified as Class 2. \n5 .1.4 If scale-free bright finish is required, this shall be \nspecified in the purchase order. \n5.1.5 For L7M bolting, the final heat treatment, which may \nbe the tempering or stress-relieving operation conducted at \n1150 °F [620 °C] minimum, shall be done after machining or \nrolling of the threads and any type of cutting. \n6. Mechanical Requirements \n6.1 Tensile Properties: \n6.1.1 Bolting material as represented by the tension speci­\nmens shall conform to the requirements as to tensile properties \nprescribed in Table 1 at room temperature after heat treatment \n(see 5.1.1). Alternatively, Class 2 Strain Hardened Headed \nBolting Components shall be tested full size after strain \nhardening to determine tensile strength and yield strength and \nshall conform to the requirements prescribed in Table 1. \nShould the results of full size tests conflict with results of \ntension specimen tests, full size test results shall prevail. \n6.1.2 Number of Tests: \n6.1.2.1 For heat-treated bars, one tension test and one \nimpact test consisting of three specimens shall be made for \neach diameter of each heat represented in each tempering \ncharge. When heat treated without interruption in continuous \nfurnaces, the material in a lot shall be the same heat, same prior \ncondition, same size, and subjected to the same heat treatment. \nNot fewer than two tensile tests and two impact tests are \nrequired for each lot containing 20 000 lbs [9000 kg] or less. \nEvery additional 10 000 lbs [4500 kg] or fraction thereof \nrequires an additional tensile test and impact test. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0520.json",
  "tabulaTablesCsv": "tables_tabula/page-0520.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0520.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5044,
  "bestTextAlphaRatio": 0.7215
}