{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 170,
  "globalPageIndex": 968,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-515/SA-515M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, Carbon Steel, for Intermediate- and \nHigher-Temperature Service \n1. Scope \n1.1 This specification covers carbon-silicon steel plates \nprimarily for intermediate- and higher-temperature service in \nwelded boilers and other pressure vessels. \n1.2 Plates under this specification are available in three \ngrades having different strength levels as follows: \nGrade U.S. [SI] Tensile Strength, ksi [MPa] \n60 [415] 6Q-80 [415-550] \n65 (450] 65-85 [450-585] \n70 [485] 70-90 [485-620] \n1.3 The maximum thickness of plates is limited only by the \ncapacity of the composition to meet the specified mechanical \nproperty requirements. \n1.4 For plates produced from coil and furnished without \nheat treatment or with stress relieving only, the additional \nrequirements, including additional testing requirements and the \nreporting of additional test results, of Specification A20/ A20M \napply. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelovment of International Standards. Guides and Recom­\nmendations iss~ed by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA435/ A435M Specification for Straight-Beam illtrasonic \nExamination of Steel Plates \nA577/A577M Specification for illtrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Plates supplied to this product specification shall con­\nform to Specification A20/ A20M. These requirements outline \nthe testing and retesting methods and procedures, permissible \nvariations in dimensions and mass, quality and repair of \ndefects, marking, loading, and ordering information. \n3 .2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhere additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/ A20M. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/A20M, the require­\nments of this specification shall prevail. \n868 \n3.4 Coils are excluded from qualification to this specifica­\ntion until they are processed into finished plates. Plates \nproduced from coil means pla1es that Imve-be-en-c-u~t ~t~o ______ _,__ \nindividual lengths from coil. The processor directly controls, or \nis responsible for, the operations involved in the processing of \ncoils into finished plates. Such operations include decoiling, \nleveling, cutting to length, testing, inspection, conditioning, \nheat treatment (if applicable), packaging, marking, loading for \nshipment, and certification. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0968.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3536,
  "bestTextAlphaRatio": 0.7721
}