{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 412,
  "globalPageIndex": 1210,
  "width": 612.48,
  "height": 792.0,
  "text": "SA·688/SA-688M . ASME BPVC.II.A·2025 \n6.2 Seamless Tubing: \n6.2.1 Seamless tubing shall be supplied from a cold finish­\ning process. Hot finishing as the final sizing process is not \nallowed. \n6.3 Welded Tubing: \n6.3.1 The tube shall be made from flat-rolled steel by an \nautomatic welding process with no addition of filler metal. \n6.3.2 Subsequent to welding and prior to final heat \ntreatment, the tubes shall be cold worked either in both the \nweld and base metal, or in the weld metal only. The method of \ncold work may be specified by the purchaser. When cold \ndrawn, the purchaser may specify the minimum amount of \nreduction in cross-sectional area or wall thickness, or both. \n6.4 Many surface contaminants may have detrimental ef­\nfects on high temperature properties or corrosion resistance of \ntubing. Contamination by copper, lead, mercury, zinc, \nchlorides, or sulfur may be detrimental to stainless steels. The \nmanufacturer shall employ techniques that minimize surface \ncontamination by these elements. \n7. Cleaning Before Annealing \n7 .1 All lubricants of coatings used in the manufacture of \nstraight-length tube or in the bending shall be removed from all \nsurfaces prior to any annealing treatments. U-bends on which \na lubricant had been applied to the inside surface during \nbending shall have the cleanness of their inside surface \nconfirmed by blowing close fitting acetone-soaked felt plugs \nthrough 10 % of the tubes of each bend radius. Dry, oil-free, air \nor inert gas shall be used to blow the plugs through the tubes. \nIf the plugs blown through any tube shows more than a light \ngray discoloration, all tubes that have had a lubricant applied to \nthe inside surface during bending shall be recleaned. After \nrecleaning 10 % of the tubes of each bend radius whose inside \nsurface had been subjected to bending lubricants shall be \nretested. \n8. Heat Treatment \n8.1 All finished straight tubing or straight tubing ready for \nU-bending shall be furnished in the solution-annealed condi­\ntion. The annealing procedure, except for N08367, S31254, \nS32654, N08810, N08811, and N08926, shall consist of \nheating the material to a minimum temperature of 1900 °P \n[1040 °C] followed by a rapid cooling to below 700 °P [370 \n°C]. The cooling rate shall be sufficiently rapid to prevent \nharmful carbide precipitation as determined in Section 13. \n8.2 UNS N08367 shall be solution annealed at 2025 °P \n[1107 °C] minimum followed by rapid quenching. \n8.3 N08926 shall be heat-treated at a minimum temperature \nof 2010 °P [1100 °C] followed by quenching in water or \nrapidly cooling by other means. \n8.4 S31254, S32654, and N08811 shall be solution annealed \nat 2100 °P [1150 °C] minimum followed by rapid quenching. \n8.5 N08810 shall be heat-treated to a minimum temperature \nof 2050 °P [1120 °C] minimum followed by rapid quenching. \n8.6 If heat treatment of U-bends is specified, it shall satisfy \nthe annealing procedure described above, and shall be done as \nfollows: \n8.6.1 The heat treatment shall be applied to the U-bend area \nplus approximately 6 in. [150 mm] of each leg beyond the \ntangent point of the U-bend. \n8.6.2 If the heat treatment specified in 8.6 is accomplished \nby resistance-heating methods wherein electrodes are clamped \nto the tubes, the clamped areas shall be visually examined for \narc bums. Burn indications shall be cause for rejection unless \nthey can be removed by local polishing without encroaching \nupon minimum wall thickness. \n8.6.3 Temperature control shall be accomplished through \nthe use of optical or emission pyrometers, or both. No \ntemperature-indicating crayons, lacquers, or pellets shall be \nused. \n8.6.4 The inside of the tube shall be purged with a protective \nor an inert gas atmosphere during heating and cooling to below \n700 °P [370 °C] to prevent scaling of the inside surface. The \natmosphere should be noncarburizing. \n9. Surface Condition \n9.1 The straight tubes, after final annealing, shall be pickled \nusing a solution of nitric and hydrofluoric acids followed by \nflushing and rinsing in water. If bright annealing is performed, \nthis requirement does not apply. \n9.2 Alight oxide scale on the outside surface ofU-bend area \nshall be permitted for tubes which have been electric-resistance \nheat treated after bending. \n10. Chemical Composition \n10.1 Product Analysis: \n10.1.1 When requested in the purchase order, a product \nanalysis shall be made by the supplier from one tube or coil of \nsteel per heat. The chemical composition shall conform to the \nrequirements shown in Table 1. \n10.1.2 A product analysis tolerance of Specification A480/ \nA480M shall apply. The product analysis tolerance is not \napplicable to the carbon content for material with a specified \nmaximum carbon of 0.04 % or less. \n10.1.3 If the original test for product analysis fails, retests of \ntwo additional lengths of flat-rolled stock or tubes shall be \nmade. Both retests, for the elements in question, shall meet the \nrequirements of this specification; otherwise all remaining \nmaterial in the heat or lot shall be rejected, or at the option of \nthe producer, each length of flat-rolled stock or tube may be \nindividually tested for acceptance. Lengths of flat-rolled stock \nor tubes that do not meet the requirements of this specification \nshall be rejected. \n11. Mechanical Requirements \n11.1 Tensile Properties: \n11.1.1 The material shall conform to the tensile properties \nshown in Table 2. \n11.1.2 One tension test shall be made on a specimen for lots \nof not more than 50 tubes. Tension tests shall be made on \nspecimens from two tubes for lots of more than 50 tubes. \n11.2 Hardness: \n11.2.1 Grade TP XM-29 and N08367 tubes shall have a \nhardness number not exceeding 100 HRB or its equivalent. \nTubes of all other grades shall have a hardness number not \n1122 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1210.json",
  "tabulaTablesCsv": "tables_tabula/page-1210.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1210.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5833,
  "bestTextAlphaRatio": 0.7451
}