{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 667,
  "globalPageIndex": 1465,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-961/SA-961M \n16.1.4 Repair by welding shall not exceed 10 % of the \nsurface area of the part, or 33 1/3 % of the wall thickness of the \nfinished product, or 3/s in. [10 mm] deep at the location of the \nrepair. \n16.2 The weld repair shall conform to 9.2 and to the \nadditional requirements, if any, invoked in the Product Speci­\nfication. \n17. Inspection \n17 .1 The supplier shall afford the purchaser's inspector all \nreasonable facilities necessary to satisfy him that the material \nis being produced and furnished in accordance with the general \nspecification and the applicable product specification. Site \ninspection by the purchaser shall not interfere unnecessarily \nwith the supplier's operations. \n18. Rejection and Rehearing \n18.1 Samples representing material rejected by the pur­\nchaser shall be preserved until disposition of the claim has been \nagreed upon between the manufacturer and the purchaser. \n18.2 Material that shows injurious defects subsequent to its \nacceptance at the manufacturer's works will be rejected, and \nthe manufacturer shall be notified. \n19. Certification \n19 .1 A test report and a certificate of compliance are \nrequired. \n19.2 Test reports shall include the product specification \nnumber and year/date of issue, the results of all tests required \nby this specification, and the purchaser order, and shall be \ntraceable to the part represented. \n19.3 A single document, containing the test report informa­\ntion and certificate of compliance information may be used. \n19 .4 A certificate printed from or used in electronic data \ninterchange (EDI) transmission shall be regarded as having the \nsame validity as a counterpoint printed in the certifier's facility. \nThe content of the EDI transmitted document shall conform to \nany existing EDI agreement between the purchaser and sup­\nplier. \n19.5 Not withstanding the absence of a signature, the \norganization submitting either a printed certificate or an EDI \ntransmitted certificate is responsible for the content of the \nreport. \n20. Marking \n20.1 Each piece shall be legibly marked in a position as not \nto injure the usefulness of the forgings with the product \nspecification number, grade or marking symbol, class, certify­\ning organization's name or symbol, the heat number or heat \nidentification, size, and service rating, if applicable. Dual or \nmultiple marking with the product specification number, grade \nor marking symbol, and class is acceptable provided the \nmaterial meets all the requirements with which it is marked. It \nis not required to mark the product with the specification year \nand date of issue. When size or shape does not permit the \ninclusion of all the required marking as described, see 20.2. \nManufacturer can also choose the use of tags, box labels, etc. \nfor identification when per piece marking is not practical due to \nsize or shape. \n20.2 The Standard Marking System of Valves, Fittings, \nFlanges and Unions MSS SP 25 shall be followed except the \nword \"steel\" shall not be substituted for the specification grade. \n20.3 Product marking shall conform to the additional \nrequirements, if any, invoked in the product specification or \npurchase order. \n21. Packaging, Marking and Loading for Shipment \n21.1 Packaging, marking, and loading for shipment shall be \nin accordance with Practices A700. \n22. Keywords \n22.1 alloy steel; carbon steel; fittings; flanges; forgings; \ngeneral requirement; piping applications; pressure containing \nparts; stainless steel; temperature service applications­\nelevated; temperature service applications-high; valves \nSUPPLEMENTARY REQUIREMENTS \nThese requirements shall not be considered unless specified in the order, in which event, the \nsupplementary requirements specified shall be made at the place of manufacture, unless otherwise \nagreed upon, at the purchaser's expense. The test specified shall be witnessed by the purchaser's \ninspector before shipment of material, if so specified in the order. The rationale for beginning the \nsection numbering with S50 is to eliminate the possibility of confusion with supplementary \nrequirements existing in individual product specifications. \nSSO. Macroetch Test \nS50.l A sample forging shall be sectioned and etched to \nshow flow lines and internal imperfections. The test shall be \nconducted according to Method E381. \nS50.2 Acceptance limits shall be as agreed upon between \nthe certifying organization and the purchaser. \nSSl. Heat Analysis \nS5 l.1 When secondary melting processes are employed, a \nheat analysis shall be obtained from each remelted ingot, or the \nproduct of each remelted ingot, from each primary melt. The \nchemical analysis thus determined shall conform to the require­\nments of the individual product specification. Note that the \n1407 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1465.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4794,
  "bestTextAlphaRatio": 0.7822
}