{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 179,
  "globalPageIndex": 179,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-36/SA-36M \nTABLE 1 Appurtenant Material Specifications \nNoTE 1-The specifier should be satisfied of the suitability of these \nmaterials for the intended application. Chemical composition or mechani­\ncal properties, or both, may be different than specified in A36/A36M. \nMaterial \nSteel rivets \nBolts \nHigh-strength bolts \nSteel nuts \nCast steel \nForgings ( carbon \nsteel) \nHot-rolled sheets \nand strip \nCold-formed tubing \nHot-formed tubing \nAnchor bolts \nASTM Designation \nA502, Grade 1 \nA307, Grade A or F568M, Class 4.6 \nF3125/F3125M, Grade A325 or A325M \nA563 or A563M \nA27/A27M, Grade 65-35 [450--240] \nA668/A668M, Class D \nA1011/A1011M, SS Grade 36 [250] Type 1 or Type 2 or \nA1018/A1018M, SS Grade 36 [250] Type 1 or Type 2 \nA500, Grade B \nA501 \nF1554, Grade 36 \nF3125/F3125M Specification for High Strength Structural \nBolts and Assemblies, Steel and Alloy Steel, Heat Treated, \nInch Dimensions 120 ksi and 150 ksi Minimum Tensile \nStrength, and Metric Dimensions 830 MPa and 1040 MPa \nMinimum Tensile Strength \n3. Appurtenant Materials \n3.1 When components of a steel structure are identified with \nthis ASTM designation but the product form is not listed in the \nscope of this specification, the material shall conform to one of \nthe standards listed in Table 1 unless otherwise specified by the \npurchaser. \n4. General Requirements for Delivery \n4.1 . Structural products furnished under this specification \nshall conform to the requirements of the current edition of \nSpecification A6/ A6M, for the specific structural product \nordered, unless a conflict exists in which case this specification \nshall prevail. \n4.2 Coils are excluded from qualification to this specifica­\ntion until they are processed into a finished structural product. \nStructural products produced from coil means structural prod­\nucts that have been cut to individual lengths from a coil. The \nprocessor directly controls, or is responsible for, the operations \ninvolved in the processing of a coil into a finished structural \nproduct. Such operations include decoiling, leveling or \nstraightening, hot-forming or cold-forming (if applicable), \ncutting to length, testing, inspection, conditioning, heat treat­\nment (if applicable), packaging, marking, loading for shipment, \nand certification. \nNoTE 1-For structural products produced from coil and furnished \nwithout heat treatment or with stress relieving only, two test results are to \nbe reported for each qualifying coil. Additional requirements regarding \nstructural products produced from coil are described in Specification \nA6/A6M. \nTABLE 2 Tensile RequirementsA \nPlates, Shapes, 8 and Bars: \nTensile strength, ksl [MPa] \nYield point, min, ksi [MPa] \nPlates and Bars: 0 ,E \n58-80 [ 400--550] \n36 [250]c \nElongation in 8 in. [200 mm], min,% 20 \nElongation in 2 in. [50 mm], min, % 23 \nShapes: \nElongation in 8 in. [200 mm], min, % 20 \nElongation in 2 in. [50 mm], min, % 21 8 \nA See the Orientation subsection in the Tension Tests section of Specification \nA6/A6M. \n8 For wide flange shapes with flange thickness over 3 in. [75 mm], the 80 ksi [550 \nMPa] maximum tensile strength does not apply and a minimum elongation in 2 In. \n[50 mm] of 19 % applies. \ncvield point 32 ksi [220 MPa] for plates over 8 in. [200 mm] in thickness. \n0 Elongation not required to be determined for floor plate. \nE For plates wider than 24 in. [600 mm], the elongation requirement is reduced two \npercentage points. See the Elongation Requirement Adjustments subsection \nunder the Tension Tests section of Specification A6/A6M. \n5. Bearing Plates \n5.1 Unless otherwise specified, plates used as bearing plates \nfor bridges shall be subjected to mechanical tests and shall \nconform to the tensile requirements of Section 8. \n5.2 Unless otherwise specified, mechanical tests shall not be \nrequired for plates over 1 ½ in. [40 mm] in thickness used as \nbearing plates in structures other than bridges, subject to the \nrequirement that they shall contain 0.20 to 0.33 % carbon by \nheat analysis, that the chemical composition shall conform to \nthe requirements of Table 3 in phosphorus and sulfur content, \nand that a sufficient discard shall be made to secure sound \nplates. \n6. Materials and Manufacture \n6.1 The steel shall be killed. \n7. Chemical Composition \n7 .1 The heat analysis shall conform to the requirements \nprescribed in Table 3, except as specified in 5.2. \n7.2 The steel shall conform on product analysis to the \nrequirements prescribed in Table 3, subject to the product \nanalysis tolerances in Specification A6/ A6M. \n8. Tension Test \n127 \n8.1 The material as represented by the test specimen, except \nas specified in 5.2 and 8.2, shall conform to the requirements as \nto the tensile properties prescribed in Table 2. \n8.2 Shapes less than 1 in.2 [645 mm 2 ] in cross section and \nbars, other than flats, less than½ in. [12.5 mm] in thickness or \ndiameter need not be subjected to tension tests by the \nmanufacturer, provided that the chemical composition used is \nappropriate for obtaining the tensile properties in Table 2. \n9. Keywords \n9.1 bars; bolted construction; bridges; buildings; carbon; \nplates; riveted construction; shapes; steel; structural steel; \nwelded construction ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0179.json",
  "tabulaTablesCsv": "tables_tabula/page-0179.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0179.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5136,
  "bestTextAlphaRatio": 0.732
}