{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 765,
  "globalPageIndex": 765,
  "width": 614.16,
  "height": 855.0,
  "text": "ASME BPVC.II.A-2025 SA-426/SA-426M \n15. Rejection \n15.1 Each length of pipe received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of the specification based on the inspection and \ntest method as outlined in the specification, the pipe may be \nrejected and the manufacturer shall be notified. Disposition of \nrejected pipe shall be a matter of agreement between the \nmanufacturer and the purchaser. \n16. Product Marking \n16.1 Each length of pipe shall be legibly marked with the \nmanufacturer's name or brand, the specification number and \ngrade. In addition, heat numbers or serial numbers that are \ntraceable to heat numbers shall be marked on each length of \npipe. \n17. Keywords \n17 .1 alloy steel; centrifugal; ferritic; high-temperature ser­\nvice; pipe; stainless steel; steel castings \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall be applied only when specified by the purchaser. Details of the \nsupplementary requirements shall be agreed upon between the manufacturer and purchaser. The \nspecified tests shall be performed by the manufacturer prior to shipment of the castings. \nS1. Additional Tension Tests \nSl.1 Additional tension tests shall be made at a temperature \nto be specified by the customer, and the properties to be met are \na matter of agreement between the purchaser and manufacturer. \nS2. Flattening Test \nS2.1 The flattening test shall be made on specimens from \none or both ends of each length of pipe. If the specimen from \nany end of any length fails to conform to the requirements of \nSpecification A999/A999M, that length shall be rejected. \nS3. Photomicrographs \nS3.l The manufacturer shall furnish one photomicrograph at \n100 diameters from one specimen of as-finished pipe from each \nheat in each heat-treatment lot. Such photomicrographs shall \nbe suitable identified as to pipe size, wall thickness, and heat. \nSuch photomicrographs are for information only, to show the \nactual metal strncture of the pipe as furnished. No photomi­\ncrographs for the individual pieces purchased shall be required \nexcept as specified in Section S4. \nS4. Photomicrographs for Individual Pieces \nS4.1 The manufacturer shall furnish photomicrographs from \none or both ends of each pipe. All photomicrographs required \nshall be properly identified as to heat number, size, and wall \nthickness of pipe from which the section was taken. Photomi­\ncrographs shall be further identified to permit association of \neach photomicrograph with the individual length of pipe it \nrepresents. \nSS. Metal Structure and Etching Tests \nS5.l Etching tests shall be made on transverse sections from \nthe pipe and shall reveal the macrostrncture of the material. \nSuch tests are for information only. \nS6. Radiographic Examination \nS6.l The castings shall be examined for internal defects by \nmeans of X rays or gamma rays. The inspection procedure shall \nbe in accordance with Guide E94 and the types and degrees of \ndiscontinuities considered shall be judged by Reference Radio­\ngraphs El86, E280, or E446. The extent of the examination \nand the basis for acceptance shall be subject to agreement \nbetween the manufacturer and the purchaser. \nS7. Liquid Penetrant Examination \nS7.l The castings shall be examined for surface discontinui­\nties by means of liquid penetrant inspection. The method of \npeiforming the liquid penetrant test shall be in accordance with \nPractice El65. The areas to be inspected, the methods and \ntypes of liquid penetrants to be used, the developing procedure, \nand the basis for acceptance shall be as specified on the inquiry \nor invitation to bid and on the purchase order or contract or \nboth, or as agreed upon between the manufacturer and pur­\nchaser. \nS8. Magnetic Particle Inspection \nS8.1 The castings shall be examined by magnetic particle \ninspection. The inspection procedure used shall be in accor­\ndance with Practice E709. The extent of examination and the \nbasis for acceptance shall be subject to agreement between the \nmanufacturer and the purchaser. \n715 \nS9. Ultrasonic Inspection \nS9.l The castings shall be examined ultrasonically in accor­\ndance with Practice A609/ A609M. The extent of the examina­\ntion and the basis of acceptance shall be subject to agreement \nbetween the manufacturer and the purchaser. \nS10. Residual Elements \nS 10.1 An analysis for the elements specified in Table S 1.1 \nshall be included in those analyses specified in Section 6. The \nchemical composition thus determined shall conform to the \nrequirements of Table S 1.1. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0765.json",
  "tabulaTablesCsv": "tables_tabula/page-0765.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0765.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4566,
  "bestTextAlphaRatio": 0.7869
}