{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 223,
  "globalPageIndex": 223,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-106/SA-106M \n3. Ordering Information \n3.1 The inclusion of the following, as required will describe \nthe desired material adequately, when ordered under this \nspecification: \n3.1.1 Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material (seamless carbon steel pipe), \n3.1.3 Grade (Table 1), \n3.1.4 Manufacture (hot-finished or cold-drawn), \n3.1.5 Size (NPS [DN] and weight class or schedule number, \nor both; outside diameter and nominal wall thickness; or inside \ndiameter and nominal wall thickness), \n3.1.6 Special outside diameter tolerance pipe (16.2.2), \n3.1.7 Inside diameter tolerance pipe, over 10 in. [250 mm] \nID (16.2.3), \n3.1.8 Length (specific or random, Section 17), \n3.1.9 Optional requirements (Sl to S9), \n3.1.10 Test report required (Section on Certification of \nSpecification A530/ A530M), \n3.1.11 Specification designation (A106 or A106M, includ­\ning year-date), \n3.1.12 End use of material, \n3.1.13 Hydrostatic test in accordance with Specification \nA530/A530M or 13.3 of this specification, or NDE in accor­\ndance with Section 14 of this specification. \n3.1.14 Special requirements. \n4. Process \n4.1 The steel shall be killed steel, with the primary melting \nprocess being open-hearth, basic-oxygen, or electric-furnace, \npossibly combined with separate degassing or refining. If \nsecondary melting, using electroslag remelting or vacuum-arc \nremelting is subsequently employed, the heat shall be defined \nas all of the ingots remelted from a single primary heat. \n4.2 Steel cast in ingots or strand cast is permissible. When \nsteels of different grades are sequentially strand cast, identifi­\ncation of the resultant transition material is required. The \nproducer shall remove the transition material by any estab­\nlished procedure that positively separates the grades. \nTABLE 1 Chemical Requirements \nComposition, % \nGrade A Grade B Grade C \nCarbon, max 0.25A 0.30 8 0.35 8 \nManganese 0.27-0.93 0.29-1.06 0.29-1.06 \nPhosphorus, max 0.035 0.035 0.035 \nSulfur, max 0.035 0.035 0.035 \nSilicon, min 0.10 0.10 0.10 \nChromium, max 0 0.40 0.40 0.40 \nCopper, max 0 0.40 0.40 0.40 \nMolybdenum, max 0 0.15 0.15' 0.15 \nNickel, max 0 0.40 0.40 0.40 \nVanadium, max 0 0.08 0.08 0.08 \nA For each reduction of 0.01 % below the specified carbon maximum, an increase \nof 0.06 % manganese above the specified maximum will be permitted up to a \nmaximum of 1.35 %. \n8 Unless otherwise specified by the purchaser, for each reduction of 0.01 % below \nthe specified carbon maximum, an Increase of 0.06 % manganese above the \nspecified maximum will be permitted up to a maximum of 1.65 %. \n0 These five elements combined shall not exceed 1 %. \n4.3 For pipe NPS 1 ½ [DN 40] and under, it shall be \npermissible to furnish hot finished or cold drawn. \n4.4 Unless otherwise specified, pipe NPS 2 [DN 50] and \nover shall be furnished hot finished. When agreed upon \nbetween the manufacturer and the purchaser, it is permissible \nto furnish cold-drawn pipe. \n5. Heat Treatment \n5.1 Hot-finished pipe need not be heat treated. When hot­\nfinished pipe is heat treated, it shall be heat treated at a \ntemperature of 1200 °F [650 °C] or higher. \n5.2 Cold-drawn pipe shall be heat treated after the final cold \ndraw pass at a temperature of 1200 °F [650 °C] or higher. \n6. General Requirements \n6.1 Material furnished to this specification shall conform to \nthe applicable requirements of the current edition of Specifi­\ncation A530/A530M unless otherwise provided herein. \n7. Chemical Composition \n7 .1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n8. Heat Analysis \n8.1 An analysis of each heat of steel shall be made by the \nsteel manufacturer to determine the percentages of the ele­\nments specified in Section 7. If the secondary melting pro­\ncesses of 5.1 are employed, the heat analysis shall be obtained \nfrom one remelted ingot or the product of one remelted ingot \nof each primary melt. The chemical composition thus \ndetermined, or that determined from a product analysis made \nby the manufacturer, if the latter has not manufactured the \nsteel, shall be reported to the purchaser or the purchaser's \nrepresentative, and shall conform to the requirements specified \nin Section 7. \n171 \n9. Product Analysis \n9.1 At the request of the purchaser, analyses of two pipes \nfrom each lot (see 20.1) shall be made by the manufacturer \nfrom the finished pipe. The results of these analyses shall be \nreported to the purchaser or the purchaser's representative and \nshall conform to the requirements specified in Section 7. \n9.2 If the analysis of one of the tests specified in 9.1 does \nnot conform to the requirements specified in Section 7, \nanalyses shall be made on additional pipes of double the \noriginal number from the same lot, each of which shall \nconform to requirements specified. \n10. Tensile Requirements \n10.1 The material shall conform to the requirements as to \ntensile properties given in Table 2. \n11. Bending Requirements \n11.1 For pipe NPS 2 [DN 50] and under, a sufficient length \nof pipe shall stand being bent cold through 90° around a \ncylindrical mandrel, the diameter of which is twelve times the \noutside diameter (as shown in ASME B 36.lOM) of the pipe, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0223.json",
  "tabulaTablesCsv": "tables_tabula/page-0223.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0223.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5262,
  "bestTextAlphaRatio": 0.71
}