{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 250,
  "globalPageIndex": 250,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-178/SA-178M (ASTM A178/A178M) ASME BPVC.II.A-2025 \n11. Mechanical Tests Required \n11.1 Flattening Test: \n11.1.1 For Grade A, one flattening test shall be made on \nspecimens from each of two tubes from each lot (Note 2) or \nfraction thereof, and from each 2000 ft [600 m] or fraction \nthereof of safe-end material. \n11.1.2 For Grades C and D, one flattening test shall be made \non specimens from each of two tubes from each lot (Note 2) or \nfraction thereof. \n11.2 Flange Test: \n11.2.1 For Grade A, one flange test shall be made on \nspecimens from each of two tubes from: each lot (Note 2) or \nfraction thereof, and from each 2000 ft [600 m] or fraction \nthereof of safe-end material. \n11.2.2 For Grades C and D, one flange test shall be made on \nspecimens from each of two tubes from each lot (Note 2) or \nfraction thereof. The width of the flange shall not be less than \n75 % of that specified in Specification A450/A450M. \n11.3 Crush Test-For Grade A, when required by the \npurchaser, one crush test shall be made on specimens from \neach of two tubes from each lot (Note 2) or fraction thereof, \nand from each 2000 ft [600 m] or fraction thereof of safe-end \nmaterial. \n11.4 Tension Test-For Grades C and D, one tension test \nshall be made on specimens from each of two tubes from each \nlot. The term lot for tension test requirements applies to all \ntubes prior to cutting, of the same nominal diameter and wall \nthickness, which are produced from the same heat of steel. \nWhen final heat treatment is in a batch-type furnace, a lot shall \ninclude only those tubes of the same size and the same heat \nwhich are heat treated in the same furnace charge. When the \nfinal heat treatment is in a continuous furnace, a lot shall \ninclude all tubes of the same size and heat, heat treated in the \nsame furnace, at the same temperature, time at heat, and \nfurnace speed. \n11.5 Reverse Flattening Test-One reverse flattening test \nshall be made on each 1500 ft [450 m] of finished tubing. \n11.6 Hydrostatic or Nondestructive Electric Test-Each \ntube shall be subjected to either the hydrostatic or the nonde­\nstructive electric test. The purchaser may specify which test is \nto be used. \n12. Forming Operations \n12.1 When inserted in the boiler, tubes shall withstand \nexpanding and beading without showing cracks or flaws, or \nopening at the weld. When properly manipulated, superheater \ntubes shall withstand all forging, welding, and bending opera­\ntions necessary for application without developing defects. \n13. Product Marking \n13.1 In addition to the marking prescribed in Specification \nA450/ A450M, the letters \"ERW'' shall be legibly stenciled on \neach tube, or marked on a tag attached to the bundle or box in \nwhich the tubes are shipped. \n13.2 The manufacturer's name or symbol may be placed \npermanently on each tube by rolling or light stamping before \nnormalizing. If a single stamp is placed on the tube by hand, \nthis mark should not be less than 8 in. [200 mm] from one end \nof the tube. \n14. Keywords \n14.1 boiler tube; resistance welded steel tube; steel tube, \ncarbon; welded steel tube \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements may become a part of the specification when specified \nin the inquiry or invitation to bid, and production order or contract. These requirements shall not be \nconsidered, unless specified in the order and the necessary tests shall be made at the mill. \nSl. Additional Testing of Welded Tubing for ASME Re­\nquirements \nSl.1 The weld seam of each tube shall be subjected to an \nultrasonic inspection employing Practices E273 or E213 with \nthe rejection criteria referenced in Specification A450/A450M. \nS 1.2 If Practice E273 is employed, a 100 % volumetric \ninspection of the entire length of each tube shall also be \nperformed using one of the nondestructive electric tests per­\nmitted by Specification A450/ A450M. \nS 1.3 The test methods described in the supplement may not \nbe capable of inspecting the end portions of tubes. This \ncondition is referred to as end effect. This portion, as deter­\nmined by the manufacturer, shall be removed and discarded. \nS 1.4 In addition to the marking prescribed in Specification \nA450/A450M, \"Sl\" shall be added after the grade designation. \n198 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-0250.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4263,
  "bestTextAlphaRatio": 0.7429,
  "noteOcrPath": "note_ocr/page-0250.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0250.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": [],
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0250.txt",
  "gapOcrHighDpiLength": 4222,
  "camelotTablesPath": "camelot_tables/page-0250.json",
  "camelotTablesCsv": "camelot_tables/page-0250.csv",
  "camelotTableCount": 1
}