{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 439,
  "globalPageIndex": 439,
  "width": 596.16,
  "height": 841.8,
  "text": "ASME BPVC.II.A-2025 SA-265 \n3.1.3 alloy cladding-the nickel or nickel-base alloy com­\nponent of the composite plate. \n3.1.4 base metal (backing steel)-component to which the \nalloy cladding is applied, usually the greater percentage of the \ncomposite plate and usually consisting of carbon or low-alloy \nsteel. \n3.1.5 integrally and continuously bonded-the process by \nwhich the alloy cladding and base metal are brought together to \nform a metallurgical bond at essentially the entire interface of \nthe two metals by means other than those processes that do not \nproduce a homogeneous composite plate. \n4. Ordering Information \n4.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for material ordered under this \nspecification. Such requirements may include, but are not \nlimited to the following: \n4.1.1 Quantity (weight or number of pieces). \n4.1.2 Heat treatment, if required (see Section 5). \n4.1.3 Dimensions, including the thickness of the cladding \nalloy and the backing steel, or of the total composite plate and \nif more or less restrictive thickness tolerances apply. \n4.1.4 Cladding alloy specification (see Section 6). \n4.1.5 Base metal specification (see Section 6). \n4.1.6 Product analysis, if required. Specify whether appli­\ncable to the cladding alloy, backing steel, or both (see Section \n10). \n4.1.7 Mechanical Properties (see Sections 7, 13, and 14). \n4.1.8 Restrictions, if required, on repair by welding (see \nSection 14). \n4.1.9 Additions to the specification or special requirements \nsuch as applicable constmction code rules. \n4.1.10 Corrosions tests, if required. \n4.1.11 Notification when the cladding alloy is to be used for \ninclusion in the design strength calculations for an applicable \nconstruction code. \nN OTB I-Construction codes may dictate certain fabrication require­\nments when the cladding is used in the design calculations that may be \ndifferent than if the cladding is used for corrosion resistance only. This \nmay be particularly important when the alloy cladding involves the use of \nwelded components in the explosion bonded clad manufacturing process. \nIt is incumbent on the purchaser to make the clad manufacturer aware of \nany such restrictions or applications at time of order. \n4.2 In addition to the basic requirements of this specification \nand the backing steel specification, certain supplementary \nrequirements are available when additional control, testing, or \nexamination is required to meet end use requirements. The \npurchaser is referred to the listed supplementary requirements \nin this specification and to the detailed requirements in \nSpecification A20/ A20M. \n4.2.1 Nondestructive examination, \n4.2.2 Impact testing, and \n4.2.3 Simulated Post-Weld Heat Treatment of Mechanical \nTest Coupons (SPWHT). \n4.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/A20M, the require­\nments of this specification shall prevail. \n4.4 Special tests. \n5. Materials and Manufacture \n5.1 Process: \n5.1.1 The steel shall be made by the open-hearth, electric­\nfurnace (with separate degassing and refining optional), or \nbasic-oxygen processes, or by secondary processes whereby \nsteel made from these primary processes is remelted using, but \nnot limited to electroslag remelting or vacuum arc remelting \nprocesses. \n5.1.2 The cladding metal may be metallurgically bonded to \nthe base metal by any method that will produce a clad steel that \nwill conform to the requirements of this specification. \n5.1.3 For explosively bonded products, the alloy cladding \nmetal may be comprised of two or more separnte alloy plates \nor sheets completely welded together to form a single fabri­\ncated component. \n5.2 Heat Treatment-Unless a specific heat treatment is \nrequired by the cladding matelial or base steel specification, or \nunless otherwise agreed upon by the purchaser and \nmanufacturer, the clad plate shall be furnished in a condition \nthat is appropriate for the cladding alloy, base metal, or both. \n6. Chemical Composition \n6.1 The composite plate may conform to any desired com­\nbination cladding metal and base metal as described in 6.2 and \n6.3, and as agreed upon between the purchaser and the \nmanufacturer. \n6.2 Cladding Metal-The nickel or nickel-base alloy clad­\nding metal specified shall conform to the requirements as to \nchemical composition prescribed for the respective metal in \nSpecifications B127, Bl 62, Bl 68, B333, B409, B424, B443, \nB463, B575, B582, and B625, or other nickel-base alloy as \nagreed upon by the purchaser and manufacturer. \n6.3 Base Metal-The base metal shall be carbon steel or \nlow-alloy steel conforming to the ASTM specifications for \nsteels for either pressure vessels or general structural \napplications, or other, as agreed upon by the purchaser and \nmanufacturer. The base metal shall conform to the chemical \nrequirements of the specification to which it is ordered. \n387 \n7. Mechanical Properties \n7.l Tensile Requirements: \n7 .1.1 The tensile properties shall be determined by a tension \ntest of the composite plate for clad plates that meet all of the \nfollowing conditions. \n( 1) The nominal composite gage is less than or equal to 1 ½ \nin (38 mm). \nTABLE 1 Weights for Component Materials \nSteel \nNickel \nNickel-copper alloy \nNickel-chromium-iron \nalloy \nDensity \nlb/in. 3 g/cm 3 \n0.283 \n0.321 \n0.319 \n0.307 \n7.83 \n8.88 \n8.83 \n8.49 \nWeight per Square \nFoot for Material \n1 in. (25.4 mm) \nin Thickness, lb \n40.80 \n46.22 \n45.94 \n44.21 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0439.json",
  "tabulaTablesCsv": "tables_tabula/page-0439.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0439.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5534,
  "bestTextAlphaRatio": 0.7524
}