{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 163,
  "globalPageIndex": 163,
  "width": 626.4,
  "height": 803.04,
  "text": "ASME BPVC.II.A-2025 SA-29/SA-29M \nTABLE 5 Permissible Variations for Product Analysis of Carbon \nSteel \nLimit, or Maximum of Over Under \nElement Maximum Minimum Specified Range, % Limit,% Limit,% \nCarbonA 0.25 and under 0.02 0.02 \nover 0.25 to 0.55, incl 0.03 0.03 \nover 0.55 0.04 0.04 \nManganese 0.90 and under 0.03 0.03 \nover 0.90 to 1.65, incl 0.06 0.06 \nPhosphorusA,a basic steels 0.008 \nacid bessemer steel 0.01 O.Q1 \nSullurA· 8 0.008 \nSilicon 0.35 and under 0.02 0.02 \nover 0.35 to 0.60, incl 0.05 0.05 \nCopper under minimum only 0.02 \nLead 0 0.15 to 0.35, incl 0.03 0.03 \nA Rimmed and capped steels are not subject to rejection on product analysis \nunless misapplication is clearly indicated. \n8 Resulfurized or rephosphorized steels are not subject to rejection on product \nanalysis for these elements unless misapplication is clearly indicated. \n0 Product analysis tolerance for lead applies both over and under to a specified \nrange of 0.15 to 0.35 %. \nTABLE 6 Permissible Variations for Product Analysis of Alloy \nSteel \nElements \nCarbon \nManganese \nPhosphorus \nSulfur \nSilicon \nNickel \nChromium \nMolybdenum \nVanadium \nTungsten \nAluminum \nLeadA \nCopper \nLimit, or Maximum of \nSpecified Range, % \n0.30 and under \nover 0.30 to 0.75, incl \nover 0.75 \n0.90 and under \nover 0.90 to 2.10, incl \nover maximum only \n0.060 and under \n0.40 and under \nover 0.40 to 2.20, Incl \n1.00 and under \nover 1.00 to 2.00, incl \nover 2.00 to 5.30, incl \nover 5.30 to 10.00, incl \n0.90 and under \nover 0.90 to 2.10, incl \nover 2.1 O to 3.99, incl \n0.20 and under \nover 0.20 to 0.40, incl \nover 0.40 to 1.15, incl \n0.1 O and under \nover 0.10 to 0.25, incl \nover 0.25 to 0.50, incl \nminimum value specified, \nunder minimum limit \nonly \n1.00 and under \nover 1.00 to 4.00, incl \n0.1 O and under \nover 0.1 O to 0.20, incl \nover 0.20 to 0.30, incl \nover 0.30 to 0.80, incl \nover 0.80 to 1.80, incl \n0.15 to 0.35, incl \nto 1.00 incl \nover 1.00 to 2.00, incl \nPermissible Variations \nOver Maximum Limit or \nUnder Minimum Limit, % \nO.D1 \n0.02 \n0.03 \n0.03 \n0.04 \n0.005 \n0.005 \n0.02 \n0.05 \n0.03 \n0.05 \n0.07 \n0.10 \n0.03 \n0.05 \n0.10 \n0.01 \n0.02 \n0.03 \n0.01 \n0.02 \n0.03 \n0.01 \n0.04 \n0.08 \n0.03 \n0.04 \n0.05 \n0.07 \n0.10 \n0.03 \n0.03 \n0.05 \nA Product analysis tolerance for lead applies both over and under to a specified \nrange of 0.15 to 0.35 %. \nis being performed, to all parts of the manufacturer's works \nthat concern the manufacture of the material ordered. The \nmanufacturer shall afford the inspector all reasonable facilities \nto satisfy him that the material is being furnished in accordance \nwith this specification. All tests (except product analysis) and \ninspection shall be made at the place of manufacture prior to \nshipment, unless otherwise specified, and shall be so conducted \nas not to interfere unnecessarily with the operation of the \nworks. \n10.2 All required tests and inspection shall be made by the \nmanufacturer prior to shipment. \n11. Rejection \n11.1 Unless otherwise specified, any rejection because of \nnoncompliance to the requirements of the specification shall be \nreported by the purchaser to the manufacturer within 30 \nworking days after receipt of samples. \n11.2 Material that shows imperfections capable of adversely \naffecting processibility subsequent to its acceptance at the \npurchaser's works will be rejected, and the manufacturer shall \nbe notified. \n12. Rehearing \n12.1 Samples that represent rejected material shall be pre­\nserved for two weeks from the date rejection is reported to the \nmanufacturer. In case of dissatisfaction with the results of the \ntests, the manufacturer may make claim for a rehearing within \nthat time. \n13. Product Marking \n13.1 Civilian Procurement-Bars of all sizes, when loaded \nfor shipment, shall be properly identified with the name or \nbrand of manufacturer, purchaser's name and order number, \nthe ASTM designation (year date is not required), grade \nnumber where appropriate, size and length, weight of lift, and \nthe heat number for identification. Unless otherwise specified, \nthe method of marking is at the manufacturer's option and may \nbe made by hot stamping, cold stamping, painting, or marking \ntags attached to the lifts of bars. \n111 \n13.1.1 Bar code marking may be used as an auxiliary \nmethod of identification. Such bar-code markings shall be of \nthe 3-of-9 type and shall conform toAlAG Bl. When barcoded \ntags are used, they shall conform to AIAG BS. \n13.2 Government Procurement: \n13.2.1 Marking for shipment shall be in accordance with the \nrequirements specified in the contract or order and shall be in \naccordance with MIL-STD-163 for military agencies and in \naccordance with Fed. Std. No. 123 for civil agencies. \n13.2.2 For government procurement by the Defense Supply \nAgency, the bars shall be continuously marked for identifica­\ntion in accordance with Fed. Std. No. 183. \n14. Packaging \n14.1 Civilian Procurement-Unless otherwise specified, the \nbars shall be packaged and loaded in accordance with Guide \nA700. \n14.2 Government Procurement-MIL-STD-163 shall apply \nwhen packaging is specified in the contract or order, or when \nLevel A for preservation, packaging, and packing is specified \nfor direct procurement by or direct shipment to the govern­\nment. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0163.json",
  "tabulaTablesCsv": "tables_tabula/page-0163.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0163.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5241,
  "bestTextAlphaRatio": 0.6762
}