{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 722,
  "globalPageIndex": 1520,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-988/SA-988M ASME BPVC.II.A-2025 \n16. Rejection \n16.1 Each part that develops defects during shop working \noperations or in service shall be rejected and the manufacturer \nnotified. \n16.2 Samples representing material rejected by the pur­\nchaser shall be preserved until disposition of the claim has been \nagreed upon between the manufacturer and the purchaser. \n17. Certification \n17.1 In addition to the certification requirements of Speci­\nfication A961/A961M, test reports shall be furnished to the \npurchaser or his representative. Test reports shall provide the \nfollowing as applicable: \n17 .1.1 Type of heat treatment, Section 7 (Table 2). \n17 .1.2 Chemical analysis results, Section 6 (Table 1 ), re­\nported results shall be to the same number of significant figures \nas the limits specified in Table 1 for that element. \n17.1.3 Product analysis results, Section 11 (Table 4), \n17.1.4 Tensile property results, Section 9 (Table 3), report \nthe yield strength and tensile strength, in ksi [MPa], elongation \nand reduction in area, in percent, \n17.1.5 Hardness results, 9.6 (Table 3) \n17.1.6 Structural integrity test results, Section 8, and \n17.1.7 Any supplementary testing required by the purchase \norder. \n18. Product Marking \n18.1 In addition to marking requirements of Specification \nA961/A961M, the following additional marking requirements \nshall apply: \n18.1.1 Quenched and tempered martensitic stainless steel \nparts shall be marked with the letters QT following the \nspecification designation. \n18.1.2 Hot isostatically-pressed parts repaired by welding \nshall be marked with the letter \"W\" following the specification \ndesignation. \n18.1.3 Hot isostatically-pressed parts meeting all require­\nments for more than one class or grade are permitted, at the \noption of the producer, .to be marked with more than one class \nor grade designation, such as S30400/S30409, S30400/S30403, \netc. \n18.2 Bar Coding-In addition to the requirements in 18.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser is permitted to specify in the order that \na specific bar coding system be used. The bar coding system, if \napplied at the discretion of the supplier, should be consistent \nwith one of the published industry standards for bar coding. If \nused on small parts, the bar code may be applied to the box or \na substantially applied tag. \n19. Keywords \n19 .1 age-hardening stainless steel; austenitic stainless \nsteels; austenitic-ferritic stainless steel; gas-atomized powder; \nhot isostatically-pressed stainless steel parts; martensitic stain­\nless steel; pipe fittings, steel; piping applications; pressure \ncontaining parts; stainless steel fittings; stainless steel flanges; \nsteel valves; temperature service applications, elevated; tem­\nperature service applications, high \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall apply only when specified by the purchaser in the \ncontract or order. \nSl. Macroetch Test \nSl.l A sample part shall be sectioned and etched to show \ninternal imperfections. The test shall be conducted according to \nTest Method E340. Details of the test shall be agreed upon \nbetween the manufacturer and the purchaser. \nS2. Product Analysis \nS2. l A product analysis in accordance with Section 11 shall \nbe made from one randomly selected part representing each \nsize and type (See Note 3) of part on the order. If the analysis \nfails to comply, each part in that lot, at the option of the \nmanufacturer, shall be checked and accepted if the analysis for \nthe part complies with the requirements, or the lot shall be \nrejected. All results shall be reported to the purchaser. \nS3. Tension Tests \nS3.1 In addition to the requirements of Section 9, one \ntension specimen shall be obtained from a representative part \nfrom each production lot at a location agreed upon between the \nmanufacturer and the purchaser. The results of the test shall \ncomply with Table 3 and shall be reported to the purchaser. \nS4. Magnetic Particle Examination \nS4. l All accessible surfaces of a finished martensitic, age \nhardening, or austenitic-ferritic stainless steel part, shall be \nexamined by a magnetic-particle method. The method shall be \nin accordance with Test Method A275/A275M. Acceptance \nlimits shall be agreed upon between the manufacturer and \npurchaser. \nSS. Liquid Penetrant Examination \nS5.l All accessible surfaces shall be examined by a liquid \npenetrant method in accordance with Test Method E165/ \nE165M. Acceptance limits shall be agreed upon between the \nmanufacturer and the purchaser. \nS6. Hydrostatic Testing \nS6.1 A hydrostatic test at a pressure agreed upon between \nthe manufacturer and the purchaser shall be applied by the \nmanufacturer. \n1466 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1520.json",
  "tabulaTablesCsv": "tables_tabula/page-1520.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1520.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4753,
  "bestTextAlphaRatio": 0.7641,
  "noteOcrPath": "note_ocr/page-1520.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1520.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}