{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 752,
  "globalPageIndex": 752,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-420 /SA-4ZOM ASME BPVC.II.A-2025 \nas shown in Table 2, unless the purchaser has otherwise \nspecified in the order. \n8. Chemical Composition \n8 .1 The steel shall conform to requirements of chemical \ncomposition for the respective material prescribed in Table 1. \n8.2 The steel shall not contain any unspecified elements for \nthe ordered grade to the extent that it then conforms to the \nrequirements of another grade for which that element is a \nspecified element having a required minimum content. \n8.3 The chemical composition of weld metal is not required \nto meet the same limits of the base materials however, the \ncomposition of the weld deposit shall be such that it meets the \nminimum mechanical and impact requirements of this specifi­\ncation. In general, the alloy content shall be similar to that of \nthe base metal but shall not exceed 6 % except in the case of \nfittings of 9 % nickel steel. \n8.4 A product analysis is optional. \n9. Tensile Properties \n9 .1 The tensile properties of the fittings material shall \nconform to the requirements for the applicable grade of \nmaterial as listed in Table 3. \n9 .1.1 Longitudinal or transverse specimens cut from either \na fitting or from starting plate or pipe they were manufactured \nfrom shall be acceptable for the tension test. For fittings made \nfrom forgings, the test specimen shall meet the requirements of \nSpecification A350/ A350M for the tension test. \n9.1.2 While Table 3 specifies elongation requirements for \nboth longitudinal and transverse specimens, it is not the intent \nthat both requirements apply simultaneously. Instead, it is \nintended that only the elongation requirement that is appropri­\nate for the specimen used be applicable. Unless specified by the \ncustomer, tensile test orientation is at the discretion of the \nmanufacturer. \n9.2 At least one tension test shall be made on each heat of \nmaterial and in the same condition of heat treatment as the \nfinished fittings it represents provided that the wall thickness of \nthe fitting and the representative sample thickness do not vary \nmore than ¼ in. [6 mm]. At least one tension test per heat of \nweld metal shall be made after heat treatment in the same \nmanner as the base metal. Results of the tension test of the \nweld metal need not be reported unless Supplementary Re­\nquirement S51 of Specification A960/A960M is specified. \nTABLE 2 Post-Weld Heat Treatment \nGrade Metal Temperature Minimum Holding Time \nOF oc \nWPL6 1100-1200 595-650 1 h/in. [25 mm] ¾ h min \nWPL3 1100-1150 540-620 ¼ h/in. [25 mm] 1 h min \nWPL8 1050-1100 565-595 ½ h/in. [25 mm] 1 h min \nWPL9A 1025-1085 550-585 1 h/in. [25 mm] 2 h min \nA 2 in. [51 mm] thickness and over. The cooling rate shall not be less than 300 °F \n[150 °C] per hour down to a temperature of 600 °F [315 °C]. \n702 \n9 .3 Records of the tension tests shall be certification that the \nmaterial of the fitting meets the tensile requirements of this \nspecification. \n10. Impact Test Properties \n10. I Properties: \n10.1.1 The notched bar impact properties of the base metal \nand weld metal shall conform to the requirements of Table 4 or \nTable 5 for the applicable grade of material. \n10.1.2 Retest-When the average value of the three speci­\nmens equals or exceeds the minimum value permitted for a \nsingle specimen and the value for more than one specimen is \nbelow the required average value, or when the value for one \nspecimen is below the minimum value permitted for a single \nspecimen, a retest of three additional specimens shall be made. \nThe value for each of these retest specimens shall equal or \nexceed the required average value. When an erratic result is \ncaused by a defective specimen, or there is uncertainty in test \nprocedure, a retest shall be allowed. \n10.2 Procedures: \n10.2.1 All material furnished under this specification shall \nbe tested for impact resistance at the temperature for the \nrespective grade in Table 6. Exceptions to these requirements \nare permissible when agreed upon between the purchaser and \nproducer and specified in the order, in that the impact test is \nacceptable when made at temperatures different from those \nshown in Table 6, provided the test temperature is at least as \nlow as the intended service temperature, and fittings are \nsuitably marked in accordance with Section 19 to identify the \nreported test temperature. \n10.2.2 The notched-bar impact test shall be made in accor­\ndance with the procedure for the simple-beam, Charpy-type \ntest of Test Methods and Definitions A370 if the inch-pound \nunits are specified or Test Methods Al058 if the M suffix (SI \nunits) standard is specified. Each impact test shall consist of \nbreaking three specimens. \n10.3 Specimens: \n10.3.1 Notched-bar impact specimens shall be simple-beam, \nCharpy-type A with a V-notch in accordance with Test Methods \nand Definitions A370 if the inch-pound units are specified or \nTest Methods Al058 if the M suffix (SI Units) standard is \nspecified. Standard specimens 10 by 10 mm in cross section \nshall be used unless the material to be tested is of insufficient \nthickness, in which case the largest obtainable standard subsize \nimpact specimens shall be used. When the size or shape of the \nfinished fittings is insufficient to permit obtaining the smallest \nstandard subsize impact specimens, an impact test by the fitting \nmanufacturer will not be required. The material from which the \nspecimens are taken shall be heat treated with a furnace charge \nin accordance with 10.4.2 or 10.4.3. Impact tests shall be made \nfrom either the raw material from which the fittings are made \nor from a finished fitting at the option of the manufacturer. \n10.3.2 Test specimens shall be obtained so that the longitu­\ndinal axis of the specimen is parallel to the longitudinal axis of \nthe fitting while the axis of the \"V\" shall be perpendicular to \nthe surface. On wall thickness over 1 in. [25 mm] the \nspecimens shall be obtained with their longitudinal axis located \n½ in. [13 mm] from the outer surface. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0752.json",
  "tabulaTablesCsv": "tables_tabula/page-0752.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0752.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6015,
  "bestTextAlphaRatio": 0.7541
}