{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 128,
  "globalPageIndex": 128,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-20/SA-Z0M ASME BPVC.II.A-2025 \n12.1.2 Orientation of Test Specimens-The long axis of the \ntest specimens shall be oriented either longitudinal (parallel to \nthe final direction of rolling) or transverse (transverse to the \nfinal direction of rolling), as specified in the applicable product \nspecification or the purchase order. \n12.1.3 Location of Test Coupons-The impact test coupons \nshall be taken adjacent to the tension test coupons. The impact \ntest coupons shall be subject to the same requirements as those \nspecified for tension tests in 11.4, except that the provisions of \n11.4.4.1 apply to the area under the notch of the impact test \nspecimen instead of to the gage length of the tension test \nspecimen. \n12.1.4 Test Method-Impact testing shall be performed in \naccordance with Test Methods and Definitions A370 using \nCharpy V-notch (Type A) specimens as shown in Test Methods \nand Definitions A370. Except as allowed by 12.1.4.1, full-size \nspecimens (0.394 by 0.394 in. [10 by 10 mm]) shall be used if \nthe plate thickness permits, and their central axis shall corre­\nspond as near as practical to the ¼ t plane in the plate thickness \nt. If the plate thickness is insufficient to obtain full-size \nspecimens, the largest possible subsize specimens shall be \nused. \n12.1.4.1 For plates that normally have absorbed energy \nvalues in excess of 180 ft-lbf [245 J] if tested using full-size \nspecimens at the specified testing temperature, subsize 0.394 \nby 0.264 in. [10 by 6.7 mm] specimens may be used in lieu of \nfull-size specimens; however, if this option is used, the \nacceptance value shall be 75 ft-lbf [100 J] minimum for each \ntest specimen and the lateral expansion in mils [micrometres] \nshall be reported. \n12.1.5 Test Temperature-The test temperature shall be as \nspecified by the product specification, if applicable, or by the \npurchaser, except that the manufacturer or processor shall have \nthe option of using a lower test temperature. The actual test \ntemperature used shall be reported with the test results. \n12.1.6 Acceptance Criteria-The acceptance criteria shall \nbe as specified by the product specification, if applicable, or the \npurchaser. \n12.1.6.1 If the acceptance criteria is based upon energy \nabsorption of a full-size specimen, the acceptance criteria for \nthe various subsize specimens shall be as given in TableAl.16 \n[A2.16], except as otherwise provided in 12.1.4.1. \n12.1.6.2 If the acceptance criterion is based upon lateral \nexpansion opposite the notch, the acceptance value shall be the \nsame for all sizes of test specimens. \n12.1.7 Marking-The letters \"LTV\" shall be stenciled or \nstamped on each plate following the class number, grade, etc. \n12.1.8 Variability-The impact properties of steel can vary \nwithin the same plate-as-rolled or piece, be it as-rolled, \ncontrol-rolled, or heat-treated. The purchaser should, therefore, \nbe aware that testing of one plate-as-rolled does not provide \nassurance that all locations within a plate-as-rolled will be \nidentical in toughness with the location tested. Normalizing or \nquenching and tempering the product will reduce the degree of \nvariation. \n12.1.8.1 Appendix X3 provides additional information on \nthe variability of Charpy V-notch test properties in plates for \npressure vessels. \n76 \n12.2 Drop-Weight Tests: \n12.2.1 Where specified, one drop-weight test, consisting of \na set of two test specimens, shall be made to the same \nfrequency stated in 12.1.1 in accordance with Test Method \nE208. \n12.2.2 The test coupons shall be obtained adjacent to a \ntension test coupon. For plates produced from coil, the test \ncoupon locations shall be the same as for Charpy V-notch tests. \n(See 12.1.) The provisions of 12.1.3 shall also apply. \n12.2.3 The testing temperature shall be as specified in the \napplicable product specification or the purchase order. \n12.2.4 Acceptance shall be on the basis of no-break perfor­\nmance of both test specimens at the specified testing tempera­\nture. \n12.2.5 The plates shall be marked as required in 12.1.7, \nexcept that the letters \"LTD\" shall be used instead of \"LTV.\" \n13. Identification of Plates \n13.1 Required Markings: \n13.1.1 Except as allowed by 13.4, plates shall be legibly \nmarked with the following information: applicable ASTM \ndesignation (see 1.1) (year of issue not required); \"G\" or\" MT\" \nif applicable (see 13.1.2); applicable grade, type, and class; \nheat number; plate identifier; and name, brand, or trademark of \nthe manufacturer (for plates produced in discrete cut lengths of \nflat product) or the processor (for plates produced from coil and \nfor subdivided plates (see 13.4)). \n13.1.2 Plates that are required to be heat treated, but have \nnot been so heat treated, shall be marked, by the manufacturer \nor processor, with the letter \"G\" ( denoting green) following the \nrequired ASTM designation mark, except that \"G\" marking is \nnot necessary if such plates are for shipment, for the purpose of \nobtaining the required heat treatment, to an organization under \nthe manufacturer's control. Plates that are required to be heat \ntreated, and have been so heat treated, shall be marked, by the \nparty that performed the heat treatment, with the letters \"MT\" \n( denoting material treated) following the required ASTM \ndesignation mark. \nNorn 2-Any stress relief of test specimens intended to simulate \npost-weld heat treatment is not included in the above heat treatment. \n13.2 Types of Marking: \n13.2.1 Except as allowed by 13.4, the required markings for \nplates over ¼ in. [6 mm] in thickness shall be by steel die \nstamping, unless paint marking is specified in the purchase \norder. \n13.2.2 Except as allowed by 13.4, the required markings for \nplates ¼ in. [6 mm] and under in thickness shall be by paint \nmarking or by steel die stamping using low-stress (either \nround-nose or interrupted-dot) impressions. \n13.3 Location of Markings: \n13.3.1 Except as allowed by 13.4, the required markings for \nplates with a maximum lengthwise or crosswise dimension \nmore than 72 in. [1800 mm] shall be in at least two places on \neach finished plate, at least 12 in. [300 mm] from the edges of \nthe plate. \n13.3.2 Except as allowed by 13.4, the required markings for \nplates with a maximum lengthwise and crosswise dimension of ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0128.json",
  "tabulaTablesCsv": "tables_tabula/page-0128.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0128.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6297,
  "bestTextAlphaRatio": 0.7415
}