{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 283,
  "globalPageIndex": 283,
  "width": 601.08,
  "height": 845.28,
  "text": "~ \nASME BPVC.II.A-2025 SA-192/SA-192M \n7. Chemical Composition \n7 .1 The steel shall conform to the following requirements as \nto chemical composition: \nCarbon, % 0.06-0.18 \nManganese, % 0.27-0.63 \nPhosphorus, max, % 0.035 \nSulfur, max, % 0.035 \nSilicon, max, % 0.25 \n7 .2 Supplying an alloy grade of steel that specifically \nrequires the addition of any element other than those listed in \n7.1 is not permitted. \n8. Product Analysis \n8.1 When requested on the purchase order, a product analy­\nsis shall be made by the supplier from one tube per 100 pieces \nfor sizes over 3 in. [76.2 mm] and one tube per 250 pieces for \nsizes 3 in. [76.2 mm] and under; or when tubes are identified \nby heat, one tube per heat shaU be analyzed. The chemical \ncomposition thus determined shall conform to the requirements \nspecified. \n8.2 If the original test for product analysis fails, retests of \ntwo additional billets or tubes shall be made. Both retests, for \nthe elements in question, shall meet the requirements of the \nspecification; otherwise all remaining material in the heat or lot \n(see Note 1) shall be rejected or, at the option of the producer, \neach billet or tube may be individually tested for acceptance. \nBillets or tubes which do not meet the requirements of the \nspecification shall be rejected. \nNom l-A lot consists of 250 tubes for sizes 3 in. [76.2 mm] and under \nand of 100 tubes for sizes over 3 in. [76.2 mm), prior to cutting to length. \n9. Hardness Requirements \n9.1 The tubes shall have a hardness number not exceeding \nthe following: \nBrinell Hardness Number (Tubes \n0.200 in. [5.1 mm] and over in \nwall thickness) \n137 HBW \nRockwell Hardness Number \n(Tubes less than 0.200 in. \n[5.1 mm] in wall thickness) \n77 HRBW \n10. Mechanical Tests Required \n10.1 Flattening Test-One flattening test shall be made on \nspecimens from each end of two tubes selected from each lot \n(see Note 1) or fraction thereof. \n10.2 Flaring Test-One flaring test shall be made on speci­\nmens from each end of two tubes selected from each lot (see \nNote 1) or fraction thereof. These tubes shall be selected apart \nfrom those used for the flattening test. \n10.3 Hardness Test-Brinell or Rockwell hardness tests \nshall be made on specimens from two tubes from each lot. The \nterm lot applies to all tubes prior to cutting, of the same \nnominal diameter and wall thickness which are produced from \nthe same heat of steel. When final heat treatment is in a \nbatch-type furnace, a lot shall include only those tubes of the \nsame size and the same heat which are heat treated in the same \nfurnace charge. When the final heat treatment is in a continuous \nfurnace, a lot shall include all tubes of the same size and heat, \nheat treated in the same furnace at the same temperature, time \nat heat, and furnace speed. \n10.4 Hydrostatic Test-Each tube shall be subjected to the \nhydrostatic pressure test, or instead of this test, a nondestruc­\ntive test may be used when specified by the purchaser. \n11. Forming Operations \n11.1 Tubes when inserted in the boiler shall stand expanding \nand beading without showing cracks or flaws. Superheater \ntubes when properly manipulated shall stand all forging, \nwelding, and bending operations necessary for application \nwithout developing defects. \n12. Product Marking \n12.1 In addition to the marking prescribed in Specification \nA450/A450M, the marking shall indicate whether the tube is \nhot finished or cold finished. \n13. Keywords \n13.1 boiler tubes; seamless steel tube; steel tube-carbon \nEXPLANATORY NOTES \nNom 1-For purposes of design, the following tensile properties may \nbe assumed: \nTensile strength, min, ksi [MPa] \nYield strength, min, ksi [MPa] \nElongation in 2 in. or 50 mm, min, % \n47 [325] \n26 [180] \n35 \n231 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-0283.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3753,
  "bestTextAlphaRatio": 0.7306
}