{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 450,
  "globalPageIndex": 1248,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-703/SA-703M ASME BPVC.II.A-2025 \nLOtATION OP ACI ALLOY TYPES \nNorn 1-The approximate areas of microstructures to be expected at room temperature are indicated as follows: \nI-Martensite \nII-Martensite and untransformed austenite \nIII-Ferrite plus martensite and untransformed austenite \nIV-Ferrite \nV-Ferrite plus austenite \nVI-Ferrite plus austenite plus sigma \nVII-Austenite \nNOTE 2-Carbides also may be present depending on carbon content and thermal history. \nFIG. X1 .1 Letters Assigned to Chromium and Nickel Ranges in ACI Designation System \nAPPENDIXES \n(Nonmandatory Information) \nXl. ALLOY DESIGNATIONS FOR CAST STAINLESS STEELS \nXl.1 Cast stainless steels are usually specified on the basis \nof composition using the alloy designation system established \nby the Alloy Casting Institute (ACI). The ACI designations, for \nexample, CF8M, have been adopted by ASTM and are pre­\nferred for cast alloys over the designations used by the \nAmerican Iron and Steel Institute for similar wrought steels. \nXl .2 This nomenclature system has served successfully to \naccommodate changes in old alloys and to designate new ones. \nxxooxxx \n~~-=:on_J J J 111 Carbon Content Number _________ __,_ \nSpecial elements 1.4!1.ter ______________ ._~ \nXl.2.1 Service Classification Letter-The first letter of the \ncast stainless steel designation system identifies the intended \nservice application of the alloy. The letter C indicates \ncorrosion-resistant service, and the letter H indicates the \nheat-resistant service at and above 1200 °F [649 °C]. \nXl.2.2 Ternary Diagram Location Letter-The second let­\nter indicates the approximate location of the nickel and \nchromium contents of the alloy grade on the FeCrNi ternary \ndiagram shown in Fig. Xl.l. \nXl.2.3 Carbon Content Number-For C service \nclassifications, this single or dual-digit numeral represents the \nmaximum carbon content in units of 0.01 %. For H service \nclassifications, this number represents the midpoint of the \nrange of carbon content in terms of 0.01 % with a ±0.05 % \nlimit. \nXl .2.4 Special Elements Letter-Additional letters follow­\ning the numeral represent special chemical elements in the \nalloy grade, such as M for molybdenum, C for columbium (Nb \nfor niobium), Mn for manganese, S for silicon, N for nitrogen, \nCu for copper, and W for tungsten. There are two exceptions: \nthe letter A indicates \"Controlled Ferrite,\" and the letter F \nindicates \"Free Machining.\" \nXl.3 In Fig. Xl.l, unlettered NiCr ranges are associated \nwith the nearest lettered location. They may be the result of \ndifferences between corrosion and heat-resistant types or be­\ncause of the influence of additional elements; for example, the \nprecipitation hardening grade CB- 7Cu. \n1162 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-1248.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2730,
  "bestTextAlphaRatio": 0.7659
}