{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 118,
  "globalPageIndex": 916,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-484/SA-484M ASME BPVC.II.A-2025 \n4.1.2 Dimensions, including shape or form with diameter or \nwidth and thickness as applicable, length, and prints or \nsketches as applicable, \n4.1.3 Type or UNS designation, \n4.1.4 ASTM specification designation and edition year if \nother than the latest edition, \n4.1.5 Condition, \n4.1.6 Finish, \n4.1.7 Supplementary Requirements when invoked, \n4.1.8 Whether bars are to be rolled as bars or cut from strip \nor plate, when applicable, \n4.1.9 Preparation for delivery, \n4.1.10 Marking requirements, \n4.1.11 Surface preparation, for shapes, and \n4.1.12 Special requirements. \nNoTE 1-A typical ordering description is as follows: 5000 lb \n[2000 kg]; 1.000 in. [25 mm] round bar by 10 to 12 ft [3 to 4 rn]; Type 304 \nor S30400; Specification A479/A479M; annealed, centerless ground; plus \noptional requirements, such as special marking instructions. \n5. Materials and Manufacture \n5.1 The material shall be made by any process. \n5.2 The material shall be furnished in one of the conditions \ndetailed in the applicable product specification, for example, \nhot-worked; hot-worked and annealed; hot-worked, annealed, \nand cold-worked; or hot-worked, annealed, and heat-treated. \n5.3 The material shall be furnished in one of the finishes as \ndetailed in Section 8 or further described in the applicable \nproduct specification, for example, hot-finished or cold­\nfinished. \n6. Chemical Composition \n6.1 Heat or Cast Analysis-The chemical analysis of each \nheat shall be determined in accordance with the applicable \nmaterials specification and Test Methods, Practices, and Ter­\nminology A751. \n6.1.1 The analysis of each heat shall be made from a test \nsample taken during the pouring of the melt or from the \nin-process product later in the manufacturing flow. \n6.1.2 The heat analysis shall conform to the chemical \nrequirements for each of the specified elements for the grade \nordered, as listed in the applicable product specification. \n6.1.3 All commercial metals contain small amounts of \nelements other than those which are specified. It is neither \npractical nor necessary to specify limits for unspecified ele­\nments that can be present. The producer is permitted to analyze \nfor unspecified elements and is permitted to report such \nanalyses. The presence of an unspecified element and the \nreporting of an analysis for that element shall not be a basis for \nrejection unless the presence of that element cause the loss of \na property typically expected for that metal, for the type and \nquality ordered. \n6.1.4 The purchaser is permitted to require in the purchase \norder a maximum limit for an individual element not specified \nin the product specification. Such a requirement for an element \nnot listed in the product specification, when acknowledged in \nthe order acceptance, shall be treated as a specified element, \nwith determination of chemical analysis and reporting of that \nanalysis. \n6.1.5 The purchaser is permitted to make the requirements \nfor any element more stringent, that is, require higher mini­\nmums for elements having minimum requirements or ranges \nwith minimum requirements, or requiring lower maximums for \nelements having specified maximums, or ranges with maxi­\nmums. The purchaser is not permitted to make chemical \nrequirements less stringent. \n6.1.6 Analysis limits shall be established for specific \nelements rather than groups of elements, including but not \nlimited to all others, rare earths, and balance, unless all \nelements in such a group are similar in technical effect and are \nassociated in typical methods of chemical analysis. \n6.2 Product Analysis-When required, a product analysis \nshall be determined in accordance with Test Methods, \nPractices, and Terminology A751. The chemical composition \nthus determined shall conform to the tolerances shown in Table \n1. \n6.2.1 When the product requirement includes a ratio re­\nquirement that is the quotient of two, or more, elements, the \nminimum required ratio determined from product analysis shall \nbe at least 0.90x the minimum in the product specification. \n6.3 The steel shall not contain an unspecified element for \nthe ordered grade to the extent that the steel conforms to the \nrequirements of another grade in the referencing product \nspecification, and any of the product specifications within the \nscope of this general requirements specification, for which that \nelement has a specified minimum. \n7. Heat Treatment \n816 \n7 .1 The heat treatments shown in this section are to be \nfollowed unless otherwise specified in the applicable product \nspecification. \n7.2 Austenitic Grades: \n7.2.1 Except for strain-hardened grades (see 7.2.4), hot­\nrolled grades (see 7.2.5), and UNS N08020 (see 7.2.6), all \naustenitic stainless steels shall be furnished in the solution \nannealed condition in accordance with Table 2, with subse­\nquent light cold drawing for cold finishing and straightening \npermitted. \n7 .2.2 Except as indicated in Table 2, the austenitic grades \nshall be annealed, at the option of the manufacturer, by a \nseparate annealing treatment or by process annealing. \n7 .2.2.1 The separate annealing treatment shall consist of \nheating the material to the minimum annealing temperature for \nthe grade as listed in Table 2, holding for a sufficient time to \npermit grain boundary carbides to enter into solution, and \ncooling rapidly enough to prevent unacceptable grain boundary \ncarbide precipitation. Except as indicated in Table 2, austenitic \nstainless steels solution annealed by a separate annealing \ntreatment shall be capable of meeting the requirements of \nPractice E of Practices A262. Practice E of Practices A262 is \nnot required unless specified on the purchase order. \n7.2.2.2 Process annealing shall consist of completing hot \nworking above the minimum annealing temperature required ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0916.json",
  "tabulaTablesCsv": "tables_tabula/page-0916.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0916.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5814,
  "bestTextAlphaRatio": 0.771
}