{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 717,
  "globalPageIndex": 1515,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-988/SA-988M \n6.1.2 When required by the purchaser, the chemical com­\nposition of a sample from one part from each lot of parts shall \nbe determined by the manufacturer. The composition of the \nsample shall conform to the chemical requirements prescribed \nin Table 1. \n6.2 Addition of lead, selenium, or other unspecified ele­\nments for the purpose of improving the machinability of the \ncompact shall not be permitted. \n6.3 The steel shall not contain an unspecified element other \nthan nitrogen, for the ordered grade, to the extent that the steel \nconforms to the requirements of another grade for which that \nelement is a specified element having a required minimum \ncontent. \n7. Heat Treatment \n7.1 Except as provided in 7.2, the final heat treatment of all \nparts shall be in compliance with the requirements of Table 2. \nAfter hot isostatic-pressing and prior to final heat treatment, the \ncompacts are permitted to be annealed, at the option of the \nproducer, either as a part of the consolidation process or as a \nseparate operation. \n7.2 When agreed upon by the purchaser, liquid quenching \nmay be applied to the martensitic stainless steels in place of the \nfurnace cool or air cool specified in Table 2, provided that such \nquenching is followed by tempering in the temperature ranges \nas required in Table 2. Martensitic parts that are liquid \nquenched and tempered shall be marked \"QT.\" \n7.3 The final heat treatment shall be performed before or \nafter machining at the option of the producer. \n7.4 See Section S16 if a particular heat treatment method is \nspecified by the purchaser in the purchase order. \n8. Structural Integrity Requirements \n8.1 Microporosity-The parts shall be free of microporosity \nas demonstrated by measurement of density as provided in \n8.1.1 or by microstructural examination as provided in 8.1.2. \n8.1.1 Density Measurement: \n8 .1.1.1 The density measurement shall be used for accep­\ntance of material but not for rejection of material. The \nmeasured density for each production lot shall exceed 99 % of \nthe density typical of that grade when wrought and in the same \nheat treated condition as the sample. A production lot that fails \nto meet this acceptance criterion is permitted to be tested at the \noption of the producer, for microporosity in accordance with \nthe microstructural examination as provided in 8.1.2. \n8.1.1.2 Density shall be determined for one sample from \neach production lot by measuring the difference in mass of the \nsample when weighed in air and when weighed in water and \nmultiplying this difference by the density of water (Archi­\nmede' s principle). The equipment used shall be capable of \ndetermining density within ±0.004 lb/in. 3 [0.10 g/cm 3 ]. \nAlternatively, at the option of the producer, it is permitted to \nuse Test Method B311 to determine the density. \n8.1.1.3 At the option of the producer, the density shall be \ncompared to the room temperature density typical of wrought \nsteels of the same class of grades, 0.28 lb/in.3 [7.8 g/cm 3 ] for \nage-hardening, martensitic, and austenitic-ferritic grades, and \n0.29 lb/in.3 [8.0 g/cm 3 ] for austenitic grades, or to the density \nof a wrought reference sample of the same grade heat treated \nin accordance with the requirements of Table 2 (See Note 2). \nNorn 2-The actual density of stainless steel varies slightly witl1 \ncomposition and heat treatment. For this reason, small differences in the \nmeasured density from the typical density for a class of grades may be the \nresult of differences in alloy content, heat treatment, or microporosity. \nWhen density values are measured that are less than the density typical of \na class of grades, it is appropriate to examine the sample for microporosity \nby the more specific metallographic examination procedures. \n8.1.2 Microstructural Examination: \n8.1.2.1 The microstructure shall be examined at 20-50x, \n100-200x, and 1000-2000x and shall be reasonably uniform \nand shall be free of voids, laps, cracks, and porosity. \n8.1.2.2 One sample from each production lot shall be \nexamined. The sample shall be taken after hot-isostatic press­\ning or after final heat treatment. The sample shall be taken from \nthe component, stem, protrusion, or test part made from a \nsingle powder blend consolidated in the same hot isostatic \npress using the same pressure, temperature, and time param­\neters and heat-treated in the same final heat-treatment charge. \nThe microstructure shall meet the requirements of 8.1.2.1. \n8.1.2.3 If the sample fails to meet the requirements for \nacceptance, each part in the lot is permitted to be retested and \nthose that pass shall be accepted. \n8.2 Hydrostatic Tests-After they have been machined, \npressure-containing parts shall be tested to the hydrostatic shell \ntest pressures prescribed in ASME B16.5 for the applicable \nsteel rating for which the part is designed and shall show no \nleaks. Parts ordered under these specifications for working \npressures other than those listed in the ASME B16.5 ratings \nshall be tested to such pressures as may be agreed upon \nbetween the manufacturer and purchaser. \n8.2.l No hydrostatic test is required for weld neck or other \nflanges. \n8.2.2 The compact manufacturer is not required to perfmm \npressure tests on rough parts that are to be finish machined by \nothers. The fabricator of the finished part is not required to \npressure test parts that are designed to be pressure containing \nonly after assembly by welding into a larger structure. The \nmanufacturer of the compacts, however, shall be responsible, \nas required in 16.1 for the satisfactory performance of the parts \nunder the final test required in 8.2. \n8.3 Ultrasonic Tests-When specified in the order, \naustenitic-ferritic stainless steel parts made from S32505 shall \nbe ultrasonic tested according to the procedures described in \nSection S7. \n9. Mechanical Properties \n9 .1 The mate1ial shall conform to the requirements for \nmechanical properties prescribed in Table 3 at room tempera­\nture. \n9.2 Sample shall be from the component, stem, protrusion, \nor test part made from a single powder blend consolidated in \nthe same hot isostatic press using the same pressure, \ntemperature, and time parameters and heat-treated in the same \nfinal heat-treatment charge. If repair welding is required (See \n1461 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1515.json",
  "tabulaTablesCsv": "tables_tabula/page-1515.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1515.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6343,
  "bestTextAlphaRatio": 0.7671,
  "noteOcrPath": "note_ocr/page-1515.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1515.txt",
  "noteOcrHighDpiCount": 1,
  "noteOcrHighDpiNotes": [
    "Note 2—The actual density of stainless steel varies slightly with"
  ]
}