{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 742,
  "globalPageIndex": 1540,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-999 /SA-999M ASME BPVC.II.A-2025 \nStandard Specification for \nGeneral Requirements for Alloy and Stainless Steel Pipe \n1. Scope \n1.1 This specification covers a group of general require­\nments that, unless otherwise specified in an individual \nspecification, shall apply to the ASTM product specifications \nnoted below. \n1.2 In the case of conflict between a requirement of a \nproduct specification and a requirement of this specification, \nthe product specification shall prevail. In the case of conflict \nbetween a requirement of the product specification or a \nrequirement of this specification and a more stringent require­\nment of the purchase order, the purchase order shall prevail. \n1itle of Specification ASTM Desig• \nnation \nSeamless, Welded, and Heavily Cold Worked Austenitic A312/A312M \nStainless Steel Pipes \nSeamless and Welded Steel Pipe for Low-Temperature A333/A333M \nService and Other Applications with Required Notch \nToughness \nSeamless Ferritic Alloy-Steel Pipe for High Temperature A335/A335M \nService \nElectric-Fusion-Welded Austenitic Chromium-Nickel Stainless A358/A358M \nSteel Pipe for High-Temperature Service and General \nApplications \nCarbon and Ferrltic Alloy Steel Forged and Bored Pipe for A369/A369M \nHigh-Temperature Service \nSeamless Austenitic Steel Pipe for High-Temperature A376/A376M \nService \nWelded Large Diameter Austenitic Steel Pipe for Corrosive A409/A409M \nor High-Temperature Service \nCentrifugally Cast Ferritic Alloy Steel Pipe for A426/A426M \nHigh-Temperature Service \nCentrifugally Cast Austenitic Steel Pipe for High- A451/A451 M \nTemperature Service \nCentrifugally Cast Iron-Chromium-Nickel High-Alloy A608/A608M \nTubing for Pressure Application at High \nTemperatures \nWelded, Unannealed Austenitlc Stainless Steel Tubular A778/A778M \nProducts \nSeamless and Welded Ferritic/Austenitic A790/A790M \nStainless Steel Pipe \nSingle- or Double-Welded Austenitic Stainless Steel Pipe \nCold-Worked Welded Austenitic Stainless Steel Pipe \nCentrifugally Cast Ferritic/Austenitic Stainless Steel Pipe \nfor Corrosive Environments \nFerritic/Austenitic (Duplex) Stainless Steel Pipe Electric \nFusion Welded with Addition of Filler Metal \nA813/A813M \nA814/A814M \nA872/A872M \nA928/A928M \nSpray-Formed Seamless Austenitic Stainless Steel Pipes A943/A943M \nSpray-Formed Seamless Ferritic/Austenltic Stainless Steel A949/A949M \nPipe \nAustenitic Chromium-Nickel-Silicon Alloy Steel Seamless A954 \nand Welded Pipe \n1.3 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. The inch-pound units apply unless the \"M\" designa­\ntion (SI) of the product specification is specified in the order. \nNoTE 1-The dimensionless designator NPS (nominal pipe size) is used \nin this standard for such traditional terms as \"nominal diameter,\" \"size,\" \n\"nominal bore,\" and \"nominal size.\" \n1.4 The following precautionary statement pertains only to \nthe test method portion, Section 22, of this specification: This \nstandard does not purport to address all of the safety concerns, \nif any, associated with its use. It is the responsibility of the user \nof this standard to establish appropriate safety, health, and \nenvironmental practices and determine the applicability of \nregulatory limitations prior to use. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \n1486 \nA312/A312M Specification for Seamless, Welded, and \nHeavily Cold Worked Austenitic Stainless Steel Pipes \nA333/A333M Specification for Seamless and Welded Steel ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1540.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4097,
  "bestTextAlphaRatio": 0.7801
}