{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 571,
  "globalPageIndex": 1369,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-803 /SA-803M \nTABLE 1 Chemical Requirements \nGrade UNS UNS S43035 UNS UNS S44626 UNS S44635 UNS S44660 UNS UNS UNS S44400 UNS S44735 \nS 40900 TP439 S 44627 TP XM-33 25-4-4 26-3-3 S44700 S44800 18-2 29-4C \nTP409 TP XM-27 29-4 29-4-2 \nElement Comoosition, % \nC, max 0.08 0.07 0.01A 0.06 0.025 0.030 0.010 0.010 0.025 0.030 \nMn, max 1.00 1.00 0.40 0.75 1.00 1.00 0.30 0.30 1.00 1.00 \nP, max 0.045 0.040 0.02 0.040 0.040 0.040 0.025 0.025 0.040 0.040 \nS, max 0.030 0.030 0.02 0.020 0.030 0.030 0.020 0.020 0.030 0.030 \nSi, max 1.00 1.00 0.40 0.75 0.75 1.00 0.20 0.20 1.00 1.00 \nNi 0.50 max 0.50 max 0.5 8 max 0.50 max 3.5-4.5 1.0--3.5 0.15 max 2.0-2.5 1.00 max 1.00 max \nCr 10.5- 17.0--19.0 25.0--27.5 25.0--27.0 24.5-26.0 25.0--28.0 28.D--30.0 28.D--30.0 17.5-19.5 28.0-30.0 \n11.7 \nMo ... ... 0.75-1.50 0.75-1.50 3.5-4.5 3.0-4.0 3.5-4.2 3.5-4.2 1.75-2.50 3.6-4.2 \nAl ... 0.15 max ... ... ... ... ... ... . .. . .. \nCu ... ... 0.20 max 0.20 max ... ... 0.15 max 0.15 max . .. . .. \nN ... 0.04 max O.Q15 0.040 max 0.035 0.040 max 0.020 0.020 0.035 max 0.045 max \nmax \nmaxc maxc \nTi 6xC 0.20 + 4 (C + ... 7 x (C + N) but (Ti+ Nb 0 ) = Ti+Nb 0 =6x (Ti+ Nb 0 ~= Ti+Nb 0 =6x \nmin; 0.75 N) min; 1.10 no less than 0.2 + 4 (C + N) (C + N) but no 0.20 + 4 ( + IC+ N) but no \nmax max 0.20 min; min; 0.80 less than 0.20 N) min; 0.80 ess than 0.20 \nmin; min; 1.00 max \n1.00 max max 1.00 max max \nNb 0 ... ... 0.05-0.20 ... ... ... ... ... . .. . .. \nA For small diameter or thin walls, or both, tubing, where many drawing passes are required, a carbon maximum of 0.015 % is necessary. Small outside diameter tubes \nare defined as those less than 0.500 in. [12. 7 mm] in outside diameter and light wall tubes as those less than 0.049 in. [1.2 mm] in average wall thickness (0.040 in. [1 \nmm] in minimum wall thickness). \n8 Nickel + copper. \nc Carbon + nitrogen = 0.025 max. \n°The term Niobium (Nb) and Columbium (Cb) are alternate names for the same element. \nsulfur may be detrimental to stainless steels. The manufacturer \nshall employ techniques which minimize surface contamina­\ntion by these elements. \n7. Cleaning Before Annealing \n7 .1 All lubricants or coatings used in the manufacture of \nstraight-length tube or in the bending shall be removed from all \nsurfaces prior to any annealing treatments. U-bends on which \na lubricant had been applied to the inside surface during \nbending shall have the cleanness of their inside surface \nconfirmed by blowing close-fitting acetone-soaked felt plugs \nthrough 10 % of the tubes of each bend radius. Dry, oil-free air \nor inert gas shall be used to blow the plugs through the tubes. \nIf the plugs blown through any tube show more than a light \ngray discoloration, all tubes that have had a lubricant applied to \nthe inside surface during bending shall be recleaned. After \nrecleaning 10 % of the tubes of each bend radius whose inside \nsurface had been subjected to bending, lubricants shall be \nretested. \n8. Heat Treatment \n8.1 All finished straight tubing or straight tubing ready for \nU-bending shall be furnished in the solution-annealed condi­\ntion. The annealing procedure shall consist of heating the \nmaterial to a temperature of 1200°P [650°C] or higher and \ncooling (as appropriate for the grade) to meet the requirements \nof this specification. \n8.2 If heat treatment of U-bends is specified, it shall satisfy \nthe annealing procedure described in 8.1 and shall be done as \nfollows: \n8.2.1 The heat treatment shall be applied to the U-bend area \nplus approximately 6 in. [150 mm] of each leg beyond the \ntangent point of the U-bend. \n8.2.2 If the heat treatment specified in 8.2 is accomplished \nby resistance-heating methods wherein electrodes are clamped \nto the tubes, the clamped areas shall be visually examined for \narc burns. Burn indications shall be cause for rejection unless \nthey can be removed by local polishing without encroaching \nupon minimum wall thickness. \n8.2.3 Temperature control shall be accomplished through \nthe use of optical or emission pyrometers, or both. No \ntemperature-indicating crayons, lacquers, or pellets shall be \nused. \n8.2.4 The inside of the tube shall be purged with a protective \nor an inert gas atmosphere during heating and cooling to below \n700°F [370°C] to prevent scaling of the inside surface. The \natmosphere should be noncarburizing. \n9. Chemical Composition \n9.1 Product Analysis: \n9 .1.1 The steel shall conform to the chemical composition \nin Table l. \n9.1.2 When specified on the purchase order, a product \nanalysis shall be supplied from one tube or coil of steel per \nheat. The product analysis tolerance of Specification A480/ \nA480M shall apply. \n9.1.3 If the original test for product analysis fails, retests of \ntwo additional lengths of flat-rolled stock or tubes shall be \nmade. Both retests, for the elements in question, shall meet the \nrequirements of this specification; otherwise all remaining \nmaterial in the heat or lot shall be rejected or, at the option of \n1307 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1369.json",
  "tabulaTablesCsv": "tables_tabula/page-1369.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1369.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5007,
  "bestTextAlphaRatio": 0.605
}