{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 243,
  "globalPageIndex": 243,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-135/SA-135M (ASTM A135/A135M) \n16.2.4 ff any test specimen shows defective machining or \ndevelops flaws not associated with the quality of the steel or the \nwelding, it may be discarded and another specimen substituted. \n16.2.5 If the results of the tension tests of any lot do not \nconform to the requirements specified in 9.1, retests of two \nadditional lengths from the same lot shall be made, each of \nwhich shall conform to the requirements specified. \n16.2.6 If the percentage of elongation of any tension test \nspecimen is less than that specified in 8.1, and any part of the \nfracture is more than ¾-in. [19.0-mm] from the center of the \ngauge length as indicated by scribe scratches marked on the \nspecimen before testing, the specimen may be discarded and \nanother substituted. \n16.3 Flattening Test: \n16.3.1 Specimens for flattening tests shall be smooth at the \nends and free from burrs. \n16.3.2 If any section of the pipe fails to comply with the \nrequirements of 9.1, for pipe produced in single lengths, other \nsections may be cut from the same end of the same length until \nsatisfactory tests are obtained, except that the finished pipe \nshall not be shorter than 80 % of its length after the initial \ncropping; otherwise, the length shall be rejected. For pipe \nproduced in multiple lengths, retests may be cut from each end \nof each individual length in the multiple; such tests shall be \nmade with the weld alternately 0° and 90° from the line of \ndirection of force. \n16.4 All specimens shall be tested at room temperature. \n17. Inspection \n17 .1 The inspector representing the purchaser shall have \nfree entry, at all times while work on the contract of the \npurchaser is being performed, to all parts of the manufacturer's \nworks that concern the manufacture of the material ordered. \nThe manufacturer shall afford the inspector, without charge, all \nreasonable facilities to satisfy him that the material is being \nfurnished in accordance with this specification. All tests \n( except check analysis) and inspection shall be made at the \nplace of manufacture prior to shipment, unless otherwise \nspecified, and shall be so conducted as not to interfere \nunnecessarily with the manufacturer's operation. \n18. Rejection \n18.1 Each length of pipe received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of this specification based on the inspection and \ntest method as outlined in the specification, the length may be \nrejected and the manufacturer shall be notified. Disposition of \nrejected pipe shall be a matter of agreement between the \nmanufacturer and the purchaser. \n18.2 Pipe found in fabrication or in installation to be \nunsuitable for the intended use, under the scope and require­\nments of this specification, may be set aside and the manufac­\nturer notified. Such pipe shall be subject to mutual investiga­\ntion as to the nature and severity of the deficiency and the \nforming or installation, or both, conditions involved. Disposi­\ntion shall be a matter for agreement. \n19. Certificate of Compliance \n19.1 When specified in the purchase order, the producer or \nsupplier shall furnish to the purchaser a certificate of compli­\nance stating that the pipe has been manufactured, sampled, \ntested and inspected in accordance with this specification \n(including the year of issue) and has been found to meet the \nrequirements. \n20. Identification of Material \n20.1 Each length of pipe shall be legibly marked with \nappropriate symbols by stenciling, stamping, or rolling to show \nthe manufacturer's name, the size, the specification \ndesignation, the grade, and the hydrostatic test pressure when \ntested, or the letters \"NH\" when not tested. \n20.2 In addition to the requirements in 20.1, bar coding is \nacceptable as a supplemental identification method. The pur­\nchaser may specify in the order a specific bar coding system to \nbe used. \n21. Packaging, Marking, and Loading for Shipment \n21.1 When specified on the purchase order, packaging, \nmarking, and loading for shipment shall be in accordance with \nGuide A700. \n21.2 The applicable levels shall be as specified in the \ncontract. Marking for shipment of such material shall be in \naccordance with Fed. Std. No. 123 for civil agencies and \nMIL-STD-129 if continuous marking is required for military \nagencies. \n22. Keywords \n22.1 eddy current testing; electric resistance welded pipe; \nhydrostatic testing; plain end pipe; Schedule 10 pipe; threaded \npipe \n191 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0243.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4525,
  "bestTextAlphaRatio": 0.7682
}