{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 530,
  "globalPageIndex": 530,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-325 ASME BPVC.II.A-2025 \nTABLE 4 Tensile Load Requirements for Bolts Tested Full-Size \nProof Load, 8 Alternative \nProof Length Bolt Size, Threads per Measure-\nInch, and Series Stress 1rea,A Tensile Load, 8 men! \nDesignation in. min, lbf Method \nColumn 1 Column 2 Column 3 Column 4 \n½-13 UNG 0.142 17050 \n%-11 UNG 0.226 27100 \n¾-10 UNG 0.334 40 100 \n7 /s-9 UNG 0.462 55 450 \n1-8 UNG 0.606 72700 \n11/s -7 UNG 0.763 80 100 \n1¼-7 UNG 0.969 101 700 \n1%-6 UNG 1.155 121 300 \n1½-6 UNG 1.405 147 500 \nA The stress area is calculated as follows: \nAs= 0.7854 [0- (0.9743/n)J 2 \nwhere: \nAs stress area, in. 2 , \nO nominal bolt size, and \nn threads per inch. \n8 Loads tabulated are based on the following: \nBolt Size, in. \n½ to 1, incl \n11/s to 1 ½, incl \nColumn 3 \n120 000 psi \n105 000 psi \nColumn 4 \n85 000 psi \n74 000 psi \n12050 \n19 200 \n28 400 \n39 250 \n51 500 \n56 450 \n71 700 \n85 450 \n104 000 \nLoad, 8 Yield \nStrength \nMethod \nColumn 5 \n13 050 \n20 800 \n30 700 \n42 500 \n55 750 \n61 800 \n78 500 \n93 550 \n113 800 \nColumn 5 \n92 000 psi \n81 000 psi \n6.3.1 Definition-The rotational capacity test is intended to \nevaluate the presence of a lubricant, the efficiency of the \nlubricant, and the compatibility of assemblies as represented by \nthe components selected for testing. \n6.3.2 Requirement-Zinc-coated bolts, zinc-coated washers, \nand zinc-coated and lubricated nuts tested full size in an \nassembled joint or tension measuring device, in accordance \nwith 10.2, shall not show signs of failure when subjected to the \nnut rotation in Table 6. The test shall be performed by the \nresponsible patty (see Section 14) prior to shipment after zinc \ncoating and lubrication of nuts (see 10.2 and Note 4). \n6.3.3 Acceptance Criterion-The bolt and nut assembly \nshall be considered as non-conforming if the assembly fails to \npass any one of the following specified requirements: \n6.3.3.1 Inability to install the assembly to the nut rotation in \nTable 6. \n6.3.3.2 Inability to remove the nut after installing to the \nrotation specified in Table 6. \n6.3.3.3 Shear failure of the threads as determined by visual \nexamination of bolt and nut threads following removal. \n6.3.3.4 Torsional or torsional/tension failure of the bolt. \nElongation of the bolt, in the threads between the nut and bolt \nhead, is to be expected at the required rotation and is not to be \nclassified as a failure. \n7. Dimensions \n7.1 Head and Body: \n7.1.1 The bolts shall conform to the dimensions for heavy \nhex structural bolts specified in ASME B18.2.6. \n7 .1.2 The thread length shall not be changed except as \nprovided in Supplementary Requirement S 1. Bolts with thread \nlengths other than those required by this specification shall be \nordered under Specification A449. \n7.2 Threads: \n7.2.1 Uncoated-Threads shall be the Unified Coarse \nThread Series as specified inASME Bl.I, and shall have Class \n2A tolerances. \n7 .2.2 Coated-Unless otherwise specified, zinc-coated bolts \nto be used with zinc-coated nuts or tapped holes that are tapped \noversize, in accordance with Specification A563, shall have \nClass 2A threads before hot-dip or mechanically deposited zinc \ncoating. After zinc coating, the maximum limits of pitch and \nmajor diameter shall not exceed the Class 2A limit by more \nthan the following amounts: \nNominal Bolt \nDiameter (in.) \n½ \n9/1a, 5/a, ¾ \n7/s \n1 to 1¼ \n1%,1½ \nOversize Limit, in.A \nHot-Dip Mechanical \nz~ z~ \n0.018 \n0.020 \n0.022 \n0.024 \n0.027 \n0.012 \n0.013 \n0.D15 \n0.016 \n0.D18 \nA Hot-dip zinc nuts are tapped oversize after coating, and mechanical zinc­\ncoated nuts are tapped oversize before coating. \n7 .2.3 The gaging limit for bolts shall be verified during \nmanufacture. In case of dispute, a calibrated thread ring gage of \nthe same size as the oversize limit in 7 .2.2 (Class X tolerance, \ngage tolerance plus) shall be used to verify compliance. The \ngage shall assemble with hand effort following application of \nlight machine oil to prevent galling and damage to the gage. \nThese inspections, when performed to resolve controversy, \nshall be conducted at the frequency specified in the quality \nassurance provisions of ASME B18.2.6. \n8. Workmanship \n8.1 The allowable limits, inspection, and evaluation of the \nsurface discontinuities, quench cracks, forging cracks, head \nbursts, shear bursts, seams, folds, thread laps, voids, tool \nmarks, nicks, and gouges shall be in accordance with Specifi­\ncation F788/F788M. \n9. Number of Tests and Retests \n9 .1 Testing Responsibility: \n478 \n9 .1.1 Each lot shall be tested by the manufacturer prior to \nshipment in accordance with the lot identification control \nquality assurance plan in 9.2 through 9.5. \n9.1.2 When bolts are furnished by a source other than the \nmanufacturer, the Responsible Patty as defined in 14 shall be \nresponsible for assuring all tests have been perfom1ed and the \nbolts comply with the requirements of this specification (see \n4.5). \n9.2 Purpose of Lot Inspection-The purpose of a lot inspec­\ntion program is to ensure that each lot confonns to the \nrequirements of this specification. For such a plan to be fully \neffective it is essential that secondary processors, distributors, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0530.json",
  "tabulaTablesCsv": "tables_tabula/page-0530.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0530.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5040,
  "bestTextAlphaRatio": 0.689,
  "noteOcrPath": "note_ocr/page-0530.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0530.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}