{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 514,
  "globalPageIndex": 1312,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-770/SA-770M ASME BPVC.II.A-2025 \nStandard Specification for \nThrough-Thickness Tension Testing of Steel Plates for \nSpecial Applications \n1. Scope \n1.1 This specification covers the procedures and accep­\ntance standards for the determination of reduction of area using \na tension test specimen whose axis is perpendicular to the \nrolled surfaces of steel plates 1 in. [25 mm] and greater in \nthickness. The principal purpose of the testing is to provide a \nmeasure of the resistance of a steel plate to lamellar tearing. \n(See Appendix XL) \n1.2 The values stated in either inch-pound units or SI units \nare to be regarded as standard. Within the text, the SI units are \nshown in brackets. The values stated in each system are not \nexact equivalents; therefore, each system must be used inde­\npendently of the other. Combining values from the two systems \nmay result in nonconformance with the specification. \n1.3 This specification is expressed in both inch-pound and \nSI unit~. However, unless the order specifies the applicable \n\"M\" specification designation (SI units), the material shall be \nfurnished to inch-pound units. \n2. Referenced Documents \n2.l ASTM Standards: \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \n3. Ordering Information \n3.1 The inquiry and order shall include the following, if \nrequired: \n3.1.1 Supplementary requirements that are available to meet \nend use requirements (see SI through S5). \n3.1.2 Special requirements agreed upon between the manu­\nfacturer and the purchaser. \n4. Tension Tests \n4.1 Number of Tests: \n4.1.l Two tests shall be required from each plate-as-rolled, \nexcept for plates subjected to heat treatment by quenching and \ntempering. 1\\vo tests shall be required from each quenched­\nand-tempered plate. The tests shall be representative of the \nplate in its final condition. \n4.1.2 When plates are furnished by the manufacturer in an \nunheat-treated condition and qualified by heat-treated speci­\nmens (including normalized, normalized and tempered, and \nquenched and tempered), two tests shall be required from each \nplate-as-rolled. \nNoTE 1-The term \"plate-as-rolled\" refers to the unit plate rolled from \na slab or directly from an ingot. It does not refer to the condition of the \nplate. \n4.2 Location of Test Coupons-Take one test coupon at each \nend of each plate as defined in 4.1. Take the test coupons from \nthe center of the plate width. \n4.3 Orientation of Test Specimens-The longitudinal axis of \nthe reduced section of the test specimens shall be perpendicular \nto the rolled surface of the plate. \n4.4 Preparation of Test Specimens: \n4.4.1 Welded Prolongations-When required, join welded \nprolongations to the surface(s) of the plate being tested. The \njoining method used shall be one which results in a minimal \nheat-affected zone in the portion of the plate to be tested. \nShielded metal arc, friction, stud, or electron-beam welding \nmethods have proven to be suitable. \n4.4.2 Standard Test Specimens: \n4.4.2.1 Three types of standard round tension test specimens \nare shown in Fig. 1 and Table 1. For Types 1 and 2 specimens, \nlocate the center of the length of the reduced section at the \napproximate mid-point of the plate thickness. For Type 3 \nspecimens, locate the weld fusion line of one plate surface \nwithin ¼ in. [6 mm] of one end of the reduced section. \n4.4.2.2 For plates from 1 in. [25 mm] to 1 ¼ in. [32 mm] \ninclusive in thickness, use either the 0.350-in. [8.75-mm] Type \n1 specimen or the 0.500-in. [12.5-mm] Type 2 specimen. \n1246 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1312.json",
  "tabulaTablesCsv": "tables_tabula/page-1312.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1312.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3550,
  "bestTextAlphaRatio": 0.7524
}