{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 600,
  "globalPageIndex": 600,
  "width": 617.52,
  "height": 857.4,
  "text": "SA-352/SA-352M ASME BPVC.II.A-2025 \nStandard Specification for \nSteel Castings, Ferritic and Martensitic, for Pressure­\nContaining Parts, Suitable for Low-Temperature Service \nl. Scope \n1.1 This specification covers steel castings for valves, \nflanges, fittings, and other pressure-containing parts intended \nprimarily for low-temperature service. \n1.2 Several grades of ferritic steels and one grade of \nmartensitic steel are covered. Selection of analysis will depend \non design and service conditions (Note). The temperature \nshown is the lowest temperature at which the material ordinar­\nily is required to meet the impact requirements of this \nspecification (see Supplementary Requirement S22, Impact \nTest Temperatures). Users should note that hardenability of \nsome of the grades mentioned may restrict the maximum size \nat which the required mechanical properties are obtainable (see \nAppendix Xl). \nGrade \nLCA \nLCB \nLCC \nLC1 \nLC2 \nLC2-1 \nLC3 \nLC4 \nLC9 \nCA6NM \nUsual Minimum Testing \nTemperatures, °F [°C] \n-25 [-32] \n-50 [-46] \n-50 [-46] \n--75 [-59] \n-100 [-73] \n-100 [-73] \n-150 [-101] \n-175 [-115] \n-320 [-196] \n-100 [-73] \nNorn 1--This specification covers the low-temperature requirements \nparticularly pertinent for ferritic and rnartensitic steels. Certain of the \ngrades of austenitic steel castings furnished in accordance with Specifi­\ncation A351/ A351M have been found suitable for low-temperature service \ndown to -300°F [-184\"C] and others down to -425°F [-254°C]. These \ngrades may be used when impact tested in accordance with Specification \nA352/A352M with energy levels and temperatures of test mutually agreed \nupon between the pnrchaser and the manufacturer. As a guide to the \nselection of e1i.ergy levels and testing temperatures, Appendix Xl should \nbe consulted. \n548 \n1.3 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. Inch-pound units are applicable for material ordered to \nSpecification A352 and SI units for material ordered to \nSpecification A352M. \n2. Referenced Documents \n2.1 ASTM Standards: \nA351/A351M Specification for Castings, Austenitic, for \nPressure-Containing Parts \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA488/A488M Practice for Steel Castings, Welding, Qualifi­\ncations of Procedures and Personnel \nA 703/ A 703M Specification for Steel Castings, General Re­\nquirements, for Pressure-Containing Parts \nEl65 Practice for Liquid Penetrant Examination for General \nIndustry \nE709 Guide for Magnetic Particle Testing \n2.2 Manufacturers' Standardization Society of the Valve and \nFittings Industry Standard: \nSP-55 Quality Standard for Steel Castings for Valves, \nFlanges, and Fittings and Other Piping Components (Vi­\nsual Method) \n3. General Conditions for Delivery \n3.1 Material furnished to this specification shall conform to \nthe requirements of Specification A703/A703M including any \nsupplementary requirements that are indicated in the purchase \norder. Failure to comply with the general requirements of \nSpecification A 703/ A 703M constitutes nonconformance with ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0600.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3387,
  "bestTextAlphaRatio": 0.7473
}