{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 412,
  "globalPageIndex": 412,
  "width": 620.76,
  "height": 859.92,
  "text": "SA-249/SA-249M ASME BPVC.II.A-2025 \n2.2 ASME Boiler and Pressure Vessel Code: \nSection VIII \n2.3 Other Standard: \nSAE J1086 Practice for Numbering Metals and Alloys \n(UNS) \n3. Ordering Information \n3.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for material ordered under this \nspecification. Such requirements may include, but are not \nlimited to, the following: \n3.1.1 Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material welded tubes (WLD) or heavily cold \nworked tubes (HCW), \n3.1.3 Grade (Table 1), \n3.1.4 Size (outside diameter and nominal wall thickness), \n3.1.5 Length (specific or random), \n3.1.6 Optional requirements (13.6), \n3.1.7 Test report required (see Certification Section of \nSpecification A1016/A1016M), \n3.1.8 Specification designation, and \n3.1.9 Special requirements and any supplementary require­\nments selected. \n3.1.9.1 If Supplementary Requirement S7 is specified, in­\nclude weld decay ratio per S 11.1.1. \n4. General Requirements \n4.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A1016/Al016M, unless otherwise provided \nherein. \n5. Manufacture \n5.1 The welded (WLD) tubes shall be made from flat-rolled \nsteel by an automatic welding process with no addition of filler \nmetal. \n5.1.l Subsequent to welding and prior to final heat \ntreatment, the tubes shall be cold worked either in both weld \nand base metal or in weld metal only. The method of cold \nworking may be specified by the purchaser. When cold drawn, \nthe purchaser may specify the minimum amount of reduction in \ncross-sectional area or wall thickness, or both. \n5.1.2 Heavily cold worked (HCW) tubes shall be made by \napplying cold working of not less than 35 % reduction in both \nwall and weld to a welded tube prior to the final anneal. No \nfiller metal shall be used in the making of the weld. Prior to \ncold working, the weld shall be 100 % radiographically in­\nspected in accordance with the requirements of ASME Boiler \nand Pressure Vessel Code, Section VIII, Division 1, latest \nrevision, Paragraph UW 51. \n6. Heat Treatment \n6.1 All material shall be furnished in the heat-treated \ncondition in accordance with the requirements of Table 2. \n6.2 A solution annealing temperature above 1950 °F [1065 \n0 C] may impair the resistance to intergranular corrosion after \nsubsequent exposure to sensitizing conditions in TP309HCb, \nTP310HCb, TP321, TP321H, TP347, TP347H, TP348, and \nTP348H. When specified by the purchaser, a lower temperature \nstabilization or re-solution anneal shall be used subsequent to \nthe initial high temperature solution anneal (see Supplementary \nRequirement S4). \n6.3 N08020 shall be supplied in the stabilization treatment \ncondition. \n7. Chemical Composition \n7 .1 The heat analysis shall conform to the requirements as \nto chemical composition given in Table 1. \n8. Product Analysis \n8.1 An analysis of either one length of flat-rolled stock or \none tube shall be made for each heat. The chemical composi­\ntion thus determined shall conform to the requirements given in \nSection 7. \n8.2 A product analysis tolerance of Table Al.I in Specifi­\ncation A480/ A480M shall apply. The product analysis toler­\nance is not applicable to the carbon content for material with a \nspecified maximum carbon of 0.04 % or less. \n8.3 If the original test for product analysis fails, retests of \ntwo additional lengths of flat-rolled stock or tubes shall be \nmade. Both retests for the elements in question shall meet the \nrequirements of the specification; otherwise all remaining \nmaterial in the heat or lot (See 13.9.1) shall be rejected or, at \nthe option of the producer, each length of flat-rolled stock or \ntube may be individually tested for acceptance. Lengths of \nflat-rolled stock or tubes that do not meet the requirements of \nthe specification shall be rejected. \n360 \n9. Tensile Requirements \n9 .1 The material shall conform to the tensile properties \nprescribed in Table 3. \n10. Hardness Requirements \n10.1 The tubes shall have a Rockwell hardness number not \nexceeding the values specified in Table 3. \n10.2 For tubing less than 0.354 in. [9.00 mm] in inside \ndiameter and for tubing less than 0.065 in. [1.65 mm] in wall \nthickness, it is permissible to use the Vickers hardness test in \nlieu of the Rockwell test. Tubes shall have a Vickers hardness \nnumber not exceeding the values specified in Table 3. \n11. Reverse-Bend Test Requirement \n11.1 A section 4 in. [100 mm] minimum in length shall be \nsplit longitudinally 90° on each side of the weld. The sample \nshall then be opened and bent around a mandrel with a \nmaximum thickness of four times the wall thickness, with the \nmandrel parallel to the weld and against the original outside \nsurface of the tube. The weld shall be at the point of maximum \nbend. There shall be no evidence of cracks, or of overlaps \nresulting from the reduction in thickness of the weld areas by \ncold working. When the geometry or size of the tubing make it ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0412.json",
  "tabulaTablesCsv": "tables_tabula/page-0412.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0412.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5070,
  "bestTextAlphaRatio": 0.7422
}