{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 447,
  "globalPageIndex": 1245,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-703/SA-703M \n(1) Exceeds approximately 10 in. 2 [65 cm 2 ] for castings weighing up \nto 1 0 000 lb [4.5 tonnes]; \n(2) Exceeds 20 in. 2 [130 cm 2 ] for castings weighing from 10 000 lb \nto 30 000 lb [4.5 to 13.5 tonnes]; \n(3) Exceeds approximately 30 in.2 [200 cm 2 ] for pieces weighing \nmore than 30 000 lb [13.5 tonnes]. \nshall be documented. \nS20.2 Weld repairs requiring documentation shall be docu­\nmented on sketches or photographs, or both. The sketches or \nphotographs shall show the location and major dimensions of \ncavities prepared for weld repair. The weld repair documenta­\ntion shall be submitted to the purchaser at the completion of the \norder. \nS21. Heat Treatment Furnace Record \nS21.1 A heat treatment chart showing time and temperature \nshall be prepared and be available for inspection by the \npurchaser. \nS22. Heat Treatment \nS22.1 Test specimens shall be heat treated together with the \ncastings they represent. Heat-treated specimens shall be tested \nand shall meet the tensile and impact properties specified. \nS22.2 The remaining test specimens from Supplementary \nRequirement S22.1 representing the casting shall be treated \nthermally after the final (foundry) heat treatment to simulate \nheat treatments below the critical temperature that the casting \nmay receive during fabrication, and then tested for mechanical \nproperties. Time, temperature, and cooling rate shall be as \nstated in the order. In the case of post-weld heat treatment, the \ntotal time at temperature or temperatures for the test material \nshall be at least 80 % of the total time at temperature or \ntemperatures during actual post-weld heat treatment of the \nfabrication of which the casting or castings are a part. The total \ntime at temperature or temperatures for the test material may be \nperformed in a single cycle. When this supplementary require­\nment is specified, the welding qualification test metal must be \nprocessed in the same manner. \nS23. Macroetch Test \nS23.l Apply Supplementary Requirement SI for the spec­\ntrographic determination and reporting of the total residual \naluminum content of all heats of ferritic and martensitic steels \nsubjected to this macroetch test. \nS23.2 When the heat analysis indicates a total residual \naluminum content in excess of 0.08 %, the manufacturer shall \netch a cross section of the casting with the heaviest section for \nwhich this supplementary requirement is invoked, or a coupon \nattached to that heaviest section or an area directly under a riser \n(Note S23.l). Cross sections, from a separately cast test block \nfrom the same heat and of a thickness representative of the \nheaviest section of castings purchased under this supplemen­\ntary requirement, may also be used for macroetch testing. The \netching shall be performed on the selected section after its heat \ntreatment, that is, after heat treatment as defined in the product \nspecification. \nNoTE S23.1-High-strength martensitic castings, in particular, may be \ndamaged beyond use if the etch is applied directly to the casting. \nS23.3 The preparation of the surface and the macroetching \nprocedure with solution No. 1 (1:1 HCl) of Table 5 in Practice \nE340 shall be followed. The resulting etched surface shall be \ncompared and rated with the reference photographs in Fig. \nS23.1 depicting ten levels of severity of intergranular network \nstructures indicative of the presence of aluminum nitride, or \nother constituents prone toward precipitating at grain bound­\naries during solidification and subsequent cooling. Table S23.1 \nrelates the severity levels shown in these photographs with \nspecific delineation widths and percent of boundary outlining \nin the etched structures. \nS23.4 Castings represented by etched structures exhibiting a \nnetwork rating in excess of Severity Level 4 shall be consid­\nered unacceptable until further evaluations are completed. The \nacceptability of individual castings may be determined by \netching sections of each casting to ascertain the network \nseverity ,level. Disposition of unacceptable castings shall be a \nmatter of agreement between the manufacturer and purchaser. \nThose castings exhibiting etched severity levels greater than \nfour may be further evaluated by any of the following \nagreed-upon methods: \nS23.4.1 Fracture testing to determine the amount of \"rock \ncandy\" structure. \nS23.4.2 Mechanical testing (bend, tensile, and so forth) to \ndetermine the ductility characteristics. \nS23.4.3 Weld testing to determine crack susceptibility in the \nheat-affected zone of a circular groove welded with cellulose \ncoated electrodes. \nS23.5 Alternatively, by agreement, it is permissible to \nsubject castings from an unacceptable heat to a high­\ntemperature homogenizing cycle prior to the normal produc­\ntion heat treatment and subsequently macroetch test each \ncasting. \nS23.6 Heavy section castings (3) whose configurations are \namenable to the attachment of test coupons representative of \nthe section thickness involved and from which standard 0.505-\nin. [12.827-mrn] diameter tension specimens may be machined \nare exempt from this macroetch test if the results of the tension \ntest on the coupon after heat treatment of the casting meet the \nminimum requirements specified for the grade of steel in­\nvolved. \nNoTE S23.2-For purposes of this supplementary requirement, a heavy \nsection casting is defined as one having a wall thickness of 1 ½ in. \n[37 mm] or greater in combination with a casting weight of at least \n1000 lb [455 kg]. \nS24. Specified Ferrite Content Range \nS24.1 The chemical composition of the heat shall be con­\ntrolled such that the ferrite content, as determined by the \nchemical composition procedure of Practice A800/ A800M, \nshall be in accordance with the specified ferrite content range. \nS24.2 The specified ferrite content range shall be as agreed \nupon between the manufacturer and the purchaser. The mini­\nmum specified ferrite content range shall be 10 %, with the \nminimum ferrite content being no lower than the percent \nnecessary to achieve the minimum mechanical properties \nrequired for the alloy. \n1159 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1245.json",
  "tabulaTablesCsv": "tables_tabula/page-1245.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1245.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6131,
  "bestTextAlphaRatio": 0.7734
}