{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 611,
  "globalPageIndex": 1409,
  "width": 613.92,
  "height": 793.2,
  "text": "( \nASME BPVC.II.A-2025 SA-834 \nA897/A897M Specification for Austempered Ductile Iron \nCastings \nA919 Terminology Relating to Heat Treatment of Metals \n(Withdrawn 1999) \nE8 Test Methods for Tension Testing of Metallic Materials \nElO Test Method for Brinell Hardness of Metallic Materials \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE30 Test Methods for Chemical Analysis of Steel, Cast Iron, \nOpen-Hearth Iron, and Wrought Iron (Withdrawn 1995) \nE59 Practice for Sampling Steel and Iron for Determination \nof Chemical Composition (Withdrawn 1996) \nE94 Guide for Radiographic Examination \nE165 Practice for Liquid Penetrant Examination for General \nIndustry \nE35 l Test Methods for Chemical Analysis of Cast Iron-All \nTypes \nE689 Reference Radiographs for Ductile Iron Castings \nE709 Guide for Magnetic Particle Testing \nE802 Reference Radiographs for Gray Iron Castings Up to \n4½ in. (114 mm) in Thickness \n2.2 Military Standard: \nMIL-STD-129 Marking for Shipment and Storage \n2.3 Federal Standard: \nFed. Std. No. 123 Marking for Shipment (Civil Agencies) \n3. Terminology \n3.1 Definitions: \n3.1.1 Definitions for many terms common to iron castings \nand their heat treatment are found in Terminology A919 and \nTerminology A644. A classification of graphite structure is \nfound in Test Method A247. \n4. Ordering Information \n4.1 The purchase order for castings ordered under this \nspecification shall stipulate the applicable material specifica­\ntion(s), grade of iron, and any options or additions to the basic \nrequirements, including the supplementary requirements in­\ncluded in this specification. \n5. Tensile Requirements \n5.1 The individual product specifications vary as to whether \ntension tests are required. For this reason, and to determine \nspecific test requirements, the individual product specification \nshall be reviewed. When required, tension tests shall be \ndetermined in accordance with Test Methods E8. \n6. Chemical Requirements \n6.1 The individual product specifications vary as to whether \nchemical analysis is required. To determine specific require­\nments, the individual product specification should be reviewed. \n6.2 Sampling shall be conducted in accordance with Test \nMethod E59. Spectrographic or other methods such as those in \nTest Methods E30 and E351 may be used for chemical \nanalysis. In the event of a dispute regarding chemical compo­\nsition, Test Methods E351 and E30 shall be used for referee \npurposes. \n6.3 The chemical analysis for total carbon shall be made on \nchilled pencil-type specimens or from thin wafers approxi­\nmately 1/32 in. (0.8 mm) thick cut from test coupons. Drillings \nare not reliable because of a probable loss of graphite. \n6.4 Chemical analysis results shall be rounded, in accor­\ndance with Practice E29, to the nearest unit in the last \nright-hand place of values in the table of chemical require­\nments. \n6.5 A product analysis may be made by the purchaser from \nmaterial representing each heat, lot, or casting. The analysis \nshall be made on representative material. Samples for carbon \nanalysis shall be taken no closer than ¼ in. to a cast surface, \nand shall follow the practice in 5.3, except where the size or \nshape of the casting does not permit such sampling. The \nchemical composition thus determined shall meet the require­\nments specified in the applicable specification for the grade \ninvolved. \n7. Workmanship, Finish, and Appearance \n7.1 All castings shall be made in a workman-like manner \nand shall conform to the dimensions on drawings furnished by \nthe purchaser before manufacture is started. If the pattern is \nsupplied by the purchaser, the dimensions of the casting shall \nbe as predicted by the pattern. \n8. Sampling \n8.1 A lot shall consist of one of the following: \n8.1.1 All the metal from a single heating in a batch-type \nmelting furnace. \n8.1.2 All the metal poured from two or more batch-type \nmelting furnaces into a single ladle or a single casting. \n8.1.3 All the metal poured from a continuous melting \nfurnace for a given period of time between changes in charge, \nprocessing conditions, or aim-for chemistry, or 4 h, whichever \nis the shorter period. \n8.1.3.1 The purchaser may agree to extend the 4-h time \nperiod to 8 h if the manufacturer can demonstrate sufficient \nprocess control to warrant such an extension. \n9. Inspection \n9.1 All tests and inspections required by this specification \nshall be perfotmed by the manufacturer or other reliable \nsources whose services have been contracted for by the \nmanufacturer. Complete records of all tests and inspections \nshall be maintained by the manufacturer and shall be available \nfor review by the purchaser. \n9.2 The manufacturer shall afford the purchaser's inspector \nall reasonable facilities necessary to satisfy that the material is \nbeing produced and furnished in accordance with the appli­\ncable specification. Foundry inspection by the purchaser shall \nnot interfere unnecessarily with the manufacturer's operations. \n1347 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1409.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5048,
  "bestTextAlphaRatio": 0.7726
}