{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 495,
  "globalPageIndex": 1293,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-748/SA-748M \n7. Number of Tests \n7 .1 The number of tension tests shall be in accordance with \nSpecification A278/A278M. \n8. Specimen Preparation \n8.1 Test bars representing the gray iron portion of the roll \nshall be made from a prolongation at one end of the roll journal \nin accordance with Specification A278/A278M. Tension test \nspecimens machined from this prolongation shall conform to \nthe dimensions shown for Specimen \"C\" in Specification \nA278/A278M. \n9. Test Method \n9 .1 Tension test specimens shall fit the holders of the testing \nmachine in such a way that the load shall be axial. The use of \nself-aligning shackles is suggested. After reaching a stress \nequivalent to 15 000 psi [100 MPa], the speed of the moving \nhead of the testing machine shall. not exceed Vs in. [3.2 \nmm]/min. \nlO. Inspection \n10.1 The inspector representing the purchaser shall have \nfree entry at all times, while work on the contract of the \npurchaser is being performed, to all parts of the manufacturer's \nworks that concern the manufacture of the material ordered. \nThe manufacturer shall afford the inspector all reasonable \nfacilities to satisfy him that the material is being furnished in \naccordance with this specification. Unless otherwise specified, \nall tests and inspections shall be made at the place of \nmanufacture prior to the shipment, and shall be so conducted as \nnot to interfere unnecessarily with the operation of the works. \n11. Acceptance and Certification \n11.1 Final acceptance of the casting shall follow complete \nmachining of the casting. Upon request of the purchaser and \nwhen so specified in the purchase order, a certification shall be \nmade on the basis of acceptance of the material. This shall \nconsist of a copy of the manufacturer's test report or a \nstatement by the supplier, accompanied by a copy of the test \nresults, that the material has been sampled, tested, and in­\nspected in accordance with the provisions of this specification. \nEach certification so furnished shall be signed by an authorized \nagent of the supplier or manufacturer. \n12. Product Marking \n12.1 Pressure-containing castings made in accordance with \nthis specification shall have the nam.e of the manufacturer or \nhis recognized trademark and the class of iron to which it \nconforms, cast or indelibly stamped on the surface indicated by \nthe purchaser or in such a position as not to injure the \nusefulness of the casting. \n1219 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1293.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2460,
  "bestTextAlphaRatio": 0.7707
}