{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 541,
  "globalPageIndex": 541,
  "width": 609.24,
  "height": 851.28,
  "text": "ASME BPVC.II.A-2025 SA-333/SA-333M \nthis specification. The outside diameter at the point of grinding \nmay be reduced by the amount so removed. \n10.5.l Wall thickness measurements shall be made with a \nmechanical caliper or with a properly calibrated nondestrnctive \ntesting device of appropriate accuracy. In case of dispute, the \nmeasurement determined by use of the mechanical caliper shall \ngovern. \n10.6 Weld repair shall be permitted only subject to the \napproval of the purchaser and in accordance with Specification \nA999/A999M. \n10.7 The finished pipe shall be reasonably straight. \n11. General Requirements \n11.1 Material furnished to this specification shall conform to \nthe applicable requirements of the current edition of Specifi­\ncation A999/A999M unless otherwise provided herein. \n12. Mechanical Testing \n12.l Sampling-For mechanical testing, the term \"lot\" ap­\nplies to all pipe of the same nominal size and wall thickness ( or \nschedule) that is produced from the same heat of steel and \nsubjected to the same finishing treatment in a continuous \nfurnace. If the final heat treatment is in a batch-type furnace, \nthe lot shall include only those pipes that are heat treated in the \nsame furnace charge. \n12.2 Transverse or Longitudinal Tensile Test and Flattening \nTest-For material heat treated in a batch-type furnace, tests \nshall be made on 5 % of the pipe from each lot. If heat treated \nby the continuous process, tests shall be made on a sufficient \nnumber of pipe to constitute 5 % of the lot, but in no case less \nthan 2 pipes. \n12.3 Impact Test-One notched bar impact test, consisting \nof breaking three specimens, shall be made from each heat \nrepresented in a heat-treatment load on specimens taken from \nthe finished pipe. This test shall represent only pipe from the \nsame heat and the same heat-treatment load, the wall thick­\nnesses of which do not exceed by more than¼ in. [6.3 mm] the \nwall thicknesses of the pipe from which the test specimens are \ntaken. If heat treatment is performed in continuous or batch­\ntype furnaces controlled within a 50 °F [30 °C] range and \nequipped with recording pyrometers so that complete records \nof heat treatment are available, then one test from each heat in \na continuous run only shall be required instead of one test from \neach heat in each heat-treatment load. \n12.4 Impact Tests (Welded Pipe)-On welded pipe, addi­\ntional impact tests of the same number as required in 12.3 shall \nbe made to test the weld. \n12.5 Specimens showing defects while being machined or \nprior to testing may be discarded and replacements shall be \nconsidered as original specimens. \n12.6 Results obtained from these tests shall be reported to \nthe purchaser or his representative. \n13. Specimens for Impact Test \n13.1 Notched bar impact specimens shall be of the simple \nbeam, Charpy-type, in accordance with Test Methods \nType A with a V notch. Standard specimens 10 by 10 mm in \ncross section shall be used unless the material to be tested is of \ninsufficient thickness, in which case the largest obtainable \nsubsize specimens shall be used. Charpy specimens of width \nalong the notch larger than 0.394 in. [10 mm] or smaller than \n0.099 in. [2.5 mm] are not provided for in this specification. \n13.2 Test specimens shall be obtained so that the longitudi­\nnal axis of the specimen is parallel to the longitudinal axis of \nthe pipe while the axis of the notch shall be perpendicular to \nthe smface. On wall thicknesses of 1 in. [25 mm] or less, the \nspecimens shall be obtained with their axial plane located at the \nmidpoint; on wall thicknesses over 1 in. [25 mm], the speci­\nmens shall be obtained with their axial plane located ½ in. \n[12.5 mm] from the outer surface. \n13.3 When testing welds the specimen shall be, whenever \ndiameter and thickness permit, transverse to the longitudinal \naxis of the pipe with the notch of the specimen in the welded \njoint and perpendicular to the surface. When diameter and \nthickness do not permit obtaining transverse specimens, longi­\ntudinal specimens in accordance with 13.2 shall be obtained; \nthe bottom of the notch shall be located at the weld joint. \n14. Impact Test \n14.1 Except when the size of the finished pipe is insufficient \nto permit obtaining subsize impact specimens, all material \nfurnished to this specification and marked in accordance with \nSection 16 shall be tested for impact resistance at the minimum \ntemperature for the respective grades as shown in Table 4. \n14.1.1 Special impact tests on individual lots of material \nmay be made at other temperatures as agreed upon between the \nmanufacturer and the purchaser. \n14.1.2 When subsize Charpy impact specimens are used and \nthe width along the notch is less than 80 % of the actual wall \nthickness of the miginal material, the specified Charpy impact \ntest temperature for Grades 1, 3, 4, 6, 7, 9, 10, and 11 shall be \nlower than the minimum temperature shown in Table 4 for the \nrespective grade. Under these circumstances the temperature \nreduction values shall be by an amount equal to the difference \n(as shown in Table 6) between the temperature reduction \ncorresponding to the actual material thickness and the tempera­\nture reduction corresponding to the Charpy specimen width \n489 \nTABLE 6 Impact Temperature Reduction \nSpecimen Width Along Notch or Actual \nMaterial Thickness \nin. mm \n0.394 10 (standard size) \n0.354 9 \n0.315 8 \n0.295 7.5 (¾ std. size) \n0.276 7 \n0.262 6.67 (% std. size) \n0.236 6 \n0.197 5 (½std.size) \n0.158 4 \n0.131 3.33 (1/s std. size) \n0.118 3 \n0.099 2.5 (¼ std. size) \nTemperature Reduction, \nDegrees ColderA \nOF oc \n0 0 \n0 0 \n0 0 \n5 3 \n8 4 \n10 5 \n15 8 \n20 11 \n30 17 \n35 19 \n40 22 \n50 28 \nA Straight line interpolation for intermediate values is permitted. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0541.json",
  "tabulaTablesCsv": "tables_tabula/page-0541.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0541.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5766,
  "bestTextAlphaRatio": 0.739
}