{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 387,
  "globalPageIndex": 387,
  "width": 620.76,
  "height": 859.92,
  "text": "ASME BPVC.II.A-2025 SA-234/SA-234M (ASTM A234/A234M) \n~- small fittings, the bar code may be applied to the box or a \nsubstantially applied tag. \n21. Keywords \n21.1 pipe fittings-steel; piping applications; pressure con­\ntaining parts; pressure vessel service; temperature service \napplications-elevated \nSUPPLEMENTARY REQUIREMENTS \nThese requirements shall not be considered unless specified in the order, in which event, the \nsupplementary requirements specified shall be made at the place of manufacture, unless otherwise \nagreed upon, at the purchaser's expense. The test specified shall be witnessed by the purchaser's \ninspector before shipment of material, if so specified in the order. \nSt. Alternative Heat Treatment-Grade WP91 Type 1 and \nType 2 \nS 1.1 Grade WP91 Type 1 and Type 2 shall be normalized in \naccordance with 8.3.5 and tempered at a temperature, to be \nspecified by the purchaser, less than 1350 °F [730 °C]. It shall \nbe the purchaser's responsibility to subsequently temper the \nentire fitting in the temperature range of 1350 °F [730 °C] to \n1470 °F [800 °C] as a final heat treatment. All mechanical tests \nshall be made on material heat treated in accordance with 8.3.5. \nThe certification shall reference this supplementary require­\nment indicating the actual tempering temperature applied. The \nnotation \"S l\" shall be included with the required marking of \nthe fitting. \nS2. Restricted Vanadium Content \nS2.1 The vanadium content of the fittings shall not exceed \nO.o3%. \nS3. Carbon Equivalent \nS3.l For grades WPB and WPC, the maximum carbon \nequivalent (C.E.), based on heat analysis and the following \nformula, shall be 0.50. \nCr+Mo+V Ni+Cu \n5 +-1-5-\nS3.2 A lower maximum carbon equivalent may be agreed \nupon between the purchaser and the supplier. \nS3.3 The C.E. shall be reported on the test report. \nS4. ASME Section III or Section VIII, Division 1 Construc­\ntion \nS4. l Products welded with filler metal furnished under this \nspecification that are intended for application under the rules of \nSection III or Section VIII, Division 1 of the ASME Boiler and \nPressure Vessel Code shall be manufactured by holders of the \nappropriate ASME Certificate of Authorization and Certifica­\ntion Mark. The product is subject to all applicable requirements \nof Section III or Section VIII, Division 1, including welding, \nheat treatment, nondestructive examination, authorized inspec­\ntion at the point of manufacture, and application of the \nCertification Mark. \nS4.2 The applicable ASME Partial Data Report form, \nsigned by an Authorized Nuclear Inspector or Authorized \nInspector, and a material test report shall be furnished for each \nlot of pipe fittings. \nS4.3 The material used to fabricate the pipe fittings shall \nconform to the applicable SA specification in ASME Boiler and \nPressure Vessel Code, Section II. The welded joints shall be \nfull penetration butt welds as obtained by double welding or by \nother means that will obtain the same quality of deposited weld \nmetal on the inside and outside. Welds using metal backing \nstrips that remain in place are prohibited. \nS4.4 Each piece of pipe fitting shall be so marked as to \nidentify each such piece of pipe fitting with the lot and the \nmaterial test report. \n335 \nSS. Minimum Cooling Rate for Grade T91 Type 2 \nS5.1 For Grade WP91 Type 2 material, the heat treatment \nshall ensure that following austenitizing the rate of cooling \nfrom 1650 °F to 900 °F [900 °C to 480 °C] is no slower than \n9 °F/min [5 °C/ min]. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0387.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3511,
  "bestTextAlphaRatio": 0.7551
}