{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 718,
  "globalPageIndex": 718,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-401/SA-401M ASME BPVC.II.A-2025 \nSpecification for \nSteel Wire, Chromium-Silicon Alloy \n1. Scope \n1. 1 This specification covers round and shaped chromium­\nsilicon alloy steel spring wire having properties and quality \nintended for the manufacture of springs resistant to set when \nused at moderately elevated temperatures. This product is not \nmeant to be used for non-static applications involving moder­\nate fatigue stresses ( see Specification A 1000/ A 1000M) or high \ncycle fatigue applications (see Specification A877/A877M). \nThis wire shall be provided either in the annealed and \ncold 0 drawn or quench and tempered condition as specified by \nthe purchaser. \n1.2 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.2.1 Within the text, the inch-pound units are shown in \nbrackets. \n1.3 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA510/A510M Specification for General Requirements for \nWire Rods and Coarse Round Wire, Carbon Steel, and \n668 \nA 700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA877 / A877M Specification for Steel Wire, Chromium­\nSilicon Alloys, Chrome-Silicon-Vanadium Alloy Valve \nSpring Quality \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nAlO00/AlO00M Specification for Steel Wire, Carbon and \nAlloy Specialty Spring Quality \nE8/E8M Test Methods for Tension Testing of Metallic Ma­\nterials \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \n3. Terminology \n3.1 Definitions: \n3.1.1 For definitions of terms used in this specification, see \nTerminology A941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.1 equivalent round diameter, n-diameter of a round \nwire having equivalent cross sectional area to a given shaped \nwire. \n3.2.2 round wire, n-wire having a circular cross section. \n3.2.3 shape factor, n-this value is used to obtain cross \nsectional area for shaped wires when multiplied by measured \nwidth and thickness. \n3.2.4 shaped wire, n-wire having a non-circular cross \nsection. \n4. Ordering Information \n4.1 It shall be the responsibility of the purchaser to specify \nall requirements that are necessary for material under this \nspecification. Such requirements may include, but are not \nlimited to, the following: \n4.1.1 Quantity (mass), \n4.1.2 Name of material (chromium-silicon alloy steel wire), \n4.1.3 Dimensions (Table 1 and Section 9), \n4.1.4 Condition (Section 7), and \n4.1.5 ASTM designation and year of issue. \n4.2 The purchaser shall have the option to specify additional \nrequirements, including but not limited to: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0718.json",
  "tabulaTablesCsv": "tables_tabula/page-0718.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0718.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3385,
  "bestTextAlphaRatio": 0.7619
}