{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 677,
  "globalPageIndex": 1475,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-962/SA-962M \nHardened steel stud \nFinely ground surface finish \n32 µin. [O,S µm] or finer \nFIG. 2 Cone-Proof Test \nin. [3 mm] per minute maximum and shall be held for at least \n10 s. The nut shall support its specified cone proof load without \nstripping or rupture. \n11.2.1 Mandrels shall conform to the requirements of \n11.1.1. \n11.2.2 Conical washers shall have a hardness of 57 HRC \nminimum and a hole diameter equivalent to the nominal \ndiameter of the mandrel +0.002, -0.000 in. [+0.05 and -0.00 \nmm]. \n11.2.3 The contact point of the cone shall be sharp for nut \nsizes ½ in. [12 mm] or less. For sizes over ½ in. [12 mm], the \npoint shall be fiat and 0.015 :±: 0.001 in. [0.38 + 0.03 mm] in \nwidth. \n11.2.4 Cone proof loads may be determined as shown in \nTables 1 and 2 when they are not specified in the product \nspecification. \n12. Impact Requirements \n12.1 The material shall conform to the impact requirements \nprescribed in the product specification. \n12.2 Sampling for impact testing shall conform to the \nproduct specification. \n12.3 The impact test specimen shall have the form and \ndimensions shown in Fig. 10 of Test Methods and Definitions \nA370 for the Charpy V-notch specimen, Type A when inch­\npound units are specified or to the test specimens described in \nthe applicable track of Test Methods A1058 if SI units are \nspecified. The longitudinal axis of the specimen shall be \nparallel to the direction of rolling or, in the case of forgings, to \nthe longest axis of the component the test bar represents. The \nnotch shall be located on the test specimen surface which most \nclosely approaches a radial direction. The base of the notch \nshall be as nearly as practicable perpendicular to the longest \naxis of the component. \n13. Workmanship, Finish, and Appearance \n13.1 The bolting components shall conform to the \ndimensions, tolerances and finish as specified in the purchase \norder or in the individual product specification. \n13.2 Bars-Bars shall meet the dimensional requirements of \nSpecifications A29/ A29M or A484/ A484M as applicable. \n13.3 Bolts, Screws, Studs, and Stud Bolts-Points shall be \nflat and chamfered or rounded at the option of the manufac­\nturer. The length of the point on studs and stud bolts shall be \nnot less than one nor more than two complete threads as \nmeasured from the extreme end parallel to the axis. Length of \nstuds and stud bolts shall be measured from first thread to first \nthread. Bolts, studs, and bolting material shall be capable of \npassing inspection in accordance with Specification F788. \n13.3.l Hex Bolts-Unless otherwise specified in the pur­\nchase order heads shall be in accordance with the dimensions \nof ASME B18.2.l or B18.2.3.6M and the Heavy Hex screw \nseries, should be used, except the maximum body diameter and \nradius of fillets may be the same as for the heavy hex bolt \nseries. The body diameter and head fillet radius for sizes of \nheavy hex cap screws and bolts that are not shown in their \nrespective tables in the ASME specifications may be that \nshown in the corresponding hex cap screw and bolt tables \nrespectively. Unless otherwise specified on the purchase order \nMetric Heavy Hex Screws shall be in accordance with ASME \nBl8.2.3.3M. \n13.3.2 Socket Heads-Unless otherwise specified socket \nhead screws shall be in accordance with ASME Bl8.3 or ISO \n4762. \n13.3.3 Studs and Stud Bolts-Unless otherwise specified in \nthe purchase order, dimensions and tolerances for studs and \nstud bolts shall be in accordance with ASME B18.31.2. \n13 .4 External Threads-Threads shall either be formed after \nheat treatment or heat treatment shall be performed in atmo­\nsphere control furnaces. \n13.4.1 Thread Form-Unless otherwise specified external \nthreads shall be in accordance with ASME Bl.l, Class 2A fit, \nor ASME Bl.13M, Class 6g fit. \n13.4.2 Inch Series-Sizes 1 in. and smaller in diameter shall \nbe coarse thread series, and those 11/s in. and larger in diameter \nshall be eight pitch thread series, unless otherwise specified. \n13.5 Nuts-Unless otherwise specified nuts shall be hexago­\nnal in shape and the American National Standard Heavy Hex \n1417 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1475.json",
  "tabulaTablesCsv": "tables_tabula/page-1475.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1475.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4165,
  "bestTextAlphaRatio": 0.7383
}