{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 664,
  "globalPageIndex": 1462,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-961/SA-961M ASME BPVC.II.A-2025 \n6.1.1 Bar-Flanges, elbows, return bends, tees, and header \ntees shall not be machined directly from bar. Other cylindrical \nshaped parts up to, and including, NPS 4 can be machined from \nbar provided that the axial length of the part is approximately \nparallel to the metal flow lines of the starting stock. \n6.1.2 Wrought Seamless Pipe and Tubing-Flanges shall not \nbe machined directly from seamless pipe or tubing. Other \nhollow cylindrical shaped parts can be machined from seam­\nless pipe and tubing provided that the axial length of the pa.it \nis approximately parallel to the metal flow lines of the staiting \nstock. \n7. Heat Treatment \n7.1 Material requiring heat treatment shall be treated as \nspecified in the individual product specification using the \nfollowing procedures that are defined in more detail in Termi­\nnology A94 l. \n7.1.1 Annealing-Material shall be uniformly reheated to a \ntemperature above the transformation range and, after holding \nfor a sufficient time at this temperature, cooled slowly to a \ntemperature below the transformation range. \n7.1.2 Solution Annealing (or Solution Treat or Treatment)­\nMaterial shall be heated to a temperature that causes the \nchromium cai·bides to go into solution, and then, quenched in \nwater or rapidly cooled by other means to prevent re­\nprecipitation. \n7.1.3 Isothermal Annealing-Isothermal annealing shall \nconsist of austenitizing a ferrous alloy, and then, cooling to and \nholding within the range of temperature at which the austenite \ntransfonns to a relatively soft ferrite-carbide aggregate. \n7.1.4 Normalizing-Material shall be uniformly reheated to \na temperature above the transformation range, and \nsubsequently, cooled in air at room temperature. \n7.1.5 Tempering and Post-Weld Heat Treatment-Material \nshall be reheated to the prescribed temperature below the \ntransformation range, held at temperature for the greater of 30 \nmin or 1 h/in. [25 .4 mm] of thickness at the thickest section and \ncooled in still air. \n7.1.6 Stress Relieving-Material shall be uniformly heated \nto the selected stress relieving temperature, held long enough \nto reduce stresses and then cooled at a rate that will result in the \nproperties required for the material grade and minimize the \ndevelopment of new residual stresses. The temperature shall \nnot vary from the selected temperature by more than :±: 25 °F \n[:±:14 °C]. \n7.1.7 Quench and Temper-Material shall be fully austen­\nitized and quenched immediately in a suitable liquid medium. \nThe quenched material shall be reheated to a minimum \ntemperature of 1100 °F [590 °C] and cooled in still air. \n7.1.8 Same Heat Treat Cycle-Heat treat loads at the same \ntemperature, equivalent soak times as appropriate for the \nmaximum section size on the respective load and equivalent \ncooling methods. \n8. Chemical Requirements \n8.1 Chemical Analysis-Samples for chemical analysis and \nmethods of analysis shall be in accordance with Test Methods, \nPractices, and Terminology A 751. \n8.2 Heat Analysis-An analysis of each heat of steel shall be \nmade by the steel manufacturer to determine the percentages of \nthose elements specified in the individual product specification. \nIf secondary melting processes are employed, the heat analysis \nshall be obtained from one remelted ingot, or the product of \none remelted ingot, from each primary melt. The chemical \nanalysis thus determined shall conform to the requirements of \nthe individual product specification. Note that the product \nanalysis (check analysis) tolerances are not to be applied to the \nHeat Analysis requirements. \n8.3 Product Analysis-If a product analysis is performed it \nshall be in accordance with Test Methods, Practices, and \nTerminology A751. Sainples for analysis shall be taken from \nmidway between center and surface of solid parts, midway \nbetween inner and outer surfaces of hollow parts, midway \nbetween center and surface of full-size prolongations or from \nbroken mechanical test specimens. The chemical composition \nthus determined shall conform to the limits of the product \nspecification, within the permissible variations of Table 1 of \nthis specification. \n8.3.1 Limits on formula calculations involving elemental \ncontents shall apply only to the heat analysis, unless agreed \nupon between supplier and purchaser. Where limits on formula \ncalculations involving elemental contents apply to product \nanalysis by such agreement, permissible variations in the \nformula calculation results beyond the limits for the heat \nanalysis shall also be agreed upon between supplier and \npurchaser. Examples of such formula calculations include, but \nare not limited to, the following: carbon equivalent CE = C + \nMn/ 6 + (Cr+ Mo + V) / 5 + (Ni + Cu) / 15; J factor= (Mn \n+ Si) x (P + Sn) x 104; or requirements for specific elemental \nbalance or sufficiency, typically related to Ti, Nb, or Al and \ninterstitials C and N, such as Nb = 5 x C minimum. \n9. Mechanical Requirements \n9.l Method of Mechanical Tests-All tests shall be con­\nducted in accordance with Test Methods and Definitions A370 \nif the inch-pound units are specified or Test Methods A1058 if \nthe M suffix (SI units) is specified. \n9.2 For the purpose of determining conformance to the \nproduct specification requirements, specimens shall be ob­\ntained from the production forgings, or from separately forged \ntest blanks prepared from the stock used to make the finished \nproduct. In either case, mechanical test specimens shall not be \nremoved until after all heat treatment is complete. If repair \nwelding is performed, test specimens shall not be removed \nuntil after post-weld heat treatment is complete, unless permit­\nted by the product specification. The locations from which test \nspecimens are removed shall be in accordance with the Product \nSpecification. \n9.3 If separately forged test blanks are used, they shall be of \nthe saine heat of steel, be subjected to substantially the same \nreduction and working as the production forging they \nrepresent, be heat treated in the same furnace charge except as \nprovided for in the reduced testing provisions of the product \nspecification, under the same conditions as the production \nforging, and be of the saine nominal thickness as the maximum \nheat treated thickness of the production forging. \n1404 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1462.json",
  "tabulaTablesCsv": "tables_tabula/page-1462.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1462.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6350,
  "bestTextAlphaRatio": 0.783
}