{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 338,
  "globalPageIndex": 338,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-213/SA-213M (ASTM A213/A213M) ASME BPVC.II.A-2025 \nTABLE 3 Continued \nAustenitizing/ Subcritical Annealing \nor Tempering \nTemperature, Grade UNS Solutioning/ \nHeat Treat Type Stabilizing Cooling Media Number Temperature, min or range °F [\"CJ \nASTM \nGrain Size No. 8 \nmin or range °F [°C] \nAlloy 20 \n800 \n800H \nN08020 \nN08028 \nN08029 \nN08367 \nN08800 \nN08810 \nN08811 \nN08904 \nN08925 \nN08926 \nS35030 \nstabilization \ntreatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \nsolution treatment \n1700-1850 \n[925-1010jF \n2000 [1100]F \n2000 [1100jF \n2025 [1105jF \n1900 [1040]P \n2050 [1120]P \n2100 [1150jF \n2000 [1100jF \n2010-2100 \n[1100-1150] \n2010-2100 \n[1100-1150] \n1900 [1040]P \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \nwater or other rapid cool \n5 \n5 \nFerritic Stainless Steels \nTP444 S44400 subcritical anneal \nA Where ellipses ( ... ) appear in this table there is no requirement. \n8 ASTM Grain Size No. listed, or coarser, unless otherwise indicated. \nc Approximately, to achieve properties. \n1400 [760] \n0 Accelerated cooling from the normalizing temperature shall be permitted for section thicknesses greater than 3 in. [75 mm]. \nEAccelerated air cooling or liquid quenching shall be permitted for Class 2. \nF Quenched in water or rapidly cooled by other means, at a rate sufficient to prevent re-precipitation of carbides, as demonstrable by the capability of tubes, heat treated \nby either separate solution annealing or by direct quenching, passing Practices A262, Practice E. The manufacturer is not required to run the test unless it is specified on \nthe purchase order (see Supplementary Requirement S4). Note that Practices A262 requires the test to be performed on sensitized specimens in the low-carbon and \nstabilized types and on specimens representative of the as-shipped condition for other types. In the case of low-carbon types containing 3 % or more molybdenum, the \napplicability of the sensitizing treatment prior to testing shall be a matter for negotiation between the seller and the purchaser. \n0 A maximum solution treating temperature of 2100 °F [1150 °CJ is recommended for UNS S21500. \nHA solution treating temperature above 1950 °F [1065 °CJ may impair resistance to intergranular corrosion after subsequent exposure to sensitizing conditions in the \nindicated grades. When specified by the purchaser, a lower temperature stabilization or resolution anneal shall be used subsequent to the higher-temperature solution \nanneal prescribed in this table. \n1 Solution treatment shall be preceded by a softening heat treatment prior to cold-working. The softening temperature shall be at least 90 °F [50 °C] higher than the solution \nheat treatment temperature, which shall be at 2150 °F [1180 °C] minimum. \n4.1.7 Size (outside diameter and minimum wall thickness, \nunless average wall thickness is specified), \n4.1.8 Length (specific or random), \n4.1.9 Hydrostatic Test or Nondestructive Electric Test (see \n10.1), \n4.1.10 Specification designation and year of issue, \n4.1.11 Increased sulfur (for machinability, see Note B, Table \n1, and 16.3), and \n4.1.12 Special requirements and any supplementary require­\nments selected. \n5. General Requirements \n5 .1 Product furnished to this specification shall conform to \nthe requirements of Specification Al016/A1016M, including \nany supplementary requirements that are indicated in the \npurchase order. Failure to comply with the general require­\nments of Specification Al016/A1016M constitutes nonconfor­\nmance with this specification. In case of conflict between the \nrequirements of this specification and Specification A1016/ \nAl016M, this specification shall prevail. \n6. Materials and Manufacture \n6.1 Manufacture and Condition-Tubes shall be made by \nthe seamless process and shall be either hot finished or cold \nfinished, as specified. Grade TP34 7HFG shall be cold finished. \n6.2 Heat Treatment: \n286 \n6.2.l Ferritic Alloy and Ferritic Stainless Steels-The fer­\nritic alloy and ferritic stainless steels shall be reheated for heat \ntreatment in accordance with the requirements of Table 3. Heat \ntreatment shall be carried out separately and in addition to \nheating for hot forming. \n6.2.2 Austenitic Stainless Steels-AU austenitic tubes shall \nbe furnished in the heat-treated condition, and shall be heat \ntreated in accordance with the requirements of Table 3. \nAlternatively, immediately after hot forming, while the tem­\nperature of the tubes is not less than the minimum solution or \nstabilization treatment temperature specified in Table 3, tubes \nmay be individually quenched in water or rapidly cooled by \nother means (direct quenched). \n6.3 If any controlled structural characteristics are required, \nthese shall be so specified in the order as to be a guide as to the \nmost suitable heat treatment. \n7. Chemical Composition \n7.1 Composition Requirements: \n7 .1.1 The alloy steels shall conform to the chemical require­\nments given in Table 1. \n7.1.2 The stainless steels shall conform to the chemical \nrequirements given in Table 2. \n7.2 Product Analysis: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0338.json",
  "tabulaTablesCsv": "tables_tabula/page-0338.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0338.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5410,
  "bestTextAlphaRatio": 0.7318
}