{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 131,
  "globalPageIndex": 131,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-20/SA-Z0M \nSUPPLEMENTARY REQUIREMENTS \nThe following standardized supplementary requirements are for use if desired by the purchaser, \nThose that are considered suitable for use with a product specification are listed in the product \nspecification. Other tests may be performed by agreement between the manufacturer or processor and \nthe purchaser. These supplementary requirements shall apply only if specified in the purchase order, \nin which event the specified tests shall be made by the manufacturer or processor before shipment of \nthe plates. \nSl. Vacuum Treatment \nS 1.1 The steel shall be made by a process that includes \nvacuum degassing while molten. Unless otherwise agreed upon \nwith the purchaser, it is the responsibility of the manufacturer \nto select suitable process procedures. \nS2. Product Analysis \nS2.1 A product analysis shall be made of each plate as \nrolled. The specimens for analysis shall be taken adjacent to or \nfrom a broken tension test specimen. \nS3. Simulated Post-Weld Heat Treatment of Mechanical \nTest Coupons \nS3.1 Prior to testing, the test coupons representing the plate \nfor acceptance purposes for mechanical properties shall be \nthermally treated to simulate a post-weld heat treatment below \nthe critical temperature (Ac 3 ), using the heat treatment param­\neters (such as temperature range, time, and cooling rates) \nspecified in the purchase order. For tests using specimens taken \nfrom such heat treated test coupons, the test results shall meet \nthe requirements of the applicable product specification. Test­\ning need only be performed and reported in the simulated \npost-weld heat treated condition. \nS4. Additional Tension Test \nS4.1 Other Than Quenched-and-Tempered Plates-In addi­\ntion to the required single tension test, a second tension test \nshall be made using a test specimen taken from a test coupon \ntaken from a corner of the plate-as-rolled on the end opposite \nthe single test specimen and in a direction parallel to the single \ntest specimen. The results obtained using this second test \nspecimen shall meet the requirements of the applicable product \nspecification. \nS4.2 Quenched-and-Tempered Plates 2 in. [50 mm] or \nGreater in Thickness-In addition to the required tension tests, \ntwo additional test coupons shall be taken from the bottom \ncorner of the plate. One shall be taken at the center of the plate \nthickness and the other immediately beneath the surface. \nMandatory conformance of these additional tests with the \nspecified properties shall be a matter of agreement between the \nmanufacturer and the purchaser. \nSS. Charpy V-Notch Impact Test \nS5.l Charpy V-notch impact tests shall be conducted in \naccordance with 12.1. \n79 \nS5.2 The orientation of the test specimens, whether longi­\ntudinal or transverse to the direction of rolling, shall be as \nspecified in the purchase order. \nS5.3 The test temperature and the required acceptance \ncriteria, if other than those required in 12.1, shall be as \nspecified in the purchase order. \nS5.4 The recorded results shall include test specimen \norientation, test specimen size, test temperature, absorbed \nenergy values, and, if specified in the purchase order for other \nthan Class VI plates, lateral expansion opposite the notch. The \npercent shear fracture appearance shall also be recorded if \nspecified in the purchase order. \nS6. Drop-Weight Test (for Plates 0.625 in. [16 mm] and \nOver in Thickness) \nS6.l Drop-weight tests shall be made in accordance with the \nrequirements of Test Method E208. The specimens shall \nrepresent the plates in the final condition of heat treatment. \nAgreement shall be reached between the purchaser and the \nmanufacturer or processor as to the number of plates to be \ntested and whether a maximum NDT temperature is mandatory \nor if the test results are for information only. \nS7. High-Temperature Tension Tests \nS7.1 A sho1i-time elevated temperature tension test shall be \nmade to represent each plate or each heat of steel as indicated \nby the purchaser. The specimens for testing shall be obtained as \nrequired for the room temperature tension tests specified in the \nbody of this general requirements specification. The high­\ntemperature tests shall be made in accordance with the require­\nments of Test Methods E21. Mandatory conformance of such \nadditional tests with the specified properties shall be a matter \nfor agreement between the manufacturer or processor and the \npurchaser. \nSS. Ultrasonic Examination in Accordance with A435/ \nA435M \nS8.1 All plates shall be ultrasonically examined in accor­\ndance with the requirements of Specification A435/ A435M. \nS9. Magnetic Particle Examination \nS9.l All plate edges shall be examined by magnetic par­\nticles in accordance with the procedures covered in Guide \nE709. The acceptability of defects revealed by this examina­\ntion shall be judged in accordance with the requirements for \nquality in 9.3. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0131.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4944,
  "bestTextAlphaRatio": 0.7907
}