{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 250,
  "globalPageIndex": 1048,
  "width": 621.72,
  "height": 799.2,
  "text": "SA-556/SA-556M (ASTM A556/A556M) ASME BPVC.II.A-2025 \nthe dimensional requirements and does not cause triggering of \nultrasonic alarm system upon retesting shall be considered as \nhaving met the requirements of this supplement. \nS2. Nondestructive Ultrasonic Test-Round Tubing (Select \nCommercial Grade) \nS2.1 The manufacturer shall test the tubing using the \nprocedure outlined in Supplementary Requirement Sl, except \nfor the notch depth, which shall be 5 % of wall thickness in \ndepth but not less than 0.004 in. [0.10 mm]. Tolerance on depth \nshall be +0.000 in. or -0.0005 in. [0.01 mm]. \nS3. Nondestructive Eddy-Current Test \nS3.1 Each tube shall be tested after the finish heat treatment \nfollowing the final cold-draw pass by passing through an \nelectric nondestructive tester capable of detecting defects on \nthe entire cross section of the tube. Suitable instrumentation \nshall be used to clearly distinguish aiiificial defects or refer­\nence notches. Tubes to be tested shall be reasonably straight \nand the outside and inside diameter surfaces shall be free of \nloose scale, metallic particles, or other material which would \ntend to restrict signals or create electlical noise. The tubing \nshall be inspected by feeding longitudinally through an inspec­\ntion coil or coils of a diameter suitable for the diameter of \ntubing to be inspected. The instrument calibration shall be \naccomplished with a reference standard prepared from an \nappropriate length of selected tubing of the same size, grade, \nand physical condition as the material to be inspected. The \nstandard shall be fed through the coil at the same speed at \nwhich the inspection of the tubing is performed. The following \nfactors shall be selected or adjusted, or both, in accordance \nwith the instrument manufacturer's instructions for the paiiicu­\nlar instrument involved as required to achieve optimum instru­\nment distinction between the reference defects and plain \nportion of the tube. These as well as other factors involved \nshall not be used in such a manner that they detract from the \ninstrument's overall ability to detect injurious defects: \nS3 .1.1 Test frequency, \nS3.l.2 Direct-current saturation level, \nS3. l.3 Filter networks, \nS3.l.4 Phase analysis circuits, \nS3.l.5 Coil diameter, and \nS3.l.6 Instrument gain. \nS3.2 The reference standard shall contain longitudinal and \ncircumferential notches in the outside diameter and shall be \nused to establish the rejection level for the tubing to be tested. \nInside diameter notches, both longitudinal and circumferential, \nshall also be a part of the reference standard. These notches \nmay be larger than outside diameter notches and ai·e intended \nfor use only to assure instrument phase settings capable of \nyielding optimum inside diameter surface sensitivity. The \noutside diameter reference notches shall have a depth equal to \n10 % of the wall thickness. The tolerance of the notch shall be \n±8 % or 0.0005 in. [0.01 mm], whichever is greater. Width of \nnotch shall not exceed twice the depth. The length of the \nreference notches shall not exceed 0.375 in. [9.5 mm]. All \ntubing including that which may be reconditioned, provided \nthe dimensional or other properties of the tubing are not \nadversely affected and provided the tubing does not show \nindications above the level determined by the outside diameter \nreferences, shall meet this specification provided the instru­\nment calibration is verified by indicating the standard outside \ndiameter reference notches of a given lot. Tubes generating a \nsignal above the calibration standard sensitivity level shall be \nrejected. Tubes may be reconditioned if not adversely affecting \nthe dimensional or other properties of the tube and so tested as \nto assure a satisfactory tube within the limits of this specifica­\ntion. All tubing shall be demagnetized after inspection has been \ncompleted. \nSUMMARY OF CHANGES \nCommittee _AQ 1 _h_as. identified 1he la.cation_ oLselected changes-to-this specifiGati0n sin Ge the-last-issae­\n(A556/ A556M - 96 (2012)) that may impact the use of this standard. (Approved Sept. 1, 2018.) \n(1) Substituted Test Methods A751 for obsolete Test Methods \nE30. \n(2) Changed hardness test indenter designation and reporting \nstyle. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTN/ International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone}, 610-832-9555 (fax}, or service@astm.org (e-mail}; or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n948 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1048.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5795,
  "bestTextAlphaRatio": 0.7741
}