{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 275,
  "globalPageIndex": 275,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-182/SA-182M (ASTM A182/A182M) \ntested, in the hardened condition (see 3.2.1), to ensure that the \nforgings are within the hardness limit given for F 23 in Note P \nof Table 2. The test samples shall be taken at the mid thickness \nof the thickest section of the product. Testing shall be per­\nformed in accordance with the Test Method E92 or as specified \nin Specification A961/A961M. \n9.7 Notch Toughness Requirements-Grades F 3V, F 3VCb, \nand F22V. \n9.7.1 Impact test specimens shall be Charpy V-notch Type. \nThe usage of subsize specimens due to material limitations \nmust have prior purchaser approval. \n9.7.2 The Charpy V-notch test specimens shall be obtained \nas required for tension tests in 9.2, 9.3, and 9.5. One set of three \nCharpy V-notch specimens shall be taken from each tensile \nspecimen location. \n9.7.3 The longitudinal axis and mid-length of impact speci­\nmen shall be located similarly to the longitudinal axis of the \ntension test specimens. The axis of the notch shall be normal to \nthe nearest heat-treated surface of the forging. \n9.7.4 The Charpy V-notch tests shall meet a minimum \nenergy absorption value of 40 ft-lbf [54 J] average of three \nspecimens. One specimen only in one set may be below 40 \nft-lbf [54 J], and it shall meet a minimum value of 35 ft-lbf [48 \nJ]. \n9.7.5 The impact test temperature shall be O °F [-18 °C]. \n10. Grain Size for Austenitic Grades \n10.1 All H grades and grade F 63 shall be tested for average \ngrain size by Test Methods El 12. \n10.1.1 Grades F 304H, F 309H, F 310H, and F 316H shall \nhave a grain size of ASTM No. 6 or coarser. \n10.1.2 Grades F 321H, F 347H, and F 348H shall have a \ngrain size of ASTM No. 7 or coarser. \n10.1.3 Grade F 63 shall have a grain size of ASTM No. 3 or \nfiner. \n10.1.4 Annealed Alloys UNS N08810 and UNS N08811 \nshall conform to an average grain size of ASTM No. 5 or \ncoarser. \n11. Corrosion Testing for Austenitic Grades and \nDetrimental Phase Detection in Austenitic/Ferritic \nStainless Grades \n11.1 Corrosion testing is not required by this specification \nnor is detrimental phase detection. \n11.2 Austenitic grades shall be capable of meeting the \nintergranular corrosion test requirements described in Supple­\nmentary Requirement S4. \n11.3 Austenitic/Ferritic Stainless grades shall be capable of \nmeeting the requirements described in Supplementary Require­\nment S 12 if the subject grade is included in the specifications \nlisted in Supplementary Requirement Sl2. \n12. Retreatment \n12.1 If the results of the mechanical tests do not conform to \nthe requirements specified, the manufacturer may reheat treat \nthe forgings and repeat the tests specified in Section 9. \n13. Nondestructive Test Requirements \n13.1 Hollow forgings of Grades F 91 Types 1 and 2, F 92, \nF 115, F 122, and F 911, NPS 4 [DIN 100] and larger, whose \nfinished internal surfaces are not accessible to magnetic par­\nticle or liquid penetrant examination, shall be examined by an \nultrasonic test in accordance with Practice A388/A388M, after \nall forging, mechanical processing, and heat treatment opera­\ntions have been completed. \n13.2 Hollow forgings of Grades F 91 Types 1 and 2, F 92, \nF 115, F 122, and F 911, NPS 4 [DIN 100] and larger, whose \nfinished internal surfaces are accessible to magnetic particle or \nliquid penetrant examination, shall be examined on their \ninternal surfaces by either a magnetic particle test in accor­\ndance with Practice A275/A275M, or by a liquid penetrant \nexamination in accordance with Test Method E165/El65M, as \napplicable, after all heat treatment, machining, and other \nmechanical processing operations are completed. \n13.3 Time of Examination-Examination by one of the \nmethods in 13 .1 or 13 .2, for specification acceptance, shall be \nperformed as specified in 13.1 or 13.2. This requirement does \nnot preclude additional testing at earlier stages in the process­\ning. \n13.4 Evaluation of Impe,fections Found by Ultrasonic' Ex­\namination: \n13 .4.1 Forgings producing a signal equal to or greater than \nthe lowest signal produced by the reference discontinuities \nshall be identified and separated from the acceptable forgings. \nThe area producing the signal may be reexamined. \n13.4.2 Such forgings shall be rejected if the test signals were \nproduced by impetfections that cannot be identified or were \nproduced by cracks or crack-like imperfections. Such forgings \nmay be repaired. To be accepted, a repaired forging shall pass \nthe same nondestructive test by which it was rejected, and it \nshall meet the minimum wall thickness requirements of this \nspecification and the purchase order. \n13.4.3 If the test signals were produced by visual imperfec­\ntions such as scratches, surface roughness, dings, tooling \nmarks, cutting chips, steel die stamps, or stop marks, the \nforging is permitted to be accepted based upon visual exami­\nnation provided that the depth of the imperfection is less than \n0.004 in. [0.1 mm] or 12.5 % of the specified wall thickness, \nwhichever is the greater. \n13.5 Treatment of Impe,fections Found by Magnetic Par­\nticle or Liquid Penetrant Examination: \n13.5.1 Defects shall be completely removed prior to weld \nrepair by chipping or grinding to sound metal. Removal of \nthese defects shall be verified by magnetic particle inspection \nin accordance with Test Method A275/A275M or by liquid \npenetrant inspection in accordance with Test Method E165/ \nE165M. \n13.5.2 Rejected forgings may be reconditioned and retested, \nprovided that the wall thickness is not decreased to less than \nthat required by this specification and the purchase order. The \noutside diameter at the point of grinding may be reduced by the \namount so removed. To be accepted, retested forgings shall \nmeet the test requirement. \n223 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0275.json",
  "tabulaTablesCsv": "tables_tabula/page-0275.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0275.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5779,
  "bestTextAlphaRatio": 0.737
}