{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 200,
  "globalPageIndex": 200,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-53/SA-53M ASME BPVC.II.A-2025 \nforming or installation, or both, conditions involved. Disposi­\ntion shall be a matter for agreement. \n20. Certification \n20.1 The manufacturer or supplier shall, upon request, \nfurnish to the purchaser a certificate of compliance stating that \nthe material has been manufactured, sampled, tested, and \ninspected in accordance with this specification (including \nyear-date), and has been found to meet the requirements. \n20.2 Test Report-For Types E and S, the manufacturer or \nsupplier shall furnish to the purchaser a chemical analysis \nreport for the elements given in Table 1. \n20.3 EDI-A certificate of compliance or test report printed \nfrom, or used in, electronic form from an electroni~ data \ninterchange (EDI) transmission shall be regarded as havmg the \nsame validity as a counterpart printed in the certifier's facility. \nThe use and format of the EDI document are subject to \nagreement between the purchaser and the manufacturer or \nsupplier. \nNoJE 7-EDI is the computer to computer exc;hange of business \ninformation in a standard format such as ANSI ASC X12. \n20.4 Notwithstanding the absence of a signature, the orga­\nnization submitting the certificate of compliance or test report \nis responsible for its content. \n21. Product Marking \n21.1 Except as allowed by 21.5 and 21.6, each length of \npipe shall be legibly marked in the following sequence to \nshow: \n21.1.1 Manufacturer's name or mark, \n21.1.2 Specification number (year-date not required), \nNorn 8-Pipe that complies with m~ltipl~ compatible spe~ifi.ca~ons \nmay be marked with the appropriate designation for each specification. \n21.1.3 Size (NPS and weight class, schedule number, or \nspecified wall thickness; or specified outside diameter and \nspecified wall thickness), \n21.1.4 Grade (A or B), \n21.1.5 Type of pipe (F, E, or S), \n21.1.6 Test pressure, seamless pipe only (if applicable, in \naccordance with Table 4), \n21.1.7 Nondestructive electric test, seamless pipe only (if \napplicable, in accordance with Table 4), \n21.2 Unless another marking format is specified in the \npurchase order, length shall be marked in feet and tenths o~ a \nfoot or metres to two decimal places, dependent upon the umts \nto ;hich the pipe was ordered. The location of such marking \nshall be at the option of the manufacturer. \nTABLE 4 Marking of Seamless Pipe \nHydro NOE Marking \nYes No Test pressure \nNo Yes NOE \nYes Yes Test Pressure/NOE \n21.3 Heat number, lot number, run number, or a combina­\ntion thereof shall be marked at the option of the manufacturer, \nunless specific marking is specified in the purchase order; The \nlocation of such marking shall be at the option of the \nmanufacturer. \n21.4 Any additional information desired by the manufac­\nturer or specified in the purchase order. \n21.5 For pipe NPS 1 ½ [DN 40] and smaller that is bundled, \nit shall be permissible to mark the required information on a tag \nsecurely attached to each bundle. \n21.6 If pipe sections are cut into shorter lengths by a \nprocessor for resale as pipe, the processor shall transfer the \ncomplete identification, including the name or brand of the \nmanufacturer, to each unmarked cut length, or to metal tags \nsecurely attached to unmarked pipe bundled in accordance with \nthe requirements of 21.5. The same material designation shall \nbe included with the information transferred, and the proces­\nsor's name, trademark, or brand shall be added. \n148 \n21.7 Bar Coding-In addition to the requirements in 21.1, \n21.5, and 21.6, bar coding is acceptable as a supplementary \nidentification method. It is recommended that bar coding be \nconsistent with the Automotive Industry Action Group (AIAG) \nstandard prepared by the Primary Metals Subcommittee of the \nAIAG Bar Code Project Team. \n22. Government Procurement \n22.1 If specified in the contract, the pipe shall be preserved, \npackaged, and packed in accordance with the require~ents ?f \nMIL-STD-163. The applicable levels shall be as specified m \nthe contract. Marking for shipment of such pipe shall be in \naccordance with Fed. Std. No. 123 for civil agencies and \nMIL-STD-129 or Fed. Std. No. 183 if continuous marking is \nrequired, for military agencies. \n22.2 Inspection-Unless otherwise specified in the contract, \nthe manufacturer is responsible for the performance of all \ninspection and test requirements specified herein. Except as \notherwise specified in the contract, the manufacturer shall use \nits own or any other suitable facilities for performing the \ninspection and test requirements specified herein, unless oth­\nerwise disapproved by the purchaser in the contract or purchase \norder. The purchaser shall have the right to perform any of the \ninspections and tests set forth in this specification where \ndeemed necessary to ensure that the pipe conforms to the \nspecified requirements. \n23. Packaging and Package Marking \n23.1 If specified in the purchase order, packaging, marking, \nand loading for shipment shall be in accordance with those \nprocedures recommended by Practices A700. \n24. Keywords \n24.1 black steel pipe; seamless steel pipe; steel pipe; welded \nsteel pipe; zinc coated steel pipe ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0200.json",
  "tabulaTablesCsv": "tables_tabula/page-0200.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0200.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5159,
  "bestTextAlphaRatio": 0.7629
}