{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 647,
  "globalPageIndex": 647,
  "width": 607.56,
  "height": 850.08,
  "text": "ASME BPVC.II.A-2025 SA-370 \nR \n/ \nI I \n, \nI \nI \nI , \nI \nI \n' I \nI \nI \nI \nI \n' I \n' I \nI \nI , \nI , \nI \n' I , \nI , \n' Strain \nA n \n, r , , \nI \nI \nI \nI \nI \nFIG. 9 Stress-strain Diagram for Determination of Yield Strength \nby Offset Method \nBEND TEST \n15. Description \n15.1 The bend test is one method for evaluating ductility, \nbut it cannot be considered as a quantitative means of predict­\ning service perfonnance in all bending operations. The severity \nof the bend test is primarily a function of the angle of bend of \nthe inside diameter to which the specimen is bent, and of the \ncross section of the specimen. These conditions are varied \naccording to location and orientation of the test specimen and \nthe chemical composition, tensile properties, hardness, type, \nand quality of the steel specified. Test Methods E190 and E290 \nmay be consulted for methods of performing the test. \n15.2 Unless otherwise specified, it shall be permissible to \nage bend test specimens. The time-temperature cycle employed \nmust be such that the effects of previous processing will not be \nmaterially changed. It may be accomplished by aging at room \ntemperature 24 to 48 h, or in shorter time at moderately \nelevated temperatures by boiling in water or by heating in oil \nor in an oven. \n15.3 Bend the test specimen at room temperature to an \ninside diameter, as designated by the applicable product \nspecifications, to the extent specified. The speed of bending is \nordinarily not an important factor. \nHARDNESS TEST \n16. General \n16.1 A hardness test is a means of determining resistance to \npenetration and is occasionally employed to obtain a quick \napproximation of tensile strength. Tables 2-5 are for the \nconversion of hardness measurements from one scale to \nanother or to approximate tensile strength. These conversion \nvalues have been obtained from computer-generated curves \nand are presented to the nearest 0.1 point to permit accurate \nreproduction of those curves. All converted hardness values \nmust be considered approximate. All converted Rockwell and \nVickers hardness numbers shall be rounded to the nearest \nwhole number. \n16.2 Hardness Testing: \n16.2.1 If the product specification permits alternative hard­\nness testing to detennine conformance to a specified hardness \nrequirement, the conversions listed in Tables 2-5 shall be used. \n16.2.2 When recording converted hardness numbers, the \nmeasured hardness and test scale shall be indicated in \nparentheses, for example: 353 HBW (38 HRC). This means \nthat a hardness value of 38 was obtained using the Rockwell C \nscale and converted to a Brinell hardness of 353. \n17. Brinell Test \n17 .1 Description: \n17.1.1 A specified load is applied to a flat surface of the \nspecimen to be tested, through a tungsten carbide ball of \nspecified diameter. The average diameter of the indentation is \nused as a basis for calculation of the Brinell hardness number. \nThe quotient of the applied load divided by the area of the \nsurface of the indentation, which is assumed to be spherical, is \ntermed the Brinell hardness number (HBW) in accordance with \nthe following equation: \nwhere: \nHBW \np \nD \nd \nHBW= P![(nDl2)(D - \\jD 2 - d 2 )] (4) \n= Brinell hardness number, \n= applied load, kgf, \n= diameter of the tungsten carbide ball, mm, and \n= average diameter of the indentation, mm. \nNoTE 12-The Brinell hardness number is more conveniently secured \nfrom standard tables such as Table 6, which show numbers corresponding \nto the various indentation diameters, usually in increments of 0.05 mm. \nNorn 13-In Test Method ElO the values are stated in SI units, whereas \nin this section kg/m units are used. \n17 .1.2 The standard Brinell test using a 10 mm tungsten \ncarbide ball employs a 3000 kgf load for hard materials and a \n1500 or 500 kgf load for thin sections or soft materials (see \nAnnex A2 on Steel Tubular Products). Other loads and differ­\nent size indentors may be used when specified. In recording \nhardness values, the diameter of the ball and the load must be \nstated except when a 10 mm ball and 3000 kgf load are used. \n17 .1.3 A range of hardness can properly be specified only \nfor quenched and tempered or normalized and tempered \nmaterial. For annealed material a maximum figure only should \nbe specified. For normalized material a minimum or a maxi­\nmum hardness may be specified by agreement. In general, no \nhardness requirements should be applied to untreated material. \n17 .1 .4 Brinell hardness may be required when tensile prop­\nerties are not specified. \n595 \n17 .2 Apparatus-Equipment shall meet the following re­\nquirements: \n17 .2.1 Testing Machine-A Brinell hardness testing ma­\nchine is acceptable for use over a loading range within which \nits load measuring device is accurate to :±: 1 %. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0647.json",
  "tabulaTablesCsv": "tables_tabula/page-0647.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0647.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4807,
  "bestTextAlphaRatio": 0.756
}