{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 500,
  "globalPageIndex": 1298,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-749/SA-749M ASME BPVC.II.A-2025 \nfrom an electronic data interchange (EDI) transmission \nshall be regarded as having the same validity as a counter­\npart printed in the certifier's facility. The content of the \nEDI transmitted document must meet the requirements of \nthe invoked ASTM standard(s) and conform to any existing \nEDI agreement between the purchaser and the supplier. \nNotwithstanding the absence of a signature, the organiza­\ntion submitting the EDI transmission is responsible for the \ncontent of the report. \nNOTE 2-The industry definition as invoked here is: EDI is the computer \nto computer exchange of business information in an agreed upon standard \nformat such as ANSI ASC Xl2. \n15. Marking \n15.1 As a minimum requirement, the material shall \nbe identified by having the manufacturer's name, ASTM \ndesignation, weight, purchaser's order number, and mate­\nrial identification legibly stenciled on top of each lift or \nshown on a tag attached to each coil or shipping unit. \n15.2 When specified in the contract or order, and for \ndirect procurement by or direct shipment to the govern­\nment, marking for shipment, in addition to requirements \nspecified in the contract or order, shall be in accordance \nwith MIL-STD-129 for military agencies and in accordance \nwith Fed. Std. No. 123 for civil agencies. \n15.3 For Government procurement by the Defense Sup­\nply Agency, strip material shall be continuously marked \nTABLE 1 \nTOLERANCES FOR PRODUCT ANALYSISA \nTolerances \nLimit, or Maximum Under Over \nof Specified Minimum Maximum \nElement Element,% Limit Limit \nCarbon to 0.15, incl 0.02 0.03 \nover 0.15 to 0.40, incl 0.03 0.04 \nover 0.40 to 0.80, incl 0.03 0.05 \nover 0.80 0.03 0.06 \nManganese to 0.60, incl 0.03 0.03 \nover 0.60 to 1.15, incl 0.04 0.04 \nover 1.15 to 1.65, incl 0.05 0.05 \nPhosphorus 0.01 \nSulfur 0.01 \nSilicon to 0.30, incl 0.02 0.03 \nover 0.30 to 0.60, incl 0.05 0.05 \nCopper 0.02 \nA See 6.3.1. \nfor identification .in accordance with Fed. Std. No. 183. \n15.4 Bar coding is acceptable as a supplementary iden­\ntification method. Bar coding should be consistent with \nthe Automotive Industry Action Group (AIAG) standard \nprepared by the primary metals subcommittee of the AIAG \nbar code project team. \n16. Packaging \n16.1 Unless otherwise specified, the strip shall be pack­\naged and loaded in accordance with Practices A 700. \n16.2 When specified in the contract or order, and for \ndirect procurement by or direct shipment to the govern­\nment, when Level A is specified, preservation, packaging, \nand packing shall be in accordance with the Level A \nrequirements of MIL-STD-163. \n16.3 When coils are ordered it is customary to specify \na minimum or range of inside diameter, maximum outside \ndiameter, and a maximum coil weight, if required. The \nability of manufacturers to meet the maximum coil weights \ndepends upon individual mill equipment. When required, \nminimum coil weights are subject to negotiation. \n17. Keywords \n17.1 carbon; steel; strip \nTABLE 2 \nINDEX OF TABLES FOR DIMENSIONS, TOLERANCES, \nAND ALLOWANCES \nTable No. \nDimensions Inch-Pound Units SI Units \nCamber tolerances 8 Al.6 \nCrown tolerances 5 Al.3 \nFlatness tolerances 9 Al.7 \nLength tolerances 7 Al.5 \nThickness tolerances 3, 4 Al.I, Al.2 \nWidth tolerances 6 Al.4 \n1226 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1298.json",
  "tabulaTablesCsv": "tables_tabula/page-1298.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1298.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3283,
  "bestTextAlphaRatio": 0.7213
}