{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 708,
  "globalPageIndex": 708,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-395/SA-395M ASME BPVC.II.A-2025 \nreasonable facilities to satisfy him that the material is being \nfurnished in accordance with these specifications. Unless \notherwise specified, all tests and inspection shall be made \nat the place of manufacture or by an approved independent \nlaboratory prior to shipment, and shall be so conducted as \nnot to interfere unnecessarily with the operation of the \nworks. \n17. Certification \n17.1 When agreed upon in writing by the purchaser \nand the supplier, a certification shall be made on the basis \nof acceptance of the material. This shall consist of a copy \nof the manufacturer's test report or a statement by the \nsupplier accompanied by a copy of the test results, that \nthe material has been sampled, tested, and inspected in \naccordance with the provisions of this specification. Each \ncertification so furnished shall be signed by an authorized \nagent of the supplier or manufacturer. \n658 \n18. Product Marking \n18.1 Castings for valves, flanges, pipe fittings, and \nunions shall be marked for material identification in accor­\ndance with the Standard Marking System for Valves, \nFlanges, Pipe Fittings, and Unions, SP-25. Castings for \ngasketed mechanical couplings and fittings may be marked \nin accordance with Specification F 1476 or F 1548 respec­\ntively. \n18.2 Castings, other than valves, flanges, pipe fittings, \nand unions, shall be identified subject to agreement by the \nmanufacturer and the purchaser. \n18.3 Marking shall be in such a position as not to injure \nthe usefulness of the castings. \n19. Keywords \n19.1 casting; ductile iron; mechanical properties; pres­\nsure-retaining; pressure test; tensile strength; tension test­\ning; yield strength ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0708.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 1707,
  "bestTextAlphaRatio": 0.7727
}