{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 606,
  "globalPageIndex": 606,
  "width": 627.36,
  "height": 865.08,
  "text": "SA-353/SA-353M ASME BPVC.11.A-2025 \nStandard Specification for \nPressure Vessel Plates, Alloy Steel, Double-Normalized and \nTempered 9 °/o Nickel \n1. Scope \n1.1 This specification covers double-normalized and tem­\npered 9 % nickel steel plates intended paiticularly for welded \npressure vessels for cryogenic service. \n1.2 Plates produced under this specification are subject to \nimpact testing at -320°F [-195°C] or at such other tempera­\ntures as are agreed upon. \n1.3 The maximum thickness of plates is limited only by the \ncapacity of the material to meet the specific mechanical \nproperty requirements. \n1.4 This material is susceptible to magnetization. Use of \nmagnets in handling after heat treatment should be avoided if \nresidual magnetism would be detrimental to subsequent fabri­\ncation or service. \n1.5 The values stated in either inch-pound units or SI units \nai·e to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem ai·e not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. • \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Material supplied to this material specification shall \nconform to Specification A20/ A20M. These requirements out­\nline the testing and retesting methods and procedures, permit­\nted variations in dimensions, and mass, quality and repair of \ndefects, marking, loading, and ordering infom1ation. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/A20M. \n554 \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/A20M, the require­\nments of this specification shall prevail. \n4. Manufacture \n4.1 Steelmaking Practice-The steel shall be killed and \nshall conform to the fine austenitic grain size requirement of \nSpecification A20/ A20M. \n5. Heat Treatment \n5.1 All plates shall be heat treated in accordance with 5.2. \nShell plates and other parts, including heads and reinforcing ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0606.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3135,
  "bestTextAlphaRatio": 0.7815
}