{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 327,
  "globalPageIndex": 327,
  "width": 620.76,
  "height": 859.92,
  "text": "ASME BPVC.II.A-Z0Z5 SA-Z10/SA-Z10M {ASTM AZ10/AZ10M) \nElement \nCarbonA , max \nManganese \nPhosphorus, max \nSulfur, max \nSilicon, min \nTABLE 1 Chemical Requirements \nGrade A-1 \n0.27 \n0.93 max \n0.035 \n0.035 \n0.10 \nComposition, % \nGrade C \n0.35 \n0.29-1.06 \n0.035 \n0.035 \n0.10 \nA For each reduction of 0.01 % below the specified carbon maximum, an increase \nof 0.06 % manganese above the specified maximum will be permitted up to a \nmaximum of 1.35 %. \nTABLE 3 Tensile Requirements \nTensile strength, min, ksi [MPa] \nYield strength, min, ksi [MPa] \nElongation in 2 in. or 50 mm, min, % \nFor longitudinal strip tests, a deduction shall be \nmade for each ½2-in. (0.8-mm] decrease in \nwall thickness under 5 /16 in. [8 mm] from the \nbasic minimum elongation of the following \npercentage points \nGrade A-1 \n60 (415] \n37 (255] \n30 \n1.50 A \nWhen standard round 2-in. or 50-mm gage length 22 \nor smaller proportionally sized specimen \nwith the gage length equal to 4D (four times \nthe diameter) is used \nA See Table 4 for the computed minimum values. \n7. Surface Condition \nGrade C \n70 (485] \n40 (275] \n30 \n1.50 A \n20 \n7 .1 If pickling or shot blasting or both are required, this \nshall be specifically stated in the order. \n8. Chemical Composition \n8.1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n8.2 When a grade is ordered under this specification, sup­\nplying an alloy grade that specifically requires the addition of \nany element other than those listed for the ordered grade in \nTable 1 is not permitted. \n9. Product Analysis \n9.1 When requested on the purchase order, a product analy­\nsis shall be made by the supplier from one tube or billet per \nheat. The chemical composition thus determined shall conform \nto the requirements specified. \n9.2 If the original test for product analysis fails, retests of \ntwo additional billets or tubes shall be made. Both retests for \nthe elements in question shall meet the requirements of the \nspecification; otherwise, all remaining material in the heat or \nlot (see Note 2) shall be rejected or, at the option of the \nproducer, each billet or tube may be individually tested for \nacceptance. Billets or tubes which do not meet the require­\nments of the specification shall be rejected. \nNow 2-For flattening and flaring requirements, the term \"lot\" applies \nto all tubes prior to cutting of the same nominal size and wall thickness \nwhich are produced from the same heat of steel. When final heat treatment \nis in a batch-type furnace, a lot shall include only those tubes of the same \nsize and from the same heat which are heat treated in the same furnace \ncharge. When the final heat treatment is in a continuous furnace, the \nnumber of tubes of the same size and from the same heat in a lot shall be \ndetermined from the size of the tubes as prescribed in Table 2. \nNoTE 3-For tensile and hardness test requirements, the term \"lot\" \napplies to all tubes prior to cutting, of the same nominal diameter and wall \nthickness which are produced from the same heat of steel. When final heat \ntreatment is in a batch-type furnace, a lot shall include only those tubes of \nthe same size and the same heat which are heat treated in the same furnace \ncharge. When the final heat treatment is in a continuous furnace, a lot shall \ninclude all tubes of the same size and heat, heat treated in the same furnace \nat the same temperature, time at heat, and furnace speed. \n10. Tensile Requirements \n10.1 The material shall conform to the requirements as to \ntensile properties prescribed in Table 3. \n10.2 Table 4 gives the computed minimum elongation \nvalues for each 1/32-in. [0.8-mm] decrease in wall thickness. \nWhere the wall thickness lies between two values shown \nabove, the minimum elongation value shall be determined by \nthe following equation: \nE = 48t+ 15.00 [ E = l.87t+ 15.00] \nwhere: \nE elongation in 2 in. or 50 mm, %, and \n= actual thiclmess of specimen, in. [mm]. \n11. Hardness Requirements \n11.1 The tubes shall have a hardness not exceeding the \nfollowing: 79 HRBW or 143 HBW for Grade A-1, 89 HRBW \nor 179 HBW for Grade C. \n12. Mechanical Tests Required \n12.1 Tension Test-One tension test shall be made on a \nspecimen for lots of not more than 50 tubes. Tension tests shall \nbe made on specimens from two tubes for lots of more than 50 \ntubes (see Note 3). \n12.2 Flattening Test-One flattening test shall be made on \nspecimens from each end of one finished tube from each lot \n(see Note 2), but not the one used for the flaring test. Tears or \nbreaks occurring at the 12 or 6 o'clock positions on Grade C \ntubing with sizes of 2.375 in. [60.3 mm] in outside diameter \nand smaller shall not be considered a basis for rejection. \n12.3 Flaring Test-One flaring test shall be made on speci­\nmens from each end of the one finished tube from each lot (see \nNote 2), but not the one used for the flattening test. \n12.4 Hardness Test-Brinell or Rockwell hardness tests \nshall be made on specimens from two tubes from each lot (see \nNote 3). \n275 \nTABLE 2 Number of Tubes in a Lot Heat Treated by the \nContinuous Process \nSize of Tube Size of Lot \n2 in. (50.8 mm) and over in outside diameter and not more than 50 tubes \n0.200 in. (5.1 mm) and over in wall thickness \n2 in. (50.8 mm) and over in outside diameter and not more than 75 tubes \nunder 0.200 in. (5.1 mm) in wall thickness \nLess than 2 in. (50.8 mm) but over 1 in. not more than 75 tubes \n(25.4 mm) in outside diameter \n1 in. (25.4 mm) or less in outside diameter not more than 125 tubes ",
  "words": [],
  "tableCount": 0,
  "noteCount": 2,
  "tabulaTablesPath": "tables_tabula/page-0327.json",
  "tabulaTablesCsv": "tables_tabula/page-0327.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0327.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5539,
  "bestTextAlphaRatio": 0.7149,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0327.txt",
  "gapOcrHighDpiLength": 5440,
  "camelotTablesPath": "camelot_tables/page-0327.json",
  "camelotTablesCsv": "camelot_tables/page-0327.csv",
  "camelotTableCount": 2
}