{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 440,
  "globalPageIndex": 440,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-265 ASME BPVC.II.A-2025 \n(2) The specified minimum tensile strength of the base \nsteel is less than or equal to 70 000 psi (485 MPa). \n( 3) The specified minimum yield strength of the base steel \nis less than or equal to 40 000 psi (275 MPa). \n( 4) The tensile properties thus determined shall not be less \nthan the minimum and not more than 5000 psi (35 MPa) over \nthe maximum prescribed in the specification for the base steel \nused. All other tensile test requirements of the specification for \nthe base steel shall be met. \n7.1.2 The tensile properties shall be determined by a \ntension test of the base steel only for clad plates that meet one \nof the following conditions. The properties thus determined \nshall meet all of the tensile test requirements for the base steel. \n(1) The composite gage is greater than 1 ½ in. (38 mm). \n(2) The specified minimum tensile strength of the base \nsteel is greater than 70 000 psi (485 MPa). \n( 3) The specified minimum yield strength of the base steel \nis greater than 40 000 psi (275 MPa). \n7 .1.3 If the cladding is for corrosion allowance only, the \ncladding need not be included in the tensile test. The tensile \nproperties thus determined shall meet the base steel require­\nments. \n7.2 Test for strength of the bond, when required, must be \nspecified by the purchaser and shall consist of one of the \nfollowing. \n7.2.1 Shear Strength-When required by the purchaser, the \nminimum shear strength of the alloy cladding and base metals \nshall be 20 000 psi (140 MPa). The shear test, when specified, \nshall be made in the manner indicated in 1. The minimum \ncladding thickness for shear testing shall be 0.075 in. (1.9 mm) \nexclusive as ordered. Testing for shear strength for clad plates \nwith minimum cladding thickness of 0.075 in (1.9 mm) or less \nshall be permitted upon agreement between the purchaser and \nthe manufacturer. \nin. \n•t· resr \ntlcimen \n:,, ' , \nJ i I \n:,,, 1' \nr j,, \nI \n_i \n... t+o.oos\" .. ( .. \n0\n'Shflt;11r Blocks,' \nt =(T·cr) min11.s (l(f ffl(l(S t On, \nFinish Cut on Ct;11rbon Sftt/$1-«'t \nMint = 2W \na = vs' M<;rx \nW = IYf'1t \nShf!C¥r Blocks sh/Jfl/ be Bo/tee! Firmly Tof!cllfher t:l'q'(l(insf \nfl/ler Piece wh/ch Provi&ltl $p(IICl2 0.005' Wl&l~r f/1(1111 t \nof Sprt:\"\"men \nMetric Equivalents \nmm in. mm \n0.005 \n'la \n0.127 \n3.17 \n19.1 \n2½ \n3 \n25.4 \n64.5 \n76.2 ¾ \nFIG. 1 Test Specimen and Method of Making Shear Test of Clad \nPlate \n388 \n7 .2.2 Bond Strength-As an alternative to the shear strength \ntest provided in 7.2. l or when agreed upon by the purchaser \nand the manufacturer, or both, three bend tests shall be made \nwith the alloy cladding in compression to determine the quality \nof the bond. These bend tests shall be made in the manner of \nthe tension tests indicated in Fig. 2 and shall be bent through an \nangle of 180° to the bend diameters provided for in either \nSpecification A6/ A6M or Specification A20/ A20M (Appendix \nX4, or equivalent), as applicable. At least two of the three tests \nshall show not more than 50 % separation on both edges of the \nbent portion. Greater separation shall be cause for rejection. \n7.3 Methods and practices relating to mechanical testing \nrequired by this specification shall be in accordance with the \nTest Methods and Definitions of A370. \n8. Number of Tests and Retests \n8.1 One or more tension tests, as required by the specifica­\ntions for the base metal and when specified, one shear test or \nthree bond bend tests shall be made, representing each plate as \nrolled. Each specimen shall be in the final condition of heat \ntreatment required for the plate, including any SPWHT if \nrequired. \n8.2 If any test specimen shows defective machining or \ndevelops flaws, it may be discarded and another specimen \nsubstituted. \n9. Test Specimens \n9 .1 The tension test specimens shall conform to the require­\nments prescribed in the specifications for the base metal. \n9.2 Bend test specimens for the alternative bond strength \ntests shall be taken at right angles to its longitudinal axis. \nr \nParallel Section \n1 \nrAboul - - nof lf!ss fhon 9_.- ,1• 1 \nPoro/le/ wilhin QOIO\" • \nI--, 0 ~-,f'tt:= • ~ \n\\ ------------ ........ , ~ ~ \n: ro~\"f,f\"~~~r:ig~S~':flt,;on '-;;';,;; \n, of'fer Frocfure \nAppro'ximalely 2• \nMetric Equivalents \nin. mm in. mm \n0.01 0.254 1½ 38.1 \n1/a 3.17 2 50.8 \n¼ 6.35 3 76.2 \n1 25.4 8 203.2 \nNorn 1-When necessary, it is permissible to use a narrower specimen, \nbut in such a case the reduced portion shall be not less than 1 in. in width. \nNorn 2-Punch marks for measuring elongation after fracture shall be \nmade on the flat or on the edge of the specimen and within the parallel \nsection; either a set of nine punch marks 1 in. apart, or one or more sets \nof 8-in. punch marks may be used. \nNorn 3-The dimension t is the thickness of the test specimen as \nprovided for in the applicable material specifications. \nFIG. 2 Standard Rectangular Test Specimens with 8-in. Gage \nLength ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0440.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4929,
  "bestTextAlphaRatio": 0.6957
}