{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 386,
  "globalPageIndex": 1184,
  "width": 623.28,
  "height": 800.52,
  "text": "SA-667 /SA-667M ASME BPVC.II.A-2025 \nStandard Specification for \nCentrifugally Cast Dual Metal (Gray and White Cast Iron) \nCylinders \n1. Scope \n1.1 This specification covers centrifugally cast cylinders \nwith an outer layer of white cast iron and the remainder of the \nmaterial of gray cast iron. These castings are suitable for \npressure containing parts the design strength of which is based \non the gray iron portion of the cylinder. These castings are \nsuitable for service at temperatures up to 450°F [230°C]. \n1.2 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.3 The following safety hazards caveat pertains only to the \ntest method portion, Section 8, of this specification: This \nstandard does not purport to address all of the sqfety concerns, \nif' any, associated with its use. It is the responsibility of the user \nof this standard to establish appropriate safety and health \npractices and determine the applicability of regulatory limita­\ntions prior to use. \n2. Referenced Documents \n2.1 ASTM Standards: \nA278/A278M Specification for Gray Iron Castings for \nPressure-Containing Parts for Temperatures Up to 650°F \n(350°C) \n3. Materials and Manufacture \n3.1 The melting procedures shall be optional with the \nfoundry. \n3.2 The white iron pmtion of the cylinder shall be made to \na minimum hardness of 55 Scleroscope \"C\". The gray iron \nportion of the cylinder shall conform to Specification A278/ \nA278M, Class 20 or Class 150. \n3.3 The casting process shall be controlled to produce a \nmetallurgical bond between the two metal layers. \n4. :Finish \n4.1 All surfaces shall be machined prior to the cylinders \nbeing placed into service. \n5. Physical Requirements \n5.1 Tensile Requirements-Tension test specimens removed \nfrom the casting shall have a tensile strength not less than 80 % \nof that specified in 3.2. \n5.2 Thickness of White Cast Iron: \n5.2. l The thickness of the white cast iron shall be not less \nthan 5 % nor more than 30 % of the total finished wall \nthickness. \n5.2.2 The thickness of the white cast iron shall be deter­\nmined by ultrasonic testing. \n6. Number of Tests \n6.1 The number of tension tests shall be in conformance \nwith Specification A278/A278M. \n7. Specimen Preparation \n7.1 Separately cast test bars may be used to represent the \ngray iron portion of the castings. The test bars shall be cast in \ncore sand and have a nominal dimneter of 2 in. [50 mm]. \nTension test specimens shall be machined from test bars to the \ndimensions given for Specimen C in Specification A278/ \nA278M. \n7 .2 At the option of the manufacturer he may substitute test \nbars taken from the gray iron portion of the casting. The test \nbars shall be taken midway between the inside diameter of the \ncasting and the interface between the two layers. Tension test \nspecimens machined from these test bars shall conform to the \ndimensions shown for Specimen C in Specification A278/ \nA278M. \n1094 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1184.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3187,
  "bestTextAlphaRatio": 0.7524
}