{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 228,
  "globalPageIndex": 1026,
  "width": 624.84,
  "height": 801.72,
  "text": "SA-541/SA-541M ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified \nby the purchaser in the inquiry or order. Details of these supplementary requirements shall \nbe agreed upon by the manufacturer and the purchaser. \nSl. Simulated Post-Weld Heat Treatment of \nMechanical Test Samples \nSl.1 All test coupons shall be subjected to single or \nmultiple heat treatments at subcritical temperatures prior \nto testing. Such treatments are intended to simulate post­\nweld or other treatments to which the forgings will be \nsubjected during subsequent fabrication. The purchaser \nshall furnish the manufacturer with details of the desired \nheat treatment for the test coupons, including temperatures, \ntimes, and cooling rates. \nS2. Ultrasonic Inspection \nS2.1 Forgings shall be ultrasonically examined in \naccordance with the procedures of Practice \nA 388/ A 388M. \nS2.1.1 Longitudinal Wave Test: \nS2.1.1.1 Unless otherwise specified, the back \nreflection method of tuning shall be used in accordance \nwith the Procedure Section (the paragraph regarding Back­\nReflection Technique) of Practice A 388/A 388M. \nS2.1.1.2 In addition to the reportable conditions \nof the Recording Section of Practice A 388/ A 388M, indi­\ncations exceeding the resultant back reflection shall be \nrecorded. \nS2.1.1.3 The following conditions are subject to \n_r_ej_ection: _ - - -- - -- - - -- - - - - -- -\n( a) Complete loss of back reflection accompanied by \nan indication of a discontinuity. For this purpose, a back \nreflection less than 5% of full screen height shall be consid­\nered complete loss of back reflection. \n(b) An indication equal in amplitude to that of the back \nreflection established in an indication-free portion of the \nforging. \nS2.1.2 Angle Beam Test: \nS2.1.2.1 Calibration notches, calibration refer­\nence, and method of scanning shall be in accordance with \nthe Procedure Section (the paragraph regarding \nAngleBeam Examination) of Practice A 388/A 388M. \nS2.1.2.2 A forging that contains a discontinuity \nthat results in an indication exceeding the amplitude of the \nreference line is subject to rejection. \nS2.1.3 The report of the ultrasonic examination shall \nbe in compliance with the Report Section of Practice \nA 388/ A 388M. \nS2.1.4 Additional nondestructive examination or tre­\npanning may be employed to resolve questions of interpre­\ntation of ultrasonic indications. The manufacturer shall \naccept responsibility for injurious conditions that will not \nbe removed in final machining. \nS3. Magnetic Particle Examination \nS3.1 Each forging shall be inspected by magnetic parti­\ncle methods described in Test Method A 275/A 275M. \nAcceptance and rejection standards shall be mutually \nagreed upon by the purchaser and manufacturer. \nS4. Charpy V-Notch Impact Transition Curve \nS4.1 Sufficient impact tests shall be made from the \nforging test material to establish a temperature-absorbed \nenergy curve. The test temperature range shall be wide \nenough to establish the upper and lower shelf foot pound \nenergies, with sufficient testing at intermediate tempera­\ntures to permit plotting a reasonably smooth curve. \nS5. Additional Charpy Data \nS5.1 The percent shear fracture and mils or I11_illimetre_1; _ \n--onaterafexpaiision, defined in TestMethods and Defini­\ntions A 370, shall be reported for each Charpy specimen \ntested. \n926 \nS6. Charpy Impact Tests \nS6.1 Charpy impact tests shall be made in accordance \nwith the provisions of Section 6 of this specification except \nthat the test temperature shall be lower than that specified \nin Table 3. \nS7. Drop-Weight Test \nS7.1 Drop-weight tests shall be conducted in accor­\ndance with the requirements of Test Method E 208. The \nfracture plane of the specimens shall coincide with the \nlocation required for other mechanical test specimens as ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1026.json",
  "tabulaTablesCsv": "tables_tabula/page-1026.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1026.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3885,
  "bestTextAlphaRatio": 0.7678,
  "camelotTablesPath": "camelot_tables/page-1026.json",
  "camelotTablesCsv": "camelot_tables/page-1026.csv",
  "camelotTableCount": 1
}