{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 91,
  "globalPageIndex": 889,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-480/SA-480M (ASTM A480/A480M) \nA895 Specification for Free-Machining Stainless Steel Plate, \nSheet, and Strip \nA923 Test Methods for Detecting Detrimental Intermetallic \nPhase in Duplex Austenitic/Ferritic Stainless Steels \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA1084 Test Method for Detecting Detrimental Phases in \nLean Duplex Austenitic/Ferritic Stainless Steels \nE140 Hardness Conversion Tables for Metals Relationship \nAmong Brinell Hardness, Vickers Hardness, Rockwell \nHardness, Superficial Hardness, Knoop Hardness, Sclero­\nscope Hardness, and Leeb Hardness \n2.2 AIAG Standard: 5 \nB-5 Primary Metals Identification Tag Application Standard \n2.3 ASME Document: 6 \nASME BPVC.IX Boiler and Pressure Vessel Code, Section \nIX: Welding, Brazing, and Fusing Qualifications \n2.4 Federal Standard: 7 \nFed. Std. No. 123 Marking for Shipment (Civil Agencies) \n3. Terminology \n3.1 Definitions: \n3.1.1 For definitions of terms pertaining to this standard, not \notherwise listed in 3.2, reference should be made to Terminol­\nogy A941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.1 cold work, n-the changing of mechanical properties \nby work hardening. \n3.2.2 plate, n-material 3/16 in. [5.00 mm] and over in \nthickness and over 10 in. [250 mn:i-] in width; finishes for plate \nare shown in Section.13. \n3,2.3 sheet, n-material under 3/16 in. [5.00 mm] in thickness \nand 24 in. [600 mm] and over in width; finishes for sheet are \nshown in Section 11. \n3.2.4 strip, n-cold-rolled material under 3/16 in. [5.00 mm] \nin thickness and under 24 in. [600 mm] in width; finishes are \ndetailed in Section 12 for strip, and strip edges in Section 14 \nfor cold-rolled strip. \n4. Ordering Information \n4.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for material ordered under this \nspecification. Such requirements may include, but are not \nlimited to, the following: \n4.1.1 Quantity (weight and number of pieces), \n4.1.2 Name of material (stainless steel), \n4.1.3 Condition (hot-rolled, cold-rolled, annealed, heat­\ntreated), \n4.1.4 Finish (see Section 11 for sheet, Section 12 for strip, \nand Section 13 for plates); in the case of polished finishes, \nspecify whether one or both sides are to be polished, \n5 Available from Automotive Industry Action Group (AIAG), 26200 Lahser Rd., \nSuite 200, Southfield, MI 48033-7156, http://www.aiag.org. \n6 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n7 Available from DLA Document Services, Building 4/D, 700 Robbins Ave., \nPhiladelphia, PA 19111-5094, http://quicksearch.dla.mil. \n4.1.5 Temper (if the applicable material specification re-\nquires this detail), \n4.1.6 Form (plate, sheet, or strip), \n4.1.7 Dimensions (thickness, width, and length), \n4.1. 7 .1 Thickness shall be ordered to decimal or fractional \nthickness. The use of the gauge number is discouraged as being \nan archaic term of limited usefulness not having general \nagreement on meaning. The gauge number shall not be a basis \n• for rejection. \n4.1.7.2 Thickness, width, and length, when applicable, \nshould be ordered in the same units, for example, 0.060 in. by \n48 in. by 120 in. [1.52 mm by 1219 mm by 3048 mm]. \n4.1.8 Edge, strip only (see Section 14 for cold-rolled strip), \n4.1.9 Type or UNS designation, refer to the applicable \nmaterial specification, \n4.1.10 Specification designation and date of issue, \n4.1.11 Additions to specification or special requirements, \n4.1.12 Restrictions (if desired) on methods for determining \nyield strength (see appropriate footnote to mechanical proper­\nties table of the basic material specification), \n4.1.13 Marking requirements (see Section 25), \n4.1.14 Preparation for delivery (see Section 25), and \n4.1.15 Magnetic permeability test (when required). Refer to \nSection 19. \n5. Process \n5.1 The steel shall be manufactured/produced by the follow­\ning or as specified in the applicable material specification. \n5.1.1 The steel shall be made by electric-arc, electric­\ninduction, or other suitable processes. \n5.1.2 If a specific type of meltip.g is required by the \npurchaser, it shall be so specified on the purchase order. \n6. Heat Analysis \n6.1 Methods and practices· relating to chemical analysis \nshall be in accordance with Test . Methods, Practices, and \nTerminology A751. \n6.2 An analysis of each heat shall be made by the steel \nproducer to determine the percentages of the elements specified \nin the applicable material specification. This analysis shall be \nmade from a test sample taken during the pouring of the melt, \nor from the in-process product later in the manufacturing flow. \n6.2.1 The heat analysis shall conform to the chemical \nrequirements for each of the specified elements for the grade \nordered, as listed in the applicable product specification. \n6.2.2 All commercial metals contain small amounts of \nelements other than those which are specified. It is neither \npractical nor necessary to specify limits for unspecified ele­\nments that can be present. The producer is permitted to analyze \nfor unspecified elements and is permitted to report such \nanalyses. The presence of an unspecified element and the \nreporting of an analysis for that element shall not be a basis for \nrejection, unless the presence of that element causes the loss of \na property typically expected for that metal, for the type and \nquality ordered. \n6.2.3 The purchaser is permitted to require in the purchase \norder a maximum limit for an individual element not specified \nin the product specification. Such a requirement for an element \n787 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0889.json",
  "tabulaTablesCsv": "tables_tabula/page-0889.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0889.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5739,
  "bestTextAlphaRatio": 0.7292
}