{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 116,
  "globalPageIndex": 116,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \nX2. VARIATION OF TENSILE PROPERTIES IN PLATES AND SHAPES \nX2. l The tension testing requirements of this specification \nare intended only to characterize the tensile properties of a heat \nof steel for determination of conformance to the requirements \nof the applicable product specification. Such testing procedures \nare not intended to define the upper or lower limits of tensile \nproperties at all possible test locations within a heat of steel. It \nis well known and documented that tensile properties will vary \nwithin a heat or individual piece of steel as a function of \nchemical composition, processing, testing procedure and other \nfactors. It is, therefore, incumbent on designers and engineers \nto use sound engineering judgement when using tension test \nresults shown on mill test reports. The testing procedures of \nthis specification have been found to provide structural prod­\nucts adequate for normal structural design criteria. \nX2.2 A survey of the variation to be expected in tensile \nproperties obtained from plates and structural shapes was \nconducted by the American Iron and Steel Institute (AISI). \nThe results of this survey are contained in a Contributions to \nthe Metallurgy of Steel entitled \"The Variation of Product \nAnalysis and Tensile Properties-Carbon Steel Plates and \nWide Flange Shapes\" (SU/18, SU/19 and SU/20), published in \nSeptember 197 4. The data are presented in tables of probability \nthat tensile properties at other than the official location may \ndiffer from those of the reported test location. Another survey \nsponsored by the AISI entitled \"Statistical Analysis of Struc­\ntural Plate Mechanical Properties\" was published in January \n2003. That survey analyzed the results of variability testing on \nmore modem as-rolled steels that were generally of higher \nminimum yield strength steels and also compared those results \nstatistically to the previous surveys. \nX2.3 This specification contains no requirements applicable \nto product tension tests; conformance to the applicable product \nspecification is determined on the basis of tests performed at \nthe place of manufacture or processing prior to shipment, \nunless otherwise specified. \nX2.4 A task group of ASTM Subcommittee A0l.02 has \ndetermined, based on review of the earlier AISI data, that the \nvariation in tensile prope1ties of plates and structural shapes \ncan be expressed as a function of specified requirements: one \nstandard deviation equals approximately 4 % of required ten­\nsile strength, 8 % of required yield strength, and 3 percentage \npoints of required elongation. The January 2003 survey re­\nsulted in similar findings. \nX2.5 Acceptance criteria for product testing based upon \nthese values, either below the minimum or above the maximum \nallowed by the applicable product specification, are generally \nacceptable to manufacturers. Such tolerances could be consid­\nered by users of structural products as a reasonable basis for \nacceptance of structural products that, due to their inherent \nvariability, deviate from the applicable product specification \nrequirements when subjected to product tension testing. \nX3. WELDABILITY OF STEEL \nX3. l Weldability is a term that usually refers to the relative \nease with which a metal can be welded using conventional \npractice. Difficulties arise in steel when the cooling rates \nassociated with weld thermal cycles produce microstructures \n(for example, martensite) that are susceptible to brittle fracture \nor, more commonly, hydrogen-induced (or cold) cracking. \n(Solidification or hot cracking is a relatively rare phenomenon \nthat will not be addressed here. See Randall for further \ninformation.) \nX3.2 The relative sensitivity of steels to forming cold \ncracking microstructures is called hardenability and can be \nmeasured in a number of ways. Perhaps the most popular \nmethod of assessing this is by the carbon equivalent (CE) \nformula, which attempts to equate the relative hardening \ncontributions of a steel's constituent elements (for example, \n64 \nmanganese, vanadium) to an equivalent amount of carbon, \nwhich is the most significant hardening agent. The most \npopular formula is the International Institute of Welding (IIW) \nequation presented in S31.2, which has been found suitable for \npredicting hardenability in a wide range of commonly used \ncarbon-manganese and low alloy steels. \nX3.3 It should be noted, however, that for the current \ngeneration oflow carbon ( <0.10 % ) low alloy steels that derive \nstrength from a combination of microalloys and thermal \nprocessing methods the use of other formulae may more \naccurately assess hardenability and cold cracking sensitivity. \nX3.4 For a vast number of common structural applications it \nis unnecessary to specify the use of CE limits. However, in ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0116.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4823,
  "bestTextAlphaRatio": 0.8003
}