{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 730,
  "globalPageIndex": 730,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-403/SA-403M ASME BPVC.II.A-2025 \n(pipe, tube, plate, bar, and forgings) normally used in the \nmanufacturing of fittings to this specification. Methods and \npractices relating to chemical analyses required by this speci­\nfication shall be in accordance with Test Methods, Practices, \nand Terminology A751. Product analysis tolerances in accor­\ndance with Specification A960/A960M are applicable. \n7 .2 The steel shall not contain any unspecified elements for \nthe ordered grade to the extent that it conforms to the \nrequirements of another grade for which that element is a \nspecified element having a required minimum content. \n7.3 In fittings of welded construction, the alloy content \n(carbon, chromium, nickel, molybdenum, niobium \n(columbium), and tantalum) of the deposited weld metal shall \nconform to that required of the base metal or for equivalent \nweld metal as given in the AWS filler metal specification A 5.4 \nor A 5.9 (Type 348 weld metal is listed in AWS A 5.9 but not \nin AWS A 5.4). Exceptions are when welding on Types 304L \nand 304 base metals, the deposited weld metal shall \ncorrespond, respectively, to AWS E308L (ER308L) and E308 \n(ER308). When welding 3 lOS or 310H, the weld metal shall \ncorrespond to A WS ER310 unless otherwise advised by the \npurchaser at the time of placement on the purchase order. When \nwelding on Type 321 base metal, the weld metal shall \ncorrespond to AWS Type E347 (ER347 or ER321); and, when \nwelding on S31725, S31726, S31254, S31266, or S33228 \ndeposited weld metal shall correspond either to the alloy \ncontent of the base metal or to AWS AS .11 E NiCrMo-3 (UNS \nW86112) (AWS AS.14 Ni Cr Mo-3 (UNS N06625)), and when \nwelding on S3 l 730, deposited weld metal and filler metal used \nshall cmTespond either to the alloy content of the base metal or \nto AWS AS.14 ERNiCr-3 (UNS N06082), or ERNiCrMo-3 \n(UNS N06625), or ERNiCrMo-4 (UNS N10276). On S38815 \nbase metals, the deposited weld metal and filler metal used \nshall be agreed upon between purchaser and manufacturer. In \nfittings of welded construction made from predominantly \nfe1rnus alloys N08020, N08367, N08700, N08800, N08810, \nN08811, N08904, N08925 & N08926, the alloy content of the \ndeposited weld metal shall conform to that required of the base \nmetal or for the equivalent weld metal given in the AWS Filler \nMetal Specification AS.11 and AS.14. However, it is possible \nthat weld deposit chemistry will not meet the limits of either \nthe base metal or the filler metal for some elements. The weld \ndeposit chemistry shall meet the lowest minimum and highest \nmaximum values for each specification element in either of the \nbase metal or filler metal specification. Dilution of the base and \nfiller metal must be considered when determining weld deposit \ncriteria for over-alloyed filler metals. \n7.3.1 Supplementary Requirement SI may be specified \nwhere 16-8-2 filler metal is required for joining thick sections \nof Types 316, 321, or 347 and has adequate corrosion resis­\ntance for the intended service. \n8. Tensile Properties \n8.1 The tensile properties of the fitting material shall con­\nform to the requirements of Table 5. The testing and reporting \nshall be performed in accordance with Specification A960/ \nA960M. \nTABLE 5 Tensile Requirements \nAll WP and CR Grades Yield Strength, min, \nksi [MPa] \n304, 304LN, 304H, 309, \n310S,310H, 316,316LN, \n316H, \n317, 317L, 321, 321H, \n347, 347H, 347LN, 348, \n348H \nS31266 \nS31725 \nS31727 \nS31730 \nS32053 \n304L, 316L \n304N, 316N, S31726 \nXM-19 \nN08020 \nN08367 \nN08700 \nN08800 \nN08810 \nN08811 \nN08904 \nN08925 \nN08926 \nS31254 \nS33228 \nS34565 \nS38815 \n30 [205] \n61 [420] \n36 [245] \n25 [175] \n43 [295] \n25 [170] \n35 [240] \n55 [380] \n35 [240] \n45 [310] \n35[240] \n25 [205] \n25 [170] \n25 [170] \n31 [220] \n43[295] \n43 [295] \n44 [300] \n27 [185] \n60 [415] \n37 [255] \nElongation Requirements \nStandard round specimen, or small \nproportional specimen, or \nstrip-type specimen, minimum % \nin 4 fY' \nA S38815 Elongation in 2 in. - 30 % min. \nLongitudinal \n28 \nTensile Strength, min, \nksi [MPa] \n75 [515] \n109 [750] \n80 [550] \n70 [480] \n93 [640] \n70 [485] \n80 [550] \n100 [690] \n80 [550] \n95 [655] \n80[550] \n65 [520] \n65 [450] \n65 [450] \n71 [490] \n87 [600] \n94 [650] \n94 [650] to 119 [820] \n73 [500] \n115 [795] \n78 [540] \nTransverse \n20 \n8.1.1 Specimens cut either longitudinally or transversely \nshall be acceptable for the tensile test. \n8.1.2 While Table 5 specifies elongation requirements for \nboth longitudinal and transverse specimens, it is not the intent \nthat both requirements apply simultaneously. Instead, it is \nintended that only the elongation requirement that is appropri­\nate for tl1e specimen used be applicable. \n8.2 Records of the tension test made on the starting material \nshall be certification that the material of the fitting meets the \nrequirements of this specification provided that heat treatments \nare the same. \n8.3 If the raw material was not tested, or if the heat \ntreatment of the raw material was different than the heat \ntreatment of the fitting, the fitting manufacturer shall perform \nat least one tension test per heat on material representative of \nthe fitting, and in the same condition of heat treatment as the \nfitting it represents. Qualification of welding procedures shall \nbe in accordance with 5.8. \n8.4 If a tension test through the weld is desired, Supplemen­\ntary Requirement S51 in Specification A960/A960M should be \nspecified. \n680 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0730.json",
  "tabulaTablesCsv": "tables_tabula/page-0730.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0730.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5450,
  "bestTextAlphaRatio": 0.6451
}