{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 57,
  "globalPageIndex": 855,
  "width": 623.28,
  "height": 800.52,
  "text": "ASME BPVC.11.A-2025 SA-451/SA-451M \nS4. Photomicrographs for hldividual Pieces \nS4.1 The manufacturer shall furnish photomicrographs from \none or both ends of each pipe. All photomicrographs required \nshall be properly identified as to heat number, size, and wall \nthickness of pipe from which the section was taken. Photomi­\ncrographs shall be further identified to permit association of \neach photomicrograph with the individual length of pipe it \nrepresents. \nS5. Metal Structure and J<:tching Tests \nS5.1 Etching tests (Note Sl) shall be made on transverse \nsections from the pipe and shall reveal the macrostructure of \nthe material. Such tests are for information only. \nNoTE Sl-Pending development of etching methods applicable to the \nproduct covered by this specification, it is recommended that the Recom­\nmended Practice for a Standard Macroetch Test for Routine Inspection of \nIron and Steel be followed. \nS6. Radiographic Examination \nS6. l The castings shall be examined for internal defects by \nmeans of X rays or gamma rays. The inspection procedure shall \nbe in accordance with Guide E94 and the types and degrees of \ndiscontinuities considered shall be judged by Reference Radio­\ngraphs E446, El86, or E280. The extent of examination and \nthe basis for acceptance shall be subject to agreement between \nthe manufacturer and the purchaser. \nS7. Liquid Penetrant Examination \nS7 .1 The castings shall be examined for surface disconti­\nnuities by means of liquid penetrant inspection. The method of \nperforming the liquid penetrnnt test shall be in accordance with \nTest Method El65. The areas to be inspected, the methods and \ntypes of liquid penetrants to be used, the developing procedure, \nand the basis for acceptance shall be as specified on the inquiry \nor invitation to bid and on the purchase order or contract or \nboth, or as agreed upon between the manufacturer and the \npurchaser. \n753 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0855.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 1913,
  "bestTextAlphaRatio": 0.7862
}