{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 415,
  "globalPageIndex": 415,
  "width": 624.0,
  "height": 862.56,
  "text": "ASME BPVC.II.A-2025 SA-249 /SA-249M \n13.7 Grain Size-Grain size determinations on grades \nTP309H, TP309HCb, TP310H and TP310HCb shall be made \non the same number of tubes as prescribed for the flattening \ntest. \n13.8 Heavily cold worked tubes (HCW) shall be capable of \npassing the -weld decay test listed in Supplementary S7 with a \nweld metal to base metal loss ratio of 0.90 to 1.10. The test is \nnot required unless S7 is specified in the purchase order. \n13.9 Lot Definitions: \n13.9.1 For flattening and flange requirements, the term lot \napplies to all tubes prior to cutting of the same nominal size \nand wall thickness which are produced from the same heat of \nsteel. When final heat treatment is in a batch-type furnace, a lot \nshall include only those tubes of the same size and from the \nsame heat which are heat treated in the same furnace charge. \nWhen the final heat treatment is in a continuous furnace, the \nnumber of tubes of the same size and from the same heat in a \nlot shall be determined from the size of the tubes as prescribed \nin Table 4. \n13.9.2 For tension and hardness test requirements, the term \nlot applies to all tubes prior to cutting, of the same nominal \ndiameter and wall thickness which are produced from the same \nheat of steel. When final heat treatment is in a batch-type \nfurnace, a lot shall include only those tubes of the same size \nand the same heat which are heat treated in the same furnace \ncharge. When the final heat treatment is in a continuous \nfurnace, a lot shall include all tubes of the same size and heat, \nannealed in the same furnace at the same temperature, time at \nheat, and furnace speed. \n14. Permissible Variations in Dimensions \n14.1 Dimensional tolerances other than wall thickness tol­\nerances shall be in accordance with Specification A1016/ \nTABLE 4 Number of Tubes in a Lot Heat Treated by the \nContinuous Process \nSize of Tube \n2 in. [50.8 mm] and over in outside \ndiameter and 0.200 in. [5.1 mm] and over \nin wall thickness \nLess than 2 in. [50.8 mm] but over 1 in. \n[25.4 mm] in outside diameter or over 1 in. \n[25.4 mm] in outside diameter and under \n0.200 In. [5.1 mm] in wall thickness \n1 In. [25.4 mm] or less in outside diameter \nSize of Lot \nnot more than 50 tubes \nnot more than 75 tubes \nnot more than 125 \ntubes \nA1016M. Wall thickness tolerances shall be ±10 % ofnominal \nwall for all tubing sizes. \n14.2 The wall thickness of the weld shall not exceed the \nwall thickness measured 90° from the weld by more than 6 % \nof the specified wall thickness or 0.004 in. [0.1 mm], which­\never is greater. \n14.2.1 Requirements of 14.2 are not applicable when any of \nthe following apply: \n14.2.1.1 When the specified wall thickness exceeds 12 % of \nthe specified outside diameter; \n14.2.1.2 When the specified wall thickness exceeds 0.165 \nin. [4.2 mm]; \n14.2.1.3 When the specified OD exceeds 3 in. [76.2 mm]; or \n14.2.1.4 When the specified minimum yield strength given \nin Table 3 for the specified grade is 35 ksi [240 MPa] or greater. \n15. Workmanship, Finish, and Appearance \n15.1 Finished tubes shall have smooth ends free of burrs and \nshall not deviate from straightness by more than 0.030 in. [0.8 \nmm] in 3 ft [900 mm] of length. \n16. Surface Condition \n16.1 The tubes, after final heat treatment, shall be chemi­\ncally descaled or pickled free of scale. When bright annealing \nis used, pickling or chemical descaling is not necessary. \n17. Forming Operations \n17 .1 Tubes when inserted in the boiler shall stand expanding \nand beading without showing cracks or flaws. All tubes, when \nproperly manipulated, shall be able to stand expanding and \nbeading without showing cracks and flaws, and also shall stand \nall forging, welding, and bending operations necessary for \napplication without developing defects. \n18. Product Marking \n18.1 In addition to the marking prescribed in Specification \nAl016/Al016M, the marking for Grades TP304H, TP309H, \nTP309HCb, TP310H, TP310HCb, TP316H, TP321H, TP347H, \nTP348H, N08810, and N08811 shall also include the heat \nnumber and the heat-treatment lot identification. \n19. Keywords \n363 \n19.1 austenitic stainless steel; boiler tubes; condenser tube; \nheat exchanger tube; high temperature applications; N08800; \nN08810; N08811; steel tube; superheater tubes; temperature \nservice applications, high; welded steel tube and heavily cold \nworked (HCW) tubes ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0415.json",
  "tabulaTablesCsv": "tables_tabula/page-0415.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0415.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4244,
  "bestTextAlphaRatio": 0.726
}