{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 545,
  "globalPageIndex": 1343,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-788/SA·788M \nTension test specimen \nNoTE I-Tension test specimens also may be located inboard of the hub. \n~ontest • specimen \nFIG. S12.1 Tension Test Specimens \nS14.l.2 Fracture appearance (see Supplement 5 of Test \nMethods and Definitions A370), or \nS14.l.3 Lateral expansion. \nS14.l.4 The test temperature range shall be wide enough to \nestablish the upper and lower shelf energies, with sufficient \ntesting at intermediate temperatures to permit a smooth curve \nto be plotted. A minimum test temperature may be set by \nagreement instead of establishing the lower shelf temperature. \nThe upper shelf energy level is defined as having at least 95 % \nfibrous fracture and the lower shelf level is defined as showing \n5 % or less fibrous fracture. \nS142 The purchaser shall furnish the manufacturer with \ndetails of sample location, number of specimens, heat \ntreatments, and information to be derived from the test. \nS15. Grain Size \nS15.1 When a grain size range is requ;ired, it shall be \nspecified in the ordering information as heat treated or \naustenitic, and shall be determined by an agreed-upon method \nfrom Test Methods E112. \nSl5.2 Samples for grain size estimation from heat treated \nproducts shall be taken from the tension test specimen location. \nS16. Rough Machining and Boring \nS 16.1 The position of the rough machining and boring in the \nmanufacturing sequence shall be specified by the purchaser, \nparticularly with regard to heat treatment for mechanical \nproperties. \nS17. Simulated Post-Weld Heat Treatment of Mechanical \nTest Samples \nS 17 .1 All test coupons shall be subjected to single or \nmultiple heat treatments at subcritical temperatures prior to \ntesting. Such treatments are intended to simulate post-weld or \nother treatments to which the forgings will be subjected during \nsubsequent fabrication. The purchaser shall furnish the manu­\nfacturer with details of the desired heat treatment for the test \ncoupons, including temperatures, times, and cooling rates. \nSIS. Magnetic Particle Examination \nS 18.1 All accessible surfaces of the finished forging shall be \nsubject to magnetic particle examination in accordance with \nPractice A275/A275M. \nSl8.2 Unless otherwise agreed upon between the manufac­\nturer and the purchaser the wet continuous method shall be \nused. \nS18.2.1 The following conditions are subject to rejection or \nremoval: \nS18.2.1.1 Indications with major dimension exceeding 3/16 \nin. [5 mm]. \nS 18.2.1.2 Four or more indications exceeding 1/16 in.· \n[1.5 mm] in major dimensions that are aligned and separated \nby 1/16 in. [1.5 mm] or less end to end. \nSl8.2.l.3 Ten or more indications exceeding 1/16 in. \n[1.5 mm] in major dimensions contained in arty 6 in.2 [40 cm 2 ] \nof surface, with the major dimension of this area not to exceed. \n6 in. [150 mm]. The area shall be taken in the most unfavorable \nlocation relative to the indications being evaluated. \nS19. Liquid Penetrant Examination \nS 19 .1 All accessible surfaces of the finished forging shall be \nsubject to liquid penetrant examination in accordance with \nPractice El65/El65M. The penetrant system to be used shall \nbe agreed upon between the manufacturer and purchaser. \nS19.2 The following conditions are subject to rejection or \nremoval: \nS19.2.1 Indications with major dimensions exceeding 1/16 .• \nin. [5 mm]. \n1281 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1343.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3363,
  "bestTextAlphaRatio": 0.7508
}