{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 813,
  "globalPageIndex": 1611,
  "width": 612.48,
  "height": 792.0,
  "text": "''----' \nASME BPVC.II.A-2025 SA-1091/SA-1091M (ASTM A1091/A1091M) \n9. Permissible Variations in Dimensions of Centrifugally \nCast Pipe \n9 .1 Thickness-The wall thickness of centrifugally cast pipe \nshall not vary over that specified by more than Vs in. [3 mm]. \nThere shall be no variation under the specified wall thickness. \n10. Rework, Welding, and Retreatment \n10.l Defects, as defined in Section 8, shall be removed and \ntheir removal verified by visual inspection of the resultant \ncavities. Defects that are located by inspecting with supple­\nmentary requirements specified in the order shall be removed \nor reduced to an acceptable size. \n10.2 If removal of the defect does not impinge upon the \nminimum wall thickness, if applicable, the depression may be \nblended uniformly into the surrounding surface. \n10.3 Welding is permitted, subject to the following require­\nments: \n10.3.1 Only welders and procedures qualified in accordance \nwith ASME Boiler and Pressure Vessel Code, Section IX, shall \nbe used. \n10.3.2 For Grade C91, all welding shall be made with one of \nthe processes and consumables shown in Table 3. In addition, \nthe sum of the Ni + Mn content of all weld consumables used \nfor weld repair shall not exceed 1.0 %. \n10.3.3 For Grade C933, close matching parent chemistry \nwelding consumables shall be used, such as AWS A5.5/A5.5M \ndesignation B9015 H4, matching the chemistry in Table 4. \nOther undermatching electrodes may be agreed upon between \nthe purchaser and manufacturer but may result in reduced \nhigh-temperature creep performance. \n~0.3.3.1 When Supplementary Requirement S4 of Specifi­\n~ation ~703/A703M or A985/A985M for investment castings \n1s specified, welds shall be inspected by magnetic particle \nex~nation to the same standards that are used to inspect the \ncastings. \n~0.3.3.2 When Supplementary Requirement S5 of Specifi­\n~ation ~703/A703M or A985/A985M for investment castings \n1s specified, welds on castings that have leaked on hydrostatic \ntest, or o? castings in which the depth of any cavity prepared \nfor weldmg exceeds 20 % of the wall thickness or 1 in. \n[25 _mm], whichever is smaller, or on castings in which any \ncavity prepared for welding is greater than approximately \n10 in.2 [65 cm 2 ], shall be radiographed to the same standards \nthat are used to inspect the castings. \n10.3.4 Welds shall be considered major in the case of a \ncasting that has leaked on hydrostatic test, or when the depth of \nthe cavity prepared for welding exceeds 20 % of the wall \nthickness or 1 in. [25 mm], whichever is smaller, or when the \nextent of the cavity exceeds approximately 10 in.2 [65 cm 2 ]. \nWelds not meeting these requirements shall be considered \nminor welds. \nTABLE 3 Welding Consumables for Use with Grade C91 Castings \nProcess \nSMAW \nSAW \nGTAW \nFCAW \nSpecification \nA5.5/A5.5M \nA5.23/A5.23M \nA5.28/A5.28M \nA5.29/A5.29M \nClassification \nE90XX-B9 \nEB9 + Neutral Flux \nER90S-B9 \nE91T1-B9 \nTABLE 4 Chemical Composition of Grade C933 Welding \nConsumablesA \nElement \nCarbon \nManganese \nPhosphorus \nSulfur \nSilicon \nNickel \nChromium \nMolybdenum \nNiobium \nNitrogen \nVanadium \nCobalt \nTungsten \nBoron \nWeight% \n0.08-0.12 \n0.70 \n0.025 \n0.012 \n0.60 \n0.60 \n8.0-9.5 \n0.50 \n0.05-0.10 \n0.050 \n0.18-0.25 \n2.75-3.50 \n2.25-3.00 \n0.007-0.020 \nA All values are maximums unless a range is provided. \n10.3.5 Major welds shall be subject to the prior approval of \nthe purchaser. \n10.3.6 The locations, lengths, widths, and depths of major \nwelds shall be included in the material test report. \n10.3.7 When specified by the purchaser, the locations of all \nwelds shall be included in the material test report. \n10.3.8 Post-WeldHeatTreatmentforGrade C91-All welds \nshall be heat treated in accordance with one of the following \nrequirements, as applicable: \n10.3.8.1 For castings for which re-austenitizing does not \nlead to unacceptable distortion, defined as violation of the \ntolerances of the specification or contained in the purchase \norder, the following shall apply: Castings containing a weld \nmade after the austenitizing and tempering heat treatment in \n5.1 ~hall be re-austenitized and tempered according to the \nreqwrements of 5.1. Local heat treatment is not permitted. \n10.3.8.2 For castings for which re-austenitizing does lead to \nunacceptable distortion, and with the agreement of the \npur~haser, in lieu of re-austenitizing and tempering, the fol­\nlowmg shall apply: \n( 1) Welds shall be heat treated within the temperature range \n~f 1350 to 1470 °F [730 to 800 °C], for a minimum holding \ntime based on the maximum thickness of the casting. \n(2) Castings having a maximum thickness :S5 in. [125 mm] \nshall be held at temperature for 1 h per inch of thickness [l h \nper 25 mm of thickness], except that 30 minutes minimum is \npermitted for castings having a maximum thickness less than \n1 in. [25 mm]. \n( 3) Castings having a maximum thickness greater than 5 in. \n[125 mm] shall be held at temperature for 5 h, plus 15 minutes \nfor each additional inch [25 mm] over 5 in. [125 mm]. \n10.3.8.3 Local post-weld heat treatment is permitted only by \nagreement between the producer and the purchaser. Process \nrequirements, to ensure that the minimum post-weld heat \ntreatment is reached in welds and that the maximum post-weld \nheat treatment is not exceeded anywhere on the casting, shall \nbe as agreed upon by the producer and the purchaser. \n10.3.8.4 Castings shall be designated as Class 1 or Class 2 \ndepending on the type of weld (see 10.3.4) and heat treatment' \nas shown in Table 5. ' \n~oTE 3-For Class 2 castings, ASME or other construction codes may \nassign allowable stresses or pressure ratings different from and more \n1557 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1611.json",
  "tabulaTablesCsv": "tables_tabula/page-1611.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1611.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5685,
  "bestTextAlphaRatio": 0.7154,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-1611.txt",
  "gapOcrHighDpiLength": 5312,
  "camelotTablesPath": "camelot_tables/page-1611.json",
  "camelotTablesCsv": "camelot_tables/page-1611.csv",
  "camelotTableCount": 2
}