{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 282,
  "globalPageIndex": 282,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-192/SA-192M ASME BPVC.II.A-2025 \nSpecification for \nSeamless Carbon Steel Boiler Tubes for High-Pressure \nService \n1. Scope \n1. 1 This specification covers minimum-wall-thickness, \nseamless carbon steel boiler and superheater tubes for high­\npressure service. \n1.2 The tubing sizes and thicknesses usually furnished to \nthis specification are½ in. to 7 in. [12.7 to 177.8 mm] outside \ndiameter and 0.085 to 1.000 in. [2.2 to 25.4 mm], inclusive, in \nminimum wall thickness. Tubing having other dimensions may \nbe furnished, provided such tubes comply with all other \nrequirements of this specification. \n1.3 Mechanical property requirements do not apply to \ntubing smaller than 1/s in. [3.2 mm] inside diameter or 0.015 in. \n[0.4 mm] thickness. \n1.4 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n230 \n2. Referenced Documents \n2.1 ASTM Standards: \nA450/A450M Specification for General Requirements for \nCarbon and Low Alloy Steel Tubes \n3. Ordering Inforination \n3 .1 Orders for material under this specification should \ninclude the following, as required, to describe the desired \nmaterial adequately: \n3.1.1 Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material (seamless tubes), \n3.1.3 Manufacture (hot-finished or cold-finished), \n3.1.4 Size (outside diameter and minimum wall thickness), \n3.1.5 Length (specific or random), \n3.1.6 Optional requirements (Sections 8.1 and 10.4), \n3.1.7 Test report required (see section on Certification of \nSpecification A450/ A450M), \n3.1.8 Specification designation, and \n3 .1.9 Special requirements. \n4. General Requirements \n4.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A450/A450M, unless otherwise provided herein. \nS. Manufacture \n5 .1 Tubes shall be made by the seamless process and shall \nbe either hot-finished or cold-finished, as specified. \n6. Heat Treatment \n6.1 Hot-finished tubes need not be heat treated. Cold­\nfinished tubes shall be heat treated after the final cold-finishing \nat a temperature of 1200°F [650°C] or higher. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0282.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2862,
  "bestTextAlphaRatio": 0.7425
}