{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 259,
  "globalPageIndex": 1057,
  "width": 632.52,
  "height": 808.08,
  "text": "ASME BPVC.II.A-2025 SA-563 \n9.5 Should any specimen fail to meet the requirements \nof any specified test, double the number of specimens from \nthe same lot shall be tested for this property, in which case \nall of the additional specimens shall meet the specifications. \n10. Test Methods \n10.1 Tests shall be conducted in accordance with Test \nMethods F 606. \n11. Report \n11.1 When specified in the order, the manufacturer \nshall furnish a test report ce1tified to be the last completed \nset of mechanical tests for each stock size in each shipment. \n12. Inspection \n12.1 If the inspection described in 12.2 is required by \nthe purchaser, it shall be specified in the inquiry and con­\ntract or order. \n12.2 The inspector representing the purchaser shall \nhave free entry to all parts of the manufacturer's works \nthat concern the manufacture of the material ordered. The \nmanufacturer shall afford the inspector all reasonable facili­\nties to satisfy him that the material is being furnished in \naccordance with this specification. All tests and inspections \nrequired by the specification that are requested by the pur­\nchaser's representative shall be made before shipment, and \nshall be conducted as not to interfere unnecessarily with \nthe operation of the works. \n13. Rejection and Rehearing \n13.1 Material that fails to conform to the requirements \nof this specification may be rejected. Rejection should be \nreported to the producer or supplier promptly and in writ­\ning. In case of dissatisfaction with the results of the test, \n- - - - - - - - - the.producer.or_ sJJp_plier_m_ay_ ll!_al<:e _Ehl_i1!1 f?r_ a _Ee_liearing. \n14. Product Marking \n14.1 Nuts made to the requirements of Grades 0, A, \nand B are not required to be marked unless individual \nmarking is specified in the inquiry and order. When individ­\nual marking is required, the mark shall be the grade letter \nsymbol on one face of the nut. \n14.2 Heavy hex nuts made to the requirements of \nGrade C (Note 4) shall be marked on one face with three \ncircumferential marks 120° apart. \n14.3 Heavy hex nuts made to the requirements of \nGrade C3 shall be marked on one face with three circumfer­\nential marks 120° apart and the numeral 3. In addition, the \nmanufacturer may add other distinguishing marks indicat­\ning that the nut is atmospheric corrosion resistant and of \na weathering type. \n14.4 Nuts made to the requirements of Grade D shall \nbe marked with the grade symbol, D (Note 4) on one face. \n14.5 Nuts made to the requirements of Grade DH shall \nbe marked with the grade symbol, DH (Note 4) on one face. \n14.6 Heavy hex nuts made to the requirements of \nGrade DH3 shall be marked with the grade symbol DH3 \non one face. Hex nuts made to the requirements of DH3 \nshall be marked with the symbol HX3 on one face. In \naddition, the manufacturer may add other distinguishing \nmarks indicating that the nut is atmospheric corrosion resis­\ntant and of a weathering type. \n14.7 In addition, nuts of Grades C, C3, D, DH, and \nDH3 and hex nuts made to the requirements of DH3, shall \nbe marked with a symbol to identify the manufacturer. \n14.8 Marks may be raised or depressed at the option \nof the manufacturer. However, if markings are located on \nthe bearing surface, they shall be depressed. \n14.9 Grade and manufacturer's identification shall be \nseparate and distinct. The two identifications shall prefera­\nbly be in different locations and, when on the same level, \nshall be separated by at least two spaces. \nNOTE 4- See Table 3 for marking of equivalent nuts made in accordance \nwith requirements of Specification A 194/ A 194M. \n15. Packaging and Package Marking \n15.1 Packaging: \n15.1.1 Unless otherwise specified, packaging shall \nbe in accordance with Practice D 3951. \n15.1.2 When special packaging requirements are \nrequired, they shall be defined at the time of the inquiry \nand order. \n15.2 Package Marking: \n15.2.1 Each shipping unit shall include or be plainly \n957 \nmarked with the following information: \n1.5.2.f:l- ASTM clesignation---an-d -grade; - - - - - - - - -\n15.2.1.2 Size, \n15.2.1.3 Name and brand or trademark of the man-\nufacturer, \n15.2.1.4 Number of pieces, \n15.2.1.5 Purchase order number, and \n15.2.1.6 Country of origin. \n16. Responsibility \n16.1 The party responsible for the fastener shall be the \norganization that supplies the fastener to the purchaser. \n17. Keywords \n17.1 alloy steel; carbon steel; nuts; steel; weathering \nsteel ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1057.json",
  "tabulaTablesCsv": "tables_tabula/page-1057.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1057.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4442,
  "bestTextAlphaRatio": 0.7377
}