{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 64,
  "globalPageIndex": 64,
  "width": 623.28,
  "height": 800.52,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \ncondition. Test specimens for heat-treated structural products \nshall be taken from test coupons that are representative of the \nstructural products in their delivered condition, or from sepa­\nrate pieces of full thickness or full section from the same heat \nsimilarly heat treated. \n11.1.1 Where the plate is heat treated with a cooling rate \nfaster than still-air cooling from the austenitizing temperature, \none of the following shall apply in addition to other require­\nments specified herein: \n11. 1.1.1 The gage length of the tension test specimen shall \nbe taken at least lT from any as-heat treated edge where Tis \nthe thickness of the plate and shall be at least ½ in. [12.5 mm] \nfrom flame cut or heat-affected-zone surfaces. \n11.1.1.2 A steel thermal buffer pad, 1 Tby lTby at least 3T, \nshall be joined to the plate edge by a partial penetration weld \ncompletely sealing the buffered edge prior to heat treatment. \n11.1.1.3 Thermal insulation or other thermal barriers shall \nbe used during the heat treatment adjacent to the plate edge \nwhere specimens are to be removed. It shall be demonstrated \nthat the cooling rate of the tension test specimen is no faster \nthan, and not substantially slower than, that attained by the \nmethod described in 11.1.1.2. \n11.1.1.4 When test coupons cut from the plate but heat \ntreated separately are used, the coupon dimensions shall be not \nless than 3Tby 3Tby T and each tension specimen cut from it \nshall meet the requirements of 11.1.1.1. \n11.1.1.5 The heat treatment of test specimens separately in \nthe device shall be subject to the limitations that (J) cooling \nrate data for the plate are available; (2) cooling rate control \ndevices for the test specimens are available; and, (3) the \nmethod has received prior approval by the purchaser. \n11.2 Orientation-For plates wider than 24 in. [600 mm], \ntest specimens shall be taken such that the longitudinal axis of \nthe test specimen is transverse to the final direction of rolling \nof the plate. Test specimens for all other structural products \nshall be taken such that the longitudinal axis of the test \nspecimen is parallel to the final direction of rolling. \n11.3 Location: \n11.3.1 Plates-Test specimens shall be taken from a corner \nof the plate. \n11.3.2 Wand HP Shapes with Flanges 6 in. [150 mm] or \nWider-Test specimens shall be selected from a point in the \nflange 2/3 of the way from the flange centerline to the flange toe. \n11.3.3 Shapes Other Than Those in 11.3.2-Test specimens \nshall be selected from the webs of beams, channels, and zees; \nfrom the stems of rolled tees; and from the legs of angles and \nbulb angles, except where full-section test specimens for \nangles are used and the elongation acceptance criteria are \nincreased accordingly. (See 11.6.2.) \n11.3.4 Bars: \n11.3.4.1 Test specimens for bars to be used for pins and \nrollers shall be taken so that the axis is: midway between the \ncenter and the surface for pins and rollers less than 3 in. [75 \nmm] in diameter; 1 in. [25 mm] from the surface for pins and \nrollers 3 in. [75 mm] and over in diameter; or as specified in \n12 \nAnnex Al of Test Methods and Definitions A370 if the \napplicable foregoing requirement is not practicable. \n11.3.4.2 Test specimens for bars other than those to be used \nfor pins and rollers shall be taken as specified in Annex Al of \nTest Methods and Definitions A370. \n11.4 Test Frequency: \n11.4.1 Structural Products Produced from an As-Rolled \nStructural Product-The minimum number of pieces or plates­\nas-rolled to be tested for each heat and strength gradation, \nwhere applicable, shall be as follows, except that it shall be \npermissible for any individual test to represent multiple \nstrength gradations: \n11.4.1.1 As given in Table B, or \n11.4.1.2 One taken from the minimum thickness in the heat \nand one taken from the maximum thickness in the heat, where \nthickness means the specified thickness, diameter, or compa­\nrable dimension, whichever is appropriate for the applicable \nstructural product rolled. \n11.4.2 Structural Products Produced from Coil and Fur­\nnished without Heat Treatment or with Stress Relieving Only: \n11.4.2.1 Except as allowed by 11.4.4, the minimum number \nof coils to be tested for each heat and strength gradation, where \napplicable, shall be as given in Table C, except that it shall be \npermissible for any individual coil to represent multiple \nstrength gradations. \n11.4.2.2 Except as required by 11.4.2.3, two tension test \nspecimens shall be taken from each coil tested, with the first \nbeing taken immediately prior to the first structural product to \nbe qualified, and the second being taken from the approximate \ncenter lap. \n11.4.2.3 If, dming decoiling, the amount of material de­\ncoiled is less than that required to reach the approximate center \nlap, the second test for the qualification of the decoiled portion \nof such a coil shall be taken from a location adjacent to the end \nof the innermost portion decoiled. For qualification of succes­\nsive portions from such a coil, an additional test shall be taken \nadjacent to the innermost pottion decoiled, until a test is \nobtained from the approximate center lap. \n11.4.3 Structural Products Produced from Coil and Fur­\nnished Heat Treated by other than Stress Relieving-The \nminimum number of pieces to be tested for each heat and \nstrength gradation, where applicable, shall be as follows, \nexcept that it shall be permissible for any individual test to \nrepresent multiple strength gradations: \n11.4.3.1 As given in Table B, or \n11.4.3.2 One taken from the minimum thickness in the heat \nand one taken from the maximum thickness in the heat, where \nthickness means the specified thickness, diameter, or compa­\nrable dimension, whichever is appropriate for the applicable \nstructural product rolled. \n11.4.4 Structural Products Produced from Coil and Quali­\nfied Using Test Specimens Heat Treated by Other than Stress \nRelieving-The minimum number of pieces to be tested for \neach heat and strength gradation, where applicable, shall be as \nfollows, except that it shall be permissible for any individual \ntest to represent multiple strength gradations: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0064.json",
  "tabulaTablesCsv": "tables_tabula/page-0064.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0064.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6206,
  "bestTextAlphaRatio": 0.7577
}