{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 446,
  "globalPageIndex": 446,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-266/SA-266M ASME BPVC.II.A-2025 \nSpecification for \nCarbon Steel Forgings for Pressure Vessel Components \n1. Scope \n1.1 This specification covers four grades of carbon steel \nforgings for boilers, pressure vessels, and associated equip­\nment. \nNoTE 1-Designations have been changed as follows: \nCurrent \nGrade 1 \nGrade 2 \nGrade 3 \nGrade 4 \nFormerly \nClass 1 \nClass 2 \nClass 3 \nClass 4 \n1.2 Supplementary requirements are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified individually by the purchaser in the order. \n1.3 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system are not necessarily exact equivalents; therefore, to \nensure conformance with the standard, each system shall be \nused independently of the other, and values from the two \nsystems shall not be combined. \n1.4 Unless the order specifies the applicable \"M\" specifica­\ntion designation, the material shall be furnished to the inch­\npound units. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \n394 \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nAl058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nE112 Test Methods for Determining Average Grain Size \nE165/E165M Practice for Liquid Penetrant Testing for Gen­\neral Industry \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \n2.2 Other Standard: \nASME Boiler and Pressure Vessel Code, Section IX \n3. Ordering Information and General Requirements \n3.1 In addition to the ordering information required by \nSpecification A 788/ A 788M, the purchaser shall include with \nthe inquiry and order a detailed drawing, sketch, or written \ndescription of the forging. \n3.2 Material supplied to this specification shall conform to \nthe requirements of Specification A788/A788M, which out­\nlines additional ordering information, manufacturing \nrequirements, testing and retesting methods and procedures, \nmarking, certification, product analysis variations, and addi­\ntional supplementary requirements. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A788/A788M, the \nrequirements of this specification shall prevail. \n3.4 For hubbed flat heads and tube sheets ordered for ASME \nBoiler and Pressure Vessel Code application, Supplementary \nRequirement S12 of Specification A788/A788M shall be \nspecified in addition to Supplementary Requirement S8 of this \nspecification. \n4. Materials and Manufacture \n4.1 The steel shall be made in accordance with the Melting \nProcess Section of Specification A788/A788M. A sufficient ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0446.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3146,
  "bestTextAlphaRatio": 0.78
}