{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 596,
  "globalPageIndex": 1394,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-815/SA-81SM ASME BPVC.11.A•2025 \nStandard Specification for \nWrought Ferritic, Ferritic/Austenitic, and Martensitic \nStainless Steel Piping Fittings \n1. Scope \n1.1 This specification covers two general classes, WP and \nCR, of wrought ferritic, ferritic/austenitic, and martensitic \nstainless steel fittings of seamless and welded construction \ncovered by the latest revision of Specification A960/ A960M. \nFittings differing from these standards may be furnished in \naccordance with Supplementary Requirement S58 of Specifi-\ncation A960/ A960M. • \n1.1.1 Class WP fittings are subdivided into four subclasses: \nClasses WP-S, WP-W, WP-WX, and WP-WU. They are \nmanufactured to the requirements of Specification A960/ \nA960M, and they shall have pressure ratings compatible with \n12.2. Class WP-S fittings are those manufactured from seam­\nless product by a seamless method of manufacture (marked \nwith class symbol WP-S); Class WP-W fittings are those which \ncontain welds where the fitting fabrication or construction \nwelds have been radiographed (marked with class symbol \nWP-W); and Class WP-WX fittings are those which contain \nwelds where all welds have been radiographed (marked with \nclass symbol WP-WX); and Class WP-WU fittings are those \nwhich contain welds where all welds have been ultrasonically \ntested (marked with class symbol WP-WU). \n1.1.2 Class CR fittings are those manufactured to the \nrequirements of MSS SP-43, and they shall have pressure \nratings compatible with 12.3. \n1.2 This specification does not apply to cast fittings. \n1.3 Optional supplementary requirements are provided. \nWhen desired, one or more of these may be specified in the \norder. \n1.4 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \napplicable \"M\" specification designation [SI units], the mate­\nrial shall be furnished to inch-pound .units. \n1.5 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n2. Referenced Documents \n2.1 ASTM Standards: \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA388/A388M Practice for Ultrasonic Examination of Steel \nForgings \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA763 Practices for Detecting Susceptibility to Intergranular \nAttack in Ferritic Stainless Steels \nA923 Test Methods for Detecting Detrimental Intermetallic \nPhase in Duplex Austenitic/Ferritic Stainless Steels \nA960/ A960M Specification for Common Requirements for \nWrought Steel Piping Fittings \nE165 Practice for Liquid Penetrant Examination for General \nIndustry \n2.2 ASME Standards: \nB16.9 Factory-Made Wrought Butt-Welding Fittings \nB16.11 Forged Fittings, Socket-Welding and Threaded \n2.3 MSS Standards: \nMSS SP-43 Standard Practice for Light Weight Stainless \nSteel Butt-Welding Fittings \nMSS SP- 79 Socket-Welding Reducer Inserts \nMSS SP-83 Steel Pipe Unions, Socket-Welding and \nThreaded \n1332 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1394.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3292,
  "bestTextAlphaRatio": 0.7713
}