{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 222,
  "globalPageIndex": 222,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-106/SA-106M ASME BPVC.II.A-2025 \nSpecification for \nSeamless Carbon Steel Pipe for High-Temperature Service \n1. Scope \n1.1 This specification covers seamless carbon steel pipe for \nhigh-temperature service (Note 1) in NPS Vs to NPS 48 [DN 6 \nto DN 1200] (Note 2) inclusive, with nominal (average) wall \nthickness as given in ASME B 36.lOM. It shall be permissible \nto furnish pipe having other dimensions provided such pipe \ncomplies with all other requirements of this specification. Pipe \nordered under this specification shall be suitable for bending, \nflanging, and similar forming operations, and for welding. \nWhen the steel is to be welded, it is presupposed that a welding \nprocedure suitable to the grade of steel and intended use or \nservice will be utilized. \nNorn 1-It is suggested, consideration be given to possible graphitiza­\ntion. \nNorn 2-The dimensionless designator NPS (nominal pipe size) [DN \n(diameter nominal)] has been substituted in this standard for such \ntraditional terms as \"nominal diameter,\" \"size,\" and \"nominal size.\" \n1.2 Supplementary requirements of an optional nature are \nprovided for seamless pipe intended for use in applications \nwhere a superior grade of pipe is required. These supplemen­\ntary requirements call for additional tests to be made and when \ndesired shall be so stated in the order. \n1.3 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.4 The following precautionary caveat pertains only to the \ntest method portion, Sections 11, 12, and 13 of this specifica­\ntion: This standard does not purport to address all of the safety \nconcerns, if any, associated with its use. It is the responsibility \nof the user of this standard to establish appropriate safety, \nhealth, and environmental practices and determine the appli­\ncability of regulatory limitations prior to use. \n170 \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA530/A530M Specification for General Requirements for \nSpecialized Carbon and Alloy Steel Pipe \nE213 Practice for Ultrasonic Testing of Metal Pipe and \nTubing \nE309 Practice for Eddy Current Examination of Steel Tubu­\nlar Products Using Magnetic Saturation \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \nE570 Practice for Flux Leakage Examination of Ferromag-\nnetic Steel Tubular Products \n2.2 ASME Standard: \nASME B 36.lOM Welded and Seamless Wrought Steel Pipe \n2.3 Military Standards: \nMIL-STD-129 Marking for Shipment and Storage \nMIL-STD-163 Steel Mill Products, Preparation for Ship-\nment and Storage \n2.4 Federal Standard: \nFed. Std. No. 123 Marking for Shipments (Civil Agencies) \nFed. Std. No. 183 Continuous Identification Marking of Iron \nand Steel Products \n2.5 Other Standards: \nSSPC-SP 6 Surface Preparation Specification No. 6 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0222.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3358,
  "bestTextAlphaRatio": 0.7737,
  "noteOcrPath": "note_ocr/page-0222.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 1—It is suggested, consideration be given to possible graphitiza-"
  ]
}