{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 196,
  "globalPageIndex": 994,
  "width": 623.28,
  "height": 800.52,
  "text": "SA-530/SA-530M ASME BPVC.II.A-2025 \nSpecification for \nGeneral Requirements for Specialized Carbon and Alloy \nSteel Pipe \n1. Scope \n1.1 This specification covers a group of requirements \nwhich, with the exceptions of Section 6.3, Section 14, Section \n21, and Section 22, are mandatory requirements to the ASTM \npipe product specifications noted below unless the product \nspecification specifies different requirements, in which case the \nrequirement of the product specification shall prevail. \n1.2 Sections 6.3 or 21 are mandatory if the product speci­\nfication has a requirement for product analysis or flattening \ntests. \n1.3 Section 22 is mandatory if the product specification has \na hydrostatic test requirement without defining the test param­\neters. \n1.4 Section 14 is for infonnation only. \n1.5 In case of conflict between a requirement of the product \nspecification and a requirement of this general requirement \nspecification, only the requirement of the product specification \nneed be satisfied. \nTitle of Specification \nSeamless Carbon Steel Pipe for High-Temperature Service \nMetal-Arc-Welded Steel Pipe for Use With High-Pressure \nTransmission Systems \nSeamless Carbon Steel Pipe for Atmospheric and Lower \nTemperatures \nCentrifugally Cast Carbon Steel Pipe for High-Temperature \nService \nElectric-Fusion-Welded Steel Pipe for Atmospheric and \nLower Temperatures \nElectric-Fusion-Welded Steel Pipe for High-Pressure Service \nat Moderate Temperatures \nCarbon and Alloy Steel Pipe, Electric-Fusion-Welded for \nHigh-Pressure Service at High Temperatures \nASTM DesignationA \nA106/A106M \nA381 \nA524 \nA660/A660M \nA671/A671M \nA672/A672M \nA691/A691M \n~---A These designatiQDS refer to the latest is_s_LLe_oUbe_respective.specifications. \n1.6 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. The inch-pound units shall apply unless the \"M\" \ndesignation (SI) of the product specification is specified in the \norder. \nNorn 1-The dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiameter,\" \"size,\" and \"nominal size.\" \n1.7 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA106/A106M Specification for Seamless Carbon Steel Pipe \nfor High-Temperature Service \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA381 Specification for Metal-Arc-Welded Carbon or High­\n-------S-tren-gth--tow=-A.lioy·-steel~P1pe 1or-me-Witn-High~----\nPressure Transmission Systems \nA450/A450M Specification for General Requirements for \nCarbon and Low Alloy Steel Tubes \nA524 Specification for Seamless Carbon Steel Pipe for \nAtmospheric and Lower Temperatures \n894 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0994.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3614,
  "bestTextAlphaRatio": 0.777
}