{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 449,
  "globalPageIndex": 1247,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-703/SA-703M \nwhen T exceeds 5 in. [125 mm], the dimension may be 15 by \n15 by 5 in. [375 by 375 by 125 mm], by agreement between the \nmanufacturer and the purchaser. The test coupon shall be of the \nsame heat of steel and shall receive substantially the same \ncasting practices as the production casting it represents. Cen­\ntrifugal castings may be represented by statically cast coupons. \n(See Specification Al067/Al067M, Fig. 6.) \nS26.3.4 When agreed upon between the manufacturer and \nthe purchaser, castings that are cast or machined to essentially \nthe finished configuration prior to heat treatment shall have test \nspecimens removed from a prolongation or other stock on the \ncasting at a location below the nearest heat-treated surface \nindicated on the order. The specimen location shall be at a \ndistance below the nearest heat-treated surface equivalent to at \nleast the greatest distance that the indicated high-tensile-stress \nsurface will be from the nearest heat-treated surface and a \nminimum of twice this distance from a second heat-treated \nsurface, except that the test specimens shall be no nearer than \n¾ in. [19 mm] to a heat-treated surface and 1 ½ in. [38 mm] \nfrom a second heat-treated surface. (See Specification Al067/ \nAl067M, Fig. 7.) \nS26.3.5 Where specimens are to be removed from the body \nof quenched and tempered castings, either the requirements of \nS26.3.1 shall be met or a steel thermal buffer pad or thermal \ninsulation or other thermal barriers shall be used during heat \ntreatment. Steel thermal buffer pads shall be a minimum of T \nby T by 3 T in length and shall be joined to the casting surface \nby a partial penetration weld completely sealing the buffered \nsurface. Test specimens shall be removed from the casting in a \nlocation adjacent to the center third of the buffer pad. They \nshall be located at a minimum distance of½ in. [13 mm] from \nthe buffered surface and ¼ T from other heat-treated surfaces \n(see Specification Al067/Al067M, Fig. 7). When thermal \ninsulation is used, it shall be applied adjacent to the casting \nsurface where the test specimens are to be removed. The \nproducer shall demonstrate that the cooling rate of the test \nspecimen location is no faster than that of specimens taken by \nthe method described in S26.3.1 \nS27. Hot Isostatic Pressing (HIPing) \nS27 .1 Castings shall be processed by hot isostatic pressing \n(HIPing) according to Practice Al080. Unless specified by the \npurchaser in the purchase order or contract, the HIPing time, \ntemperature, pressure, and other parameters shall be at the \ndiscretion of the producer. \nS28. Cleaning of Stainless Steels \nS28.1 Final cleaning of the casting surfaces shall be per­\nformed in accordance with one of the cleaning methods in \nPractice A380/A380M or Specification A967/A967M as \nagreed upon between the purchaser and supplier. Acceptance \ntesting shall be subject to agreement between the purchaser and \nsupplier. \nS29. \n(This number not assigned to a supplementary requirement.) \nS30. \n(This number not assigned to a supplementary requirement.) \nS31. \n(This number not assigned to a supplementary requirement.) \nS32. \n(This number not assigned to a supplementary requirement.) \nS33. Stabilization Heat Treatment of CFSC \nS33.1 CF8C shall be stabilized at 1600 to 1650 °F [870 to \n900 °C] for a minimum time of 1 h/in. [25 mm] of thickness \nand water quenched or rapidly cooled by other means. The \ngrade designation symbol shall be followed by the symbol \n\"S33.\" \nS34. Stabilization Heat Treatment of CFlOMC \nS34.1 CFlOMC shall be stabilized at 1600 to 1650 °F [870 \nto 900 °C] for a minimum time of 1 h/in. [25 mm] of thickness \nand water quenched or rapidly cooled by other means. The \ngrade designation symbol shall be followed by the symbol \n\"S34.\" \nSS0-869. \n(These numbers reserved for assignment by individual \nproduct standards.) \n1161 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1247.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3902,
  "bestTextAlphaRatio": 0.7427
}