{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 449,
  "globalPageIndex": 449,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-266/SA-266M \nS4. Magnetic Particle Examination \nS4.1 All accessible surfaces of the finished forging shall be \nexamined by a magnetic particle method. The method shall be \nin accordance with Practice A275/A275M. Acceptance limits \nshall be as agreed upon between the manufacturer and the \npurchaser. \nSS. Liquid Penetrant Examination \nS5.1 After forgings have been heat-treated by liquid \nquenching and tempering, all accessible surfaces shall be \ninspected for quench cracks by the liquid penetrant method in \naccordance with Test Method E165/El65M as an alternative to \nmagnetic particle exanrination. \nS6. Macroetch Test \nS6.1 A sample forging shall be sectioned and etched to \nshow ·flow lines and internal imperfections. The test shall be \nconducted in accordance with Method E381. Details of the test \nshall be agreed upon between the manufacturer and the \npurchaser. \nS7. Product Analysis \nS7 .1 A product analysis in accordance with Section 7 shall \nbe made from one randomly selected forging representing each \nsize and shape of forging on the order. If the analysis fails to \ncomply, each forging shall be checked or the lot rejected. All \nresults shall be reported to the purchaser. \nSS. Specimen Location on Forged Hubs \nS8.1 Forged hubs to be butt-welded to shells shall be forged \nin such a manner as to provide in the hub the full nrinimum \ntensile strength and elongation specified for the material, in a \ndirection parallel to the axis of the vessel. A tension specimen \n(subsize if necessary) shall be taken in this direction and as \nclose to the finished hub outside diameter as practical. \nS9. Hardness \nS9.1 The purchaser may check the Brinell hardness of the \nforging at any location on the surface of the forging, and the \nhardness shall be within the following limits: \nGrade \n1 \n2 and 4 \n3 \nSlO. Grain Size \nBrinell Hardness Range HBW \n121 to 170 \n137 to 197 \n156 to 207 \nS 10 .1 The austenitic grain size of the steel shall be 1 to 5 as \ndetermined using Test Methods E112. \nSll. Restriction on Residual Elements (Applicable to Heat \nAnalysis) \nS 11.1 Nickel, chromium, and molybdenum shall be deter­\nmined and shall not exceed the following limits: \nNickel \nChromium \nMolybdenum \nS12. Deleted. \nS13. Impact Tests \n0.25 % max \n0.20 % max \n0,08% max \nS13.l Charpy impact tests shall be made. The number and \nlocation of the tests, minimum properties, and test temperatures \nshall be specified. \n397 \nSl3.2 The specimens shall be machined and tested in \naccordance with Test Methods and Definitions A370. \nSl3.3 Retests may be conducted in accordance with Section \n10 of Specification A 788/ A 788M. \nS14. Individual Forging \nSl4.1 Forgings, whether identical or not, shall be produced \nindividually. They shall not be forged in multiples and sepa­\nrated prior to or after heat treatment. \nSl4.2 The shape and size of individual forgings shall be \nagreed upon between the manufacturer and the purchaser by \nmeans of a forging drawing or the purchase order. \nSIS. Carbon Equivalancy \nSl5.1 The heat analysis including the residual element \nrestrictions of Sl in Specification A788/A788M shall be \nlimited such that the carbon equivalent shall not exceed 0.45 \nfor Grade 1 or 0.50 for Grade 2 or 4 when calculated in \naccordance with the following formula: \n%Mn %Cr+%Mo+%V %Ni+%Cu \nCE=% C+-6-+ 5 + 15 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0449.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3346,
  "bestTextAlphaRatio": 0.7448
}