{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 526,
  "globalPageIndex": 526,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-325 ASME BPVC.II.A-2025 \nStandard Specification for \nStructural Bolts, Steel, Heat Treated, 120/105 ksi Minimum \nTensile Strength \n1. Scope \n1. 1 This specification covers two types of quenched and \ntempered steel heavy hex structural bolts having a minimum \ntensile strength of 120 ksi for sizes 1.0 in. and less and 105 ksi \nfor sizes over 1.0 to 1 ½ in., inclusive. \n1.2 The bolts are intended for use in structmal connections. \nThese connections are covered under the requirements of the \nSpecification for Structural Joints Using ASTM A325 or A490 \nBolts, approved by the Research Council on Structural Con­\nnections, endorsed by the American Institute of Steel Construc­\ntion and by the Industrial Fastener Institute. \n1.3 The bolts are furnished in sizes ½ to 1 ½ in., inclusive. \nThey are designated by type, denoting chemical composition as \nfollows: \nType Description \nType 1 Medium carbon, carbon boron, or medium carbon alloy steel. \nType 2 Withdrawn in November 1991. \nType 3 Weathering steel. \nNoTE I-Bolts for general applications, including anchor bolts, are \ncovered by Specification A449. Also refer to Specification A449 for \nquenched and tempered steel bolts and studs with diameters greater than \n1 ½ in. but with similar mechanical properties. \n1 .4 The values stated in inch-pound units are to be regarded \nas standard. No other units of measmement are included in this \nstandard. \nNoTE 2-A complete metric companion to Specification A325 has been \ndeveloped, Specification A325M; therefore, no metric equivalents are \npresented in this specification. \n1.5 This specification is applicable to heavy hex structmal \nbolts only. For bolts of other configurations and thread lengths \nwith similar mechanical properties, see Specification A449. \n1.6 Terms used in this specification are defined in Termi­\nnology Fl 789. \n1.7 The following safety hazard caveat pertains only to the \ntest methods portion, Section 10, of this specification:This \nstandard does not purport to address all of the safety concerns, \nif any, associated with its use. It is the responsibility of the user \nof this standard to establish appropriate safety and health \npractices and determine the applicability of regulatory limita­\ntions prior to use. \n2. Referenced Documents \n2.1 ASTM Standards: \nA194/A194M Specification for Carbon and Alloy Steel Nuts \nfor Bolts for High Pressme or High Temperature Service, \nor Both \nA325M Specification for Structural Bolts, Steel, Heat \nTreated 830 MPa Minimum Tensile Strength (Metric) \nA449 Specification for Hex Cap Screws, Bolts and Studs, \nSteel, Heat Treated, 120/105/90 ksi Minimum Tensile \nStrength, General Use \nA490 Specification for Structural Bolts, Alloy Steel, Heat \nTreated, 150 ksi Minimum Tensile Strength \n474 \nA563 Specification for Carbon and Alloy Steel Nuts \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nB695 Specification for Coatings of Zinc Mechanically De-\nposited on Iron and Steel \nD3951 Practice for Commercial Packaging \nF436 Specification for Hardened Steel Washers \nF606 Test Methods for Determining the Mechanical Proper­\nties of Externally and Internally Threaded Fasteners, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0526.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3135,
  "bestTextAlphaRatio": 0.767
}