{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 648,
  "globalPageIndex": 1446,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-941 ASME BPVC.II.A-2025 \ninduction heating, n-heating by electrical induction. \ninspection, n-the process of measuring, examining, testing, \ngaging, or otherwise comparing the unit of product with the \napplicable requirements. \nintermediate annealing, n-annealing wrought steel objects \nat one or more stages during manufacture prior to final \nthermal treatment. \ninterrupted aging, n-aging at two or more temperatures, by \nsteps, and cooling to room temperature after each step. \ninterrupted quenching, n-quenching in which the object \nbeing quenched is removed from the quenching medium \nwhile the object is at a temperature substantially higher than \nthat of the quenching medium. \ninterstitial-free steel, n-a steel that has essentially all of its \ncarbon and nitrogen chemically combined with stabilization \nelements rather than being present interstitially. \nD1scussION-The heat analysis limits (minimum or maximum, or \nboth) that are permitted to be prescribed in interstitial-free steel \n. specifications are as given in the definition for carbon steel, except that \nthe 0.050 % maximum limit for titanium does not apply. \nisothermal annealing, n-austenitizing a steel object and \nthen cooling it to, and holding it at, a temperature at which \naustenite transforms to a ferrite-carbide aggregate. \nisothermal transformation, n-a change in phase at any \nconstant temperature. \nkilled steel, n-a steel deoxidized to such a level that essen­\ntially no reaction occurred between carbon and oxygen \nduring solidification. \nlaser beam welding, n-a welding process that uses a laser \nbeam as the heat source. \nlot, n-a definite quantity of product manufactured under \nconditions that are considered uniform. \nlow-alloy steel, n-a steel, other than a carbon steel or an \ninterstitial-free steel, that conforms to a specification that \nrequires the minimum content for each specified alloying \nelement to be lower than the applicable limit in the definition \nfor alloy steel. \nMp M 8 -See transformation temperature. \nmanufacturer, n-the organization responsible for the conver­\nsion of materials into products meeting the requirements of \na product specification. \nmaraging, n-a precipitation hardening treatment applied to a \nspecial group of alloy steels to precipitate one or more \nintermetallic compounds in a matrix of essentially carbon­\nfree martensite. \nmartempering, n-quenching an austenitized steel object in a \nmedium at a temperature in the upper part of, or slightly \nabove, the martensite range, holding it in the medium until \nits temperature is substantially uniform throughout, and then \ncooling it in air through the martensite range. \nmartensite range, n-the temperature interval between M 8 and \n~-\nmicroalloyed steel, n-a low-alloy steel that conforms to a \nspecification that requires the presence of one or more \ncarbide-, nitride-, or carbonitride-forming elements, gener­\nally in individual concentrations less than 0.15 mass percent, \nto enhance strength. \nDiscussION-The most common microalloying elements are niobium \n(columbium), titanium, and vanadium. \nmultiple heat, n-two or more molten primary heats, in \nwhole or in part, combined in a common ladle or in a \ncommon non-oscillating mold. \nDiscussION-A multiple heat is identified by a single heat number \nrepresentative of the multiple heat, or by the individual heat numbers \nof the primary heats contained in the multiple heat. The heat \nanalysis of a multiple heat identified by a single heat number is the \nweighted average analysis of the individual primary heats contained in \nthe multiple heat. Two or more molten primary heats sequentially \nstrand cast (poured- into an oscillating mold) constitute a series of \nindividual heats, not a multiple heat. \nnatural aging, n-spontaneous aging of a super-saturated solid \nsolution at room temperature. \nnickel alloy, n-a material that conforms to a specification that \nrequires by mass percent more nickel than any other ele­\nment. \nDiscussION-ln castings, the nickel content requirement is not \nnormally stated in the specification and is not normally determined by \nchemical analysis, but is taken to be 100 % minus the sum of the mean \nvalues permitted by the specification for all other elements having a \nspecified range or a specified maximum. \nnitriding, n-introducing nitrogen into a solid steel object by \nholding it at a suitable temperature in contact with a \nnitrogenous environment. \nnonferrous material, n-metals and alloys that do not contain \niron as the principal component. \nDiscussION-The iron content is not always stated in the specification \nand is not always determined by chemical analysis. The iron content \nmay be taken to be 100 % minus the sum of the mean values permitted \nby the specification for all other elements having a specified range or a \nspecified maximum. For conformance purposes, the mean value for \niron, whether specified or calculated, is compared on an individual \nbasis to the mean values permitted by the specification for each of the \nother elements having a specified range or a specified maximum. If an \nelement other than iron is not specified, but is listed as remainder or \nbalance, then, for conformance purposes, the mean value for iron is \ncompared to the calculated value for that other element. \nnormalizing, v-reheating a steel object to a temperature \nabove the transformation range and then cooling it in air to \na temperature substantially below the transformation range \nto achieve both grain refinement and improved homogeni­\nzation. \noveraging, n-aging under conditions of time and temperature \ngreater than those required to obtain maximum change in a \ncertain prope1ty, so that the property is altered away from the \nmaximum. \noverheating, n-heating a steel object to such a high tempera­\nture that excessive grain growth occurs. \n1384 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1446.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5843,
  "bestTextAlphaRatio": 0.801
}