{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 279,
  "globalPageIndex": 279,
  "width": 596.16,
  "height": 841.8,
  "text": "ASME BPVC.II.A-2025 SA-182/SA-182M (ASTM A182/A182M) \nthe discretion of the supplier, should be consistent with one of \nthe published industry standards for bar coding. If used on \nsmall parts, the bar code may be applied to the box or a \nsubstantially applied tag. \n20. Keywords \n20.1 austenitic stainless steel; chromium alloy steel; \nchromium-molybdenum steel; ferritic/austenitic stainless steel; \nferritic stainless steel; martensitic stainless steel; nickel alloy \nsteel; notch toughness requirements; pipe fittings; piping ap­\nplications; pressure containing parts; stainless steel fittings; \nstainless steel forgings; steel; steel flanges; steel forgings, \nalloy; steel valves; temperature service applications, elevated; \ntemperature service applications, high; wrought material \nSUPPLEMENTARY REQUIREMENTS \nIn addition to any of the supplementary requirements of Specification A961/A961M, the following \nsupplementary requirements shall apply only when specified by the purchaser in the order. \nSl. Macroetch Test \nS 1.1 A sample forging shall be sectioned and etched to \nshow flow lines and internal imperfections. The test shall be \nconducted according to Test Method E340. Details of the test \nshall be agreed upon between the manufacturer and the \npurchaser. \nS2. Heat Treatment Details \nS2. l The manufacturer shall furnish a detailed test report \ncontaining the information required in 18.2 and shall include \nall pertinent details of the heat-treating cycle given the forg­\nings. \nS3. Material for Optimum Resistance to Stress-Corrosion \nCracking \nS3 .1 Austenitic stainless steel shall be furnished in the \nsolution-annealed condition as a final operation with no sub­\nsequent cold working permitted, except, unless specifically \nprohibited by the purchaser, straightening of bars from which \nparts are machined is permitted to meet the requirements of \nSpecification A484/A484M. \nS4. Corrosion Tests \nS4. l All austenitic stainless steels shall pass intergranular \ncorrosion tests performed in accordance with Practice E of \nPractices A262. \nS4.2 Intergranular corrosion tests shall be performed on \nspecimens of ferritic stainless steels as described in Practices \nA763. \nS4.3 For both the austenitic and ferritic stainless steels, \ndetails concerning the number of specimens and their source \nand location are to be a matter of agreement between the \nmanufacturer and the purchaser. \nS5. Special Filler Metal \nS5.1 In repair-welded F 316, F 316L, F 316H, and F 316N \nforgings, the deposited weld metal shall conform to E 308 \ncomposition wire. Forgings repair welded with E 308 weld \nmetal shall be marked F W 308. \nS6. Hardness Test \nS6. l Each forging shall be hardness tested and shall meet \nthe requirements of Table 3. \nSS. Heat Treatment of Austenitic Forgings \nS8.l The purchaser shall specify the heat-treatment method \n(in 7.1 or in 7.3.1) that shall be employed. \nS8.2 The manufacturer shall provide a test report containing \nthe information required in 18.2 and shall include a statement \nof the heat-treatment method employed. \nS9. Grain Size for Austenitic Grades \nS9.1 Forgings made from austenitic grades other than H \ngrades shall be tested for average grain size by Test Method \nEl12. Details of the test shall be agreed upon between the \nmanufacturer and the purchaser. \nSlO. Stabilizing Treatment \nSlO.l Subsequent to the solution anneal for Grades F 321, F \n321H, F 347, F 347H, F 348, and F 348H, these grades shall be \ngiven a stabilizing treatment at 1500 to 1600 °F [815 to 870 \n0 C] for a minimum of 2 h/in. [4.7 min/mm] of thickness and \nthen cooling in the furnace or in air. In addition to the marking \nrequired in Section 19, the grade designation symbol shall be \nfollowed by the symbol \"SlO.\" \nSll. Grain Size Requirements for Non-H-Grade Austenitic \nSteels Used Above 1000 °F [540 °C] \nSll.1 Non-H grades of austenitic stainless steels shall have \na grain size of No. 7 or coarser as determined in accordance \nwith Test Methods El 12. The grain size so determined shall be \non a certified test report. \nS12. Detection of Detrimental Phases in Austenitic/Ferritic \nStainless Steels \nS 12.1 All austenitic/ferritic stainless steels that are included \nin Test Methods A923 shall meet the requirements of those test \nmethods. \nS 12.2 All austenitic/ferritic stainless steels that are included \nin Test Method A1084 shall meet the requirements of that test \nmethod. \nS13. Minimum Cooling Rate for Grade T91 Type 2 \nS13.1 For Grade P91 Type 2 material, the heat treatment \nshall ensure that following austenitizing the rate of cooling \nfrom 1650 °P to 900 °P [900 °C to 480 °C] is no slower than \n9 °F/min [5 °C/ min]. \n227 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0279.json",
  "tabulaTablesCsv": "tables_tabula/page-0279.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0279.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4671,
  "bestTextAlphaRatio": 0.7517
}