{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 795,
  "globalPageIndex": 795,
  "width": 648.72,
  "height": 882.36,
  "text": "ASME BPVC.II.A-2025 SA-450/SA-450M \n26.9.3 The reference standard shall be passed through the \ntest apparatus at the same speed and test system settings as the \ntube to be tested, except that, at the manufacturer's discretion, \nthe tubes may be tested at a higher sensitivity. \n26.9.4 The signal-to-noise ratio for the reference standard \nshall be 2.5:1 or greater, and the reference signal amplitude for \neach discontinuity shall be at least 50 % of full scale of the \ndisplay. In establishing the noise level, extraneous signals from \nidentifiable surface impe1fections on the reference standard \nmay be ignored. When reject filtering is used during UT \ntesting, linearity must be demonstrated. \n26.9.5 If, upon any standardization, the reference signal \namplitude has decreased by 29 % (3.0 dB), the test apparatus \nshall be considered out of standardization. The test system \nsettings may be changed, or the transducer(s), coil(s), or \nsensor(s) adjusted, and the unit restandardized, but all tubes \ntested since the last acceptable standardization must be re­\ntested. \n26.10 Evaluation of Imperfections: \n26.10.1 Tubing producing a test signal to or greater than the \nlowest signal produced by the reference standard shall be \ndesignated suspect, shall be clearly marked or identified, and \nshall be separated from the acceptable tubing. \n26.10.2 Such suspect tubing shall be subject to one of the \nfollowing three dispositions: \n26.10.2.1 The tubes may be rejected without further \nexamination, at the discretion of the manufacturer. \n26.10.2.2 If the test signal was produced by imperfections \nsuch as scratches, surface roughness, dings, straightener marks, \nloose ID bead and cutting chips, steel die stamps, stop marks, \ntube reducer ripple, or chattered flash trim, the tubing may be \naccepted or rejected depending on visual observation of the \nseverity of the imperfection, the type of signal it produces on \nthe testing equipment used, or both. \n26.10.2.3 If the test signal was produced by imperfections \nwhich cannot be identified, or was produced by cracks or \ncrack-like imperfections, the tubing shall be rejected. \n26.10.3 Any tubes with imperfections of the types in \n26.10.2.2 and 26.10.2.3, exceeding 0.004 in. [0.1 mm] or \n12½ % of the specified minimum wall thickness (whichever is \ngreater) in depth shall be rejected. \n26.10.4 Rejected tubes may be reconditioned and retested \nproviding the wall thickness is not decreased to less than that \nrequired by this or the product specification. If grinding is \nperfonned, the outside diameter in the area of grinding may be \nreduced by the amount so removed. To be accepted, recondi­\ntioned tubes must pass the nondestructive examination by \nwhich they were originally rejected. \n27. Test Report \n27.1 The producer or supplier shall furnish a test report \nstating that the material was manufactured, sampled, tested and \ninspected in accordance with the specification, including year \ndate, the supplementary requirements, and any other require­\nments designated in the purchase order or contract, and that the \nresults met the requirements of that specification, the supple­\nmentary requirements and the other requirements. A signature \nor notarization is not required on the test report, but the \ndocument shall be dated and shall clearly identify the organi­\nzation submitting the report. Notwithstanding the absence of a \nsignature or notarization, the organization submitting the report \nis responsible for the contents of the report. \n27 .2 In addition, the test report shall include the following \ninformation and test results, when applicable: \n27 .2.1 Heat Number, \n27 .2.2 Heat Analysis, \n27.2.3 Product Analysis, when specified, \n27.2.4 Tensile Properties, \n27.2.5 Width of the gage length, when longitudinal strip \ntension test specimens are used, \n27 .2.6 Flattening Test acceptable, \n27.2.7 Reverse Flattening Test acceptable, \n27.2.8 Flaring Test acceptable, \n27.2.9 Flange Test acceptable, \n27.2.10 Hardness Test values, \n27.2.11 Hydrostatic Test pressure, \n27.2.12 Non-destructive Electric Test method, \n27.2.13 Impact Test results, and \n27.2.14 Other test results or information required to be \nreported by the product specification. \n27 .3 Test results or information required to be reported by \nsupplementary requirements, or other requirements designated \nin the purchase order or contract shall be reported, but may be \nreported in a separate document. \n27.4 The test report shall include a statement of explanation \nfor the letter added to the specification number marked on the \ntubes (see 30.2), when all of the requirements of the specifi­\ncation have not been completed. The purchaser must certify \nthat all requirements of the specification have been completed \nbefore removal of the letter (that is, X, Y, or Z). \n27.5 A test report, certificate of compliance, or similar \ndocument printed from or used in electronic form from an \nelectronic data interchange (EDI) transmission shall be re­\ngarded as having the same validity as a counterpart printed in \nthe certifier's facility. The content of the EDI transmitted \ndocument shall meet the requirements of the invoked ASTM \nstandard(s) and conform to any existing EDI agreement be­\ntween the purchaser and supplier. Notwithstanding the absence \nof a signature, the organization submitting the EDI transmis­\nsion is responsible for the content of the report. \n28. Inspection \n745 \n28 .1 The inspector representing the purchaser shall have \nentry at all times while work on the contract of the purchaser \nis being performed, to all parts of the manufacturer's works \nthat concern the manufacture of the material ordered. The \nmanufacturer shall afford the inspector all reasonable facilities \nto satisfy him that the material is being furnished in accordance \nwith this specification. All required tests and inspection shall \nbe made at the place of manufacture prior to shipment, unless \notherwise specified, and shall be conducted so as not to \ninterfere unnecessarily with the operation of the works. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0795.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6053,
  "bestTextAlphaRatio": 0.7656
}