{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 747,
  "globalPageIndex": 1545,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-999 /SA-999M \nfor ferritic/austenitic stainless steel pipe. The test pressure or \nstress shall be detennined using the following equation: \nP = 2St/D or S = PD/2t \nwhere: \nP = hydrostatic test pressure in psi [MPa], \nS = pipe wall stress in psi or [MPa], \n(3) \nt = specified wall thickness, nominal wall thickness accord­\ning to specified ANSI schedule number, or 1.143 times \nthe specified minimum wall thickness, in. [mm], and \nD = specified outside diameter, outside diameter correspond­\ning to specified ANSI pipe size, or outside diameter \ncalculated by adding 2t (as defined above) to the \nspecified inside diameter, in. [mm]. \n22.2.1.1 The hydrostatic test pressure dete1mined by Eq 3 \nshall be rounded to the nearest 50 psi [0.5 MPa] for pressures \nbelow 1000 psi [7 MPa], and to the nearest 100 psi [l MPa] for \npressures 1000 psi [7 MPa] and above. The hydrostatic test \nmay be performed prior to cutting to final length, or prior to \nupsetting, swaging, expanding, bending, or other forming \noperations. \n22.2.2 Regardless of pipe-wall stress-level determined by \nEq 3, the minimum hydrostatic test pressure required to satisfy \nthese requirements need not exceed 2500 psi [17.0 MPa] for \noutside diameters (see D in 22.2) of 3.5 in. [88.9 mm] or less, \nor 2800 psi [19.0 MPa] for outside diameters over 3.5 in. [88.9 \nmm]. This does not prohibit testing at higher pressures at the \noption of the manufacturer or as allowed by 22.2.3. \n22.2.3 With concurrence of the manufacturer, a minimum \nhydrostatic test pressure in excess of the requirements of 22.1 \nor 22.2, or both, may be stated in the purchase order. \n22.2.4 The test pressure shall be held for a minimum of 5 s. \nFor welded pipe, the test pressure shall be held for a time \nsufficient to permit the entire length of the welded seam to be \ninspected. \n22.2.5 The hydrostatic test may not be capable of testing the \nend portion of the pipe. The length of pipe that cannot be tested \nshall be determined by the manufacturer and, if specified in the \npurchase order, reported to the purchaser. \n22.3 Nondestructive Electric Test: \n22.3.1 Each pipe shall be examined with a nondestructive \ntest in accordance with Practices E213, E309, E426, or E570. \nUnless specifically called out by the purchaser, the selection of \nthe nondestructive electric test shall be at the option of the \nmanufacturer. Upon agreement between the purchaser and the \nmanufacturer, Practice E273 shall be employed in addition to \none of the full periphery tests. The range of pipe sizes that may \nbe examined by each method shall be subject to the limitations \nin the scope of the respective practices. \n22.3.2 The following information is for the benefit of the \nuser of this specification: \n22.3.2.1 The reference discontinuities defined in 22.3.8.2 -\n22.3.8. 7 are convenient standards for the standardization of \nnondestructive testing equipment. The dimensions of such \nreference discontinuities should not be construed as the mini­\nmum size imperfection detectable by such equipment. \n22.3.2.2 The ultrasonic testing (UT) can be performed to \ndetect both longitudinally and circumferentially oriented im-\nperfections. It should be recognized that different techniques \nshould be used to detect differently oriented imperfections. The \nexamination may not detect short deep imperfections. \n22.3.2.3 The eddy-current testing (ET) referenced in this \nspecification, (see Practices E426 and E309), has the capability \nof detecting significant imperfections, especially of the short \nabrupt type. The sensitivity of this test decreases with wall \nthickness over 0.250 in. (6.4 mm). \n22.3.2.4 The flux leakage examination referred to in this \nspecification is capable of detecting the presence and location \nof significant longitudinally or transversely oriented imperfec­\ntions; however, sensitivity of the test to various types of \nimperfections is affected by the calibration, and different \ntechniques should be employed to detect differently oriented \nimperfections. \n22.3.2.5 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of imperfections that can \nbe detected in the specific application of these examinations \nshould discuss this with the manufacturer of the tubular \nproduct. \n22.3.3 Time of Examination: \n22.3.3.1 Nondestructive testing for specification acceptance \nshall be performed after all mechanical processing, heat \ntreatments, and straightening operations. This requirement \ndoes not preclude additional testing at earlier stages in the \nprocessing. \n22.3.4 Su-rjace Condition: \n22.3.4.1 All surfaces shall be free of scale, dirt, grease, \npaint, and other foreign material that could interfere with \ninterpretation of test results. The methods used for cleaning \nand preparing the surfaces for examination shall not be \ndetrimental to the base metal or the surface finish. \n22.3.4.2 Excessive surface roughness or deep scratches can \nproduce signals that interfere with the test. \n22.3.5 Extent of Examination: \n22.3.5.1 The relative motion of the pipe and the \ntransducer(s), coil(s), or sensor(s) shall be such that the entire \npipe surface is scanned, except as allowed by 22.3.5.2. \n22.3.5.2 The existence of end effects is recognized, and the \nextent of such effects shall be detennined by the manufacturer, \nand, if requested, shall be reported to the purchaser. Other \nnondestructive tests may be applied to the end areas, subject to \nagreement between the purchaser and the manufacturer. \n22.3.6 Operator Qualifications: \n22.3.6.1 The test unit operator shall be qualified in accor­\ndance • with SNT-TC- lA, or an equivalent recognized and \ndocumented standard. \n22.3.7 Test Conditions: \n22.3.7.1 For eddy-current testing, the excitation coil fre­\nquency shall be chosen to ensure adequate penetration yet \nprovide a good signal-to-noise ratio. \n22.3.7.2 The eddy-current coil frequency used shall not \nexceed the following: \nOn specified walls up to 0.050 in. [1.3 mm] - 100 kHz \nOn specified walls up to 0.150 in. [3.8 mm] - 50 kHz \nOn specified walls equal to or greater than 0.150 in. [3.8 mm] - 10 kHz \n1491 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1545.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6153,
  "bestTextAlphaRatio": 0.7393
}