{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 687,
  "globalPageIndex": 687,
  "width": 609.24,
  "height": 851.28,
  "text": "ASME BPVC.II.A-2025 SA-372/SA-372M \ntreatment as the cylinders it represents. The method of quench­\ning the test ring shall duplicate that of the cylinders; if the \ncylinders aTe quenched from the outside only, then the test ring \nshall have its ends closed. The length of test rings that will be \nliquid quenched shall be at least 24 in. [610 mm]. The ends of \nsuch test rings may be vented to prevent pressure buildup \nduring heat treating. \n6.4.2 Test specimens representing vessel covers or similar \ncomponents may be taken from a full-section prolongation of \nthe cover, a representative forging, or an integral prolongation \nwhen the part is contour machined before heat treatment. \n6.4.2.1 Test specimens taken from full size prolongations or \nrepresentative forgings shall be located at a position midway \nbetween the center and the surface. \n6.4.2.2 When forgings are contour machined before heat \ntreatment so that highly stressed surfaces are exposed, the test \nspecimens may be taken at an equal distance (t) from the \nnearest quenched surface as the highly stressed area but not \nless than ¾ in. [20 mm]. The location of the specimens from a \nsecond surface shall be at least the greater of 1 ½ in. [40 mm] \nor 2t. \n6.5 Number of Tests: \n6.5.1 Up to 200 like forgings, each with a heat-treated \nweight of less than 1000 lb [450 kg] when heat treated in a \nsingle-batch furnace charge, shall have one tension test taken in \naccordance with 6.4.1 or 6.4.2 to represent each heat. In \naddition, for hollow or bored forgings, one bend or flattening \ntest shall be taken in accordance with 6.3. \n6.5.2 Like forgings, weighing less than 1000 lb [450 kg] \neach when heat treated in a continuous furnace, shall have one \ntensile test taken to represent each heat and not more than 200 \nforgings in any continuous period up to 4 h duration. In \naddition, bored or hollow forgings shall have one bend or \nflattening test talcen per heat per 200 forgings in any continuous \nperiod up to 4 h duration in accordance with 6.3. \n6.5.3 For heat-treated forgings weighing 1000 lb [ 450 kg] or \nmore, one tension test shall be taken in accordance with 6.4.1 \nor 6.4.2 to represent each heat and not more than ten forgings \nin a heat-treat lot. In addition, hollow or bored forgings shall \nhave one bend or flattening test, taken in accordance with 6.3, \nto represent each ten or fewer forgings from the same heat and \nheat-treatment lot. \n6.6 Hardness Testing: \n6.6.1 Forgings under 1000 lb [ 450 kg] in weight, heat \ntreated in a batch lot of up to 200 pieces (6.5.1) or in a \ncontinuous furnace run covering up to 200 pieces in up to 4 h \nproduction (6.5.2) shall be subject to a uniformity check by \nBrinell hardness testing or an equivalent method. For this \npurpose, 10 % of the furnace production shall be sampled and \nshall meet the minimum hardness specified in Table 2 for the \ntype and shall also be within 20 Brinell points of the hardness \nof the forging from which the tensile test was taken. \n6.6.2 In the event that the test sample does not meet these \ncriteria, the remainder of that production group shall be \nhardness tested and all of those forgings that fall outside these \nlimits shall be retempered or reheat-treated at the manufactur­\ner's option and retested. \n7. Magnetic Particle Examination \n7.1 All quenched and tempered forgings shall be subject to \nmagnetic particle examination after heat treatment. The meth­\nods used shall be in accordance with Practice A275/A275M. \n7.2 Only direct current or rectified alternating (full or half \nwave) current shall be used as the electric power source for any \nof the magnetizing methods. \n7.3 The forgings shall be free from linear indications \nindicative of cracks. In case of doubt as to the type of condition \ngiving rise to linear magnetic particle indications, they may be \ninspected for Type II indications referenced in Reference \nPhotographs E433 when inspected by the liquid penetrant \nmethod in accordance with Practice E165/E165M. \nAlternatively, some other suitable method for classifying the \nindications may be used as agreed upon between the manufac­\nturer and the purchaser. \n8. Workmanship \n8.1 If the thickness of a portion of the wall of a forging is \nless than that specified, the forgings may be accepted by the \npurchaser, provided that such irregularity will not require \nlowering the allowable working pressure below that for which \nthe forging was designed. \n9. Repair Welding \n9.1 Repair welding shall be permitted when mutually agreed \nupon between the purchaser and the manufacturer and shall be \nperformed in accordance with all the requirements of the \napplicable code or rules of construction. \n10. Keywords \n10.1 alloy steel forgings; carbon steel forgings; gas bottles; \npressure vessels; thin wall \n637 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0687.json",
  "tabulaTablesCsv": "tables_tabula/page-0687.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0687.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4802,
  "bestTextAlphaRatio": 0.7526
}