{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 417,
  "globalPageIndex": 417,
  "width": 638.88,
  "height": 874.32,
  "text": "ASME BPVC.II.A-2025 SA-249 /SA-249M \nthickness (usually 2 h or less). If more than 60 % of the \nbase-metal thickness remains, the sample may be removed \nafter 24 h. \nS7 .8 At the end of the test period, remove the samples from \nthe solution, rinse with distilled water, and dry. \nS7.9 After exposure to the test solution, repeat the tube­\nthickness measurement as in S7.6. If the thinning is not \nuniform across the width of the weld, then two sets of \nweld-metal measurement are required. One set of measure­\nments is to be taken along the centerline of the weld. The \nsecond set of measurements is to be taken in the thinnest area \nof the weld. \nS7 .10 Calculate the corrosion ratio, R, for both sections of \nthe weld as follows in Eq 1: \nwhere: \nR= WO -w \nB 0 -B \nW 0 = average weld-metal thickness before the test, \nW = average weld-metal thickness after the test, \nB 0 = average base-metal thickness before the test, and \nB = average base-metal thickness after the test. \nS7.11 Acceptance Criteria: \n(1) \nS7 .11.1 The ratio of the thinnest section of the weld and \nadjacent heat affected zone versus the base metal shall be \ndetermined. The following ratios or alternatives are commonly \nspecified: \nS7.ll.l.1 A corrosion ratio of 1.25 or less. If not specified \nby the purchase order, this is the default criteria. \nS7.ll.l.2 A corrosion ratio of 1.00 or less. \nS7.11.1.3 Alternative ratios may be agreed between the \npurchaser and supplier. \nS8. Special Applications \nS8.1 For special applications, such as hydraulic expansion \nof tubes into tube sheets, dimensions of the weld shape and \nthickness shall be per agreement between the purchaser and \nsupplier. Tubes ordered to this requirement shall bear the \nadditional marking of NB. \nS9. Additional Testing of Welded Tubing for ASME Re­\nquirements \nS9.l. When this supplement is specified in the purchase \norder, in certain ASME applications it is permissible to use \n100 % joint efficiency for longitudinal weld, provided the \nfollowing additional requirements are met: \nS9.l.1 Each tube shall be subjected to an ultrasonic inspec­\ntion employing Practices E273 or E213 with the rejection \ncriteria referenced in Specification A1016/Al016M. \nS9.l.2 If Practice E273 is employed, a 100 % volumetric \ninspection of the entire length of each tube shall also be \nperformed using one of the nondestructive electric tests per­\nmitted by Specification A1016/A1016M. \nS9.l.3 The test methods described in the supplement may \nnot be capable of inspecting the end portions of tubes. This \ncondition is referred to as end effect. This portion, as deter­\nmined by the manufacturer, shall be removed and discarded. \nS9.l.4 In addition to the marking prescribed in Specification \nA1016/Al016M, \"S9\" shall be added after the grade designa­\ntion. \nND'rE S9.1-When specified, the special testing in this supplement is \nintended for special ASME applications. It is not mandatory for all ASME \napplications. \n365 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0417.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2955,
  "bestTextAlphaRatio": 0.7428
}