{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 404,
  "globalPageIndex": 404,
  "width": 622.44,
  "height": 861.36,
  "text": "SA-240/SA-240M ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nA supplementary requirement shall apply only when specified in the purchase order. \nSl. Charpy Impact Testing of Plate \nS 1.1 Charpy impact tests shall be conducted in accordance \nwith Test Methods and Definitions A370. \nSl.2 Number of Tests-One impact test (three specimens) \nshall be made from one plate per heat treatment lot in the final \nheat treated condition. \nSl.3 Orientation of Test Specimens-Unless specified as \ntransverse specimens (long axis of the specimen transverse to \nthe final rolling direction, root of the notch perpendicular to the \nrolling face) on the purchase order, the orientation o~ the \nspecimens shall be longitudinal (long axis of the spec11nen \nparallel to the final rolling direction, root of the_ notch ~erpen­\ndicular to the rolling face). The manufacturer is permitted to \ntest transverse specimens provided that such tests meet the \nacceptance criteria applicable to longitudinal specimen~. Un­\nless otherwise specified on the purchase order, the specimens \nshall be taken so as to include the mid-thickness of the product. \nS 1 .4 Test Temperature-The purchaser shall specify the \ntest temperature. The manufacturer is permitted to test speci­\nmens at a temperature lower than that specified by the \npurchaser, provided that such tests shall meet the acceptance \ncriteria applicable to specimens tested at the specified tempera­\nture (see the note below). \nNorn S 1.1-Test Methods A923, Method B, applicable to some duplex \n(austenitic-fen-itic) stainless steels as listed in Test ~ethods A923, uses a \nCharpy impact test for the purpose of detern:immg the absence of \ndetrimental intermetallic phases. Method B specifies a test temperature \nand acceptance criterion, expressed as impact energy, for each type of \nsteel covered. It may be economical for the Charpy impact tests performed \non duplex stainless steels covered in both Specification A240 and _Test \nMethods A923 to be performed at the lower of the temperatures specified \nby this supplementary requirement and Test Methods A923 Method B, \nwith measurement of both lateral expansion and impact energy. \n352 \nS 1.5 Acceptance Limit-Unless otherwise specified on the \npurchase order, each of the three specimens tested shall sh~w \na lateral expansion opposite the notch of not less than 0.015 m. \n[0.38 mm]. \nSl.6 Records-The recorded results shall include the \nspecimen orientation, specimen size, test temperature, ~b­\nsorbed energy values (if required), and lateral expans10n \nopposite the notch. \nS2. Materials for High-Temperature Service \nS2.l Unless an H grade has been ordered, this supplemen­\ntary requirement shall be specified for ASME Code applica­\ntions for service above 1000°F [540°C]. \nS2.2 The user is permitted to use an austenitic stainless \nsteel as the corresponding H grade when the material meets all \nrequirements of the H grade including chemistry, annealing \ntemperature, and grain size (see Section 6). . . \nS2.3 The user is permitted to use an L grade austemtic \nstainless steel for service above 1000°F [540°C], subject to the \napplicable allowable stress table of the ASME Code, when the \nmaterial meets all requirements of this specification and the \ngrain size is ASTM No. 7 or coarser as determined in \naccordance with Test Methods E112. The grain size shall be \nreported on a Certified Test Report. \nS3. One Percent Offset Yield Strength \nS3 .1 If reporting of 1 % offset yield strength is specified on \nthe purchase order; the material shall meet the strength \nrequirements shown in Table S3.1. . \nS3.2 The mechanical properties, including 1 % offset yield \nstrength and all other required properties shall be reported on \na Material Test Report. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0404.json",
  "tabulaTablesCsv": "tables_tabula/page-0404.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0404.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3745,
  "bestTextAlphaRatio": 0.7746
}