{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 130,
  "globalPageIndex": 928,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-487 /SA-487M ASME BPVC.II.A-2025 \nSpecification for \nSteel Castings Suitable for Pressure Service \n1. Scope \n1.1 This specification covers low-alloy steels and marten­\nsitic stainless steels in the normalized and tempered, or \nquenched and tempered, condition suitable for pressure­\ncontaining parts. The weldability of the classes in this speci­\nfication varies from readily weldable to weldable only with \nadequate precautions, and the weldability of each class should \nbe considered prior to assembly by fusion welding. \n1.2 Selection will depend on design, mechanical, and ser­\nvice conditions. Users should note that hardenability of some \nof the grades mentioned may restrict the maximum size at \nwhich the required mechanical properties are obtained. \n1.3 The values stated in either SI units or inch-pound units \n• are to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. C9mbining \nvalues from the two systems may result in nonconformance \nwith the standard. \n1.3.1 Within the text, the SI units are shown in brackets. \n1.4 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA488/A488M Practice for Steel Castings, Welding, Qualifi­\ncations of Procedures and Personnel \nA703/A703M Specification for Steel Castings, General \nRequirements, for Pressure-Containing Parts \nA985/ A985M Specification for Steel Investment Castings \nGeneral Requirements, for Pressure-Containing Parts \nE165/E165M Practice for Liquid Penetrant Testing for Gen-\neral Industry \nE709 Guide for Magnetic Particle Testing \n2.2 American Society of Mechanical Engineers: \nASME Boiler and Pressure Vessel Code, Section IX \n2.3 Manufacturers Standardization Society of the Valve and \nFittings Industry Standards: \nSP-55 Quality Standard for Steel Castings-Visual Method \n3. General Conditions for Delivery \n3.1 Except for investment castings, castings furnished to \nthis specification shall conform to the requirements of Speci-\n- fl.cation A703/A703M, including any supplementary require­\nments that are indicated in the purchase order. Failure to \ncomply with the general requirements of Specification A 703/ \nA 703M constitutes nonconformance with this specification. In \ncase of conflict between the requirements of this specification \nand Specification A703/A703M, this specification shall pre­\nvail. \n828 \n3.2 Investment castings furnished to this specification shall \nconform to the requirements of Specification A985/A985M, \nincluding any supplementary requirements that are indicated in \nthe purchase order. Failure to comply with the general require­\nments of Specification A985/A985M constitutes nonconfor­\nmance with this specification. In case of conflict between the \nrequirements of this specification and Specification A985/ \nA985M, Specification A985/ A985M shall prevail. \n4. Ordering Information \n4.1 The inquiry and order should include or indicate the \nfollowing: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0928.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3380,
  "bestTextAlphaRatio": 0.7837
}