{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 14,
  "globalPageIndex": 14,
  "width": 615.48,
  "height": 794.4,
  "text": "STATEMENT OF POLICY ON THE USE OF THE ASME SINGLE \nCERTIFICATION MARK AND CODE AUTHORIZATION IN \nADVERTISING \nASME has established procedures to authorize qualified organizations to perform various activities in accordance \nwith the requirements of the ASME Boiler and Pressure Vessel Code. It is the aim of the Society to provide recognition \nof organizations so authorized. An organization holding authorization to perform various activities in accordance with \nthe requirements of the Code may state this capability in its advertising literature. \nOrganizations that are authorized to use the ASME Single Certification Mark for marking items or constructions that \nhave been constructed and inspected in compliance with the ASME Boiler and Pressure Vessel Code are issued Certifi­\ncates of Authorization. It is the aim of the Society to maintain the standing of the ASME Single Certification Mark for the \nbenefit of the users, the enforcement jurisdictions, and the holders of the ASME Single Certification Mark who comply \nwith all requirements. \nBased on these objectives, the following policy has been established on the usage in advertising of facsimiles of the \nASME Single Certification Mark, Certificates of Authorization, and reference to Code construction. The American Society \nof Mechanical Engineers does not \"approve,\" \"certify,\" \"rate,\" or \"endorse\" any item, construction, or activity and there \nshall be no statements or implications that might so indicate. An organization holding the ASME Single Certification Mark \nand/or a Certificate of Authorization may state in advertising literature that items, constructions, or activities \"are built \n(produced or performed) or activities conducted in accordance with the requirements of the ASME Boiler and Pressure \nVessel Code,\" or \"meet the requirements of the ASME Boiler and Pressure Vessel Code.\" An ASME corporate logo shall not \nbe used by any organization other than ASME. \nThe ASME Single Certification Mark shall be used only for stamping and nameplates as specifically provided in the \nCode. However, facsimiles may be used for the purpose of fostering the use of such construction. Such usage may be \nby an association or a society, or by a holder of the ASME Single Certification Mark who may also use the facsimile \nin advertising to show that clearly specified items will carry the ASME Single Certification Mark. \nSTATEMENT OF POLICY ON THE USE OF ASME MARKING TO \nIDENTIFY MANUFACTURED ITEMS \nThe ASME Boiler and Pressure Vessel Code provides rules for the construction of boilers, pressure vessels, and nuclear \ncomponents. This includes requirements for materials, design, fabrication, examination, inspection, and stamping. Items \nconstructed in accordance with all of the applicable rules of the Code are identified with the ASME Single Certification \nMark described in the governing Section of the Code. \nMarkings such as ''ASME,\" ''ASME Standard,\" or any other marking including \"ASME\" or the ASME Single Certification \nMark shall not be used on any item that is not constructed in accordance with all of the applicable requirements of the \nCode. \nItems shall not be described on ASME Data Report Forms nor on similar forms referring to ASME that tend to imply \nthat all Code requirements have been met when, in fact, they have not been. Data Report Forms covering items not fully \ncomplying with ASME requirements should not refer to ASME or they should clearly identify all exceptions to the ASME \nrequirements. \nxiv ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0014.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3508,
  "bestTextAlphaRatio": 0.8167
}