{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 662,
  "globalPageIndex": 1460,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-961/SA-961M ASME BPVC.II.A-2025 \nSpecification for \nCommon Requirements for Steel Flanges, Forged Fittings, \nValves, and Parts for Piping Applications \n1. Scope \n1.1 This specification covers a group of common require­\nments that shall apply to steel flanges, forged fittings, valves, \nand parts for piping applications under any of the following \nindividual product specifications: \nTitle of Specification \nForgings, Carbon Steel, for Piping Components \nForgings, Carbon Steel, for General-Purpose Piping \nForged or Rolled Alloy-Steel Pipe Flanges, Forged \nFittings, and Valves and Parts for High Temperature \nService \nForgings, Carbon and Low Alloy Steel, Requiring Notch \nToughness Testing for Piping Components \nForged or Rolled 8 and 9 % Nickel Alloy \nSteel Flanges, Fittings, Valves, and Parts \nfor Low-Temperature Service \nForgings, Carbon and Alloy Steel, for Pipe Flanges, \nFittings, Valves, and Parts for High-Pressure \nTransmission Service \nFlanges, Forged, Carbon and Alloy Steel for Low \nTemperature Service \nForgings, Carbon Steel, for Piping Components with \nInherent Notch Toughness \nForgings, Titanium-Stabilized Carbon Steel, for \nGlass-Lined Piping and Pressure Vessel Service \nASTM Designation \nA105/A105M \nA181/A181M \nA182/A182M \nA350/A350M \nA522/A522M \nA694/A694M \nA707/A707M \nA727/A727M \nA836/A836M \n1.2 In case of conflict between a requirement of the indi­\nvidual product specification and a requirement of this general \nrequirement specification, the requirements of the individual \nproduct specification shall prevail over those of this specifica­\ntion. \n1.3 By mutual agreement between the purchaser and the \nsupplier, additional requirements may be specified (see Section \n4.1.2). The acceptance of any such additional requirements \nshall be dependent on negotiations with the supplier and must \nbe included in the order as agreed upon between the purchaser \nand supplier. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text and \nthe tables, the SI units are shown in brackets. The values stated \nin each system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. The inch-pound units shall apply, unless the \n\"M\" designation (SI) of the product specification is specified in \nthe order. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \n1402 \nA105/A105M Specification for Carbon Steel Forgings for \nPiping Applications \nA181/A181M Specification for Carbon Steel Forgings, for \nGeneral-Purpose Piping \nA182/A182M Specification for Forged or Rolled Alloy and \nStainless Steel Pipe Flanges, Forged Fittings, and Valves \nand Parts for High-Temperature Service \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA350/A350M Specification for Carbon and Low-Alloy Steel \nForgings, Requiring Notch Toughness Testing for Piping \nComponents \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA522/ A522M Specification for Forged or Rolled 8 and 9% \nNickel Alloy Steel Flanges, Fittings, Valves, and Parts for \nLow-Temperature Service \nA694/A694M Specification for Carbon and Alloy Steel \nForgings for Pipe Flanges, Fittings, Valves, and Parts for \nHigh-Pressure Transmission Service \nA 700 Guide for Packaging, Marking, and Loading Methods ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1460.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3746,
  "bestTextAlphaRatio": 0.772
}