{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 216,
  "globalPageIndex": 216,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-105 /SA-105M ASME BPVC.II.A-2025 \nSpecification for \nCarbon Steel Forgings for Piping Applications \n1. Scope \n1.1 This specification covers forged carbon steel piping \ncomponents for ambient- and higher-temperature service in \npressure systems. Included are flanges, fittings, valves, and \nsimilar parts ordered either to dimensions specified by the \npurchaser or to dimensional standards such as the MSS, \nASME, and API specifications referenced in Section 2. Forg­\nings made to this specification are limited to a maximum \nweight of 10 000 lb [ 4540 kg]. Larger forgings may be ordered \nto Specification A266/A266M. Tubesheets and hollow cylin­\ndrical forgings for pressure vessel shells are not included \nwithin the scope of this specification. Although this specifica­\ntion covers some piping components machined from rolled bar \nand seamless tubular products (see 5.2), it does not cover raw \nmaterial produced in these product forms. \n1.2 Supplementary requirements are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified individually by the purchaser in the order. \n1.3 Specification A266/ A266M covers other steel forgings \nand Specifications A675/A675M and A696 cover other steel \nbars. \n1.4 This specification is expressed in both inch-pound units \nand SI units. However, unless the order specifies the applicable \n\"M\" specification designation (SI units), the material shall be \nfurnished to inch-pound units. The values stated in either SI \nunits or inch-pound units are to be regarded separately as \nstandard. Within the text, the SI units are shown in brackets. \nThe values stated in each system may not be exact equivalents; \ntherefore, each system shall be used independently of the other. \nCombining values from the two systems may result in non­\nconformance with the standard. \nNorn 1-Toe dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiameter,\" \"size,\" and \"nominal size.\" \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 In addition to those reference documents listed in \nSpecification A961/A961M, the following list of standards \napply to this specification: \n2.2 ASTM Standards: \nA266/ A266M Specification for Carbon Steel Forgings for \nPressure Vessel Components \nA675/A675M Specification for Steel Bars, Carbon, Hot­\nWrought, Special Quality, Mechanical Properties \n164 \nA696 Specification for Steel Bars, Carbon, Hot-Wrought or \nCold-Finished, Special Quality, for Pressure Piping Com­\nponents \nA788/A788M Specification for Steel Forgings, General Re-\nquirements • \nA961/A961M Specification for. Common Requirements for \nSteel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \n2.3 MSS Standards: \nSP 44 Standard for Steel Pipe Line Flanges ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0216.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3139,
  "bestTextAlphaRatio": 0.7741
}