{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 354,
  "globalPageIndex": 1152,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-645/SA-645M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, 5 % and 5½ % Nickel Alloy Steels, \nSpecially Heat Treated \n1. Scope \n1.1 This specification covers specially heat treated 5 % and \n5 ½ % nickel alloy steel plates intended primarily for welded \npressure vessels for service at low or cryogenic temperatures. \n1.2 The maximum thickness of plates which can be supplied \nunder this specification is limited only by the capacity of the \nmaterial to meet the specified requirements. \n1.3 This material is susceptible to magnetization. Use of \nmagnets in handling after heat treatment should be avoided if \nresidual magnetism would be detrimental to subsequent fabri­\ncation or service. \n1.4 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.5 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety and health practices and determine the applica­\nbility of regulatory limitations prior to use. \n2. Referenced Docwnents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Plates supplied to this material specification shall con­\nform to Specification A20/ A20M. These requirements outline \nthe testing and retesting methods and procedures, permitted \nvariations in dimensions and mass, quality and repair of \ndefects, marking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/ A20M. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/ A20M, the require­\nments of this specification shall prevail. \n4. Materials and Manufacture \n4.1 Steelmaking Practice-The steel shall be killed and \nshall conform to the fine austenitic grain size requirements of \nSpecification A20/ A20M. \n5. Heat Treatment \n5.1 Grade A plates shall be heat treated in accordance with \n5.2. Grade B plates shall be heat treated in accordance with 5.3. \nShell plates and other parts, including heads and reinforcing \npads that are heated above 1125°F [605°C] for forming, shall \nbe heat treated after forming, \n5.2 Grade A, Procedure and Sequence: \n5.2.1 Hardening-The plates shall be heated to a tempera­\nture within the range from 1575 to 1675°F [855 to 915°C], held \nwithin that temperature range for a minimum of 1 h/in. [2.4 \nmin/mm] of thickness, but in no case less than 15 min, and then \nwater-quenched to below 300°F [150°C]. \n5.2.2 Intermediate Heat Treatment-The plates shall be \nreheated to a temperature within the range from 1275 to \n1058 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1152.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3611,
  "bestTextAlphaRatio": 0.7635
}