{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 370,
  "globalPageIndex": 370,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-231/SA-231M ASME BPVC.II.A-2025 \n11. Inspection \n11.1 Unless otherwise specified in the contract or pur­\nchase order, the manufacturer is responsible for the per­\nformance of all inspection and test requirements specified \nin this specification. Except as otherwise specified in the \ncontract or purchase order, the manufacturer may use his \nown or any other suitable facilities for the performance of \nthe inspection and test requirements unless disapproved by \nthe purchaser at the time the order is placed. The purchaser \nshall have the right to perform any of the inspections and \ntests set forth in this specification when such inspections \nand tests are deemed necessary to assure that the material \nconforms to prescribed requirements. \n12. Rejection and Rehearing \n12.1 Unless otherwise specified, any rejection based \non tests made in accordance with this specification shall \nbe reported to the manufacturer as soon as possible so that \nan investigation may be initiated. \n12.2 The material must be adequately protected and \ncorrectly identified in order that the manufacturer may \nmake a proper investigation. \n13. Certification \n13.1 A manufacturer's or supplier's certification shall \nbe furnished to the purchaser that the material was manu­\nfactured, sampled, tested, and inspected in accordance with \nthis specification and has been found to meet the require­\nments. A report of the test results shall be furnished. \n13.2 The certification shall include the specification \nnumber, year date of issue, and revision letter, if any. \n14. Packaging, Marking, and Loading for Shipment \n14.1 The coil mass, dimensions, and the method of \npackaging shall be as agreed upon between the manufac­\nturer and purchaser. \n14.2 The size of the wire, purchaser's order number, \nASTM Specification number, heat number, and name or \nmark of the manufacturer shall be marked on a tag securely \nattached to each coil of wire. \n14.3 Unless otherwise specified in the purchaser's \norder, packing, marking, and loading for shipments shall \nbe in accordance with those procedures recommended by \nPractices A 700. \n318 \n14.4 For Government Procurement: \n14.4.1 Packaging, packing, and marking of material \nfor military procurement shall be in accordance with the \nrequirements of MIL-STD-163, Level A, Level C, or com­\nmercial as specified in the contract or purchase order. Mark­\ning for shipment of material for civil agencies shall be in \naccordance with Fed. Std. No. 123. \n14.5 Bar Coding - In addition to the previously-stated \nidentification requirements, bar coding is acceptable as a \nsupplementary identification method. Bar coding should \nbe consistent with AIAG B-5 02.00, Primary Metals Identi­\nfication Tag Application. The bar code may be applied to \na substantially affixed tag. \n15. Keywords \n15.1 alloy; chromium-vanadium; spring; wire ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0370.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2849,
  "bestTextAlphaRatio": 0.7733
}