{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 646,
  "globalPageIndex": 1444,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-941 ASME BPVC.II.A-2025 \ncold working, n-mechanical deformation of a metal at \ntemperatures below its recrystallization temperature. \ncold treatment, n-exposing a steel object to temperatures \nbelow room temperature for the purpose of obtaining desired \nconditions or properties, such as dimensional or structural \nstability. \nconditioning heat treatment, n-a preliminary heat treat­\nment used to prepare a steel object for a desired reaction to \na subsequent heat treatment. \ncontinuous-conveyance furnace, n-a heating device through \nwhich steel objects are intentionally moved at a constant rate \nduring the thermal processing cycle. \ncontrolled cooling, n-cooling a steel object from an elevated \ntemperature in a predetermined manner to avoid hardening, \ncracking, or intema1 damage, or to produce a desired \nmicrostructure or mechanical properties. \ncontrolling cross section thickness (Tc), n-diameter of the \nlargest theoretical sphere that can be inscribed within the \nvolume of the component. \nDrscuss10N-The controlling cross section thickness (Tc) is used to \ndetermine the size of prolongations, test blocks, or representative test \npieces. It is calculated based on the dimensions of the component at the \ntime of heat treatment. Where components are heat treated with internal \ndiameters the calculation is made based on the wall thickness. \ncore, n-in case hardening, the interior portion of unaltered \ncomposition or microstructure, or both, of a case hardened \nsteel object. \ncore, n-in clad products, the central portion of a multilayer \ncomposite metallic material. \ncritical cooling rate, n-the slowest rate of continuous cooling \nat which austenite can be cooled from above the transfor­\nmation range to prevent its transformation above M •. \ncycle annealing, n-annealing employing a predetermined \nand closely controlled time-temperature cycle to produce \nspecific properties or a specific microstructure. \ndecarburization, n-the loss of carbon from the surface of a \nsteel object as a result of its being heated in a medium that \nreacts with the carbon. \ndefect, n-an imperfection of sufficient magnitude to warrant \nrejection based on the specified requirements. \ndifferential heating, n-heating that intentionally produces a \ntemperature gradient within a steel object such that, after \ncooling, a desired stress distribution or variation in proper­\nties is present within the object. \ndiffusion coating, n-any process whereby a base metal is \neither coated with another metal and heated to a sufficient \ntemperature in a suitable environment, or exposed to a \ngaseous or liquid medium containing the other metal, \nthereby causing diffusion of the coating or other metal into \nthe base metal, with a resultant change in the composition \nand properties of its surface. \ndirect quenching, n-in thermochemical processing, quench­\ning immediately following the thermochemical treatment. \ndirect quenching, n-in thermomechanical processing, \nquenching immediately following the final hot deformation. \ndocument, n-a written, printed, or electronic record that \nprovides information, evidence, or official statements. \ndouble aging, n-employment of two different aging \ntreatments, in sequence, to control the type of precipitate \nformed from a supersaturated alloy matrix in order to obtain \nthe desired properties. \nDrscuss10N-The first aging treatment, sometimes referred to as \nintermediate or stabilizing, is usually carried out at a higher tempera­\nture than the second. \ndouble tempering, n-a treatment in which a quench­\nhardened steel object is given two complete tempering \ncycles at substantially the same temperature for the purpose \nof ensuring completion of the tempering reaction and pro­\nmoting stability of the resultant microstructure. \nelectronic data interchange, n-the computer to computer \nexchange of business information in a standardized format. \nellipsis, n-in a tabular entry, three periods ( ... ) that indicate \nthat there is no requirement. \nferritizing anneal, n-a heat treatment that produces a \npredominantly ferritic matrix in a steel object. \nferroalloy, n-an alloy of iron and one or more other metals, \nfor use as an addition to the molten metal during the \nmanufacture of steels, nickel alloys, or cobalt alloys. \nferrous material, n-metals and alloys that contain iron as the \nprincipal component. \nD1scussmN-The iron content is not always stated in the specification \nand is not always determined by chemical analysis. The iron content \nmay be taken to be 100 % minus the sum of the mean values permitted \nby the specification for all other elements having a specified range or a \nspecified maximum. For conformance purposes, the mean value for \niron, whether specified or calculated, is compared on an individual \nbasis to the mean values permitted by the specification for each of the \nother elements having a specified range or a specified maximum. If an \nelement other than iron is not specified, but is listed as remainder or \nbalance, then, for conformance purposes the mean value for iron is \ncompared to the calculated value for that other element. \nfine grain practice, n-a steelmaking practice for other than \nstainless steel that is intended to produce a killed steel that \nis capable of meeting the requirements specified for fine \naustenitic grain size when and if the as-rolled or as-forged \nproduct is reheated to a temperature at or above the \ntransformation temperature, Ac 3 . \nD1scuss10N-When stated as a requirement, fine grain practice \nnormally involves the addition of one or more austenitic grain refining \nelements in amounts that have been established by the steel producer as \nbeing sufficient. Austenitic grain refining elements include, but are not \nlimited to, aluminum, niobium (columbium), titanium, and vanadium. \nA fine grain practice requirement ( 1) does not specify a minimum \naustenitic grain refining element addition; (2) does not require prior \naustenite grain size testing or measurement, or both; ( 3) if tested, does \nnot require meeting any prior austenite grain size requirement; and ( 4) \ndoes not apply to, nor in any way control, the p1ior austenite grain size \n1382 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1444.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6179,
  "bestTextAlphaRatio": 0.803
}