{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 144,
  "globalPageIndex": 942,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-508/SA-508M ASME BPVC.ILA-2025 \n9.3.1.3 Indications whose amplitude equals or exceeds that \nof the back reflection established in an indication-free area of \nthe forging. \n9.3.2 Angle Beam Inspection: \n9.3.2.1 Calibration notches shall be cut into the inside- and \noutside-diameter surfaces with a depth equal to 3 % of the \nnominal section thickness (or 3 /s in. [9.5 mm], max), a length of \napproximately 1 in. [25 mm], and a width not greater than \ntwice its depth. Adjust instrument controls to obtain an \nindication from the inside-diameter notch approximately 75 % \nof full screen height. Measure the amplitude of indication from \nthe outside-diameter notch. Draw a straight line on the shield in \nfront of the cathode ray tube from this peak to that of the \ninside-diameter notch and continue it as a horizontal line to the \ninitial pulse. This line constitutes the angle beam reference \nline. \n9.3.2.2 A forging containing a discontinuity which results in \nan indication exceeding the amplitude of the reference line is \nsubject to rejection. \nNorn 6-Signals from discontinuities within approximately ¼ in. \n[6.4 mm] of inside and outside surfaces are reinforced by wave trapping \nduring angle beam inspection; they are therefore amplified in respect to \ninternal discontinuities. \n9.3.3 The report of the ultrasonic inspection shall be in \ncompliance with Section 8 of Practice A388/A388M. \n9.3.4 Additional nondestructive inspection or trepanning \nmay. be employed to resolve questions of interpretation of \nultrasonic indications. The manufacturer shall accept respon­\nsibility for injurious indications which will not be removed in \nfinal machining. \n10. Repair Welding \n10.1 Repair welding of forgings may be permitted, but only \nat the option of the purchaser. \n10.2 If repair welding is performed, welders and weld \nprocedures shall be qualified in accordance with Section IX of \nthe ASME Boiler and Pressure Vessel Code. \n11. Certification and Reports \n11.1 In addition to items to be reported by Specification \nA788/A788M, the following items shall also be reported: \n11.1.1 Product chemical analysis, \n11.1.2 The method used for locating test specimens, and \n11.1.3 Sketches showing the locations of all recordable \nindications in the report of all nondestructive examinations. \n11.1.3.1 If Practice A966/A966M has been used, this also \nshall be recorded in the certification. \n11.1.4 Details of the heat treatment cycle, as listed in \nSpecification A 788/ A 788M. \n12. Product Marking \n12.1 The purchaser may specify additional identification \nmarking and the location of the stamping. The type of stamps \nto be used when impression stamping is performed shall be \nround-nosed or \"interrupted-dot\" die stamps having a mini­\nmum radius of .½2 in. [0.8 mm]. \n13. Keywords \n13.1 chromium-molybdenum steel; nickel-chromium­\nmolybdenum alloy steels; pressure vessel service; quenched \nand tempered steels; steel forgings-alloy; steel forgings­\ncarbon; vacuum-treated steels \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified by the \npurchaser in the inquiry or order. Details of these supplementary requirements shall be agreed upon \nbetween the manufacturer and the purchaser. \nSl. Simulated Post-Weld Heat Treatment of Mechanical \nTest Samples \nS 1.1 All test coupons shall be subjected to single or multiple \nheat treatments at subcritical temperatures prior to testing. \nSuch treatments are intended to simulate post-weld or other \ntreatments to which the forgings will be subjected during \nsubsequent fabrication. The purchaser shall furnish the manu­\nfacturer with details of the desired heat treatment for the test \ncoupons, including temperatures, timers, and cooling rates. \nS2. Ultrasonic Testing-Reference Block Calibration (for \nexamining sections 24-in. [610 mm] thick or less) \nS2.1 Reference blocks of acoustically similar metal shall be \nused for calibration. Blocks shall meet one of the following \nrequirements: \nS2.l.1 A comparison of the back reflections between \nequivalent thicknesses of the reference block material and the \nactual forging to be tested, without change in instrument \nsetting shall not show a variation in excess of 25 %. \n842 \nS2.l.2 The reference blocks shall be manufactured from \nsteel that is similar in chemistry and processing history to the \nproduction forging being tested. The reference blocks shall be \nfabricated in accordance with the procedures of Practice E428. \nS2.2 For test sections up to 12 in. [305 mm] thick, the \nreference blocks shall contain a ¼-in. [6.4-mm] diameter \nflat-bottom hole; for over 12 to 18 in. [305 to 457 mm], the \nhole diameter shall be 3/s in. [9.5 mm]; and for over 18 to 24 in. \n[457 to 610 mm], it shall be ½ in. [13 mm]. \nS2.3 A distance-amplitude correction curve shall be estab­\nlished for the proper grade of steel and specified hole size. \nS2.4 A forging containing one or more indications equal in \namplitude to that of the applicable reference hole, when \nproperly corrected for distance, is subject to rejection. \nS3. Charpy V-Notch Impact Transition Curve \nS3.l Sufficient impact tests shall be made from the forging \ntest material to establish a temperature-absorbed energy curve. \nThe test-temperature range shall be wide enough to establish ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0942.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5320,
  "bestTextAlphaRatio": 0.76
}