{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 433,
  "globalPageIndex": 433,
  "width": 597.72,
  "height": 842.88,
  "text": "ASME BPVC.II.A-2025 SA-264 \n4.1. 7 Mechanical properties, including shear test if required. \n4.1.8 Finish (see Section 12). \n4.1.9 Restrictions, if required, on repair by welding (see \nSection 14). \n4.1.10 Additions to the specification or special requirements \nsuch as any applicable construction code rules. \n4.1.11 Corrosion testing if applicable. \n4.1.12 Notification when the cladding alloy is to be used for \ninclusion in the design strength calculations for an applicable \nconstruction code. \nNoTE I-Construction codes may dictate certain fabrication require­\nments when the cladding is used in the design calculations that may be \ndifferent than if the cladding is used for corrosion resistance only. This \nmay be particularly important when the alloy cladding involves the use of \nwelded components in the explosion bonded clad manufactming process. \nIt is incumbent on the purchaser to make the clad manufacturer aware of \nany such restrictions or applications at time of order. \n4.2 In addition to the basic requirements of this specification \nand the backing steel specification, certain supplementary \nrequirements are available when additional control, testing, or \nexamination is required to meet end use requirements. The \npurchaser is referred to the listed supplementary requirements \nin this specification and to the detailed requirements in \nSpecification A20/ A20M. \n4.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/A20M, the require­\nments of this specification shall prevail. \n4.4 Special tests. \n5. Materials and Manufacture \n5.1 Process: \n5.1.1 The steel shall be made by the open-hearth, electric­\nfumace, or basic-oxygen processes, or by secondary processes \nwhereby steel made from these primary processes is remelted \nusing, but not limited to electroslag remelting or vacuum-arc \nremelting processes. \n5.1.2 The alloy-cladding metal inay be metallurgically \nbonded to the base metal by any method that will produce a \nclad steel that will conform to the requirements of this \nspecification. \n5.1.3 For explosively bonded products, the alloy cladding \nmetal may be comprised of two or more separate alloy plates \nor sheets completely welded together to form a single fabri­\ncated component. \n5.2 Heat Treatment: \n5.2.1 Unless otherwise specified or agreed upon between \nthe purchaser and the manufacturer, all austenitic stainless steel \nclad plates shall be given a heat treatment consisting of heating \nto the proper temperature for the solution of the chromium \ncarbides in the cladding followed by individual air cooling. For \nbase metals of air-hardening low-alloy steels the above heat \ntreatment shall be followed by a tempering treatment. In the \ncase of clad plate manufactured without hot rolling, the base \nmetal and alloy cladding components may be heat treated \nseparately as appropriate prior to bonding. \n5.2.2 Duplex stainless steel clad plates shall be provided in \na heat treated condition as agreed upon between the purchaser \nand the manufacturer. \n5.2.3 When plates are to be cold formed, or when otherwise \nrequired by the base metal specification, the purchaser may \nspecify that such plates, following solution annealing, be heat \ntreated for grain refinement of the base metal by normalizing \nand either air cooled or water quenched as appropriate. \n6. Chemical Composition \n6.1 The composite plate may conform to any desired com­\nbination of alloy-cladding metal and base metal as described in \n6.2 and 6.3 and as agreed upon between the purchaser and the \nmanufacturer. \n6.2 Alloy Cladding Metal-The alloy-cladding metal speci­\nfied shall conform to the requirements as to chemical compo­\nsition prescribed for the respective chromium-nickel or duplex \nsteel in Specification A240/A240M. \n6.3 Base Metal-The base metal shall be carbon steel or \nlow-alloy steel conforming to the ASTM specifications for \nsteel for pressure vessels, or other, as agreed by the purchaser \nand the manufacturer. The base metal shall conform to the \nchemical requirements of the specification to which it is \nordered. \n7. Mechanical Properties \n7.1 Tensile Requirements: \n7 .1.1 The tensile properties shall be determined by a \ntension test of the composite plate for clad plates that meet all \nof the following conditions. \n(1) The composite gage is less than or equal to 1 ½ in. (38 \nmm). \n(2) The specified minimum tensile strength of the base \nsteel is less than or equal to 70 000 psi ( 485 MPa) \n381 \n( 3) The specified minimum yield strength of the base steel \nis less than or equal to 40 000 psi (275 MPa). \n( 4) The tensile properties thus determined shall be not less \nthan the minimum and not more than 5000 psi (35 MPa) over \nthe maximum prescribed in the specification for the base steel \nused: All other tensile test requirements of the specification for \nthe base steel shall be met. \n7.1.2 The tensile properties shall be determined by a \ntension test of the base steel only for clad plates that meet one \nof the following conditions. The properties thus determined \nshall meet all of the tensile test requirements for the base steel. \n( 1) The composite gage is greater than 1 ½ in. (38 mm). \n(2) The specified minimum tensile strength of the base \nsteel is greater than 70 000 psi (485 MPa). \n( 3) The specified minimum yield strength of the base steel \nis greater than 40 000 psi (275 MPa). \n7.1.3 If the cladding is for corrosion allowance only, the \ncladding need not be included in the tensile test. The tensile \nproperties thus determined shall meet the base steel require­\nments. \n7 .2 Tests for strength of the bond, when required, must be \nspecified by the purchaser and shall consist of one of the \nfollowing. \n7.2.1 Shear Strength-When required by the purchaser, the \nminimum shear strength of the alloy cladding and base metals \nshall be 20 000 psi (140 MPa). The shear test, when specified, \nshall be made in the manner indicated in Fig. 1. The minimum ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0433.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5975,
  "bestTextAlphaRatio": 0.766
}