{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 713,
  "globalPageIndex": 1511,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-988/SA-988M \n2.3 ASME Specifications and Boiler and Pressure Vessel \nCodes: \nB16.5 Dimensional Standards for Steel Pipe Flanges and \nFlanged Fittings \n2.4 ASME Specification IX Welding Qualifications: \nSFA-5.4 Specification for Corrosion-Resisting Chromium \nand Chromium-Nickel Steel Covered Welding Electrodes \nSFA-5.9 Specification for Corrosion-Resisting Chromium \nand Chromium-Nickel Steel Welding Rods and Bare \nElectrodes \nSFA-5.11 Specification for Nickel and Nickel-Alloy Cov­\nered Welding Electrodes \nSFA-5.14 Specification for Nickel and Nickel Alloy Bare \nWelding Electrodes and Rods \n2.5 AWS Standard: \nA5.11 Specification for Nickel and Nickel Alloy Welding \nElectrodes for Shielded Metal Arc Welding \nA5 .14 Specification for Nickel and Nickel Alloy Bare Weld­\ning Electrodes and Rods \n3. Terminology \n3 .1 Definitions of Terms Specific to This Standard: \n3.1.1 can, n-the container used to encapsulate the powder \nduring the pressure consolidation process; it is partially or fully \nremoved from the final part. \n3.1.2 compact, n-the consolidated powder from one can. It \nmay be used to make one or more parts. \n3.1.3 consolidation, n-the bonding of adjacent powder \nparticles in a compact under pressure by heating to a tempera­\nture below the melting point of the powder. \n3 .1.4 fill stem, n-the part of the compact used to fill the can. \nIt is not usually integral to the part produced. \n3.1.5 hot isostatic-pressing, n-a process for simultaneously \nheating and forming a compact in which the powder is \ncontained in a sealed formable enclosure usually made from \nmetal and the so-contained powder is subjected to equal \npressure from all directions at a temperature high enough to \npermit plastic deformation and consolidation of the powder \nparticles to take place. \n3.1.6 lot, n-a number of parts made from a single powder \nblend following the same manufacturing practice. \n3.1.7 part, n-a single item coming from a compact, either \nprior to or after machining. \n3.1.8 powder blend, n-a homogeneous mixture of powder \nfrom one or more heats of the same grade. \n3.1.9 rough part, n-the part prior to final machining. \n4. Ordering Information \n4.1 It is the responsibility of the purchaser to specify in the \npurchase order all requirements that are necessary for material \nordered under this specification. Such requirements may \ninclude, but are not limited to, the following: \n4.1.1 Quantity (weight or number of parts), \n4.1.2 Name of material or UNS number, \n4.1.3 ASTM designation and year of issue, \n4.1.4 Dimensions (tolerances and surface finishes should be \nincluded), \n4.1.5 Microstructure examination if required (5.1.4), \n4.1.6 Inspection (15.1), \n4.1.7 Whether rough part or finished machined part (8.2.2), \n4.1.8 Supplementary requirements, if any, \n4.1.9 Additional requirements (See 7.2 and 17.1), and \n4.1.10 Requirement, if any, that the manufacturer shall \nsubmit drawings for approval showing the shape of the rough \npart before machining and the exact location of test specimen \nmaterial (See 9.3). \n5. Materials and Manufacture \n5.1 Manufacturing Practice: \n5.1.1 Compacts shall be manufactured by placing a single \npowder blend into a can, evacuating the can, and sealing it. The \ncan material shall be selected to ensure that it has no deleteri­\nous effect on the final product. The entire assembly shall be \nheated and placed under sufficient pressure for a sufficient \nperiod of time to ensure that the final consolidated part meets \nthe density requirements of 8.1.1.1. One or more parts shall be \nmachined from a single compact. \n5 .1.2 The powder shall be prealloyed and made by a melting \nmethod capable of producing the specified chemical \ncomposition, such as but not limited to, air or vacuum \ninduction melting, followed by gas atomization. \n5.1.3 When powder from more than one heat of the same \ngrade is used to make a blend, the heats shall be mixed \nthoroughly to ensure homogeneity. \n5.1.4 The compact shall be sectioned and the microstructure \nexamined to check for porosity and other internal imperfec­\ntions. It shall meet the requirements of 8.1.2. The sample shall \nbe taken from the fill stem or from a location in a part as agreed \nupon by the manufacturer and purchaser. \n5.1.5 Unless otherwise specified in the purchase order, the \nmanufacturer shall remove the can material from the surfaces \nof the consolidated compacts by chemical or mechanical \nmethods such as by pickling or machining. This removal shall \nbe done before or after heat treatment at the option of the \nmanufacturer (See Note 1). \nNore I-Often, it is advantageous to leave the can material in place \nuntil after heat treatment or further thermal processing of the consolidated \ncompact. \n5;1.6 Supplementary Requirements Sl9, S20, S21, and S22 \nare mandatory. \n6. Chemical Composition \n6.1 The steel, both as a blend and as a part, shall conform to \nthe requirements for chemical composition prescribed in Table \n1. Test Methods, Practices, and Terminology of A751 shall \napply. \n6.1.1 A representative sample of each blend of powder shall \nbe analyzed by the manufacturer to determine the percentage of \nelements prescribed in Table 1. The blend shall conform to the \nchemical composition requirements prescribed in Table 1. \n1457 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1511.json",
  "tabulaTablesCsv": "tables_tabula/page-1511.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1511.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5294,
  "bestTextAlphaRatio": 0.7567,
  "noteOcrPath": "note_ocr/page-1511.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1511.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}