{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 183,
  "globalPageIndex": 981,
  "width": 638.76,
  "height": 813.24,
  "text": "ASME BPVC.II.A-2025 SA-522/SA-522M \nprovided that the axial length of the part is approximately \nparallel to the metal flow lines of the stock. Except for all \ntypes of flanges, elbows, return bends, tees, and header \ntees, other parts up to and including NPS 4 may be \nmachined from hot-rolled or forged bar. \n4.5 When specified in the order, the manufacturer shall \nsubmit for purchaser's approval a sketch showing the shape \nof the rough forging before machining. \n5. Chemical Composition \n5.1 The steel shall conform to the requirements of \nTable 1. \n5.2 If required by the purchaser, product analysis may \nbe performed in accordance with the requirements of \nA 961. \n6. Heat Treatment \n6.1 The forgings shall be heat treated by the manufac­\nturer by either of the following methods as mutually agreed \nupon between the purchaser and the manufacturer. \n6.1.1 Quenched and Tempered - Heat to a uniform \ntemperature of 1475 ± 25°F [800 ± 15°C]; hold at this \ntemperature for a minimum time of 1 h/in. [2.5 min/mm] \nof thickness but in no case less than 30 min; quench by \nimmersion in circulating water. Reheat until the forging \nattains a uniform temperature within the range from 1050 \nto l 125°F [565 to 605°C]; hold at this temperature for a \nminimum time of 1 h/in. [2.5 min/mm] of thickness but \nminimum rate of 300°F [165°C]/h to a temperature not \nexceeding 600°F [3 l 5°C]. \n7. Mechanical Properties \n7.1 Tension Test - Forgings to Types 1 and 2 shall \nconform to the tensile requirements of Table 2. \n7 .2 Impact Test - The Charpy impact test requirements \nin Table 3 shall be met unless Supplementary Requirement \nS2 of this specification has been specified. \n7.2.1 The values for energy absorption and the frac­\nture appearance in percentage of shear fracture for each \nspecimen shall be recorded and reported for information. \n8. Workmanship, Finish, and Appearance \n8.1 The forgings shall have a workman-like finish and \nshall be free of injurious defects. \n9. Number of Tests and Retests \n9.1 At least one tension test and one set of Charpy \nV-notch impact tests shall be made from each heat in each \nheat-treatment charge. \n9.2 If the results of the mechanical tests do not conform \nto the specified requirements, the manufacturer may retreat \nthe forgings, but not more than three additional times. \nRetreatment involves re-austenitizing the forgings. Retests \nshall be made in accordance with this section. \nin no case less than 30 min; cool in air or water quench, 9.3 If the lateral expansion result from one Charpy \nat a rate not less than 300°F [165°C]/h. impact specimen falls below 0.015 in. [0.38 1mn], but not \n6.1.2 Double Normalized and Tempered_ Heat to less than 0.010 in. [0.25 mm], and the average test result \na uniform temperature of 1650 oF [goooc]; hold at this equals or exceeds 0.015 mm [0.38 1mn], then one retest \nt t f · · t· f 1 1 ;· [ 2 5 •n1 ] of three additional specimens may be made. The lateral empera ure or a 1mmmum nne o 1 m. . m1 mm . . . f th· k b t · 1 th 30 • . 1 . . expansion obtamed from each of the three retest specimens \n~~~~o~ 1c ness u 111 no case ess an mm, coo m air. h 11 1 d 0 015 . [0 38 ] \nReheat until the forging attains a uniform temperattrre--of--- 2__a~ equ~ or e~~e~-· __ _1:1:,_~_· _ mm • __ \n1450°F [790°C]; hold at this temperature for a minimum --~~---\ntime of 1 h/in. [2.5 min/mm] of thickness but in no case \nless than 30 min; cool in air. Reheat to a uniform tempera­\nture within the range from 1050 to 1125°F [565 to 605°C]; \nhold at this temperature for a minimum time of 1 h/in. \n[2.5 min/mm] of thickness but in no case less than 30 min; \ncool in air or water quench, at a rate not less than 300°F \n[165°C]/h. \n6.2 When stress relieving is to be performed after fabri­\ncation, the recommended stress-relieving treatment is as \nfollows: gradually and uniformly heat the steel to a temper­\nature between 1025 and 1085°F [550 and 585°C]; hold for \na minimum of 2 h for thicknesses up to I in. [25 mm]. \nFor thicknesses over I in. [25 mm], a minimum additional \nholding time in the ratio of 1 h/in. [2.5 min/mm] of thick­\nness in excess of I in. [25 mm] shall be added. Cool at a \n881 \n10. Test Specimens \n10.1 The test specimens shall be located at any point \nmidway between the center and surface of solid forgings, \nand at any point mid-thickness of the heaviest section of \nhollow or bored forgings. For solid forgings where test \nmetal is provided on the periphery, test specimens shall \nbe taken at mid-thickness of the test prolongation. \n10.2 Tests shall be oriented so that the longitudinal \naxis of the specimen is parallel to the major direction of \ngrain flow. \n10.3 When fabrication requires stress relieving, the \npurchaser shall specify stress relieving of the test pieces \nprior to machining of the test specimens. Stress relieving \nshall be carried out as prescribed in 6.2. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0981.json",
  "tabulaTablesCsv": "tables_tabula/page-0981.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0981.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4876,
  "bestTextAlphaRatio": 0.702
}