{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 523,
  "globalPageIndex": 523,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-320/SA-320M \nTABLE 3 Continued \nPhosphorus, max \nSulfur, max \nSilicon, max \nNickel \n0.045 \n0.030 \n1.00 \n8.0-11 \n18.0-20.0 \n0.010 over \n0.005 over \n0.05 over \n0.15 \n0.045 \n0.030 \n1.00 \n10.0-13.0 \n16.0-18.0 \n2.00-3.00 \n0.10--0.16 \n0.010 over \n0.005 over \n0.05 over \n0.15 \nChromium \nMolybdenum \nNitrogen 0.10-0.16 \n0.20 \n0.01 \n0.20 \n0.10 \n0.01 \nA The intentional addition of Bi, Se, Te, and Pb is not permitted except for Grade B8F, in which selenium is specified and required. \n8 Typical steel compositions used for this grade include 4140, 4142, 4145, 4140H, 4142H, and 4145H. \n° For the L7M grade, a minimum carbon content of 0.28 % is permitted provided that the required tensile properties are met in the section sizes involved; the use of AISI \n4130 or 4130H is allowed. \n° Class 1 are made from solution-treated material. Class 1 A products (BSA, B8CA, B8MA, B8PA, B8FA, and B8TA) are solution-treated in the finished condition. Class \n2 products are solution-treated and strain-hardened. \nENiobium and columbium are interchangeable names for the same element and both names are acceptable for use in A01.22 specifications. \n7. Chemical Composition \n7.1 Each alloy shall conform to the chemical composition \nrequirements prescribed in Table 3. \n8. Workmanship, Finish, and Appearance \n8.1 Bolts, screws, studs, and stud bolts shall be pointed and \nshall have a workmanlike finish. \n9. Retests \n9 .1 If the results of the mechanical tests of any test lot do \nnot conform to the requirements specified, the manufacturer \nmay retreat such lot not more than twice, in which case two \nadditional tension tests and one additional impact test consist­\ning of three specimens shall be made from such lot, all of \nwhich shall conform to the requirements specified. \n10. Nuts and Washers \n10.1 Bolts, studs, and stud bolts of Grades L7, L7A, L7B, \nL7C, L43, Ll, L70, L71, L72, and L73 shall be equipped with \nferritic alloy nuts conforming to Grade 7 of Specification \nA194/A194M or conforming to Grade L43 or Grade L73. Nuts \nmanufactured of Grade L43 and Grade L73, in addition to the \nrequirements stated for those grades, shall be subject to the \nproof-load requirements for Grade 7 nuts. Nuts manufactured \nof Grade L43 and Grade L 73 shall be marked respectively with \nthose grade symbols. Grade 7M nuts at a hardness not \nexceeding 235 HBW (or equivalent) shall be used with Grade \nL 7M bolts, studs, and stud bolts. All nut materials, including \nthose which may be supplied under Specification A194/ \nA194M, shall be subject to the impact requirements of this \nspecification in the following manner: impact tests shall be \nmade on test specimens taken from the nuts or nut blanks or the \nbar from the heat of steel used for manufacturing the nuts, and \nheat treated with the nut blanks. \n10.2 Bolts, studs, and stud bolts of Grades B8, B8C, B8T, \nB8P, B8P, B8M, B8LN, and B8MLN shall be equipped with \naustenitic alloy nuts conforming to Grades 8, 8C, 8T, 8P, 8M, \n8LN, and 8MLN for Specification A194/A194M. Impact tests \nare not required for Grades 8P, 8M, 8T, and 8MLN for \ntemperatures above -325 °P [-200 °C] and for Grades 8, 8P, \n8C, and 8LN above -425 °P [-255 °C]. \n10.3 If the purchaser requires nuts with a Charpy impact \nenergy absorption of not less than 20 ft • lbf [27 J] at \n471 \ntemperatures below -150 °P [-100 °C], he may require that the \nnuts conform to Grades 8, 8C, 8M, 8P, 8T, 8P, 8LN, or 8MLN \nof Specification A194/A194M. \n10.4 Unless otherwise specified, washers for use with fer­\nritic steel bolting shall conform to Specification P436/F436M. \n10.5 Washers for use with austenitic steel bolting shall be \nmade of austenitic steel as agreed upon between the manufac­\nturer and purchaser. \n10.6 Washer dimensions shall be in accordance with re­\nquirements of ASME B18.21.1, unless otherwise specified in \nthe purchase order. \n11. Threads \n11.1 Where practical, all threads shall be formed after heat \ntreatment. Class lA, Grades BSA, B8CA, B8MA, B8PA, \nB8PA, B8TA, B8LNA, and B8MLNA are to be solution­\ntreated in the finished condition. \n12. Certification \n12.1 Certification is required. See Specification A962/ \nA962M. \n13. Product Marking \n13.1 In addition to the requirements of Specification A962/ \nA962M, the grade symbol marked shall be as shown in Table \n3. In the case of Class 2, Grades B8, B8C, B8M, B8P, B8P, and \nB8T strain hardened as provided in Table 1, a line shall be \nstamped under the grade symbol in order to distinguish it from \nClass 1 and Class lA bolting which has not been strain \nhardened. In the case of Class IA, the marking BSA, B8CA, \nB8MA, B8PA, B8PA, B8TA, B8LNA, and B8MLNAidentifies \nthe material as being in the solution-treated condition in the \nfinished state. Grade L7M no longer requires a line under the \ngrade symbol. However, a line is permitted. \n13.2 Nuts from materials that have been impact tested shall \nbe marked with the letter \"L.\" \n14. Keywords \n14.1 additional elements; austenitic stainless steel; bolts­\nsteel; chromium-molybdenum steel; bolting components­\nsteel; markings on fittings; nickel-chromium-molybdenum al­\nloy steel; pressure vessel service; stainless steel bolting; ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0523.json",
  "tabulaTablesCsv": "tables_tabula/page-0523.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0523.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5193,
  "bestTextAlphaRatio": 0.697,
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-0523.txt",
  "gapOcrHighDpiLength": 5136,
  "camelotTablesPath": "camelot_tables/page-0523.json",
  "camelotTablesCsv": "camelot_tables/page-0523.csv",
  "camelotTableCount": 2
}