{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 745,
  "globalPageIndex": 1543,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-999 /SA-999M \n10.1.1 Minimum Wall-If the wall thickness of the pipe is \nspecified as minimum wall in the purchase order, there shall be \nno variation under the specified wall thickness. \n10.2 Forged and Bored-The wall thickness shall not vary \nover that specified by more than Vs in. [3.2 mm]. There shall be \nno variation under the specified wall thickness. \n10.3 Cast-The wall thickness shall not vary over that \nspecified by more than V16 in. [1.6 mm]. There shall be no \nvariation under the specified wall thickness. \n11. Permissible Variations in Inside Diameter \n11.1 Forged and Bored, and Cast-The inside diameter \nshall not vary under that specified by more than V16 in. [1.6 \nmm]. There shall be no variation over the specified inside \ndiameter. \n12. Permissible Variation in Outside Diameter \n12.1 Variations in outside diameter, unless otherwise agreed \nupon, shall not exceed the limits given in Table I. The \ntolerances for outside diameter include ovality, except as \nprovided for in 12.2 and 12.2.1. (See Note 2.) \n12.2 For thin-wall pipe, defined as pipe having a wall \nthickness of 3 % or less of the specified outside diameter, the \ndiameter tolerance of Table 1 is applicable only to the mean of \nthe extreme (maximum and minimum) outside diameter read­\nings in any one cross-section. \n12.2.1 For thin-wall pipe, the difference in extreme outside \nreadings (ovality) in any one cross-section shall not exceed \n1.5 % of the specified outside diameter. \nNorn 2-Thin-wall pipe usually develops significant ovality (out-of­\nroundness) during final annealing, straightening, or both. The diameter \ntolerances given in Table 1 are usually not sufficient to provide for \nadditional ovality expected in thin-wall pipe. \n13. Permissible Variations in Length \n13.1 Seamless and Welded (No Filler Metal Added)-If \nspecific cut lengths of 24 ft [7.3 m] or less are ordered, no \nlength of pipe shall be under the length specified or more than \n¼ in. [6 mm] over that specified. \n13.1.1 Permissible variations in length for lengths greater \nthan 24 ft [7.3 m] shall be subject to agreement between the \nmanufacturer and purchaser. \n13.2 Forged and Bored, Cast, and Cast Cold-Wrought-If \nspecific cut lengths are ordered, no length of pipe shall be \nunder the length specified or more than 1/s in. [3 mm] over that \nspecified. \n13.3 For pipe ordered to random lengths, the lengths and \nvariations shall be agreed upon between the manufacturer and \npurchaser. \n13.4 No girth welds are permitted unless agreed upon by the \nmanufacturer and purchaser. \n14. Mass per Unit Length \n14.1 A system of standard pipe sizes has been approved by \nthe American National Standards Institute as ANSI B36.10 and \nB36.19. The standard sizes do not prohibit the production and \nuse of other sizes of pipe produced to the various product \nspecifications referenced in 1.1. (See Note 3.) \n14.2 For nonstandard sizes of pipe, the calculated mass per \nunit length shall be determined using the following equation: \nM= C(D - t)t (1) \nwhere: \nC = 10.69 [0.0246615], \nM = mass per unit length, lbm/ft [kg/m], \nD = specified or calculated (from specified inside diameter \nand wall thickness) outside diameter, in. [mm], and \nt = specified wall thickness, in. (to 3 decimal places) [mm \nto 2 decimal places]. \n14.3 When minimum wall thickness is specified in the \npurchase order, the calculated mass per unit length shall be \ndetermined using Eq 1, obtaining from Table Xl.l the nominal \nwall thickness, t, corresponding to that minimum wall. \nNorn 3-The mass per unit length values given in the American \nNational Standards and the calculated masses per unit length determined \nusing Eq 1 are based upon carbon steel pipe. The mass per unit length of \npipe made of ferritic stainless steels may be up to about 5 % less, and that \nmade of austeilitic stainless steel up to about 2 % greater, than the values \ngiven. \n15. Ends \n15.1 Unless otherwise specified, the pipe shall be furnished \nwith plain ends. All burrs at the ends of the pipe shall be \nremoved. \n16. Straightness \n16.1 The finished pipe shall be reasonably straight. \n16.2 For metal-arc welded pipe, the maximum deviation \nfrom a 10-ft [3.0-m] straightedge placed so that both ends are \nin contact with the pipe shall be Vs in. [3.2 mm]. For metal-arc \nwelded pipe with lengths shorter than 10 ft [3.0 m], this \nmaximum deviation shall be prorated with respect to the ratio \nof the actual length to 10 ft [3.0 m]. \nTABLE 1 Permissible Variations in Outside Diameter \nNPS \nDesi nator \n1/s -1 ½, incl \nOver 1 ½ to 4, incl \nOver 4 to 8, incl \nOver 8 to 18, incl \nOver 18 to 26, incl \nOver 26 to 34, incl \nOver 34 to 48, incl \nPermissible Variations in Outside Diameter \nOver Under \nin. in. \n1/s• (0.015) 1/32 (0.031) \n1/s2 (0.031) 1/32 (0.031) \n1Ae (0.062) 1/s2 (0.031) \no/32 (0.093) 1/s2 (0.031) \n1/s (0.125) 1/s2 (0.031) \no/32 (0.156) 1/s2 (0.031) \no/16 (0.187) 1/s2 (0.031) \n1489 \nDN Designator Permissible Variations in Outside \nDiameter \nOver Under \nmm mm \n[6--40], incl [0.4] [0.8] \nOver [40 to 100] [0.8] [0.8] \nOver [100 to 200] [1.6] [0.8] \nOver [200 to 450] [2.4] [0.8] \nOver [450 to 650] [3.2] [0.8] \nOver [650 to 850] [4.0] [0.8] \nOver [850 to 1200] [4.8] [0.8] ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1543.json",
  "tabulaTablesCsv": "tables_tabula/page-1543.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1543.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5235,
  "bestTextAlphaRatio": 0.6839,
  "noteOcrPath": "note_ocr/page-1543.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1543.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}