{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 547,
  "globalPageIndex": 547,
  "width": 609.24,
  "height": 851.28,
  "text": "ASME BPVC.II.A-2025 SA-334/SA-334M \n6. Heat Treatment \n6.1 All seamless and welded tubes, other than Grades \n8 and 11, shall be treated to control their microstmcture \nin accordance with one of the following methods: \n6.1.1 Normalize by heating to a uniform temperature \nof not less than 1550°F [845°C] and cool in air or in the \ncooling chamber of an atmosphere controlled furnace. \n6.1.2 Normalize as in 10.1.1, and, at the discretion \nof the manufacturer, reheat to a suitable tempering temper­\nature. \n6.1.3 For the seamless process only, reheat and con­\ntrol hot working and the temperature of the hot-finishing \noperation to a finishing temperature range from 1550 to \n1750°F [845 to 955°C] and cool in a controlled atmosphere \nfurnace from an initial temperature of not less than 1550°F \n[845°C]. \n6.1.4 Treat as in 6.1.3 and, at the discretion of the \nmanufacturer, reheat to a suitable tempering temperature. \n6.2 Grade 8 tubes shall be heat treated by the manufac­\nturer by either of the following methods. \n6.2.1 Quenched and Tempered - Heat to a unifom1 \ntemperature of 1475 ± 25°F [800 ± l5°C]; hold at this \ntemperature for a minimum time in the ratio of 1 h/in. \n[2 min/mm] of thiclmess, but in no case less than 15 min; \nquench by immersion in circulating water. Reheat until the \npipe attains a uniform temperature within the range from \n1050 to 1125°F [565 to 605°C]; hold at this temperature \nfor a minimum time in the ratio of 1 h/in. [2 min/mm] of \nthickness, but in no case less than 15 min; cool in air or \nwater quench at a rate no less than 300°F [165°C]/h. \n6.2.2 Double Normalized and Tempered - Heat to \na unifonn temperature of 1650 ± 25°F [900 ± 15°C]; hold \nat this temperature for a minimum time in the ratio of 1 \nh/in. [2 min/mm] of thickness, but in no case less than \n15 min; cool in air. Reheat until the pipe attains a uniform \ntemperature of 1450 ± 25°F [790 ± l5°C]; hold at this \ntemperature for a minimum time in the ratio of 1 h/in. \n[2 min/mm] of thickness, but in no case less than 15 min; \ncool in air. Reheat to a uniform temperature within the \nrange from 1050 to 1125°F [565 to 605°C]; hold at this \ntemperature for a minimum time of 1 h/in. [2 min/mm] of \nthickness but in no case less than 15 min; cool in air or \nwater quench at a rate not less than 300°F [165°C]/h. \n6.3 Material from which impact specimens are obtained \nshall be in the same condition of heat treatment as the \nfinished tubes. \n6.4 Whether to anneal Grade 11 tubes is per agreement \nbetween purchaser and supplier. When Grade 11 tubes are \nannealed they shall be normalized in the range of 1400 to \n1600°F [760 to 870°C]. \n7. Chemical Composition \n7.1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n7.2 When Grades 1 or 6 are ordered under this specifi­\ncation, supplying an alloy grade that specifically requires \nthe addition of any element other than those listed for the \nordered grade in Table 1 is not pennitted. However, the \naddition of elements required for the deoxidation of the \nsteel is permitted. \n8. Product Analysis \n8.1 An analysis of either one billet or one length of \nflat-rolled stock or one tube shall be made for each heat. \nThe chemical composition thus determined shall conform \nto the requirements specified. \n8.2 If the original test for product analysis fails, retests \nof two additional billets, lengths of flat-rolled stock, or \ntubes shall be made. Both retests, for the elements in ques­\ntion, shall meet the requirements of the specification; other­\nwise all remaining material in the heat or lot shall be \nrejected or, at the option of the manufacturer, each billet, \nlength of flat-rolled stock, or tube may be individually \ntested for acceptance. Billets, lengths of flat-rolled stock, \nor tubes which do not meet the requirements of the specifi­\ncation shall be rejected. \n9 Sampling \n495 \n9.1 For flattening, flare, and flange requirements, the \nterm lot applies to all tubes prior to cutting of the same \nnominal size and wall thickness which are produced from \nthe same heat of steel. When final heat treatment is in a \nbatch-type furnace, a lot shall include only those tubes of \nthe same size and from the same heat which are heat treated \nin the same furnace charge. When the final heat treatment \nis in a continuous furnace, the number of tubes of the same \nsize and from the same heat in a lot shall be determined \nfrom the size of the tubes as prescribed in Table 2. \n9.2 For tensile and hardness test requirements, the term \nlot applies to all tubes prior to cutting, of the same nominal \ndiameter and wall thickness which are produced from the \nsame heat of steel. When final heat treatment is in a batch­\ntype furnace, a lot shall include only those tubes of the \nsame size and the same heat which are heat treated in the \nsame furnace charge. When the final heat treatment is in \na continuous furnace, a lot shall include,aU tubes of the \nsame size and heat, heat treated in the same furnace at the \nsame temperature, time at heat and furnace speed. \n10. Tensile Requirements \n10.1 The material shall conform to the requirements \nas to tensile properties prescribed in Table 3. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0547.json",
  "tabulaTablesCsv": "tables_tabula/page-0547.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0547.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5198,
  "bestTextAlphaRatio": 0.7276
}