{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 174,
  "globalPageIndex": 972,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-516/SA-516M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, Carbon Steel, for Moderate- and \nLower-Temperature Service \n1. Scope \n1.1 This specification covers carbon steel plates intended \nprimarily for service in welded pressure vessels where im­\nproved notch toughness is important. \n1.2 Plates under this specification are available in four \ngrades having different strength levels as follows: \nTensile Strength, Grade U.S. [SI] ksi [MPa] \n55 (380] 55-75 (380-515] \n60 (415] 60-80 [415-550] \n65 [450] 65-85 [450-585] \n70 [485] 70-90 [485-620] \n1.3 The maximum thickness of plates is limited only by the \ncapacity of the composition to meet the specified mechanical \nproperty requirements. \n1.4 For plates produced from coil and furnished without \nheat treatment or with stress relieving only, the additional \nrequirements, including additional testing requirements and the \nreporting of additional test results of Specification A2O/A2OM \napply. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment o] international Sfiiii<iaras;TJuide.iaiirrRecom~ \nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA2O/ A2OM Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/ A578M Specification for Straight-Beam Ultrasonic \nExarnination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Material supplied to this product specification shall \nconform to Specification A2O/A2OM, which outlines the test­\ning and retesting methods and procedures, permissible varia­\ntions in dimensions and mass, quality and repair of defects, \nmarking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhere additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A2O/A2OM. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A2O/A2OM, the require­\nments of this specification shall prevail. \n3.4 Coils are excluded from qualification to this specifica­\ntion until they are processed into finished plates. Plates \n- pl'00ueed· fr0m-e0il-means -plates-that-- have-been-cut-to \nindividual lengths from coil. The processor directly controls, or \nis responsible for, the operations involved in the processing of \ncoils into finished plates. Such operations include decoiling, \nleveling, cutting to length, testing, inspection, conditioning, \nheat treatment (if applicable), packaging, marking, loading for \nshipment, and certification. \n872 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0972.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3527,
  "bestTextAlphaRatio": 0.7703
}