{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 884,
  "globalPageIndex": 1682,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 \nIV-700 REQUIRED SAMPLING \nFor all mechanical properties, data shall be provided \nover the required range of test temperatures from at least \nthree heats of material meeting all of the requirements of \nthe applicable specifications. Data submitted on three \nheats of one wrought product form for which coverage \nis requested may be considered to be applicable for all \nother wrought product forms having the same nominal \ncomposition. Testing shall include the characterization \nof the metallurgical structure, including determination \nof grain size. \nFor wrought materials and especially for those materi­\nals whose mechanical properties are enhanced by heat \ntreatment, forming practices, or a combination thereof, \nand for other materials for which the mechanical proper­\nties may be reasonably expected to be thickness depen­\ndent, data from one additional lot from material of at \nleast 75% of the maximum thickness for which coverage \nis requested shall be submitted. If no maximum thickness \nis given, information shall be provided to support the suit­\nability of the thickness used for the tested samples. \nWhen adoption of cast product forms is requested, data \nfrom at least three heats for one of the cast product forms \nshall be submitted. The cast material shall be considered \nas a separate material even if its nominal composition is \nthe same or very similar to that of an approved wrought \nmaterial. \nIf the hot isostatically pressed powder material meets \nall of the requirements of Table IV-100-1, it shall be con­\nsidered the same material as that of the approved \nwrought material for temperatures approximately 50°F \n(25°C) below the temperature where time-dependent \nproperties, as defined by the Time-Dependent Properties \nNotes (T-Notes) in the applicable allowable stress table \nfor the approved wrought material, govern. \nIf the hot isostatically pressed material is to be used at \ntemperatures where the time-dependent properties, as \ndefined by the Time-Dependent Properties Notes \n(T-Notes) in the applicable allowable stress table for the \napproved wrought material, govern, the requirements of \nthis Appendix relative to the provision of data for new \nmaterials shall apply. \nIf the hot isostatically pressed powder material does \nnot meet all of the requirements of Table IV-100-1, it shall \nbe considered as a separate material to that of the ap­\nproved wrought material. In this case, the requirements \nof this Appendix relative to the provision of data for \nnew materials shall apply. \nAdditional data for other heats tested to a lesser degree \nthan described herein would be beneficial to the Commit­\ntee's consideration. \nIV-800 TIME-INDEPENDENT PROPERTIES \nFor time-independent properties at and above room \ntemperature, the required data include values of ultimate \ntensile strength, 0.2% offset yield strength, reduction of \narea (when specified in the material specification), and \nelongation. For steels, nickel alloys, cobalt alloys, and alu­\nminum alloys, data shall be provided at room tempera­\nture and 100°F (50°C) intervals, beginning at 200°F \n(100°C) to 100°F (50°C) above the maximum intended \nuse temperature, unless the maximum intended use tem­\nperature does not exceed 100°F ( 40°C). For copper alloys, \ntitanium alloys, and zirconium alloys, data shall be pro­\nvided at room temperature, 150°F (65°C), and 200°F \n(100°C), and then at 100°F (50°C) intervals, to 100°F \n(50°C) above the maximum intended use temperature, \nunless the maximum intended use temperature does not \nexceed 100°F ( 40°C). The test methods shall be as given \nin ASTM A370, ASTM A1058, ASTM E8, ASTM E21, or \nother equivalent national or international test standards. \nIn addition, when specified in the material specification, \nhardness values shall be provided at room temperature \nand shall be determined as specified in the material spec­\nification. Data provided shall be expressed in the units \nand to the number of significant figures shown in Table \nIV-800-1. When either the material specification or the \napplicable construction code ( e.g., Section XII) permits \nor requires that yield strength be determined by other \nthan the 0.2% offset method, those other yield strength \nvalues shall also be reported. \nIV-900 TIME-DEPENDENT PROPERTIES \nIf approval is desired for temperatures where time­\ndependent properties may be expected to control design, \ntime-dependent data, as itemized below, shall be pro­\nvided, starting at temperatures approximately 50°F \n(25°C) below the temperature where time-dependent \nproperties may govern and extending at least 100°F \n(S0°C) above the maximum intended use temperature. \nExceptions to this rule are permitted, provided the in­\nquirer provides suitable justification for the deviation. \nThe creep-rupture test method shall be in accordance \nwith ASTM E139 or other equivalent national or interna­\ntional test standard.For time-dependent tests, the interval \nbetween successive temperatures shall be chosen such \nthat it permits, in all cases, an accurate estimation of \nthe slope of the stress-rupture curves. For normally stable \nmaterials ( e.g., solid solution-strengthened materials), \ntest temperatures shall be at intervals of 100°F (50°C) \nor less. Where there is a possibility of degradation of \nstrength related to metallurgical instability ( e.g., for \nprecipitation-strengthened materials), test temperatures \nshall be at intervals of 50°F (25°C) or less. \nData provided shall be expressed in the units and to the \nnumber of significant figures shown in Table IV-800-1.In \naddition, for certain types of steels or alloys, it may be \n1628 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1682.json",
  "tabulaTablesCsv": "tables_tabula/page-1682.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1682.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5649,
  "bestTextAlphaRatio": 0.7766
}