{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 568,
  "globalPageIndex": 568,
  "width": 604.32,
  "height": 847.68,
  "text": "SA-335/SA-335M (ASTM A335/A335M) ASME BPVC.II.A-2025 \nmay be omitted. All photo-micrographs required shall be \nproperly identified as to heat number, size, and wall thickness \nof pipe from which the section was taken. Photomicrographs \nshall be further identified to permit association of each photo­\nmicrograph with the individual length of pipe it represents. \ncation shall reference this supplementary requirement indicat­\ning the tempering temperature applied. The notation \"S7\" shall \nbe included with the required marking of the pipe. \nSS. Melting Practice-Grades P2 and Pl2 \nS7. Alternative Heat Treatment-Grade P91 Type 1 and \nS8.1 Specific limits, if any, on grain size or deoxidation \npractice shall be a matter of agreement between the manufac­\nturer and purchaser. Type 2 \nS7.1 Grade P91 shall be normalized in accordance with \nTable 2 and tempered at a temperature, to be specified by the \npurchaser, less than 1350 °F [730 °C]. It shall be purchaser's \nresponsibility to subsequently temper at 1350-1470 °F \n[730-800 °C] minimum. All mechanical tests shall be made on \nmaterial heat treated in accordance with Table 2. The certifi-\nS9. Minimum Cooling Rate for Grade P91 Type 2 \nS9 .1 For Grade P91 Type 2 material, the heat treatment shall \nensure that following austenitizing the rate of cooling from \n1650 °F to 900 °F [900 °C to 480 °C] is no slower than 9 \n°F/min [5 °C/ min]. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A335/A335M- 23) that may impact the use of this standard. (Approved April 1, 2024.) \n(]) Revised the UNS number for Grade P91 Type 1 and Type \n2 in Table 1. \n(2) Deleted subsection 7.5.1 which specified tools for measure­\nment of wall thickness. \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A335/A335M-22) that may impact the use of this standard. (Approved May 1, 2023.) \n(]) Revised 1.3. (2) Added Supplementary Requirement S9. \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A335/A335M- 21a) that may impact the use of this standard. (Approved Nov. 1, 2022.) \n(1) Moved hardness requirements from subsection 9.3 (and \ndeleted subsection) into new Table 6. \n(2) Renumbered subsequent subsections and tables. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed eve,y five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed toASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n516 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0568.json",
  "tabulaTablesCsv": "tables_tabula/page-0568.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0568.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3878,
  "bestTextAlphaRatio": 0.7375
}