{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 721,
  "globalPageIndex": 721,
  "width": 606.0,
  "height": 848.88,
  "text": "ASME BPVC.II.A-2025 SA-401/SA-401M \nsurface. The wire shall lie substantially flat on itself and not \nspring up nor show a wavy condition. \n10.2 Quench and Tempered-The wire shall be uniform in \nquality and temper and shall not be wavy or crooked. \n10.3 Each coil shall be one continuous length of wire \nproperly coiled. Welds made prior to cold drawing are permit­\nted. If unmarked welds are unacceptable to the purchaser, \nspecial arrangements should be made with the manufacturer at \nthe time of the purchase. \n11. Retests \n11.1 If any tested specimen exhibits an obvious defect or \ncondition of non-conformance that is not representative of the \ncoil from which it was collected, or shows the presence of a \nweld, it shall be discarded and another specimen substituted. \n11.2 If any tested specimen exhibits an obvious defect or \ncondition of non-conformance that is representative of a \nportion of the coil from which it was collected, the manufac­\nturer shall remove from the coil the portion containing the \nobvious defect or condition of non-conformance before col­\nlecting another test specimen from the coil for the purpose of \nretesting. \n12. Inspection \n12.1 Unless otherwise specified in the contract or purchase \norder, the manufacturer is responsible for the performance of \nall inspection and test requirements specified in this specifica­\ntion. Except as otherwise specified in the contract or purchase \norder, the manufacturer may use his own or any other suitable \nfacilities for the performance of the inspection and test \nrequirements unless disapproved by the purchaser at the time \nthe order is placed. The purchaser shall have the right to \nperform any of the inspections and tests set forth in this \nspecification when such inspections and tests are deemed \nnecessary to assure that the material conforms to prescribed \nrequirements. \n13. Rejection and Rehearing \n13 .1 Unless otherwise specified, any rejection based on tests \nmade in accordance with these specifications shall be reported \nto the manufacturer as soon as possible so that an investigation \nmay be initiated. \n13.2 The material must be adequately protected and cor­\nrectly identified in order that the manufacturer may make a \nproper investigation. \n14. Certification \n14.1 When specified in the purchase order or contract, a \nmanufacturer's or supplier's certification shall be furnished to \nthe purchaser that the material was manufactured, sampled, \ntested, and inspected in accordance with this specification and \nhas been found to meet the requirements. When specified in the \npurchase order or contract, a report of the test results shall be \nfurnished. \n14.2 The certification shall include the specification \nnumber, year date of issue, and revision letter, if any. \n15. Packaging, Marking, and Loading for Shipment \n15.1 The coil mass, dimensions, and the method of packag­\ning shall be agreed upon between the manufacturer and \npurchaser. \n15 .2 The size of the wire, purchaser's order number, ASTM \nspecification number, heat number, and name or mark of the \nmanufacturer shall be marked on a tag securely attached to \neach coil of wire. \n15.3 Unless otherwise specified in the purchaser's order, \npackaging, marking, and loading for shipments shall be in \naccordance with those procedures recommended by Practices \nA700. \n671 \n16. Keywords \n16.1 annealed chromium-silicon alloy; springs; tempered; \nwire ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0721.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3408,
  "bestTextAlphaRatio": 0.7823
}