{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 793,
  "globalPageIndex": 793,
  "width": 651.96,
  "height": 885.12,
  "text": "ASME BPVC.II.A-2025 SA-450 /SA-450M \nwhere: \nP = hydrostatic test pressure, psi or MPa, \nt = specified wall thickness, in. or mm, and \nD = specified outside diameter, in. or mm. \n24.1.1 The hydrostatic test pressure determined by Eq 3 \nshall be rounded to the nearest 50 psi [0.5 MPa] for pressure \nbelow 1000 psi [7 MPa], and to the nearest 100 psi [1 MPa] for \npressures 1000 psi [7 MPa] and above. The hydrostatic test \nmay be performed prior to cutting to final length, or prior to \nupsetting, swaging, expanding, bending or other forming \noperations, or both. \n24.2 Regardless of the determination made by Eq 3, the \nminimum hydrostatic test pressure required to satisfy these \nrequirements need not exceed the values given in Table 7. This \ndoes not prohibit testing at higher pressures at manufacturer's \noption or as provided in 24.3. \n24.3 With concurrence of the manufacturer, a minimum \nhydrostatic test pressure in excess of the requirements of 24.2 \nor 24.1, or both, may be stated on the order. The tube wall \nstress shall be determined by the following equation: \nS = PD/2t (4) \nwhere: \nS = tube wall stress, psi or MPa, and all other symbols as \ndefined in 24.1.1. \n24.4 The test pressure shall be held for a minimum of 5 s. \n24.5 If any tube shows leaks during the hydrostatic test, it \nshall be rejected. \n24.6 The hydrostatic test may not be capable of testing the \nend po11ion of the pipe. The lengths of pipe that cannot be \ntested shall be determined by the manufacturer and, when \nspecified in the purchase order, reported to the purchaser. \n25. Air Pressure Test \n25.1 Air Underwater Test-When this test is employed, \neach tube, with internal surface clean and dry, shall be \ninternally pressurized to 150 psi [1000 kPa] minimum with \nclean and dry compressed air while being submerged in clear \nwater. The tube shall be well-lighted, preferably by underwater \nillumination. Any evidence of air leakage of the pneumatic \ncouplings shall be corrected prior to testing. Inspection shall be \nmade of the entire external surface of the tube after holding the \npressure for not less than 5 s after the surface of the water has \nbecome calm. If any tube shows leakage during the air \nTABLE 7 Hydrostatic Test Pressures \nOutside Diameter of Tube, in. [mm] \nUnder 1 [25.4] \n1 to 1 ½ [25.4 to 38.1 ), excl \n1 ½ to 2 [38.1 to 50.8]. excl \n2 to 3 [50.8 to 76.2], excl \n3 to 5 [76.2 to 127), excl \n5 [127] and over \nHydrostatic Test Pressure, psi [MPa] \n1000 [7] \n1500 [10) \n2000 [14) \n2500 [17] \n3500 [24) \n4500 [31) \nunderwater test, it shall be rejected. Any leaking areas may be \ncut out and the tube retested. \n25.2 Pneumatic Leak Test-When this test is employed, \neach tube shall be subjected to a pneumatic leak test in \naccordance with Specification A1047/A1047M. \nAcceptance criteria shall be as follows: \nTube O.D. in [mm] \nc,;1,5 [s40] \n>1.5S2.0 [>40:550] \n>2.0:52,5 [>50:565] \n>2.5:53,0 [>65:575] \n>3.0 [>75] \n26. Nondestructive Examination \nCalibration Hole, max. in [mm] \n0,003 [0.076) \n0,004 [0.162] \n0.005 [0.127) \n0,006 [0, 152] \nby agreement \n26.1 When nondestructive examination is specified by the \npurchaser or the product specification, each tube shall be \nexamined by a nondestructive examination method in accor­\ndance with Practice E213, Practice E309 (for ferromagnetic \nmaterials), Practice E426 (for non-magnetic materials), or \nPractice E570. Upon agreement, Practice E273 shall be em­\nployed in addition to one of the full periphery tests. The range \nof tube sizes that may be examined by each method shall be \nsubject to the limitations in the scope of that practice. In case \nof conflict between these methods and practices and this \nspecification, the requirements of this specification shall pre­\nvail. \n743 \n26.2 The following information is for the benefit of the user \nof this specification. \n26.2.1 Calibration standards for the nondestructive electric \ntest are convenient standards for calibration of nondestructive \ntesting equipment only. For several reasons, including shape, \norientation, width, etc., the correlation between the signal \nproduced in the electric test from an imperfection and from \ncalibration standards is only approximate. A purchaser inter­\nested in ascertaining the nature (type, size, location, and \norientation) of discontinuities that can be detected in the \nspecific application of these examinations should discuss this \nwith the manufacturer of the tubular product. \n26.2.2 The ultrasonic examination refe1Ted to in this speci­\nfication is intended to detect longitudinal discontinuities having \na reflective area similar to or larger than the calibration \nreference notches specified in 26.4. The examination may not \ndetect circumferentially oriented impelfections or short, deep \ndefects. \n26.2.3 The eddy current examination referenced in this \nspecification has the capability of detecting significant \ndiscontinuities, especially of the sh011 abrupt type. Practices \nE309 and E426 contain additional information regarding the \ncapabilities and limitations of eddy-current examination. \n26.2.4 The flux leakage examination referred to in this \nspecification is capable of detecting the presence and location \nof significant longitudinally or transversely oriented disconti­\nnuities. The provisions of this specification only provide for \nlongitudinal calibration for flux leakage. It should be recog­\nnized that different techniques should be employed to detect \ndifferently oriented imperfections. \n26.2.5 The hydrostatic test referred to in Section 23 is a test \nmethod provided for in many product specifications. This test \nhas the capability of finding defects of a size permitting the test ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0793.json",
  "tabulaTablesCsv": "tables_tabula/page-0793.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0793.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5475,
  "bestTextAlphaRatio": 0.75
}