{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 740,
  "globalPageIndex": 740,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-409 /SA-409M ASME BPVC.II.A-2025 \n12. Workmanship, Finish, and Appearance \n12.1 The finished pipe shall have a workmanlike finish. \n12.2 Repair of Defects by Machining or Grinding-Pipe \nshowing moderate slivers or other surface defects may be \nmachined or ground inside or outside to a depth which will \nensure the removal of all defects providing the wall thickness \nis not reduced below the minimum specified in 9 .1. \n12.3 Repair of Defects by Welding-Defects which violate \nminimum wall thickness may be repaired by welding, but only \nwith the approval of the purchaser. Areas shall be suitably \nprepared for welding with tightly closed defects removed by \ngrinding. Open, clean defects, such as pits or impressions, may \nrequire no preparation. All welders, welding operators, and \nweld procedures shall be qualified to the ASME Boiler and \nPressure Vessel Code, Section IX. Unless the purchaser speci­\nfies otherwise, pipe required to be heat treated under the \nprovisions of 5.3 shall be heat treated or reheat treated \nfollowing repair welding. Repaired lengths, where repair depth \nis greater tl1an ¼ of the thickness, shall be pressure tested or \nrepressure tested after repair and heat treatment (if any). Repair \nwelds shall also be examined by suitable non-destructive \nexamination techniques, including any techniques specifically \nrequired of the primary weld. \n12.4 The pipe shall be free of scale and contaminating iron \nparticles. Pickling, blasting, or surface finishing is not manda­\ntory when pipe is bright annealed. The purchaser may request \nthat a passivating treatment be applied. \n13. Test Specimens \n13.1 Transverse tension and bend test specimens may be \ntaken from a test plate of the same material as the pipe, made \nby attaching a formed cylinder to the end of the pipe and \nwelding the abutting edges as a continuation and duplication of \nthe seam of the pipe (run-off plate). As an alternative to a \nformed cylinder, the run-off plate may consist of flat plates \nwith reinforcing bars clamped to the underside to prevent \ndistortion. The run-off plate material shall be of the same heat, \npreferably shear croppings from the same plate. \n13.2 When heat treatment is required, test specimens shall \nbe cut from pipe after the heat treating has been completed, or \nspecimens removed from the pipe prior to heat treating shall be \nheat treated with the pipe. \n14. Transverse Guided-Bend Weld Tests \n14.1 Two bend test specimens shall be taken transversely \nacross the weld. One shall be subject to a face guided-bend test \nand the second to a root guided-bend test. One specimen shall \nbe bent with the inside surface of the pipe against the plunger, \nand the other with the outside surface against the plunger. \n14.2 The bend test shall be acceptable if no cracks or other \ndefects exceeding 1/s in. [3 mm] in any direction are present in \nthe weld metal or between the weld and the pipe metal after \nbending. Cracks which originate along the edges of the \nspecimen dming testing, and that are less than ¼ in. [6.5 llllll] \nmeasured in any direction shall not be considered. \n15. Pressure Tests \n15 .1 Where hydrostatic test equipment is not available, the \npipe may be air or gas pressure tested with an internal pressure \nof 100 psi [700 kPa]. The weld and weld area shall be inspected \nwith the use of soap solution or any other prepared solution \nwhich will detect the leakage of air or gas from the inside. \n15.2 Instead of a pressure test, when mutually agreed upon \nbetween the purchaser and manufacturer, the entire weld area \nof each pipe, including circumferential welds, may be tested by \nnondestructive testing methods. These methods shall be ca­\npable of detecting both surface and subsurface defects. \n16. Inspection \n16.1 When specified in the purchase order, the pipe may be \ninspected at the manufacturer's plant by an inspector repre­\nsenting the purchaser. The inspector shall have entry at all \ntimes. The manufacturer shall afford the inspector, all reason­\nable facilities to satisfy him that the material is being furnished \nin accordance with these specifications. \n690 \n17. Certification \n17 .1 Certification in accordance with the provisions of \nSpecification A999/ A999M shall be furnished. When specified \non the purchase order or when a specific type of melting \nhas been specified on the purchase order, the type of \nmelting used shall also be reported to the purchaser or the \npurchaser's representative. \n18. Product Marking \n18.1 Each length of pipe manufactured in accordance with \nthis specification shall have the following identifying marking \nwitl1in 12 in. [300 llllll] of one end: manufacturer's name or \ntrade-mark, specification number, grade number of the alloy, \nthe manufacturer's heat number, size, and schedule number. \nAdditional marking requirements for heat treatment are de­\nscribed in Supplementary Requirement S2. \n18.2 Marking shall be legibly stenciled with a suitable paint \nor permanent marking compound, except when otherwise \nspecified by the purchaser. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0740.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5048,
  "bestTextAlphaRatio": 0.7781
}