{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 515,
  "globalPageIndex": 1313,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-770/SA-770M \n0 to Yiin. \n(0 to \"\"'\"'1 \nD \n---A----....t \nTYPE \n1 \nTYPE \n3 \nNoTE 1-For Type 3 only one welded prolongation may be needed, \ndepending upon plate thickness. \nFIG. 1 Standard Round Tension Test Specimens \nTABLE 1 Schedule of Standard Test Specimens, Inches \n[MillimetresJA \nPlate thickness (~ \nDiameter (D) \nRadius, minimum (R) \nLength of reduced section (A) \n1 ,st ,s 1¼ \n0.350 [8.75] \n¼[6] \n1¾[45] \nSpecimen Type \n2 \n1 < t::S 2 \n0.500 [12.5] \n%[10] \n2¼[60] \n3 \n2<t \nQ.500 [12.5] \n% [10] \n2¼ [60] \nA See Test Methods and Definitions A370 (Fig. 5 for further details and Fig. 6 for \nvarious types of ends). \n4.4.2.3 For plates over 1 ¼ in. to 2 in. [50 mm] inclusive in \nthickness, use the 0.500-in. [12.5-mm] Type 2 specimen. \n4.4.2.4 For plates greater than 2 in. [50 nun] in thickness, \nuse the Type 3 specimen. \n4.4.3 Alternative Test Specimens-The alternative test \nspecimens in Fig. 2 and Table 2 may be used in place of the \nstandard specimens in Fig. 1 and Table 1. \n4.4.3.1 For plates over 2 in. [50 mm] in thickness, Type A or \nType B specimens may be used. The Type A specimen provides \na reduced section length greater than the plate thickness. The \nType B specimen provides a reduced section length of 2¼ in. \n[57 mm] with its center at the mid-thickness of the plate. Over \na minimum plate thickness determined by the specimen end \nconfiguration, no welded prolongations may be needed for the \nType B specimen. For plates over 4¼ in. [108 mm] in \nthickness, the Type C specimen may be used. For plates over 6 \nin. [150 mm] in thickness, a series of two or more Type A or \nType C specimens with reduced sections of 4 in. [100 mm] or \nless may be used to cover the full thickness of the plate. The \nnumber of tests required will depend upon the thickness of the \nplate being tested and the reduced section length selected. \nTYPES \nD. E. & F \nFIG. 2 Alternative Tension Test Specimens \nTYPE. \nA \n4.4.3.2 For plates over 1 in. [25 mm] in thickness, a series \nof button-head specimens shown in Fig. 2 and Table 2 may be \nused. The test specimen type to be used, Type D, Type E, or \nType F, is determined by the nominal plate thickness as \ndescribed in Table 2. A series of two or more Type F specimens \nmay be used to cover the full thickness of the plate. The length \nof the reduced section (A), as shown in Fig. 2 and specified in \nTable 2, is the length of the reduced section excluding the \nmachined radius (R). Within the plate thickness dimension \nspecified for each test specimen type, either the button-head \nthickness, the reduced section length, or the machined radius \nmay be varied. In all cases, the minimum length of the reduced \nsection must be as specified in Table 2 to maintain a minimum \nlength to diameter ratio (see Appendix X2.2). \n5. Acceptance Standards \n5.1 Each tension test shall have a minimum reduction of \narea no less than 20 %. If the reduction of area of both tests is \nless than 20 %, no retest shall be permitted. If the reduction of \narea of one of the two tests from a plate is less than 20 %, one \nretest of two additional specimens taken from a location \nadjacent to the specimen that failed may be made, and both of \nthese additional specimens shall have a reduction of area of \n20 % or more. \n1247 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1313.json",
  "tabulaTablesCsv": "tables_tabula/page-1313.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1313.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3283,
  "bestTextAlphaRatio": 0.6902
}