{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 633,
  "globalPageIndex": 1431,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.11.A-2025 SA-859/SA-859M (ASTM A859/A859M) \n8. Repair Welding \n8.1 Repair welding of forgings shall be permitted only with \nthe approval of the purchaser. \n8.2 Preparation for repair welding shall include inspection \nto ensure complete removal of the defect. \n8.3 Repairs shall be made using welding procedures quali­\nfied in accordance with ASME Boiler and Pressure Vessel \nCode Section IX and repair welding shall be done by welders \nor welding operators meeting the qualification requirements of \nthat code. \n9. Test Reports \n9 .1 A test report shall be furnished and shall include \ncertification that the material was manufactured and tested in \naccordance with this specification. The report shall include the \nresults of all required tests, including heat analysis, mechanical \ntest results, the type of heat treatment, and the test sampling \nmethod. \n10. Keywords \n10.1 precipitation hardening steel; pressure containing \nparts; pressure vessel service; steel forgings-alloy \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified by the \npurchaser on the order. Details of these supplementary requirements shall be agreed upon by the \nmanufacturer and purchaser. \nSl. Simulated Post-Weld Heat Treatment of Mechanical \nTest Coupons \nS 1.1 All test coupons shall be subjected to single or multiple \nheat treatments at subcritical temperatures prior to testing. \nSuch treatments are intended to simulate post-weld or other \nthermal treatments to which the forgings will be subjected \nduring subsequent fabrication. The purchaser shall furnish the \nmanufacturer with details of the desired heat treatment for the \ntest coupons, including temperatures, times, and cooling rates. \nS2. Ultrasonic Examination \nS2.1 The forgings shall be ultrasonically examined in ac­\ncordance with the procedures of Practice A388/A388M. \nS2. l.1 Longitudinal Wave Test: \nS2. l. l.1 Unless otherwise specified, the back-reflection \nmethod of tuning shall be used in accordance with 7 .2.2.1 of \nPractice A388/A388M. \nS2. l. l.2 In addition to the reportable conditions of Section \n8 of Practice A388/ A388M, indications exceeding the resultant \nback reflection shall be recorded. \nS2. l. l.3 The following conditions are subject to rejection: \n(a) Complete loss of back reflection accompanied by an \nindication of a discontinuity. For this purpose, a back reflection \nless than 5 % of full screen height shall be considered complete \nloss of back reflection. \n(b) An indication equal in amplitude to that of the back \nreflection established in an indication-free portion of the \nforging. \nS2. l.2 Angle Beam Test: \nS2.l.2.1 Calibration notches, calibration reference, and \nmethod of scanning shall be in accordance with 7 .3 of Practice \nA388/A388M. \nS2. l.2.2 A forging that contains a discontinuity that results \nin an indication exceeding the amplitude of the reference line \nis subject to rejection. \nS2.l.3 The report of the ultrasonic examination shall be in \ncompliance with Section 9 of Practice A388/ A388M. \nS2.1.4 Additional nondestructive examination or trepanning \nmay be employed to resolve questions of interpretation of \nultrasonic indications. The manufacturer shall accept respon­\nsibility for injurious conditions that will not be removed in final \nmachining. \nS3. Magnetic Particle Examination \nS3.l Each forging shall be examined by magnetic particle \nmethods described in Practice A275/A275M. Acceptance stan­\ndards shall be specified by the purchaser. \nS3.2 Alternatively the purchaser may specify that Supple­\nmentary Requirement S18 of Specification A788 shall be used \nas the basis for the magnetic particle examination. \nS4. Charpy V-Notch Impact Transition Curve \nS4. l Sufficient impact test shall be made from the forging \ntest material to establish a temperature/absorbed-energy curve. \nThe test temperature range shall be wide enough to establish \nthe upper and lower shelf foot-pound-force [Joule] energies, \nwith sufficient testing at intermediate temperatures to permit \nplotting a reasonably smooth curve. \nS5. Additional Charpy V-Notch Test Data \nS5.l The percent shear fracture and mils [mm] of lateral \nexpansion shall be reported for each specimen tested. \nS6. Charpy V-Notch Test \nS6.1 For Grade A, Class 1 or 2 forgings the specified test \ntemperature for the Charpy V-Notch tests required in Section 6 \nof this specification shall be a temperature lower than -50 °F \n[-45 °C]. The specified test temperature shall be stated in the \norder. \nS6.2 The charpy impact test temperature used shall be \nincluded in the forging certification and marking. \nS7. Drop-Weight Test \nS7.l Drop-weight tests shall be conducted in accordance \nwith Test Method E208. The fracture plane of the specimen \nshall coincide with the location required for other mechanical \n1369 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1431.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4852,
  "bestTextAlphaRatio": 0.7743
}