{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 645,
  "globalPageIndex": 645,
  "width": 620.76,
  "height": 859.92,
  "text": "ASME BPVC.II.A-2025 SA-370 \ndrop of the beam. Note the load at the \"drop of the beam\" or \nthe \"halt of the pointer\" and record the corresponding stress as \nthe yield point. \n14.1.2 Autographic Diagram Method-When a sharp-kneed \nstress-strain diagram is obtained by an autographic recording \ndevice, take the stress corresponding to the top of the knee \n(Fig. 7), or the stress at which the curve drops as the yield \npoint. \n14.1.3 Total Extension Under Load Method-When testing \nmaterial for yield point and the test specimens may not exhibit \na well-defined disproportionate deformation that characterizes \na yield point as measured by the drop of the beam, halt of the \npointer, or antographic diagram methods described in 14.1.1 \nand 14.1.2, a value equivalent to the yield point in its practical \nsignificance may be determined by the following method and \nmay be recorded as yield point: Attach a Class C or better \nextensometer (Notes 5 and 6) to the specimen. When the load \nproducing a specified extension (Note 7) is reached record the \nstress corresponding to the load as the yield point (Fig. 8). \nNorn 5-Automatic devices are available that determine the load at the \nspecified total extension without plotting a stress-strain curve. Such \ndevices may be used if their accuracy has been demonstrated. Multiplying \ncalipers and other such devices are acceptable for use provided their \naccuracy has been demonstrated as equivalent to a Class C extensometer. \nNorn 6-Reference should be made to Practice E83. \nNorn 7-For steel with a yield point specified not over 80 000 psi \n(550 MPa), an appropriate value is 0.005 in.fin. of gauge length. For \nvalues above 80 000 psi, this method is not valid unless the limiting total \nextension is increased. \nNorn 8-The shape of the initial portion of an autographically \ndetermined stress-strain (or a load-elongation) curve may be influenced by \nnumerous factors such as the seating of tl1e specimen in the grips, the \nstraightening of a specimen bent due to residual stresses, and the rapid \nloading permitted in 8.4.1. Generally, the abem1tions in this portion of the \ncurve should be ignored when fitting a modulus line, such as that used to \ndetermine the extension-under-load yield, to the curve. In practice, for a \nnumber of reasons, the straight-line portion of the stress-strain curve may \nnot go through the origin of the stress-strain diagram. In these cases it is \nnot the origin of the stress-strain diagram, but rather where the straight­\nline portion of the stress-strain curve, intersects the strain axis that is \npertinent. All offsets and extensions should be calculated from the \nintersection of the strai.ght-line portion of the stress-strain curve with the \nstrain axis, and not necessarily from the origin of the stress-strain diagram. \nSee also Test Methods E8/E8M, Note 32. \n14.2 Yield Strength-Yield strength is the stress at which a \nmaterial exhibits a specified limiting deviation from the pro­\nportionality of stress to strain. The deviation is expressed in \nterms of strain, percent offset, total extension under load, and \nso forth. Determine yield strength by one of the following \nmethods: \n14.2.1 Offset Method-To determine the yield strength by \nthe \"offset method,\" it is necessary to secure data (autographic \nor numerical) from which a stress-strain diagram with a distinct \nmodulus characteristic of the material being tested may be \ndrawn. Then on the stress-strain diagram (Fig. 9) lay off Om \nequal to the specified value of the offset, draw mn parallel to \nOA, and thus locate r, the intersection of mn with the \nstress-strain curve corresponding to load R, which is the \nyield-strength load. In recording values of yield strength \nobtained by this method, the value of offset specified or used, \nor both, shall be stated in parentheses after the term yield \nstrength, for example: \nYield strength ( 0.2 % offset) = 52 000 psi ( 360 MPa) ( 1) \nWhen the offset is 0.2 % or larger, the extensometer used \nshall qualify as a Class B2 device over a strain range of 0.05 to \n1.0 %. If a smaller offset is specified, it may be necessary to \nspecify a more accurate device (that is, a Class Bl device) or \nreduce the lower limit of the strain range (for example, to \n0.01 %) or both. See also Note 10 for automatic devices. \nNorn 9-For stress-strain diagrams not containing a distinct modulus, \nsuch as for some cold-worked materials, it is recommended that the \nextension under load method be utilized. If the offset method is used for \nmaterials without a distinct modulus, a modulus value appropriate for the \nmaterial being tested should be used: 30 000 000 psi (207 000 MPa) for \ncarbon steel; 29 000 000 psi (200 000 MPa) for ferritic stainless steel; \n28 000 000 psi (193 000 MPa) for austenitic stainless steel. For special \nalloys, the producer should be contacted to discuss appropriate modulus \nvalues. \n14.2.2 Extension Under Load Method-For tests to deter­\nmine the acceptance or rejection of material whose stress-strain \ncharacteristics are well known from previous tests of similar \nmaterial in which stress-strain diagrams were plotted, the total \nstrain corresponding to the stress at which the specified offset \n(see Notes 10 and 11) occurs will be known within satisfactory \nlimits. The stress on the specimen, when this total strain is \nreached, is the value of the yield strength. In recording values \nof yield strength obtained by this method, the value of \n\"extension\" specified or used, or both, shall be stated in \nparentheses after the term yield strength, for example: \n593 \nYield strength (0.5 % EUL) = 52000 psi (360 MPa) (2) \nThe total strain can be obtained satisfactorily by use of a \nClass Bl extensometer (Note 5, Note 6, and Note 8). \nNorn 10-Automatic devices are available that determine offset yield \nstrength without plotting a stress-strain curve. Such devices may be used \nif their accuracy has been demonstrated. \nNorn 11-The appropriate magnitude of the extension under load will \nobviously vary with the strength range of the particular steel under test. In \ngeneral, the value of extension under load applicable to steel at any \nstrength level may be determined from the sum of the proportional strain \nand the plastic strain expected at the specified yield strength. The \nfollowing equation is used: \nExtension under load, in.fin. of gauge length= (YS/ E) + r (3) \nwhere: \nYS = specified yield strength, psi or MPa, \nE = modulus of elasticity, psi or MPa, and \nr = limiting plastic strain, in.fin. \n14.3 Tensile Strength-Calculate the tensile strength by \ndividing the maximum load the specimen sustains during a \ntension test by the original cross-sectional area of the speci­\nmen. If the upper yield strength is the maximum stress \nrecorded and if the stress-strain curve resembles that of Test \nMethods E8/E8M-15a Fig. 25, the maximum stress after \ndiscontinuous yielding shall be reported as the tensile strength \nunless otherwise stated by the purchaser. \n14.4 Elongation: \n14.4.1 Fit the ends of the fractured specimen together \ncarefully and measure the distance between the gauge marks to \nthe nearest 0.01 in. (0.25 mm) for gauge lengths of 2 in. and \nunder, and to the nearest 0.5 % of the gauge length for gauge ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0645.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 7259,
  "bestTextAlphaRatio": 0.7589,
  "noteOcrPath": "note_ocr/page-0645.txt",
  "noteOcrCount": 2,
  "noteOcrNotes": [
    "Note 9—For stress-strain diagrams not containing a distinct modulus,",
    "Note 11—The appropriate magnitude of the extension under load will"
  ]
}