{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 198,
  "globalPageIndex": 198,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-53/SA-53M ASME BPVC.II.A-2025 \npipe NPS 4 [DN 100] or larger shall have thread protectors on \nthe ends not protected by a coupling. \n11.3 If ordered with couplings, one end of each length of \npipe shall be provided with a coupling manufactured in \naccordance with Specification A865/ A865M. The coupling \nthreads shall be in accordance with the gaging practice of ANSI \nB 1.20.1. The coupling shall be applied handling-tight, unless \npower-tight is specified in the purchase order. Couplings are to \nbe made of steel. Taper-tapped couplings shall be furnished on \nall threaded pipe NPS 2½ [DN 65] or larger. For pipe smaller \nthan NPS 2½ [DN 65], it is regular practice to furnish \nstraight-tapped couplings for standard-weight pipe and taper­\ntapped couplings for extra-strong and double extra-strong \nweight pipe. If taper-tapped couplings are required for \nstandard-weight pipe smaller than NPS 2½ [DN 65], it is \nrecommended that line pipe threads in accordance with API \nSpecification 5B be ordered. The taper-tapped couplings pro­\nvided on line pipe in such sizes may be used on mill-threaded \nstandard-weight pipe of the same size. \n12. Workmanship, Finish, and Appearance \n12.1 The pipe manufacturer shall explore a sufficient num­\nber of visual surface imperfections to provide reasonable \nassurance that they have been properly evaluated with respect \nto depth. \n12.2 Surface imperfections that penetrate more than 12.5 % \nof the specified wall thickness or encroach on the minimum \nwall thickness shall be considered defects. Pipe with defects \nshall be given one or more of the following dispositions: \n12.2.1 The defect shall be removed by grinding, provided \nthat the remaining wall thickness is within specified limits, \n12.2.2 Type S pipe and the parent metal of Type E pipe, \nexcept within ½ in. [13 mm] of the fusion line of the \nelectric-resistance-weld seam, are permitted to be repaired in \naccordance with the welding provisions of 12.5. Repair weld­\ning of Type F pipe and the weld seam of Type E pipe is \nprohibited. \n12.2.3 The section of pipe containing the defect shall be cut \noff within the limits of requirement on length, or rejected. \n12.3 At the purchaser's discretion, pipe shall be subjected to \nrejection if surface defects repaired in accordance with 12.2 are \nnot scattered, but appear over a large area in excess of what is \nconsidered a workmanlike finish. Disposition of such pipe shall \nbe a matter of agreement between the manufacturer and the \npurchaser. \n12.4 For the removal of imperfections and defects by \ngrinding, a smooth curved surface shall be maintained, and the \nwall thickness shall not be decreased below that permitted by \nthis specification. It shall be permissible to reduce the outside \ndiameter at the point of grinding by the amount so removed. \n12.5 Weld repair shall only be permitted with the approval \nof the purchaser and in accordance with Specification A530/ \nA530M. \n12.6 The finished pipe shall be reasonably straight. \n12.7 The pipe shall contain no dents greater than 10 % of \nthe pipe diameter or ¼ in. [6 mm], whichever is smaller, \n146 \nmeasured as the gap between the lowest point of the dent and \na prolongation of the original contour of the pipe. Cold-formed \ndents deeper than 1/s in. [3 mm] shall be free of sharp-bottomed \ngouges; it shall be permissible to remove the gouges by \ngrinding, provided that the remaining wall thickness is within \nspecified limits. The length of the dent in any direction shall \nnot exceed one half the specified outside diameter of the pipe. \n13. Number of Tests \n13.1 Except as required by 13.2, one of each of the tests \nspecified in Section 7 shall be made on test specimens taken \nfrom one length of pipe from each lot of each pipe size. For \ncontinuous-welded pipe, each lot shall contain no more than 25 \ntons [23 Mg] of pipe for pipe sizes NPS 1 ½ [DN 40] and \nsmaller, and no more than 50 tons [ 45 Mg] of pipe for pipe \nsizes larger than NPS 1 ½ [DN 40]. For seamless and electric­\nresistance-welded pipe, a lot shall contain no more than one \nheat, and at the option of the manufacturer shall contain no \nmore than 500 lengths of pipe (as initially cut after the final \npipe-forming operation, prior to any further cutting to the \nrequired ordered lengths) or 50 tons [45 Mg] of pipe. \n13.2 The number of flattening tests for electric-resistance­\nwelded pipe shall be in accordance with 7.3.3.2 or 7.3.3.3, \nwhichever is applicable. \n13.3 Except as allowed by 9.2, each length of pipe shall be \nsubjected to the hydrostatic test (see Section 8). \n14. Retests \n14.1 Except for flattening tests of electric-resistance-welded \npipe, if the results of a mechanical test for a lot fail to conform \nto the applicable requirements specified in Section 7, the lot \nshall be rejected unless tests of additional pipe from the \naffected lot of double the number originally tested are subse­\nquently made and each such test conforms to the specified \nrequirements. Only one retest of any lot will be permitted. Any \nindividual length of pipe that conforms to the test requirements \nis acceptable. Any individual length of pipe that does not \nconform to the test requirements may be resubmitted for test \nand will be considered acceptable if tests taken from each pipe \nend conform to the specified requirements. \n14.2 Electric-Resistance-Welded Pipe Produced in Single \nLengths-If any flattening test result fails to conform to the \nrequirements specified in 7.3.3, the affected single length shall \nbe rejected unless the failed end is subsequently retested using \nthe same weld orientation as the failed test and a satisfactory \ntest result is obtained before the pipe's length is reduced by \nsuch testing to less than 80 % of its length after the initial \ncropping. \n14.3 Electric-Resistance-Welded Pipe Produced in Multiple \nLengths-If any flattening test result fails to conform to the \nrequirements specified in 7.3.3, the affected multiple length \nshall be rejected or flattening tests shall be made using a test \nspecimen taken from each end of each individual length in the \nfailed multiple length. For each pipe end, such tests shall be \nmade with the weld alternately at 0° and 90° from the line of \ndirection of force. Individual lengths are considered acceptable \nif the test results for both pipe ends conform to the specified \nrequirements. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0198.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6372,
  "bestTextAlphaRatio": 0.763
}