{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 478,
  "globalPageIndex": 1276,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-737 /SA-737M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, High-Strength, Low-Alloy Steel \n1. Scope \n1.1 This specification covers high-strength low-alloy steel \nplates for service in welded pressure vessels and piping \ncomponents. \n1.2 This material is particularly intended for piping and \npressure vessel applications where high strength and improved \ntoughness are required. \n1.3 Two grades, designated B and C, are covered by this \nspecification. Grade B provides a minimum yield strength of \n50 ksi [345 MPa]. Grade C provides a minimum yield strength \nof 60 ksi [415 MPa]. \n1.4 The maximum thickness of plates is limited only by the \ncapacity of the chemical composition and heat treatment to \nmeet the specified mechanical property requirements; however, \ncurrent practice normally limits the maximum thickness to 4 in. \n[100 mm] for each grade. \n1.5 Grade C in the as-rolled condition is sensitive to \ncracking during flame cutting, transit, and handling, particu­\nlarly in thicknesses over 2 in. [50 mm]. Plates should not be \nshipped in the as-rolled condition only except by mutual \nagreement between the manufacturer and the purchaser. \n1.6 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA435/A435M Specification for Straight-Beam illtrasonic \nExamination of Steel Plates \nA577/A577M Specification for illtrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Material supplied to this specification shall conform to \nthe requirements of Specification A20/ A20M. These require­\nments outline the testing and retesting methods and procedures, \npermitted variations in dimensions and mass, quality, repair of \ndefects, marking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/A20M. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/A20M, the require­\nments of this specification shall prevail. \n4. Manufacture \n4.1 Steelmaking Practice-The steel shall be killed and \nshall conform to the fine austenitic grain size requirement of \nSpecification A20/ A20M. \n5. Heat Treatment \n5 .1 The material shall be normalized by heating to a suitable \ntemperature which produces an austenitic structure, but not \nexceeding 1700°F [925°C], holding a sufficient time to attain \nuniform heat throughout the material, and cooling in air. \n1198 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1276.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3631,
  "bestTextAlphaRatio": 0.7791
}