{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 522,
  "globalPageIndex": 1320,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-781/SA-781M ASME BPVC.II.A-2025 \nthe elements specified in the individual specification for \nthe grade being poured. The analysis shall be made from \na test sample preferably taken during the pouring of the \nheat. When drillings are used, they shall be taken not less \nthan ¼ in. [6.4 mm] beneath the surface. The chemical \ncomposition thus determined shall conform to the require­\nments in the individual specification for the grade being \npoured. \n5.3 Product Analysis - A product analysis may be \nmade by the purchaser from material representing each \nheat, lot, or casting. The analysis shall be made on represen­\ntative material. Samples for carbon analysis of carbon and \nalloy steel shall be taken no closer than ¼ in. [6 mm] to \na cast surface, except that castings too thin for this shall \nbe analyzed on representative material. The chemical com­\nposition thus determined shall meetthe requirements speci­\nfied in the applicable specification for the grade involved, \nor shall be subject to rejection by the purchaser, except \nthat the chemical composition determined for carbon and \nlow alloy steel castings may vary from the specified limits \nby the amounts shown in Table 1. The product analysis \ntolerances of Table 1 are not applicable as acceptance \ncriteria for heat analysis by the casting manufacturer. When \ncomparing product and heat analysis for other than carbon \nand low alloy steels, the reproducibility Data R 2 , in Test \nMethods E 353 or E 354, as applicable, shall be taken into \nconsideration. \n5.4 Unspecified Elements - When chemical analysis \nfor elements not specified for the grade ordered is desired, \nSupplementary Requirement S13 may be specified. \n5.4.1 Grade substitution, for stainless steel or nickel \nbase alloy castings, is not permitted. Grade substitution \noccurs when the material supplied: \n( 1) contains an element, other than nitrogen, that is not \nspecified in the ordered grade; and, \n(2) the amount of that element equals or exceeds the \nminimum requirement for the element in another grade for \nwhich it is specified. \nFor this requirement, a grade is defined as an alloy \ndescribed individually in a table of chemical requirements \nwithin any specification listed within the scope of \nA 781/A 781M. \n6. Mechanical Test Requirements \n6.1 The individual product specifications vary as to \nwhether mechanical tests are required; for this reason, and \nto determine specific test requirements, the individual prod­\nuct specification should be reviewed. \n6.2 Unless otherwise specified by the purchaser, when \nmechanical properties are required by the product specifi­\ncation, test coupons may be cast integrally with the cast­\nings, or as separate blocks, in accordance with Fig. 1, \nFig. 2, or Fig. 3, except when Supplementary Requirement \nS 15 is specified. The test coupon in Fig. 3 shall be \nemployed only for austenitic alloy castings with cross sec­\ntions less than 2½, in. [65 mm]. \n7. Workmanship, Finish, and Appearance \n7.1 All castings shall be made in a workmanlike manner \nand shall conform to the dimensions on drawings furnished \nby the purchaser before manufacture is started. If the pat­\ntern is supplied by the purchaser, the dimensions of the \ncasting shall be as predicated by the pattern. \n8. Quality \n8.1 The surface of the casting shall be free of adhering \nsand, scale, cracks, and hot tears as determined by visual \nexamination. Other surface discontinuities shall meet the \nvisual acceptance standards specified in the order. Practice \nA 802/ A 802M or other visual standards may be used to \ndefine acceptable surface discontinuities and finish. Unac­\nceptable visual surface discontinuities shall be removed \nand their removal verified by visual examination of the \nresultant cavities. \n8.2 When additional inspection is desired, Supplemen­\ntary Requirements Sl, S2, S3, S4, or S5 may be specified. \n8.3 Rejectable indications shall not be peened, plugged, \nor impregnated. \n9. Repair \n9.1 Repair by welding shall be in accordance with the \nrequirements of the individual specification using proce­\ndures and welders qualified in accordance with Practice \nA 488 / A 488M. \n10. • Inspection \n10.1 The manufacturer shall afford the purchaser's \ninspector all reasonable facilities necessary to satisfy that \nthe material is being produced and furnished in accordance \nwith the applicable specification. Foundry inspection by \nthe purchaser shall not interfere unnecessarily with the \nmanufacturer's operations. All tests and inspections, with \nthe exception of product analysis (5.3), shall be made at \nthe place of manufacture unless otherwise agreed. \n11. Rejection \n11.1 Subsequent to acceptance at the manufacturer's \nworks, material that is found to be unacceptable as deter­\nmined by requirements specified in the order may be \nrejected by the purchaser. The manufacturer should be \nnotified of such rejection. If the manufacturer is dissatisfied \nwith the results of any tests performed by the purchaser, \nhe may make claim for a rehearing. \n12. Keywords \n12.1 castings; common requirements; steel and alloy \n1254 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1320.json",
  "tabulaTablesCsv": "tables_tabula/page-1320.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1320.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5100,
  "bestTextAlphaRatio": 0.7776,
  "camelotTablesPath": "camelot_tables/page-1320.json",
  "camelotTablesCsv": "camelot_tables/page-1320.csv",
  "camelotTableCount": 4
}