{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 690,
  "globalPageIndex": 690,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-376/SA-376M ASME BPVC.II.A-2025 \nSpecification for \nSeamless Austenitic Steel Pipe for High-Temperature \nService \n1. Scope \n1.1 This specification covers seamless austenitic steel pipe \nintended for high-temperature service. Among the grades \ncovered are H grades and nitrogen grades that are specifically \nintended for high-temperature service. \nNorn I-This specification was 01iginally developed for use for piping \nin the central stations of electric-power generating thermal plants. \nHowever, its use is not restricted to such applications and it may be used \nin other applications for which the attributes of the materials, as defined by \nthis specification, are appropriate. \n1.2 Optional supplementary requirements (Sl through SlO) \nare provided. These supplementary requirements specify addi­\ntional tests that will be made only when stated in the order, \ntogether with the number of such tests required. \n1.3 Grades TP321 and TP321H have lower strength require­\nments for nominal wall thicknesses greater than 3/s in. [9.5 \nmm]. \n1.4 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \nNorn 2-The dimensionless designators NPS (nominal pipe size) and \nDN (Diametre Nominel) have been substituted in this standard for such \ntraditional tenns as \"nominal diameter,\" \"size,\" and \"nominal size.\" \nl .5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n640 \n2. Referenced Documents \n2.l ASTM Standards: \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA999/ A999M Specification for General Requirements for \nAlloy and Stainless Steel Pipe \nE112 Test Methods for Determining Average Grain Size \nE213 Practice for Ultrasonic Testing of Metal Pipe and \nTubing \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \nE426 Practice for Electromagnetic (Eddy Current) Examina­\ntion of Seamless and Welded Tubular Products, Titanium, \nAustenitic Stainless Steel and Similar Alloys \n2.2 Other Standards: \nSNT-TC- lA Personnel Qualification and Certification in \nNondestructive Testing \n3. Ordering Information \n3.1 Orders for material to this specification should include \nthe following, as required to describe the desired material \nadequately: \n3.1.1 Quantity (feet, centimetres, or number of lengths), \n3.1.2 Name of material (seamless austenitic steel pipe), \n3.1.3 Grade (Table 1), \n3.1.4 Size (nominal size, or outside diameter and schedule \nnumber or average wall thiclmess), \n3.1.5 Lengths (specific or random), (Permissible Variations \nin Length Section of Specification A999/ A999M), \n3.1.6 End finish (Ends Section of Specification A999/ \nA999M), \n3.1.7 Optional requirements (Section 8) (see Hydrostatic \nTest Requirements Section and the Permissible Variation in \nWeight for Seamless Pipe Section for weighing individual \nlengths, of Specification A999/A999M), (see 9.6, repairing by \nwelding; 13.3, die stamping), ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0690.json",
  "tabulaTablesCsv": "tables_tabula/page-0690.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0690.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3613,
  "bestTextAlphaRatio": 0.7706
}