{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 634,
  "globalPageIndex": 1432,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-859/SA-859M (ASTM A859/A859M) ASME BPVC.II.A-2025 \ntest specimens as specified by the purchaser in accordance with \n6.3. However, since the drop-weight specimen can be taken in \nany orientation, the fracture plane of the specimen when tested \nto Method 2 (see 6.3.2) shall be a minimum distance of 7/16 in. \n[10 mm] from the nearest quenched surface, and 1 V2 in. \n[40 mm] from any second surface. The purchaser may specify \neither duplicate no-break performance when tested 10 °F \n[5 °C] warmer than a specified temperature or request a \ndetermination of the Nil-Ductility temperature. \nS8. Rings and Hollow Cylindrically-Shaped Parts \nSS.l Tests shall be removed in the tangential (circumferen­\ntial) direction regardless of the direction of maximum working. \nS9. Alternative Test Specimen Orientation \nS9.1 The longitudinal axis of all test specimens shall be \noriented in a direction transverse to the direction of maximum \nworking of the forging. \nSlO. Dynamic Tear Test \nS 10.1 For Grade B material, dynamic tear testing shall be \ncarried out in accordance with Test Method E604. Unless \notherwise specified by the purchaser the test temperature shall \nbe -20 ± 3 °F [-30 ± 2 °C]. Acceptance criteria shall be in \naccordance with the purchase order requirements. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. lndiVidual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n1370 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1432.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2810,
  "bestTextAlphaRatio": 0.7566
}