{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 441,
  "globalPageIndex": 1239,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-703/SA-703M \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA800/ A800M Practice for Steel Casting, Austenitic Alloy, \nEstimating Ferrite Content Thereof \nA802/A802M Practice for Steel Castings, Surface Accep­\ntance Standards, Visual Examination \nA903/ A903M Specification for Steel Castings, Surface Ac­\nceptance Standards, Magnetic Particle and Liquid Pen­\netrant Inspection \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA967/A967M Specification for Chemical Passivation Treat­\nments for Stainless Steel Parts \nA990/A990M Specification for Castings, Iron-Nickel­\nChromium and Nickel Alloys, Specially Controlled for \nPressure-Retaining Parts for Corrosive Service \nA991/A991M Test Method for Conducting Temperature \nUniformity Surveys of Furnaces Used to Heat Treat Steel \nProducts \nA995/A995M Specification for Castings, Austenitic-Ferritic \n(Duplex) Stainless Steel, for Pressure-Containing Parts \nAl058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nA1067/A1067M Specification for Test Coupons for Steel \nCastings \nA1080 Practice for Hot Isostatic Pressing of Steel, Stainless \nSteel, and Related Alloy Castings \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE94/E94M Guide for Radiographic Examination Using In­\ndustrial Radiographic Film \nE125 Reference Photographs for Magnetic Particle Indica­\ntions on Ferrous Castings \nE165/E165M Practice for Liquid Penetrant Examination for \nGeneral Industry \nE186 Reference Radiographs for Heavy-Walled (2 to 4½ in. \n(50.8 to 114 mm)) Steel Castings \nE208 Test Method for Conducting Drop-Weight Test to \nDetermine Nil-Ductility Transition Temperature of Fer­\nritic Steels \nE280 Reference Radiographs for Heavy-Walled (4½ to 12 \nin. (114 to 305 mm)) Steel Castings \nE340 Practice for Macroetching Metals and Alloys \nE353 Test Methods for Chemical Analysis of Stainless, \nHeat-Resisting, Maraging, and Other Similar Chromium­\nNickel-Iron Alloys \nE354 Test Methods for Chemical Analysis of High­\nTemperature, Electrical, Magnetic, and Other Similar Iron, \nNickel, and Cobalt Alloys \nE446 Reference Radiographs for Steel Castings Up to 2 in. \n(50.8 mm) in Thickness \nE709 Guide for Magnetic Particle Testing \n2.2 ANSI Standard: \nB16.5 Pipe Flanges and Flanged Fittings \n2.3 Standards of the Manufacturers Standardization Society \nof the Valve and Fitting Industry: \nMSS SP 53 Quality Standard for Steel Castings and Forg­\nings for Valves, Flanges, and Fittings and Other Piping \nComponents (Magnetic Particle Exam Method) \nMSS SP 54 Quality Standard for Steel Castings for Valves, \nFlanges, and Fittings and Other Piping Components (Ra­\ndiographic Examination Method) \n3. Terminology \n3.1 Definitions: \n3.1.1 The definitions in Test Methods and Definitions A370, \nTerminology A941, and Test Methods Al058 are applicable to \nthis specification and to those listed in 1. 1. \n3.1.2 chaplet, n-a chaplet is a metallic support placed in a \nmold cavity to maintain the spacing between a core and the \nmold. \n3.1.3 electronic data interchange (EDI), n-the computer­\nto-computer exchange of business information in a standard \nformat such as ANSI ASC X12. \n3.1.4 heat, n-all the molten metal poured from a single \nfurnace or all the molten metal from two or more furnaces \npoured into a single ladle or casting prior to the replenishing of \nthe fumace(s). \n3.1.5 internal chill, n-an internal chill is a metallic device \nplaced in a mold cavity to increase the rate of heat removal at \nthat location. \n3.1.6 test coupon, n-the part from which the test specimen \nwill be extracted. \n3.1.7 test specimen, n-the part that will be acted upon in a \nmechanical test. \n4. Materials and Manufacture \n4.1 Melting Process-The steel shall be made by open­\nhearth or electric-furnace process, with or without separate \nrefining such as argon-oxygen-decarburization (AOD), unless \notherwise designated by the individual specification. \n4.2 Heat Treatment: \n4.2.1 Ferritic and martensitic steel shall be cooled after \npouring to provide substantially complete transformation of \naustenite prior to heat treatment to enhance mechanical prop­\nerties. \n4.2.2 Castings shall be heat treated in the working zone of a \nfumace that has been surveyed in accordance with Test Method \nA991/A991M. \n4.2.2.1 When castings are heat treated at temperatures \nabove 2000 °F [1100 °C], then the working zone shall have \nbeen established by a survey performed at not more than 25 °F \n[15 °C] below nor more than 200 °F [110 °C] above the \nminimum heat treatment temperature specified for the grade. If \na minimum heat treatment temperature is not specified for the \ngrade, then the survey temperature shall be not more than 50 °F \n1153 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1239.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4818,
  "bestTextAlphaRatio": 0.7526
}