{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 499,
  "globalPageIndex": 1297,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-749/SA-749M \nfor press-work operations or welding. Hot-rolled and hot­\nrolled descaled strip are not generally used for exposed \nparts where surface is of prime importance. However, hot­\nrolled surface might be of importance, as in the case of \nweathering steels for exposed parts. \n9.1.1 Hot-rolled strip can be supplied with mill \nedges, square edges, or cut (slit) edges as specified. \n9.1.1.1 Mill edges are the natural edges resulting \nfrom the hot-rolling operation and are generally round and \nsmooth without any definite contour. \n9.1.1.2 Square edges are the edges resulting from \nrolling through vertical edging rolls during the hot-rolling \noperations. These edges are square and smooth, with the \ncomers slightly rounded. \n9.1.1.3 Cut (slit) edges are the normal edges that \nresult from the shearing, slitting, or trimming of mill edges. \n9.1.2 The ends of plain hot-rolled mill-edge coils \nare irregular in shape and are referred to as uncropped \nends. Where such ends are not acceptable, the purchaser's \norder should so specify. Processed coils such as pickled \nor blast cleaned are supplied with square-cut ends. \n9.2 Oiling: \n9.2.1 Plain hot-rolled strip is customarily furnished \nnot oiled. Oiling must be specified when required \n9.2.2 Hot-rolled pickled or descaled strip is custom­\narily furnished oiled. If the product is not to be oiled, it \nmust be so specified since the cleaned surface is prone to \nrusting. \n10. General Requirements for Delivery \n10.1 Products covered by this specification are pro­\nduced to inch-pound or metric decimal thickness only. \n10.2 Steel may be produced as ingot-cast or strand­\ncast. When different grades of strand-cast steel are sequen­\ntially cast, identification and separation of the transition \nmaterial is required. \n11. Retests \n11.1 If any test specimen shows defective machining or \ndevelops flaws, it must be discarded and another specimen \nsubstituted. \n11.2 If the percentage of elongation of any tension test \nspecimen is less than that specified and any part of the \nfracture is more than [nl]P in. [20 mm] from the center of \nthe gage length of a 2 in. [50 mm] specimen or is outside \nthe middle half of the gage length of an 8 in. [200 mm] \nspecimen, as indicated by scribe scratches marked on the \nspecimen before testing, a retest is allowed. \n11.3 If a bend specimen fails, due to conditions of \nbending more severe than required by the specification, a \nretest is permitted either on a duplicate specimen or on a \nremaining portion of the failed specimen. \n12. Inspection \n12.1 When the purchaser's order stipulates that inspec­\ntion and test (except product analyses) for acceptance on \nthe steel be made prior to shipment from the mill, the \nmanufacturer shall afford the purchaser's inspector all rea­\nsonable facilities to satisfy him that the steel is being pro­\nduced and furnished in accordance with the specification. \nMill inspection by the purchaser shall not interfere unneces­\nsarily with the manufacturer's operation. \n13. Rejection and Rehearing \n13.1 Unless otherwise specified, any rejection shall be \nreported to the manufacturer within a reasonable time after \nreceipt of material by the purchaser. \n13.2 Material that is reported to be defective subsequent \nto the acceptance at the purchaser's works shall be set \naside, adequately protected, and correctly identified. The \nmanufacturer shall be notified as soon as possible so that \nan investigation may be initiated. \n13.3 Samples that are representative of the rejected \nmaterial shall be made available to the manufacturer. In \nthe event that the manufacturer is dissatisfied with the \nrejection, he may request a rehearing. \n14. Test Reports and Certification \n14.1 When test reports are required by the purchase \norder or the material specification, the supplier shall report \nthe results of all tests required by the material specification \nand the order. \n14.2 When certification is required by the purchase \norder, the supplier shall furnish a certification that the \nmaterial has been manufactured and tested in accordance \nwith the requirements of the material specification. \n14.3 A signature is not required on test reports or \ncertifications. However, the document shall clearly identify \nthe organization submitting the document. Notwithstand­\ning the absence of a signature, the organization submitting \nthe document is responsible for the content of the doc­\nument. \n14.4 When test reports are required, copies of the origi­\nnal material manufacturer's test report shall be included \nwith any subsequent test report. \n14.5 A material test report, certificate of inspection, or \nsimilar document printed from or used in electronic form \n1225 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1297.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4728,
  "bestTextAlphaRatio": 0.775
}