{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 632,
  "globalPageIndex": 632,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-369/SA-369M (ASTM A369/A369M) ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified in the \npurchase order. The purchaser may specify a different frequency of test or analysis than is provided \nin the supplementary requirement. Subject to agreement between the purchaser and manufacturer, \nretest and retreatment provisions of these supplementary requirements may also be modified. \nSl. Additional Tension Test \nS 1. 1 An additional tension test shall be made on a specimen \nfrom one or each end of each pipe. If this supplementary \nrequirement is specified, the number of tests per pipe required \nshall be specified. If a specimen from any length fails to meet \nthe required tensile properties (tensile, yield, and elongation), \nthat length shall be rejected subject to retreatment in accor­\ndance with Specification A999/ A999M and satisfactory retest. \nS2. Additional Flattening or Bend Tests \nS2. l The appropriate flattening or bend test may be made on \nspecimens from both ends of each length of pipe. Crop ends \nmay be used. If the specimen from either end of any length \nfails to conform to the specific requirement, that length shall be \nrejected. \nS3. Ultrasonic Tests \nS3.1 Each pipe shall be ultrasonically tested to determine its \nsoundness throughout the entire length of the pipe. Until \nsuitable standards are established, the basis for rejection of \nmaterial shall be a matter of agreement between the manufac­\nturer and purchaser. \nS4. Hydrostatic Test \nS4.1 A hydrostatic pressure test shall be applied as agreed \nupon by the manufacturer and purchaser. \nSS. Metal Structure and Etching Tests \nS5.l The steel shall be homogeneous as shown by etching \ntests conducted in accordance with the appropriate portions of \nMethod E381. Etching tests shall be made on a cross section \nfrom one end or both ends of each pipe and shall show sound \nand reasonably uniform material free of injurious laminations, \ncracks, and similar objectionable defects. If this supplementary \nrequirement is specified, the number of tests per pipe required \nshall also be specified. If a specimen from any length shows \nobjectionable defects, the length shall be rejected, subject to \nremoval of the defective end and subsequent retests indicating \nthe remainder of the length to be sound and reasonably uniform \nmaterial. \nS6. Alternative Heat Treatment-Grades FP91 Type 1 \nand Type 2 and FP92 \nS6.1 Grades FP91 Type 1 and Type 2 and FP92 shall be \nnormalized in accordance with 5.4.3 or 5.4.4, respectively, and \ntempered at a temperature, to be specified by the purchaser, \nless than 1350 °F [730 °C]. It shall be the purchaser's \nresponsibility to subsequently temper in the range of 1350 to \n1470 °F [730 to 800 °C]. All mechanical tests shall be made on \nmaterial heat treated in accordance with 5.4.3 or 5.4.4, respec­\ntively. The certification shall reference this supplementary \nrequirement indicating the tempering temperature applied. The \nnotation \"S6'' shall be included with the required marking of \nthe pipe. \nS7. Minimum Cooling Rate for Grade P91 Type 2 \nS7.1 For Grade P91 Type 2 material, the heat treatment shall \nensure that following austenitizing the rate of cooling from \n1650 °F to 900 °F [900 °C to 480 °C] is no slower than 9 \n°F/min [5 °C/ min]. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue \n(A369/A369M-18a) that may impact the use of this standard. (Approved May 1, 2023.) \n( 1) Revised 1.3. \n(2) Revised 3.1.8. \n580 \n(3) Added Supplementary Requirement S7. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0632.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3643,
  "bestTextAlphaRatio": 0.7538
}