{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 614,
  "globalPageIndex": 614,
  "width": 638.88,
  "height": 874.32,
  "text": "SA-354 ASME BPVC.II.A-2025 \nTABLE 4 Mechanical Requirements for Machined Specimens \nTensile Yield Strength Elonga- Reduc-\nStrength (0.2 % offset), lion in lion \nGrade Size, in. min, psi min, psi 2 in. of \nmin,% Area, \nmin,% \nBC ¼to2½, incl 125 000 109 000 16 50 \nBC Over2½ 115 000 99 000 16 45 \nBD ¼to 2½, incl 150 000 130 000 14 40 \nBD Over2½ 140 000 115 000 14 40 \neffective it is essential that secondary processors, distributors, \nand purchasers maintain the identification and integrity of each \nlot until the product is installed. \n9.3 Lot Processing-All fasteners shall be processed in \naccordance with a lot identification-control quality assurance \nplan. The manufacturer, secondary processors, and distributors \nshall identify and maintain the integrity of each lot of fasteners \nfrom raw-material selection through all processing operations \nand treatments to final packing and shipment. Each lot shall be \nassigned its own lot-identification number, each lot shall be \ntested, and the inspection test reports for each lot shall be \nretained. \n9.4 Lot Definition-A lot is a quantity of a uniquely identi­\nfied fastener product of the same nominal size and length \nproduced consecutively at the initial operation from a single \nmill heat of material and heat treatment lot and processed at \none time, by the same process, in the same manner so that \nstatistical sampling is valid. The identity of the lot is main­\ntained throughout all subsequent operations and packaging. \n9 .5 Number of Tests~ The minimum number of tests from \neach production lot for the tests specified below shall be in \naccordance with Guide F1470. \nHardness \nTensile \nProof Load \nCoating Weight/Thickness \nWorkmanship (Surface \nDiscontinuities Section 8) \n9.5.1 The number of tests for dimensional and thread fit \ncompliance shall be in accordance with the quality assurance \nprovisions of the referenced dimensional standards. \n9.6 If any test specimen shows defective machining it may \nbe discarded and another specimen substituted. \n10. Test Methods \n10.1 Test methods shall be conducted in accordance with \nTest Methods F606. \n10.2 Proof load, rather than yield strength determination is \npreferred and shall be the arbitration method for fasteners 1 ¼ \nin. and under in diameter. \n10.3 Hexagon bolts shall be tested by the wedge tension \nmethod. Fracture shall be in the body or threads of the bolt \nwithout any fracture at the junction of the head and body. \n10.3.1 At the option of the manufacturer, the yield strength \ntest (Method 2, Yield Strength paragraph of Test Methods \nF606) and the wedge tension test (Wedge Tension Testing of \nFull-Size Product paragraph, both from the Test Method \nsection of Test Methods F606) may be accomplished concur- \"-\nrently to satisfy 10.2 and 10.3. \n10.4 Studs and bolts other than those in 10.3 shall be tested \nby the axial tension method. \n10.4.1 At the option of the manufacturer, the yield strength \ntest and the axial tension test may be accomplished concur­\nrently to satisfy 10.2 and 10.4. \n10.5 The speed of testing determined with a free running \ncrosshead shall be a maximum of 1/s in. (3.2 mm)/min for the \nbolt proof load (or yield strength) determination and a maxi­\nmum of 1 in. (25.4 mm)/min for the tensile strength determi­\nnation. \n11. Inspection \n11.1 If the inspection described in 11.2 is required by the \npurchaser, it shall be specified in the inquiry and contract or \npurchase order. \n11.2 The inspector representing the purchaser shall have \nfree entry to all parts of the manufacturer's works that concern \nthe manufacture of the material ordered. The manufacturer \nshall afford the inspector all reasonable facilities to satisfy him \nthat the material is being furnished in accordance with this \nspecification. All tests and inspections required by the specifi­\ncation that are requested by the purchaser's representative shall \nbe made before shipment, and shall be conducted as not to \ninterfere unnecessarily with the operation of the works. \n12. Responsibility \n12.1 The party responsible for the fastener shall be the \norganization that supplies the fastener to the purchaser. \n13. Rejection and Rehearing \n13.l Material that fails to conform to the requirements of \nthis specification may be rejected. Rejection should be reported \nto the producer or supplier promptly and in writing. In case of \ndissatisfaction with the results of the test, the producer or \nsupplier may make claim for a rehearing. \n562 \n14. Certification \n14.1 When specified on the purchase order, the manufac­\nturer or supplier, whichever is the responsible party in accor­\ndance with Section 12, shall furnish the purchaser a test report \nwhich includes the following: \n14.1.1 Product description, grade, quantity, ASTM Specifi­\ncation Number and issue date, \n14.1.2 Alloy grade (AlSI, SAE, UNS, etc.), heat analysis, \nand heat number, and type of quench, \n14.1.3 Results of hardness, tensile, and proof load tests, as \napplicable, \n14.1.4 Statement of compliance to Protective Coating \nSpecification (if applicable), \n14.1.5 Statement of compliance with the surface disconti­\nnuity requirements of Specification F788/F788M, \n14.1.6 Statement of compliance dimensionally, \n14.1.7 Report, describe, or illustrate manufacturer's mark­\nings and their location, \n14.1.8 Lot number, purchase order number, and date \nshipped, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0614.json",
  "tabulaTablesCsv": "tables_tabula/page-0614.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0614.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5357,
  "bestTextAlphaRatio": 0.7484
}