{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 234,
  "globalPageIndex": 234,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-134/SA-134M ASME BPVC.II.A-2025 \nmetal after bending. Cracks that originate along the edges of \nthe specimens during testing and that are less than ¼ in. [6 \nmm] in any direction, shall not be considered. \n10. Tensile Properties of Production Welds \n10.1 Reduced-section tension test specimens required in \nSection 8, taken perpendicularly across the weld with the weld \nreinforcement removed, shall show a tensile strength not less \nthan 95 % of the specified minimum strength of the steel. At \nthe manufacturer's option, the test may be made without \nremoving the weld reinforcement, in which case the tensile \nstrength shall be not less than the specified minimum tensile \nstrength for the grade of steel used. \n11. Hydrostatic.Test (Note 5) \n11.1 Each length of pipe shall be tested by the manufacturer \nto a hydrostatic pressure that will produce in the pipe wall a \nstress of 60 % of the specified minimum yield point of the steel \nused at room temperature. The pressure shall be determined by \nthe following equation: \nP = 2St/D \nwhere: \nP = minimum hydrostatic test pressure, psi (Note 6) (not to \nexceed 2800 psi [19 MPa]), \nS = 0.60 times the minimum specified yield point of the \nsteel used, psi [MPa], \nt = specified wall thickness, in. [mm], and \nD = specified outside diameter, in. [mm]. \nNoTE 5-A hydrostatic sizing operation is not to be considered a \nhydrostatic test or a substitute for it. \nNoTE 6-When the diameter and wall thickness of pipe are such that the \ncapacity limits of testing equipment are exceeded by these requirements, \nthe test pressures may be reduced by agreement between the purchaser and \nthe manufacturer. \n11.2 Test pressure shall be held for not less than 5 s, or for \na longer time as agreed upon between the purchaser and the \nmanufacturer. \nNoTE 7-When agreed upon between the purchaser and the manufac­\nturer and so stated on the order, pipe may be tested to one and one half \ntimes the specified working pressure, except that the maximum test \npressure shall not exceed 2800 psi [19 MPa] nor shall the maximum fiber \nstress exceed 85 % of specified minimum yield point of steel or to a fiber \nstress that does not exceed 85 % of the specified minimum yield point of \nthe steel or 2800-psi [19-MPa] test pressure. \n11.3 When specified in the order, pipe may be furnished \nwithout hydrostatic testing and each length so furnished shall \ninclude the mandatory marking of the letters \"NH.\" \nAdditionally, the certification, when required, shall state \"Not \nHydrostatically Tested\" and the specification number and \nmaterial grade, as shown on the certification, shall be followed \nby the letters \"NH.\" \n12. Permissible Variations in Weights and Dimensions \n12.1 Thickness and Weight-The wall thickness and weight \nfor welded pipe under this specification shall be governed by \nthe requirements of the specifications to which the steel was \nordered. \n182 \n12.2 Circumference-The outside circumference of the pipe \nshall not vary more than ±0.5 % from the nominal outside \ncircumference based upon the diameter specified, except that \nthe circumference at ends shall be sized, if necessary, to meet \nthe requirements of Section 14. \n12.3 Straightness-Finished pipe shall be commercially \nstraight. When specific straightness requirements are desired, \nthe order should so state, and the tolerances shall be a matter of \nagreement between the purchaser and the manufacturer. \n12.4 Ovality-Out-of-roundness-The difference between \nmajor and minor outside diameter shall not exceed 1 %. Closer \ntolerances may be established by agreement between the \nmanufacturer and the purchaser. Where the D/I' ( outside \ndiameter/wall thickness) is over 120, internal bracing should be \nutilized to achieve sizing of ends and ovality shall be by \nagreement between the manufacturer and purchaser. \n13. Lengths \n13.1 Pipe lengths shall be supplied in accordance with the \nfollowing regular practice: \n13.1.1 The lengths shall be as specified on the order with a \ntolerance of±½ in. [13 mm], except that the shorter lengths \nfrom which test coupons have been cut may also be shipped. \n13.1.2 When random lengths are specified, pipe shall be \nfurnished in lengths having a minimum average of 29 ft [9 m] \nwith a minimum length of 20 ft [6 m], but not more than 5 % \nmay be under 25 ft [8 m]. \n13.2 Pipe lengths containing circumferentially welded joints \n(Note 8) shall be permitted by agreement between the manu­\nfacturer and the purchaser. Tests of these welded joints shall be \nmade in accordance with the procedure tests specified in \nSection 9 and the production weld tests specified in Section 10. \nThe number of production weld tests shall be one per each lot \nof 100 joints or fraction thereof, but not less than one for each \nwelder or welding operator. \nNoTE 8-Joints are defined for the purpose of this specification as a \ncircumferential welded seam lying in one plane, used to join lengths of \nstraight pipe. \n14. Ends \n14.1 Pipe shall be furnished with a plain right-angle cut or \nwith bevel ends as specified. All burrs at the ends of pipe shall \nbe removed. \n14.1.1 Unless otherwise specified, pipe with beveled ends \nshall meet the requirements of ANSI B 16.25. \n14.2 Unless otherwise specified, the outside circumference \nof pipe ends for a distance of not less than 4 in. [100 mm] shall \nnot vary more than ± 60 % of the nominal wall thickness of the \npipe from the nominal outside circumference based on the \ndiameter specified, except that the tolerance shall not be less \nthan ± 3/16 in. [5 mm]. \n14.3 By agreement between the manufacturer and the pur­\nchaser the ends of the pipe may be sized within agreed-upon \ntolerances if necessary to meet the requirements of special \ninstallations. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0234.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5739,
  "bestTextAlphaRatio": 0.7578,
  "noteOcrPath": "note_ocr/page-0234.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 6—When the diameter and wall thickness of pipe are such that the"
  ]
}