{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 514,
  "globalPageIndex": 514,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-312/SA-312M (ASTM A312/A312M) ASME BPVC.II.A-2025 \nS4. Etching Tests \nS4.1 The steel shall be homogeneous as shown by etching \ntests conducted in accordance with the appropriate portions of \nMethod E381. Etching tests shall be made on a cross section \nfrom one end or both ends of each pipe and shall show sound \nand reasonably uniform material free of injurious laminations, \ncracks, and similar objectionable defects. If this supplementary \nrequirement is specified, the number of tests per pipe required \nshall also be specified. If a specimen from any length shows \nobjectionable defects, the length shall be rejected, subject to \nremoval of the defective end and subsequent retests indicating \nthe remainder of the length to be sound and reasonably uniform \nmaterial. \nS5. Radiographic Examination \nS5.l The entire length of weld in each double welded pipe \nshall be radiographically examined, using X-radiation, in \naccordance with Paragraph UW-51 of Section VIII Division 1 \nof the ASME Boiler and Pressure Vessel Code. In addition to \nthe marking required by Section 13 each pipe shall be marked \n\"RT\" after the specification and grade. Requirements of S5 \nshall be required in the certification. \nS6. Stabilizing Heat Treatment \nS6.1 Subsequent to the solution anneal required in 6.2, \nGrades TP309HCb, TP310HCb, TP321, TP321H, TP347, \nTP347H, TP348, and TP348H shall be given a stabilization \nheat treatment at a temperature lower than that used for the \ninitial solution annealing heat treatment. The temperature of \nstabilization heat treatment shall be as agreed upon between the \npurchaser and vendor. \nS7. Intergranular Corrosion Test \nS7.l When specified, material shall pass intergranular cor­\nrosion tests conducted by the manufacturer in accordance with \nPractices A262, Practice E. \nS7 .1.1 Practice E requires testing on the sensitized condi­\ntion for low carbon or stabilized grades, and on the as-shipped \ncondition for other grades. The applicability of this test and the \npreparation of the sample for testing for grades containing \ngreater than 3 % molybdenum shall be as agreed by the \npurchaser and manufacturer. \nNorn S7.1-Practice E requires testing on the sensitized condition for \nlow carbon or stabilized grades, and on the as-shipped condition for other \ngrades. \nS7.2 A stabilization heat treatment in accordance with \nSupplementary Requirement S6 may be necessary and is \npermitted in order to meet this requirement for the grades \ncontaining titanium or columbium, particularly in their H \nversions. \nS8. Minimum Wall Pipe \nS8.1 When specified by the purchaser, pipe shall be fur­\nnished on a minimum wall basis. The wall of such pipe shall \nnot fall below the thickness specified. In addition to the \nmarking required by Section 17, the pipe shall be marked S8. \nS9. Weld Decay Test \nS9 .1 When specified in the purchase order, one sample from \neach lot of pipe shall be subject to testing in a boiling solution \nof 50 % reagent grade hydrochloric acid and 50 % water. \nS9.2 The sample, of approximately 2-in. [50-mm] length, \nshall be prepared from a production length of pipe. Depending \non the size of the pipe, it is permitted to section the sample \nlongitudinally to allow it to fit in the Erlenmeyer flask. As a \nminimum, the tested sample shall include the entire weld and \nadjacent area and the full length of base metal 180° across from \nthe weld. All burrs and sharp edges shall be removed by light \ngrinding. Dust and grease shall be removed by cleaning with \nsoap and water or other suitable solvents. \nS9.3 The hydrochloric acid solution shall be prepared by \nslowly adding reagent grade (approximately 37 %) hydrochlo­\nric acid to an equal volume of distilled water. \nWarning-Protect eyes and use rubber gloves when han­\ndling acid. Mixing and testing shall be performed in a \nprotective enclosure. \nS9.4 The test container shall be a 1-L Erlenmeyer flask \nequipped with ground-glass joints and an Ahline condenser. \nThe volume of the solution shall be approximately 700 mL. \nS9.5 The thickness of the weld and the base metal 180° \nfrom the weld shall be measured near both ends of the sample. \nThese measurements shall be made with a micrometer with an \nanvil shape suitable for measuring the thickness with an \naccuracy to at least 0.001 in. [0.025 mm]. \nS9.6 The sample sections, both weld and base metal, shall \nbe immersed in the flask containing the solution. Boiling chips \nshall be added and the solution brought to a boil. Boiling shall \nbe maintained through the duration of the test. The time of \ntesting shall be that which is required to remove 40 to 60 % of \nthe original base metal thickness (usually 2 h or less). If more \nthan 60 % of the base metal thickness remains, it is permitted \nto terminate the test after 24 h. \n462 \nS9.7 At the end of the test period, the samples shall be \nremoved from the solution, rinsed with distilled water, and \ndried. \nS9.8 The thickness measurements as in S9.5 shall be re­\npeated. The anvil shape of the micrometer used shall be \nsuitable for measuring the minimum remaining thickness with \nan accuracy to at least 0.001 in. [0.025 mm]. \nS9.9 The corrosion ratio, R, shall be calculated as follows: \nW)l(B 0 - B) \nwhere: \nW 0 = average weld-metal thickness before the test, \nW = average weld-metal thickness after the test, \nB 0 = average base-metal thickness before the test, and \nB = average base-metal thickness after the test, \nS9.9.1 The corrosion ratio for HCW pipe shall be as \nspecified in 11.5. \nS9.9.2 The corrosion ratio shall be 1.25 or less, or as further \nrestricted in the purchase order, when the weld decay test is \nspecified for welded (WLD) pipe. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0514.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5674,
  "bestTextAlphaRatio": 0.7585
}