{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 328,
  "globalPageIndex": 328,
  "width": 615.84,
  "height": 856.2,
  "text": "SA-Z10/SA-Z10M (ASTM AZ10/AZ10M) ASME BPVC.II.A-Z0Z5 \nTABLE 4 Computed Minimum Elongation Values \nWall Thickness, in. [mm] \n5/16 (0.312) [8] \n%2 (0.281) [7.2] \n¼ (0.250) (6.4] \n7 /32 (0.219) [5.6] \n3 A, (0.188) (4.8] \n%2 (0.156) [4] \n1;, (0.125) (3.2] \n%2 (0.094) [2.4] \n1/,a (0.062) [1.6] \n0.062 to 0.035 (1.6 to 0.9], excl \n0.035 to 0.022 (0.9 to 0.6], excl \n0.022 to 0.D15 (0.6 to 0.4], incl \nElongation in 2 in. or \n50 mm, min, % A \n30 \n28 \n27 \n26 \n24 \n22 \n21 \n20 \n18 \n17 \n16 \n16 \nA Calculated elongation requirements shall be rounded to the nearest whole \nnumber. \n12.5 Hydrostatic or Nondestructive Electric Test-Each \ntube shall be subjected to the hydrostatic, or, instead of this \ntest, a nondestructive electric test may be used when specified \nby the purchaser. \n13. Forming Operations \n13.1 When inserted in the boiler, tubes shall stand ex­\npanding and beading without showing cracks or flaws. When \nproperly manipulated, superheater tubes shall stand all forging, \nwelding, and bending operations necessary for application \nwithout developing defects. \n14. Product Marking \n14.1 In addition to the marking prescribed in Specification \nA450/A450M, the marking shall indicate whether the tube is \nhot-finished or cold-finished. \n14.2 Bar Coding-In addition to the requirements in 14.1 \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. \n15. Keywords \n15.1 boiler tubes; carbon; seamless steel tube; steel tube; \nsuperheater tubes \nSUMMARY OF CHANGES \nCommittee A0l has identified, the location of selected changes to this specification since the last issue, \nA210/A210M-02 (2012), that may impact the use of this specification. (Approved May 1, 2019.) \n(1) Scope was expanded to include grades. \n(2) Hardness values were aligned to match changes in A370 \nSections 16-18 rep01iing of hardness values. \nASTM International takes no position respecting the validity of any patent rights asserted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that determination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed eve,y five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headquarters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n276 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0328.json",
  "tabulaTablesCsv": "tables_tabula/page-0328.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0328.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3347,
  "bestTextAlphaRatio": 0.714,
  "camelotTablesPath": "camelot_tables/page-0328.json",
  "camelotTablesCsv": "camelot_tables/page-0328.csv",
  "camelotTableCount": 2
}