{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 67,
  "globalPageIndex": 67,
  "width": 626.4,
  "height": 803.04,
  "text": "ASME BPVC.II.A-2025 SA-6/SA-6M \n12.3.3 Shapes Having One Dimension of the Cross Section \n3 in. [75 mm] or Greater (Structural-Size Shapes)-The \ncross-sectional area or weight [mass] of each shape shall be \nwithin ±2.5 % of the theoretical or specified amounts except \nfor shapes with a nominal weight of less than 100 lb/ft [149 \nkg/m], in which the variation shall be within -2.5 % to +3.0 % \nof the theoretical cross-sectional area or the specified nominal \nweight [mass]. \n12.4 Sheet Piling-The weight [mass] of each steel sheet \npile shall be within ±2.5 % of the theoretical or specified \nweight [mass]. The length of each steel sheet pile shall be not \nless than the specified length, and not more than 5 in. [125 mm] \nover the specified length. \n12.5 Hot-Rolled Bars-The permitted variations in dimen­\nsions shall not exceed the applicable limits in Tables 26 to 31 \n[Annex Al, Tables Al.26 to Al.31] inclusive. \n12.6 Conversion of Permitted Variations from Fractions of \nan Inch to Decimals-Permitted variations in dimensions for \nproducts covered by this specification are generally given as \nfractions of an inch and these remain the official permitted \nvariations, where so stated. If the material is to be measured by \nequipment reporting dimensions as decimals, conversion of \npermitted variations froni fractions of an inch to decimals shall \nbe made to three decimal places; using the rounding method \nprescribed in Practice E29. \n13. Retests \n13.1 If any test specimen shows defective machining or \ndevelops flaws, the manufacturer or processor shall have the \noption of discarding it and substituting another test specimen. \n13.2 If the percentage of elongation of any tension test \nspecimen is less than that specified and any part of the fracture \nis more than ¾ in. [20 mm] from the center of the gage length \nof a 2-in. [50-mm] specimen or is outside the middle half of the \ngage length of an 8-in. [200-mm] specimen, as indicated by \nscribe scratches marked on the specimen before testing, a retest \nshall be allowed. \n13.3 Except as provided in 13.3.1, if the results from an \noriginal tension specimen fails to meet the specified \nrequirements, but are within 2 ksi [14 MPa] of the required \ntensile strength, within 1 ksi [7 MPa] of the required yield \nstrength or yield point, or within 2 percentage points of the \nrequired elongation, a retest shall be permitted to replace the \nfailing test. A retest shall be performed for the failing original \ntest, with the specimen being randomly selected from the heat. \nIf the results of the retest meet the specified requirements, the \nheat or lot shall be approved. \n13.3.1 For structural products that are tested as given in \nTable C, both tests from each coil tested to qualify a heat are \nrequired to meet all mechanical property requirements. Should \neither test fail to do so, then that coil shall not be used to \nqualify the heat; however, the portion of that individual coil \nthat is bracketed by acceptable tests (see 11.4.2.3) is considered \nto be qualified. \n13.4 Quenched and tempered steel plates shall be subject to \nany additional retest requirements contained in the applicable \nproduct specification. \n15 \n13.5 When the full-section option of 11.3.3 is used and the \nelongation falls below the specified requirement, the manufac­\nturer or processor shall have the option of making another test \nusing a test specimen permitted in 11.5.2. \n14. Test Reports \n14.1 Test reports for each heat supplied are required and \nthey shall report the following: \n14.1.1 The applicable product specification designation, \nincluding year-date and whichever of grade, class, and type are \nspecified in the purchase order, to which the structural product \nis furnished. \n14.1.2 The heat number, heat analysis (see 7.1), and nomi­\nnal sizes. \nNorn 8-If the amount of copper, chromium, nickel, molybdenum, or \nsilicon is less than 0.02 %, the heat analysis for that element may be \nreported as <0.02 %. If the amount of columbium (niobium) or vanadium \nis less than 0.008 %, the heat analysis for that element may be reported as \n<0.008 %. \n14.1.3 For structural products that are tested as given in \nTable B, two tension test results appropriate to qualify the \nshipment (see 11.4), except that only one tension test result \nneed be reported if the shipment consists of a single piece or \nplate-as-rolled. \n14.1.3.1 In reporting elongation values, both the percentage \nincrease and the original gage length shall be stated. \n14.1.3.2 Yield to tensile ratio when such a requirement is \ncontained in the product specification. \n14.1.4 For structural products that are required to be heat \ntreated, either by the applicable product specification or by the \npurchase order, all heat treatments, including temperature \nranges and times at temperature, unless the purchaser and the \nsupplier have agreed to the supply of a heat treatment proce­\ndure in place of the actual temperatures and times. \n14.1.4.1 Subcritical heat treatment to soften thermally cut \nedges need not be reported, except for structural products \nhaving a specified minimum tensile strength of 95 ksi [655 \nMPa] or higher, unless such subcritical heating is accomplished \nat temperatures at least 75°F [40°C] lower than the minimum \ntempering temperature. \n14.1.5 The results of any required austenitic grain size tests \n(see 8.2 or 8.3, whichever is applicable). \n14.1.6 The results of any other test required by the appli­\ncable product specification, the applicable supplementary \nrequirements, and the purchase order. \n14.2 The thickness of the structural product tested is not \nnecessarily the same as an individual ordered thickness, given \nthat it is the heat that is tested, rather than each ordered item. \nTests from specified thicknesses in accordance with 11.4 and \nencompassing the thicknesses in a shipment shall be sufficient \nfor qualifying the structural product in the shipment. Such test \nthicknesses are not required to be within previously tested and \nshipped thicknesses from the same heat. \n14.3 For structural products produced from coil that are \nsupplied in the as-rolled condition or have been heat treated by \nstress relieving only, the test report shall state \"Produced from ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0067.json",
  "tabulaTablesCsv": "tables_tabula/page-0067.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0067.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6237,
  "bestTextAlphaRatio": 0.7553
}