{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 772,
  "globalPageIndex": 1570,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-1011/SA-lOUM (ASTM A1011/A1011M) ASME BPVC.II.A-2025 \ncft Designation: A1011/A1011M-23 \n~ull 7 \nINTERNATIONAL \nStandard Specification for \nSteel, Sheet and Strip, Hot-Rolled, Carbon, Structural, High­\nStrength Low-Alloy, High-Strength Low-Alloy with Improved \nFormability, and Ultra-High Strength 1 \nThis standard is issued under the fixed designation AlOll/Al0llM; the number immediately following the designation indicates the \nyear of original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last \nreapproval. A superscript epsilon (s) indicates an editorial change since the last revision or reapproval. \nThis standard has been approved for use by agencies of the U.S. Department of Defense. \n1. Scope* \n1.1 This specification covers hot-rolled, carbon, structural, \nhigh-strength low-alloy, high-strength low-alloy with im­\nproved formability, and ultra-high strength steel sheet and strip, \nin coils and cut lengths. \n1.2 Hot rolled steel sheet and strip is available in the \ndesignations as listed in 4.1. \n1.3 This specification is not applicable to the steel covered \nby Specification A635/A635M. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards.-2 \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA568/A568M Specification for Steel, Sheet, Carbon, \nStructural, and High-Strength, Low-Alloy, Hot-Rolled and \nCold-Rolled, General Requirements for \n1 This specification is under the jurisdiction of ASTM Committee A0l on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.19 on Steel Sheet and Strip. \nCurrent edition approved May I, 2023. Published June 2023. Originally \napproved in 2000. Last previous edition approved in 2018 as AI0ll/AlOllM - 18a. \nDOI: 10.1520/AlOll_A!0llM-23. \n2 For referenced ASTM standards, visit the ASTM website, www.astm.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \nA635/A635M Specification for Steel, Sheet and Strip, \nHeavy-Thickness Coils, Hot-Rolled, Alloy, Carbon, \nStructural, High-Strength Low-Alloy, and High-Strength \nLow-Alloy with Improved Formability, General Require­\nments for \nA749/A749M Specification for Steel, Strip, Carbon and \nHigh-Strength, Low-Alloy, Hot-Rolled, General Require­\nments for \nA751 Test Methods and Practices for Chemical Analysis of \nSteel Products \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nE18 Test Methods for Rockwell Hardness of Metallic Ma­\nterials \n3. Terminology \n3.1 Definitions-For definitions of other terms used in this \nspecification refer to Terminology A941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.1 aging, n-loss of ductility with an increase in \nhardness, yield strength, and tensile strength that occurs when \nsteel, which has been slightly cold worked (such as by temper \nrolling) is stored for some time. \n3.2.1.1 Discussion-Aging also increases the tendency to­\nward stretcher strains and fluting. \n3.2.2 inclusion control, n-the process of reducing the \nvolume fraction of inclusions or modifying the shape of \ninclusions to improve formability, weldability, and machinabil­\nity. \n3.2.2.1 Discussion-Inclusions, especially those elongated \nduring the rolling process, create the conditions for initiating or \npropagating cracks when the material is stretched or bent \nduring the manufacture of a part (or both). The adverse effects \nof inclusions are minimized by reducing the content of \ninclusions in the steel or by altering the shape of inclusions \nthrough the use of additions during the steelmaking process \nthat change the elongated shape of the inclusions to less \nharmful small, well dispersed globular inclusions (or both). \n* A Summary of Changes section appears at the end of this standard \n1516 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1570.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4601,
  "bestTextAlphaRatio": 0.7694
}