{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 640,
  "globalPageIndex": 640,
  "width": 614.16,
  "height": 855.0,
  "text": "SA-370 ASME BPVC.II.A-2025 \nNorn 2-Many machines are equipped with stress-strain recorders for \nautographic plotting of stress-strain curves. It should be noted that some \nrecorders have a load measuring component entirely separate from the \nload indicator of the testing machine. Such recorders are calibrated \nseparately. \n8.3 Loading-It is the function of the gripping or holding \ndevice of the testing machine to transmit the load from the \nheads of the machine to the specimen under test. The essential \nrequirement is that the load shall be transmitted axially. This \nimplies that the centers of the action of the grips shall be in \nalignment, insofar as practicable, with the axis of the specimen \nat the beginning and during the test and that bending or \ntwisting be held to a minimum. For specimens with a reduced \nsection, gripping of the specimen shall be restricted to the grip \nsection. In the case of certain sections tested in full size, \nnonaxial loading is unavoidable and in such cases shall be \npermissible. \n8.4 Speed of Testing-The speed of testing shall not be \ngreater than that at which load and strain readings can be made \naccurately. In production testing, speed of testing is commonly \nexpressed: (l) in terms of free nmning crosshead speed (rate of \nmovement of the crosshead of the testing machine when not \nunder load), (2) in terms of rate of separation of the two heads \nof the testing machine under load, (3) in terms of rate of \nstressing the specimen, or (4) in terms of rate of straining the \nspecimen. The following limitations on the speed of testing are \nrecommended as adequate for most steel products: \nNorn 3-Tension tests using closed-loop machines (with feedback \ncontrol of rate) should not be performed using load control, as this mode \nof testing will result in acceleration of the crosshead upon yielding and \nelevation of the measured yield strength. \n8.4.1 Any convenient speed of testing may be used up to \none half the specified yield point or yield strength. When this \npoint is reached, the free-running rate of separation of the \ncrossheads shall be adjusted so as not to exceed 1/16 in. per min \nper inch of reduced section, or the distance between the grips \nfor test specimens not having reduced sections. This speed \nshall be maintained through the yield point or yield strength. In \ndetennining the tensile strength, the free-running rate of \nseparation of the heads shall not exceed ½ in. per min per inch \nof reduced section, or the distance between the grips for test \nspecimens not having reduced sections. In any event, the \nminimum speed of testing shall not be less than 1/10 the \nspecified maximum rates for determining yield point or yield \nstrength and tensile strength. \n8.4.2 It shall be permissible to set the speed of the testing \nmachine by adjusting the free running crosshead speed to the \nabove specified values, inasmuch as the rate of separation of \nheads under load at these machine settings is less than the \nspecified values of free running crosshead speed. \n8.4.3 As an alternative, if the machine is equipped with a \ndevice to indicate the rate of loading, the speed of the machine \nfrom half the specified yield point or yield strength through the \nyield point or yield strength may be adjusted so that the rate of \nstressing does not exceed 100 000 psi (690 MPa)/min. \nHowever, the minimum rate of stressing shall not be less than \n10 000 psi (70 MPa)/min. \n9. Test Specimen Parameters \n9.1 Selection-Test coupons shall be selected in accordance \nwith the applicable product specifications. \n9.1.1 Wrought Steels-Wrought steel products are usually \ntested in the longitudinal direction, but in some cases, where \nsize permits and the service justifies it, testing is in the \ntransverse, radial, or tangential directions (see Figs. 1 and 2). \n9.1.2 Forged Steels-For open die forgings, the metal for \ntension testing is usually provided by allowing extensions or \nprolongations on one or both ends of the forgings, either on all \nor a representative number as provided by the applicable \nproduct specifications. Test specimens are normally taken at \nmid-radius. Certain product specifications permit the use of a \nrepresentative bar or the destruction of a production part for \ntest purposes. For ring or disk-like forgings test metal is \nprovided by increasing the diameter, thickness, or length of the \nforging. Upset disk or ring forgings, which are worked or \nextended by forging in a direction perpendicular to the axis of \nthe forging, usually have their principal extension along \nconcentric circles and for such forgings tangential tension \nspecimens are obtained from extra metal on the periphery or \nend of the forging. For some forgings, such as rotors, radial \ntension tests are required. In such cases the specimens are cut \nor trepanned from specified locations. \n9.2 Size and Tolerances-Test specimens shall be (I) the \nfull cross section of material, or (2) machined to the form and \ndimensions shown in Figs. 3-6. The selection of size and type \nof specimen is prescribed by the applicable product specifica­\ntion. Full cross section specimens shall be tested in 8-in. \n(200 mm) gauge length unless otherwise specified in the \nproduct specification. \n9.3 Procurement of Test Specimens-Specimens shall be \nextracted by any convenient method taking care to remove all \ndistorted, cold-worked, or heat-affected areas from the edges of \nthe section used in evaluating the material. Specimens usually \nhave a reduced cross section at mid-length to ensure uniform \ndistribution of the stress over the cross section and localize the \nzone of fracture. \n588 \n9.4 Aging of Test Specimens-Unless otherwise specified, it \nshall be permissible to age tension test specimens. The time­\ntemperature cycle employed must be such that the effects of \nprevious processing will not be materially changed. It may be \naccomplished by aging at room temperature 24 to 48 h, or in \nshorter time at moderately elevated temperatures by boiling in \nwater, heating in oil or in an oven. \n9.5 Measurement of Dimensions of Test Specimens: \n9 .5 .1 Standard Rectangular Tension Test Specimens-These \nforms of specimens are shown in Fig. 3. To determine the \ncross-sectional area, the center width dimension shall be \nmeasured to the nearest 0.005 in. (0.13 mm) for the 8-in. (200 \nmm) gauge length specimen and 0.001 in. (0.025 mm) for the \n2-in. (50 mm) gauge length specimen in Fig. 3. The center \nthickness dimension shall be measured to the nearest 0.001 in. \nfor both specimens. \n9.5.2 Standard Round Tension Test Specimens-These \nforms of specimens are shown in Fig. 4 and Fig. 5. To \ndetermine the cross-sectional area, the diameter shall be ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0640.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6722,
  "bestTextAlphaRatio": 0.776
}