{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 698,
  "globalPageIndex": 698,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-387 /SA-387M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, Alloy Steel, Chromium­\nMolybdenum \n1. Scope \n1.1 This specification covers chromium-molybdenum alloy \nsteel plates intended primarily for welded boilers and pressure \nvessels designed for elevated temperature service. \n1.2 Plates are available under this specification in several \ngrades having different alloy contents as follows: \nNominal Nominal \nChromium Molybdenum \nGrade Content, % Content, % \n2 0~ 0~ \n12 1.00 0.50 \n11 1.25 0.50 \n22 2.25 1.00 \n21 3.00 ·1.00 \n5 5.00 0.50 \n9 9.00 1.00 \n91 9.00 1.00 \n1.3 Each grade except Grade 91 is available in two classes \nof tensile strength levels as defined in the Tensile Requirements \ntables. Grade 91 is available only as Class 2. Grade 91 consists \nof two types, with Type 2 differentiated from Type 1 by \nrequiring restricted composition for the enhancement of creep \nresistance. \nNorn I-Grade 911, previously covered by this specification, is now \ncovered by Specification Al017/Al0l7M. \n1.4 The maximum thickness of plates is limited only by the \ncapacity of the composition to meet the specified mechanical \nproperty requirements. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents. Therefore, each system mnst \n648 \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with this specifi­\ncation. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 AS1M Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \nA1017/A1017M µcoc,1rn~uLtuu for Pressure Vessel Plates, \nAlloy Steel, Chromium-Molybdenum-Tungsten \n2.2 AWS Specifications: \nA5.5/A5.5M Low-Alloy Steel Electrodes for Shielded Metal \nArc Welding \nA5.23/A5.23M Low-Alloy Steel Electrodes and Fluxes for \nSubmerged Arc Welding \nA5.28/A5.28M Low-Alloy Steel Electrodes and Rods for \nGas Shielded Arc Welding ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0698.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2743,
  "bestTextAlphaRatio": 0.7441
}