{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 38,
  "globalPageIndex": 38,
  "width": 613.92,
  "height": 793.2,
  "text": "CORRESPONDENCE WITH THE COMMITTEE \nGeneral \nASME codes and standards are developed and maintained by committees with the intent to represent the consensus of \nconcerned interests. Users of ASME codes and standards may correspond with the committees to propose revisions or \ncases, report errata, or request interpretations. Correspondence for this Section of the ASME Boiler and Pressure \nVessel Code (BPVC) should be sent to the staff secretary noted on the Section's committee web page, accessible at \nhttps://go.asme.org/CSCommittees. \nNOTE: See ASME BPVC Section II, Part D for guidelines on requesting approval of new materials. See Section II, Part C for guidelines on re­\nquesting approval of new welding and brazing materials (\"consumables\"). \nRevisions and Errata \nThe committee processes revisions to this Code on a continuous basis to incorporate changes that appear necessary or \ndesirable as demonstrated by the experience gained from the application of the Code. Approved revisions will be pub­\nlished in the next edition of the Code. \nIn addition, the committee may post errata and Special Notices at http://go.asme.org/BPVCerrata. Errata and Special \nNotices become effective on the date posted. Users can register on the committee web page to receive email notifications \nof posted errata and Special Notices. \nThis Code is always open for comment, and the committee welcomes proposals for revisions. Such proposals should \nbe as specific as possible, citing the paragraph number, the proposed wording, and a detailed description of the reasons \nfor the proposal, including any pertinent background information and supporting documentation. \nCases \n(a) The most common applications for cases are \n(1) to permit early implementation of a revision based on an urgent need \n(2) to provide alternative requirements \n(3) to allow users to gain experience with alternative or potential additional requirements prior to incorporation \ndirectly into the Code \n(4) to permit use of a new material or process \n(b J Users are cautioned that not all jurisdictions or owners automatically accept cases. Cases are not to be considered \nas approving, recommending, certifying, or endorsing any proprietary or specific design, or as limiting in any way the \nfreedom of manufacturers, constructors, or owners to choose any method of design or any form of construction that \nconforms to the Code. \n[c) The committee will consider proposed cases concerning the following topics only: \n(1) equipment to be marked with the ASME Single Certification Mark, or \n(2) equipment to be constructed as a repair/replacement activity under the requirements of Section XI \n[ d) A proposed case shall be written as a question and reply in the same format as existing cases. The proposal shall \nalso include the following information: \n(1) a statement of need and background information \n(2) the urgency of the case (e.g., the case concerns a project that is underway or imminent) \n(3) the Code Section and the paragraph, figure, or table number to which the proposed case applies \n(4) the editions of the Code to which the proposed case applies \n[e) A case is effective for use when the public review process has been completed and it is approved by the cognizant \nsupervisory board. Cases that have been approved will appear in the next edition or supplement of the Code Cases \nbooks, \"Boilers and Pressure Vessels\" or \"Nuclear Components.\" Each Code Cases book is updated with seven Supple­\nments. Supplements will be sent or made available automatically to the purchasers of the Code Cases books until the \nnext edition of the Code. Annulments of Code Cases become effective six months after the first announcement of the \nannulment in a Code Case Supplement or Edition of the appropriate Code Case book The status of any case is available \nat http://go.asme.org/BPVCCDatabase. An index of the complete list of Boiler and Pressure Vessel Code Cases and Nu­\nclear Code Cases is available at http://go.asme.org/BPVCC. \nxxxviii ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-0038.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4012,
  "bestTextAlphaRatio": 0.8016
}