{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 201,
  "globalPageIndex": 999,
  "width": 629.4,
  "height": 805.44,
  "text": "ASME BPVC.II.A-2025 SA-530 /SA-530M \nof the specification have not been completed. The purchaser \nmust certify that all requirements of the specification have been \ncompleted before removal of the letter (that is, X, Y, or Z). \n23.5 When certification is required for material that has not \nbeen hydrostatically tested, the certificate of test shall state \n\"Not hydrostatically tested\", and the letters \"NH\" shall be \nappended to the product specification number, material grade \nand class shown on the certificate. \n23.6 A material test report, certificate of compliance, or \nsimilar document printed from or used in electronic form from \nan electronic data interchange (EDI) transmission shall be \nregarded as having the same validity as a counterpart printed in \nthe certifier's facility. The content of the EDI transmitted \ndocument shall meet the requirements of the invoked ASTM \nstandard(s) and conform to any existing EDI agreement be­\ntween the purchaser and supplier. Notwithstanding the absence \nof a signature, the organization submitting the EDI transmis­\nsion is responsible for the content of the material test report. \n24. Inspection \n24.1 The inspector representing the purchaser shall have \nentry at all times while work on the contract of the purchaser \nis being performed, to all parts of the manufacturer's works \nthat concern the manufacture of the material ordered. The \nmanufacturer shall afford the inspector all reasonable facilities \nto satisfy him that the material is being furnished in accordance \nwith this specification. All required tests and inspection shall \nbe made at the place of manufacture prior to shipment, unless \notherwise specified, and shall be conducted so as not to \ninterfere unnecessarily with operation of the works. \n26.3 For anstenitic steel pipe, the marking paint or ink shall \nnot contain any harmful metal, or metal salts, such as zinc, \nlead, or copper, which cause corrosive attack on heating. \n26.4 Pipes which have been weld repaired in accordance \nwith 17.1 shall be marked WR. \n26.5 When it is specified that certain requirements of a \nspecification adopted by the ASME Boiler and Pressure Vessel \nCommittee are to be completed by the purchaser upon receipt \nof the material, the manufacturer shall indicate that all require­\nments of the specification have not been completed by a letter \nsuch as X, Y, or Z, immediately following the specification \nnumber. This letter may be removed after completion of all \nrequirements in accordance with the specification. An expla­\nnation of specification requirements to be completed is pro­\nvided in 25.1. \n26.6 Bar Coding-In addition to the requirements in 26.1, \n26.2, 26.3, 26.4 and 26.5, bar coding is acceptable as a \nsupplemental identification method. The purchaser may \nspecify in the order a specific bar coding system to be used. \n27. Packaging, Marking, and Loading \n27.1 When specified on the purchase order, packaging, \nmarking, and loading for shipment shall be in accordance with \nthe procedures of Practices A 700. \n28. Government Procurement \n28.1 When specified in the contract or order, the following \nrequirements shall be considered in the inquiry contract or \norder for agencies of the U.S. Government where scale free \npipe is required. These requirements shall take precedence if \n25. Rejection there is a conflict between these requirements and the product \n25.1 Each length of pipe received from the manufacturer specification. \nmay be inspected by the purchaser and, if it does not meet the 28.1.1 Pipe shall be ordered to nominal pipe size (NPS) and \nrequirements of the specification based on the inspection and schedule. Nominal pipe shall be as specified in ASME B36.10. \ntest method as outlined in the specification, the length may be 28.1.2 Responsibility for Inspection-Unless otherwise \nrejected and the manufacturer shall be notified. Disposition of specified in the contract or purchase order, the manufacturer is \nrejected pipe shall be a matter of agreement between the responsible for the performance of all inspection and test \nmanufacturer and the purchaser. requirements specified. The absence of any inspection require-\n~~~~---_-2---_-5---_-.2~P---_-ip-e-t--=-h-a-t--=-fa---:-il::-s--:i'-n-a-n-y-o--=f---:th---:e-f-=--o-rm---:-ir- 1 g~op-e-r-a---cti-on-s~or-1~· 11 -t~h-e~~men1s-in-the-spgG-ification-shalLnotrelie_ye the contractor of the \nprocess of installation and is found to be defective shall be set responsibility for ensming that all products or supplies submit-\naside and the manufacturer shall be notified for mutual ted to the Government for acceptance comply with all require-\nevaluation of the suitability of the pipe. Disposition of such ments of the contract. Sampling inspection, as part of the \npipe shall be a matter for agreement. manufacturing operations, is an acceptable practice to ascertain \n26. Product Marking \n26.1 Each length of pipe shall be legibly marked with the \nmanufacturer's name or brand, the specification number (year \nof issue not required) and grade. Marking shall begin approxi­\nmately 12 in. [300 mm] from the end of each length of pipe. \nFor pipe less than NPS 2 [DN 50] and pipe under 3 ft [1 m] in \nlength, the required infmmation may be marked on a tag \nsecurely attached to the bundle or box in which the pipes are \nshipped. \n26.2 When pipe marked as specified is rejected, the ASTM \ndesignation shall be cancelled. \n899 \nconformance to requirements, however, this does not authorize \nsubmission of known defective material, either indicated or \nactual, nor does it commit the Government to accept the \nmaterial. Except as otherwise specified in the contract or \npurchase order, the manufacturer may use his own or any other \nsuitable facilities for the performance of the inspection and test \nrequirements unless disapproved by the purchaser at the time \nthe order is placed. The purchaser shall have the right to \nperform any of the inspections and tests set forth when such \ninspections and tests are deemed necessary to ensure that the \nmaterial conforms to the prescribed requirements. \n28.1.3 Sampling for Flattening and Flaring Test and for \nVisual and Dimensional Examination-Minimum sampling for ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0999.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6203,
  "bestTextAlphaRatio": 0.774
}