{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 636,
  "globalPageIndex": 636,
  "width": 620.76,
  "height": 859.92,
  "text": "SA-370 ASME BPVC.II.A-2025 \nTest Methods and Definitions for \nMechanical Testing of Steel Products \n1. Scope \n1. 1 These test methods cover procedures and definitions \nfor the mechanical testing of steels, stainless steels, and related \nalloys. The various mechanical tests herein described are used \nto determine properties required in the product specifications. \nVariations in testing methods are to be avoided, and standard \nmethods of testing are to be followed to obtain reproducible \nand comparable results. In those cases in which the testing \nrequirements for certain products are unique or at variance with \nthese general procedures, the product specification testing \nrequirements shall control. \n1.2 The following mechanical tests are described: \nTension \nBend \nHardness \nBrinell \nRockwell \nPortable \nImpact \nKeywords \nSections \n7 to 14 \n15 \n16 \n17 \n18 \n19 \n20 to 30 \n32 \n1.3 Annexes covering details peculiar to certain products \nare appended to these test methods as follows: \nBar Products \nTubular Products \nFasteners \nRound Wire Products \nSignificance of Notched-Bar Impact Testing \nConverting Percentage Elongation of Round Specimens to \nEquivalents for Flat Specimens \nAnnex \nAnnex A1 \nAnnex A2 \nAnnex A3 \nAnnex A4 \nAnnex AS \nAnnexA6 \nTesting Multi-Wire Strand \nRounding of Test Data \nMethods for Testing Steel Reinforcing Bars \nProcedure for Use and Control of Heat-cycle Simulation \nAnnexA7 \nAnnex AB \nAnnexA9 \nAnnex A10 \n1.4 The values stated in inch-pound units are to be regarded \nas standard. The values given in parentheses are mathematical \nconversions to SI units that are provided for information only \nand are not considered standard. \n1.5 When these test methods are referenced in a metric \nproduct specification, the yield and tensile values may be \ndetermined in inch-pound (ksi) units then converted into SI \n(MPa) units. The elongation determined in inch-pound gauge \nlengths of 2 or 8 in. may be reported in SI unit gauge lengths \nof 50 or 200 mm, respectively, as applicable. Conversely, when \nthese test methods are referenced in an inch-pound product \nspecification, the yield and tensile values may be detennined in \nSI units then converted into inch-pound units. The elongation \ndetermined in SI unit gauge lengths of 50 or 200 mm may be \nreported in inch-pound gauge lengths of 2 or 8 in., respectively, \nas applicable. \n584 \n1.5.1 The specimen used to detennine the original units \nmust conform to the applicable tolerances of the original unit \nsystem given in the dimension table not that of the converted \ntolerance dimensions. \nNorn I-This is due to the specimen SI dimensions and tolerances \nbeing hard conversions when this is not a dual standard. The user is \ndirected to Test Methods A1058 if the tests are required in SI units. \n1.6 Attention is directed to ISO/IEC 17025 when there may \nbe a need for information on criteria for evaluation of testing \nlaborat01ies. \n1. 7 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0636.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3560,
  "bestTextAlphaRatio": 0.7787
}