{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 754,
  "globalPageIndex": 754,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-420 /SA-420M ASME BPVC.II.A-2025 \nTABLE 6 Impact Test Temperature \nWPL6 \nWPL9 \nWPL3 \nWPLB \nGrade Impact Test Temperature, \nOF [OC] \n-50 [-45] \n-100 [-75] \n-150 [-100] \n-320 [-195] \n10.4.1 A notched-bar impact test, consisting of breaking \nthree specimens shall be made. Each test shall represent only \nsuch fittings from a heat that do not vary from the thickness of \nthe material from which the test specimens are taken by more \nthan ¼ in. [6 mm]. \n10.4.2 When heat treatment is performed in furnaces not \nequipped with calibrated recording pyrometers, one impact test \nshall be made for each heat in each heat-treatment load. Test \nspecimens shall be included with each furnace charge. If this \nheat treatment is conducted in continuous-type furnaces not \nequipped with calibrated recording pyrometers, then one test \nper heat shall be conducted for each 5000 lb or 2550 kg (or \nless) of product. \n10.4.3 When heat treatment is performed in furnaces con­\ntrolled within a 50 °F [28 °C] range and equipped with \ncalibrated recording pyrometers so that records of heat treat­\nment are available, then one impact test from each heat is \nrequired, provided that all other heat treatments are conducted \nat the same temperatures and within the same 50 °F [28 °C] \nrange as the furnace charge that contained the test specimens. \n10.4.4 On fittings of welded construction, additional impact \ntests of the same number as required in 10.4.1 or 10.4.2 shall \nbe made to test the weld metal. \n10.4.5 Specimens showing defects while being machined or \nprior to testing shall be discarded, and replacements shall be \nconsidered as original specimens. \n10.5 Retreatment: \n10.5.1 If the results of impact tests conducted in accordance \nwith 10.4.2 and 10.4.3 fail to conform to the test requirements \nspecified in 10.1, that group of fittings shall be retreated and \nsubmitted for test. No group of fittings shall be retreated more \nthan twice. \n11. Hydrostatic Tests \n11.1 Hydrostatic testing of fittings is not required by this \nspecification. \n11.2 All fittings shall be capable of withstanding without \nfailure, leakage, or impairment of their serviceability, a hydro­\nstatic test pressure equal to that prescribed for the specified \nmatching pipe of equivalent material. \n12. Dimensions \n12.1 Butt-welding fittings and butt-welding short-radius \nelbows and returns purchased in accordance with this specifi­\ncation shall confonn to the dimensions and tolerances given in \nthe latest revision of ASME Bl6.9 or MSS SP-95. Steel \nsocket-welding and threaded fittings purchased in accordance \nwith this specification shall conform to the sizes, shapes, \ndimensions, and tolerances specified in the latest revision of \nASME B16.ll, MSS SP-79, or MSS SP-83. Swage(d) Nipples, \nBull Plugs, and Integrally Reinforced Forged Branch Outlet \nFittings purchased in accordance with this specification shall \nconform to the sizes, shapes, dimensions, and tolerances \nspecified in the latest revision of MSS SP-95 or MSS SP-97. \n12.2 Fittings of size or shape differing from these standards, \nbut meeting all other requirements of the specification, shall be \nfurnished in accordance with Supplementary Requirement S58 \nof Specification A960/ A960M only by agreement with the \npurchaser. \n13. Surface Finish, Appearance, and Corrosion \nProtection \n13.1 The requirements of Specification A960/ A960M apply. \n14. Repair by Welding \n14.1 The requirements of Specification A960/A960M apply \nexcept as follows: \n14.l.1 Repair welding, by the manufacturer, is permissible \nfor parts made to dimensional standards such as those of \nASME or equivalent standards. \n14.1.2 Prior approval of the purchaser shall be required to \nweld repair special parts made to the purchaser's dimensional \nrequirements. \n14.1.3 Welding shall be accomplished with a weld proce­\ndure designed to produce low hydrogen in the weldment. Short \ncircuit gas metal arc welding is permissible only with the \napproval of the purchaser. \n704 \n14.1.4 The weld repair shall be permanently identified with \nthe welder's stamp or symbol in accordance with Section IX of \nthe ASME Boiler and Pressure Vessel Code. \n14.1.5 After weld repair, material shall be heat treated in \naccordance with 7.1. \n14.1.6 Tension and impact testing of representative depos­\nited weld metal for each heat shall meet the requirements of 9 .2 \nand 10.1. \n15. Radiographic Examination \n15.1 All fusion-welded butt joints shall be radiographically \nexamined throughout the entire length in accordance with \nParagraph UW-51 of Section VIII, Division 1, of the ASME \nBoiler and Pressure Vessel Code. Instead of radiographic \nexamination, welds made by the manufacturer may be ultra­\nsonically examined in accordance with Appendix 12 of Section \nVIII, Division 1, of the ASME Boiler and Pressure Vessel \nCode. In general, radiography or ultrasonic examination shall \nbe performed after all forming operations have been com­\npleted. Fittings made from fusion-welded pipe need not be \nradiographed if the pipe has been radiographed, provided the \nfitting forming process does not materially affect the weld. \n16. Inspection \n16.l All tests and inspections shall be made at the place of \nmanufacture, unless otherwise agreed to. \n16.2 Other tests, when required by agreement shall be made \nfrom materials of the lots covered in the order. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0754.json",
  "tabulaTablesCsv": "tables_tabula/page-0754.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0754.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5349,
  "bestTextAlphaRatio": 0.7532
}