{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 331,
  "globalPageIndex": 1129,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-609 /SA-609M \n3.2.1.5 Any requirements additional to the provi­\nsions of this practice. \n3.3 Procedure B: Back-Wall Reflection Calibration \nProcedure - When this procedure is to be applied to an \ninquiry, contract, or order, the purchaser shall designate the \nquality levels for the entire casting or applicable portions. \nPROCEDURE A - FLAT-BOTTOMED HOLE \nCALIBRATION PROCEDURE \n4. Apparatus \n4.1 Electronic Apparatus: \n4.1.1 An ultrasonic, pulsed, reflection type of instru­\nment that is capable of generating, receiving, and ampli­\nfying frequencies of at least 1 to 5 MHz. \n4.1.2 The ultrasonic instrument shall provide linear \npresentation (within ±5%) for at least 75% of the screen \nheight (sweep line to top of screen). Linearity shall be \ndetermined in accordance with Practice E 317 or equivalent \nelectronic means. \n4.1.3 The electronic apparatus shall contain a signal \nattenuator or calibrated gain control that shall be accurate \nover its useful range to ±10% of the nominal attenuation \nor gain ratio to allow measurement of signals beyond the \nlinear range of the instrument. \n4.2 Search Units: \n4.2.1 Longitudinal Wave, internally grounded, having \na ½ to 1½ in. [13 to 28 mm] diameter or 1 in. [25 mm] \nsquare piezo-electric elements. Based on the signals-to­\nnoise ratio of the response pattern of the casting, a fre­\nquency in the range from 1 to 5 MHz shall be used. The \nbackground noise shall not exceed 25% of the distance \namplitude correction curve (DAC). Transducers shall be \nutilized at their rated frequencies. \n4.2.2 Dual-Element, 5 MHz, ½, by 1 in. [13 by \n25 mm], 12° included angle search units are recommended \nfor sections 1 in. [25 mm] and under. \n4.2.3 Other frequencies and sizes of search units may \nbe used for evaluating and pinpointing indications. \n4.3 Reference Blocks: \n4.3.1 Reference blocks containing flat-bottom holes \nshall be used to establish test sensitivity in accordance \nwith 8.2. \n4.3.2 Reference blocks shall be made from cast steels \nthat give an acoustic response similar to the castings being \nexamined. \n4.3.3 The design of reference blocks shall be in \naccordance with Fig. 1, and the basic set shall consist of \nthose blocks listed in Table 1. When section thicknesses \nover 15 in. [380 mm] are to be inspected, an additional \nblock of the maximum test thickness shall be made to \nsupplement the basic set. \n4.3.4 Machined blocks with ¾ 2 in. [2.4 mm] diameter \nflat-bottom holes at depths from the entry surface of ½ in. \n[3 mm], ½ in. [13 mm], or ½t and ¾ in. [19 mm], or ¾t \n( where t = thickness of the block) shall be used to establish \nthe DAC for the dual-element search units (see Fig. 2). \n4.3.5 Each reference block shall be permanently \nidentified along the side of the block indicating the material \nand the block identification. \n4.4 Couplant - A suitable couplant having good wet­\nting characteristics shall be used between the search unit \nand examination surface. The same couplant shall be used \nfor calibrations and examinations. \n5. Personnel Requirements \n5.1 The manufacturer shall be responsible for assigning \nqualified personnel to perform ultrasonic examination in \nconformance with the requirements of this practice. \n5.2 Personnel performing ultrasonic examinations in \naccordance with this practice shall be familiar with the \nfollowing: \n5.2.1 Ultrasonic terminology. \n5.2.2 Instrument calibration. \n5.2.3 Effect of transducer material, size, frequency, \nand mode on test results. \n5.2.4 Effect of material structure (grain size, cleanli-\nness, etc.) on test results. \n5.2.5 Effect of test distance on test results. \n5.2.6 Effect of nonlinearity on test results. \n5.2.7 Effect of thickness and orientation of disconti­\nnuities on test results. \n5.2.8 Effect of surface roughness on test results. \n5.3 A qualification record (see Note 2) of personnel \nconsidered suitable by the manufacturer to perform exami­\nnations in accordance with this practice shall be available • \nupon request. \nNOTE 2 - SNT-TC-lA, Ultrasonic Testing Method, provides a recom­\nmended procedure for qualifying personnel. Other personnel qualification \nrequirement documents may be used when agreed upon between the \npurchaser and the supplier. \n6. Casting Conditions \n6.1 Castings shall receive at least an austenitizing heat \ntreatment before being ultrasonically examined. \n6.2 Test surfaces of castings shall be free of material \nthat will interfere with the ultrasonic examination. They \nmay be as cast, blasted, ground, or machined. \n1035 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1129.json",
  "tabulaTablesCsv": "tables_tabula/page-1129.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1129.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4535,
  "bestTextAlphaRatio": 0.7449
}