{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 224,
  "globalPageIndex": 1022,
  "width": 627.84,
  "height": 804.24,
  "text": "SA-541/SA-541M ASME BPVC.II.A-2025 \nforgings that it represents, except that a longitudinally \nforged bar may be used to represent a rolled ring of similar \ncross section. It shall be of the same nominal thickness as \nthe as-quenched production forgings and shall be heat \ntreated in the same furnace charge and under the same \nconditions as the production forgings. Test specimens shall \nbe removed using the ¾ T by T procedure referenced in \nMethod 3 with the same limitation on forging thickness \nas in 6.2.3. This method shall be limited to forgings with a \nrough machined weight of not more than 1 000 lb [ 450 kg]. \n6.3 Metal Buffers - The required distances from \nquenched surfaces may be obtained with metal buffers \ninstead of integral extensions. Buffer material may be car­\nbon or low-alloy steel, and shall be joined to the forging \nwith a partial penetration weld that seals the buffered sur­\nface. Specimens shall be located at least ½. in. [13 mm] \nfrom the buffered surface of the forging. Buffers shall be \nremoved and the welded areas subjected to magnetic parti­\ncle test to ensure freedom from cracks unless the welded \nareas are completely removed by subsequent machining. \n6.4 Samples shall be removed from forgings after the \nquenching and tempering heat treatments. This sample \nmaterial shall be subjected to a simulated post-weld heat \ntreatment if Supplementary Requirement Sl is specified. \n6.5 Orientation - For upset disk forgings, the longitu­\ndinal axis of all test specimens shall be oriented in the \ntangential direction. For all other forgings, the longitudinal \naxis of the specimens shall be oriented in the direction of \nmaximum working of the forging unless Supplementary \nRequirements S 11 or S 14 are imposed. \n6.6 Number of Tests: \n6.6.1 Forgings under 500 lb [230 kg] As Treated -\n6.6.3 Each forging weighing over 10 000 lb \n[ 4500 kg] shall require two tension tests and two impact \ntests, located at opposite ends if the length is 1 ½. times the \ndiameter or more, or 180° apart otherwise. \n7. Repair Welding \n7.1 Repair welding of forgings may be permitted, but \nonly at the option of the purchaser. \n7 .2 If repair welding is pe1formed, welders and weld \nprocedures shall be qualified in accordance with Section \nIX of the ASME Boiler and Pressure Vessel Code. \n8. Workmanship and Quality Level Requirements \n8.1 Dimensional and visual inspections shall be con­\nducted by the manufacturer. Forgings shall be free of \ncracks, thermal ruptures, or other imperfections. \n9. Certification and Reports \n9.1 In addition to items required to be reported by \nSpecification A 788, the following items shall also be \nreported: \n9.1.1 Product chemical analysis. \n9.1.2 The method used for locating test specimens. \n9.1.3 Sketches included in the report of non-destruc-\ntive examinations. \n9.1.4 Details of the heat treatment cycle, as listed in \nSpecification A 788. \nFor duplicate forgings weighing less than 500 lb [230 kg] 10. Product Marking \nas treated, one tension test and one impact test (three speci- 10.1 The purchaser may specify additional identifica-\nmens) shall be made to represent each heat in each heat- tion marking and the location of the marking. If stamps \n~~~------'t=re-atment cbar~€Il-h0at4Featm:ent-i~performe::.id---i;.,n~__'.\"ar\"'.e~u~se_:d~, ~th~e,_y~sh~a;ll~be~ro\"\":u~n..,,d~-n__\".o~s_..e~d\"'-o~r~'~'i\"\"'nt~e1:,rr.__uc!c'p~te~d~-d~o'1:'t'~' ~~~~~~-y--\ncontinuous-type furnaces with suitable temperature control die stamps having a minimum radius of ½ 2 in. [0.8 mm]. \nand equipped with recording pyrometers so that complete \nheat-treatment records are available, a heat-treatment \ncharge shall be considered as any continuous run not \nexceeding an 8 h duration. \n6.6.2 Forgings weighing 500 to JO 000 lb [230 to \n4500 kg] As-Heat Treated - One tension and one impact \ntest (3 specimens) shall be made for each forging. \n922 \n11. Keywords \n11.1 chromium-molybdenum steel; nickel-chromium­\nmolybdenum alloy steel; pressure vessel service; quenched \nand tempered steel; steel forgings-alloy; steel forgings­\ncarbon ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1022.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4077,
  "bestTextAlphaRatio": 0.7383
}