{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 706,
  "globalPageIndex": 706,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-395/SA-395M ASME BPVC.II.A-2025 \n7.4.3 Castings Grade 60-40-18, ordered under this \nspecification not covered by ANSI standards and ASME \nPressure Vessel Code, and castings for special service \napplications, shall be tested to such pressures as may be \nagreed upon by the manufacturer and the purchaser. \n7.4.4 For castings Grade 60-40-18, it is realized that \nthe foundry may be unable to perform the hydrostatic test \nprior to shipment, or that the purchaser may wish to defer \ntesting until additional work or machining has been per­\nformed on the casting. Castings ordered in the rough state \nfor final machining by the purchaser may be tested hydro­\nstatically prior to shipment by the manufacturer at pressures \nto be agreed upon with the purchaser. However, the foundry \nis responsible for the satisfactory pe1formance of the cast­\nings under the final hydrostatic test. \n8. Workmanship and Finish \n8.1 The surface of the casting shall be examined visu­\nally and shall be free from adhering sand, scale, cracks, \nand hot tears. Any other surface discontinuities shall meet \nvisual acceptance standards specified in the order. \n9. Repair \n9.1 Castings for valves, flanges, pipe fittings, pumps, \nand other piping components ordered under applicable \nANSI standards shall not be repaired by plugging, welding, \nbrazing, or impregnation. \n9.2 Castings Grade 60-40-18 not covered in 9.1 which \nleak on hydrostatic tests may be repaired by plugging, \nprovided the following requirements are met: \n9.2.1 No welding or brazing is permitted. \n9.2.2 The diameter of the plug shall not exceed the \ndiameter of a standard 2 in. [ISO R2] pipe plug. \n9.2.3 The plugs, where practical, shall conform in \nall dimensions to the standard ISO ¾ plugs. In addition, \nthey shall have full thread engagement corresponding to \nthe thickness in the repaired section. Where a tapered plug \nis impractical because of the excess wall thickness in terms \nof plug diameter and coincident thread engagement, other \ntypes of plugs may be used provided both full engagement \nand effective sealing against pressure are obtained. Where \npossible, the ends of the plug should be ground smooth after \ninstallation to conform to the inside and outside contours of \nthe wall of the pressure vessel or pressure part. \n9.2.4 The material from which the plug is manufac­\ntured shall conform in all respects to the materials specifi­\ncations that apply to the pressure vessel or pressure part. \n9.2.5 The area adjacent to the drilled hole shall be \nexamined by radiography, and shall meet the Level 3 \nacceptance requirements of Reference Radiographs E 689 \nand supporting Reference Radiographs E 446, E 186, or \nE 280 as applicable and defined in accordance with Refer­\nence Radiographs E 689. \n9.2.6 The thickness of any repaired section in relation \nto the size of the plug used shall not be less than that given \nin Table 2. \n9.2.7 The minimum radius of repaired sections of \ncylinders or cones in relation to the size of plug used shall \nnot be less than that given in Table 3. \n9.2.8 A repaired area may consist of a maximum of \nthree plugs with a spacing such that the ligaments between \nadjacent plugs shall not be less than listed in Table 4. Other \ndefective areas may also be repaired by plugging provided \nthe minimum ligament between plugs in adjacent areas is \nnot less than twice the distance from the nearest plug, the \nvalues for which are listed in Table 4. \n9 .3 Surface imperfections in castings Grade 60-40-18 \nother than valves, flanges, pipe fittings, pumps, and other \npiping components may be repaired by plugging provided \nthe depth of the plug is not greater than 20% of the thickness \nof the casting section and the diameter of the plug is not \ngreater than its length. Repair of surface defects may not \nbe done on pressure-containing portions of castings. The \nplug need not be threaded. The conditions of 9.2.1 and \n9.2.4 shall also be satisfied. \n10. Sampling \n10.1 A lot shall consist of one of the following: \n656 \n10.1.1 All the metal from a single heating in a batch­\ntype melting furnace. \n10.1.2 All the metal poured from two or more batch­\ntype melting furnaces into a single ladle or a single casting. \n10.1.3 All the metal poured from a continuous melt­\ning furnace for a given period of time between changes in \ncharge, processing conditions, or aim-for chemistry, or 8 h, \nwhichever is the shorter period. \n11. Test Coupon \n11.1 The separately cast test coupons poured from the \nsame lot as the castings they represent from which the \ntension test specimen is machined shall be cast to the size \nand shape shown in Fig. 2, Fig. 3, or Fig. 4. Cast coupons \nshall be identified with the castings they represent. Sec­\ntioning procedure for removing test specimens from \nY-blocks is shown in Fig. 5. \n11.1.1 Test samples may be removed from castings \nat locations designated on a drawing or as agreed to by \nmanufacturer and purchaser. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0706.json",
  "tabulaTablesCsv": "tables_tabula/page-0706.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0706.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4944,
  "bestTextAlphaRatio": 0.7595
}