{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 566,
  "globalPageIndex": 566,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-335/SA-335M (ASTM A335/A335M) ASME BPVC.II.A-2025 \nVickers, or Rockwell hardness tests shall be made on one \nspecimen from each lot. For pipe of all other grades, a hardness \ntest is not required. \n14.4 Flattening Test: \n14.4.1 The flattening test of Specification A999/A999M \nshall be made on a specimen from one end of the pipe with the \nnumber of tests as specified in 14.2. Crop ends may be used. If \na specimen from any length fails because of lack of ductility \nprior to satisfactory completion of the first step of the flattening \ntest requirement, that pipe shall be rejected subject to retreat­\nment in accordance with Specification A999/ A999M and \nsatisfactory retest. If a specimen from any length of pipe fails \nbecause of a lack of soundness that length shall be rejected, \nunless subsequent retesting indicates that the remaining length \nis sound. \n14.5 Bend Test: \n14.5.1 For pipe whose diameter exceeds NPS 25 and whose \ndiameter to wall thickness ratio is 7.0 or less shall be subjected \nto the bend test instead of the flattening test. Other pipe whose \ndiameter equals or exceeds NPS 10 may be given the bend test \nin place of the flattening test subject to the approval of the \npurchaser. \n14.5.2 The bend test specimens shall be bent at room \ntemperature through 180° without cracking on the outside of \nthe bent portion. The inside diameter of the bend shall be 1 in. \n[25 mm]. \n14.5 .3 Test specimens for the bend test shall be cut from one \nend of the pipe with the number of tests as specified in 14.2 \nand, unless otherwise specified, shall be taken in a transverse \ndirection. One test specimen shall be taken as close to the outer \nsurface as possible and another from as close to the inner \nsurface as possible. The specimens shall be either ½ by ½ in. \n[12.5 by 12.5 mm] in section or 1 by ½ in. [25 by 12.5 mm] in \nsection with the comers rounded to a radius not over 1/16 in. \n[1.6 mm] and need not exceed 6 in. [150 mm] in length. The \nside of the samples placed in tension during the bend shall be \nthe side closest to the inner and outer surface of the pipe, \nrespectively. \n15. Certification \n15.1 Certification and test reports, as described in Section \n25 of Specification A999/A999M, are required. \n15.2 In addition to the information required by Specification \nA999/ A999M, the certification shall state whether or not the \npipe was hydrostatically tested. If the pipe was nondestruc­\ntively examined, the certification shall so state and shall show \nwhich practice was followed and what reference discontinuities \nwere used. In addition, the test method information as given in \nTable 9 shall be appended to the specification number and \ngrade shown on the certification. \n16. Product Marking \n16.1 In addition to the marking prescribed in Specification \nA999/A999M, the marking shall include the length, an addi­\ntional symbol \"S\", if the pipe conforms to any of the Supple­\nmentary Requirements Sl to S6, the schedule number, if the \npipe is ordered to a schedule number, and the heat number or \nmanufacturer's number by which the heat can be identified. \nFurthermore, the marking designated in Table 9 to indicate the \ntest method(s) shall be included. Marking may be by stenciling, \nstamping, or rolling. Pipe that has been weld repaired in \naccordance with 7.6 shall be marked \"WR.\" \n16.2 P91 shall be additionally marked with the appropriate \nType. \n17. Government Procurement \n17 .1 Scale Free Pipe: \n17 .1.1 When specified in the contract or order, the following \nrequirements shall be considered in the inquiry contract or \norder, for agencies of the U.S. Government where scale free \npipe is required. These requirements shall take precedence if \nthere is a conflict between these requirements and the product \nspecification. \n17 .1.2 The requirements of Specification A999/ A999M for \npipe shall be applicable when pipe is ordered to this specifi­\ncation. \n17 .1.3 Pipe shall be one of the following grades as specified \nherein: \nGrade \nP11 \nP22 \nP5 \n17.1.4 Part Number: \nUNS Designation \nK11597 \nK21590 \nK41545 \nTABLE 9 Test Method Information for Certification and Marking \nUltrasonic Flux Leakage Eddy Current Hydrostatic Marking \nNO NO NO YES TEST PRESSUREA \nYES NO NO NO UT \nNO YES NO NO FL \nNO NO YES NO EC \nYES YES NO NO UT/FL \nYES NO YES NO UT/EC \nNO NO NO NO NH \nYES NO NO YES UT/TEST \nPRESSUREA \nNO YES NO YES FL/TEST \nPRESSUREA \nNO NO YES YES EC/TEST \nPRESSUREA \nATest pressure is to be in psi [MPa]. \n514 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0566.json",
  "tabulaTablesCsv": "tables_tabula/page-0566.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0566.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4473,
  "bestTextAlphaRatio": 0.7362
}