{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 731,
  "globalPageIndex": 731,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-403 /SA-403M \n9. Hydrostatic Tests \n9.1 Hydrostatic testing is not required by this specification. \n9.2 All Grade WP fittings shall be capable of withstanding \nwithout failure, leakage, or impairment of serviceability, a test \npressure equal to that prescribed for the specified matching \npipe or equivalent material. \n9.3 All Grade CR fittings, except tees covered in 9.3.1, shall \nbe capable of withstanding without failure, leakage, or impair­\nment of serviceability, a test pressure based on the ratings in \nMSS SP-43. \n9.3.1 Grade CR tees fabricated using intersection welds \nshall be capable of passing a hydrostatic test based on 70 % of \nthe ratings in MSS SP-43. \n10. Surface Finish, Appearance, and Corrosion \nProtection \n10.1 The requirements of Specification A960/A960M apply \nexcept as modified as follows: \n10.2 Fittings supplied under this specification shall be \nexamined visually. Selected typical surface discontinuities \nshall be explored for depth. The fittings shall be free from \nsurface discontinuities that penetrate more than 5 % of the \nspecified nominal wall thickness, except as defined in 10.4 and \n10.5, and shall have a workmanlike finish. \n10.3 Surface discontinuities deeper than 5 % of the speci­\nfied nominal wall thickness, except as defined in 10.4 and 10.5, \nshall be removed by the manufacturer by machining or \ngrinding to sound metal, and the repaired areas shall be well \nfaired. The wall thickness at all points shall be at least 87½ % \nof the specified nominal wall thickness, and the diameters at all \npoints shall be within the specified limits. \n10.4 Surface checks (fish scale) deeper than 1/64 in. [0.4 \nmm] shall be removed. \n10.5 Mechanical marks deeper than ½6 in. [l.6 mm] shall \nbe removed. \n10.6 When the removal of a surface discontinuity reduces \nthe wall thickness below 87½ % of the specified nominal wall \nthickness at any point, the fitting shall be subject to rejection or \nto repair as provided in Section 11. \n10.7 The fittings shall be free of scale and shall be passi­\nvated. \n11. Repair by Welding \n11.1 Repair of unacceptable imperfections in the base metal \nis permissible for fittings made to the dimensional standards \nlisted in 1. 1 or for other standard fittings made for stock by the \nmanufacturer. Prior approval of the purchaser is required to \nrepair special fittings made to the purchaser's requirements. \nWelding of unacceptable imperfections in no case shall be \npermitted when the depth of defect exceeds 331/3 % of the \nnominal wall thickness or the defect area exceeds 10 % of the \nsurface area of the fitting. \n11.2 The welding procedure and welders shall be qualified \nin accordance with Section IX of the ASME Boiler and \nPressure Vessel Code. \n11.3 The composition of the weld deposits shall be in \naccordance with 7.3 and in accordance with the procedure \nqualification for the applicable material. \n11.4 Unacceptable imperfections shall be removed by me­\nchanical means or by thermal cutting or gouging methods. \nCavities prepared for welding shall be examined with liquid \npenetrant in accordance with Practice E165/E165M. No cracks \nare permitted in the prepared cavities. Personnel performing \nNDE examinations shall be qualified in accordance with \nSNT-TC-lA \n11.5 The weld repair shall be permanently identified with \nthe welder's stamp or symbol in accordance with Section VIII \nof the ASME Boiler and Pressure Vessel Code. \n11.6 Weld repair area(s) shall be blended uniformly to the \nbase metal and shall be examined by liquid penetrant in \naccordance with Practice E165/E165M. No cracks are permit­\nted in the weld or surrounding ½ in. [12.7 mm] of base metal. \nPersonnel performing NDE examinations shall be qualified in \naccordance with SNT-TC-lA. \n11. 7 After weld repair, material shall be heat treated in \naccordance with Section 6. \n12. Dimensions \n12.1 For fittings covered by ASME B16.9, ASME B16.ll, \nMSS SP-43, MSS SP- 79, MSS SP-83, MSS SP-95, or MSS \nSP-97, the sizes, shapes, and dimensions of the fittings shall be \nas specified in those standards. \n12.1.1 Fittings of size or shape differing from these \nstandards, but meeting all other requirements of this \nspecification, may be furnished in accordance with Supplemen­\ntary Requirement S58 Specification A960/A960M. \n13. Rejection and Rehearing \n13 .1 Material that fails to conform to the requirements of \nthis specification may be rejected. Rejection should be reported \nto the producer or supplier promptly and in writing. In case of \ndissatisfaction with the results of the tests, the producer or \nsupplier may make claim for rehearing. \n13.2 Fittings that develop defects in shop working or \napplication operations may be rejected. Upon rejection, the \nmanufacturer shall be notified promptly in w1iting. \n14. Certification \n14.1 Test reports are required for all fittings covered by this \nspecification. Each test report shall meet the requirements for \ncertification in Specification A960/ A960M as well as include \nthe following information specific to this specification: \n681 \n14.1.1 Chemical analyses results for all starting materials, \nSection 7. (Table 2), reported results shall be to the same \nnumber of significant figures as the limits specified in Table 2 \nfor that element, \n14.1.2 Tensile property results of all starting materials, \nSection 8 (Table 5), report the yield strength and the tensile \nstrength in ksi [MPa] and elongation in percent, \n14.1.3 For construction with filler metal added, weld metal \nchemical analysis, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0731.json",
  "tabulaTablesCsv": "tables_tabula/page-0731.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0731.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5536,
  "bestTextAlphaRatio": 0.7547
}