{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 644,
  "globalPageIndex": 1442,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-941 ASME BPVC.II.A-2025 \nTerminology Relating to \nSteel, Stainless Steel, Related Alloys, and Ferroalloys \n1. Scope \n1.1 This standard is a compilation of definitions of terms \nrelated to steel, stainless steel, related alloys, and ferroalloys. \n1.2 When a term is used in an ASTM document for which \nCommittee A0l is responsible, it is included herein only when \njudged, after review by Subcommittee A0l.92, to be a gener­\nally usable term. \n1.3 Some definitions include a discussion section, which is \na mandatory part of the definition and contains additional \ninformation that is relevant to the meaning of the defined term. \n1.4 Definitions of terms specific to a particular standard will \nappear in that standard and will supersede any definitions of \nidentical terms in this standard. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nE112 Test Methods for Determining Average Grain Size \n3. Terminology \n3.1 Definitions of Terms Specific to This Standard: \nAccm• Ac 1, Ac 3, Ac,r-See transformation temperature. \nAecm, Ae 1 , Ae 3 , Ae,r-See transformation temperature. \nage hardening, n-hardening by aging, usually after rapid \ncooling or cold working. \nage hardening, n-see precipitation hardening. \naging, n-a change in the properties of certain steels that \noccurs at ambient or moderately elevated temperatures after \nhot working or a heat treatment ( quench aging, natural \naging, or artificial aging) or after a cold-working operation \n(strain aging). \nDiscussION-The change in properties is often, but not always, due to \nprecipitation hardening, but never involves a change in the chemical \ncomposition of the steel. \nalloy steel, n-a steel, other than a stainless steel, that \nconforms to a specification that requires one or more of the \nfollowing elements, by mass percent, to have a minimum \ncontent equal to or greater than: 0.30 for aluminum; 0.0008 \nfor boron; 0.30 for chromium; 0.30 for cobalt; 0.40 for \ncopper; 0.40 for lead; 1.65 for manganese; 0.08 for molyb­\ndenum; 0.30 for nickel; 0.06 for niobium (columbium); 0.60 \nfor silicon; 0.05 for titanium; 0.30 for tungsten (wolfram); \n0.10 for vanadium; 0.05 for zirconium; or 0.10 for any other \nalloying element, except sulphur, phosphorus, carbon, and \nnitrogen. \nannealing, n-a generic term covering any of several heat \ntreatments. \nDiscusSION-This treatment is used for purposes such as reducing \nhardness, improving machinability, facilitating cold working, produc­\ning a desired microstructure, or obtaining desired mechanical, physical, \nor other properties. Where applicable, it is preferred that the following \nmore specific terms be used: box annealing, bright annealing, full \nannealing, intermediate annealing, isothermal annealing, process \nannealing, spheroidizing, and subcritical annealing. The term \n\"annealing,\" without qualification, implies full annealing. Any pro­\ncess of annealing will usually reduce stresses; however, if the \ntreatment is applied for the sole purpose of stress reduction, it should be \ndesignated stress relieving. \nArcm, Ar 1 , Ar 3 , Ar,r-See transformation temperature. \nartificial aging, n-aging above room temperature. \natmospheric corrosion resistance, n-the ability to resist \ndegradation or alteration of material through chemical reac­\ntion with the surrounding atmosphere. \nD1scussioN-This term generally pertains to carbon steel, low alloy \nsteel, or micro-alloyed steel. \naustempering, n-heat treatment involving quenching a \nsteel object from a temperature above the transformation \nrange in a medium maintained at a temperature above the \nmartensite range sufficiently fast to avoid the formation of \n1380 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1442.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3973,
  "bestTextAlphaRatio": 0.7722
}