{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 775,
  "globalPageIndex": 775,
  "width": 610.92,
  "height": 852.6,
  "text": "ASME BPVC.II.A-2025 SA-439 /SA-439M \nin. \nmm \n½ \n13 \n1\\1 .. ) 2 Rad. \nl-1\"-I \nMetric Equivalents \n1 1½ \n25 38 \nT \n1\" 2-2 \nl\" 1-2 \n_j_ \n2½ \n63 \nNorn 1-The length of the keel block shall be 6 in. [150 mm]. \nFIG. 2 Keel Block for Test Coupons \nthat are used to produce the castings. These test specimens \nshall be made to the dimensions shown in Fig. 3 and Fig. 4 of \nTest Methods and Definitions A370. \n9.5 Test bars representing the furnace heat of iron shall be \ncast from the same ladle of metal as soon as practicable after \nthe last iron is poured to produce castings, unless otherwise \nspecified. Test bars shall be left in the mold until they have \ncooled to less than 930 °F [500 °C]; cooling to a black \nappearance is acceptable if the manufacturer has established \nthat such black appearance corresponds to a temperature less \nthan 930 °F [500 °C]. \n10. Number of Tests \n10.1 Test bars shall be poured from each ladle treated with \nnodularizing agent, unless otherwise specified. \n10.2 The number of test bars cast shall be agreed upon by \nthe manufacturer and the purchaser. \n10.3 One tension test shall be made from sections cut from \nthe test bars as shown in Fig. 4. If any tension test shows \nobvious foundry or machining defects, another specimen shall \nbe cut from the same test bar or from another test bar \nrepresenting the same metal. If the retest specimen fails to \nconform to this specification, the castings they represent shall \nbe rejected. \n11. Tension Test Specimens \n11.1 The standard round tension test specimen with 2-in. \n[50-rnm] gauge length shown in Fig. 5 shall be used, except \nwhen the ½-in. [13-mm] \"Y\" block is used or when specimens \nare cut from castings under ¾-in. [20-rnm] thickness. In these \ncases, either of the test specimens shown in Fig. 6 shall be \nsatisfactory. \n11.2 By agreement between the manufacturer and the \npurchaser, tension test specimens may be cut directly from \ncentrifugal or other permanent mold castings. The location and \norientation of such tension test specimens cut from castings \nshall be specified as agreed upon by the manufacturer and the \npurchaser. \n12. Additional Tests \n12.1 Hydrostatic tests for pressure castings, radiography \nstandards, fracture tests, microstructure standards, or any other \nspecial tests may be set up by mutual agreement between the \nmanufacturer and the purchaser. \n13. Responsibility for Inspection \n13.1 Unless otherwise specified in the contract or purchase \norder, the manufacturer is responsible for the performance of \nall inspection requirements as specified herein. Except as \notherwise specified in the contract or order, the manufacturer \nmay use their own or any other facilities suitable for the \nperformance of the inspection requirements specified herein, \nunless disapproved by the purchaser. The purchaser reserves \nthe right to perform any of the inspections set forth in the \nspecification where such inspections are deemed necessary to \nensure supplies and services conform to prescribed require­\nments. \n14. Certification \n14.1 A certification shall be made the basis of acceptance of \nthe material. This shall consist of a copy of the manufacturer's \ntest report or a statement by the supplier, accompanied by a \ncopy of the test results that the material has been tested and \ninspected in accordance with the provisions of this specifica­\ntion. Each certification so furnished shall be signed by an \nauthorized agent of the supplier or manufacturer. \n15. Packaging and Package Marking \n15.1 Unless otherwise specified in the contract or purchase \norder, preservation and packaging of casting shall be in \naccordance with the manufacturer's commercial practice. \nPacking and marking shall also be adequate to ensure accep­\ntance and safe delivery by the carrier for the mode of \ntransportation employed. \n725 \n16. Keywords \n16.1 austenitic; corrosion resistant; ductile iron; mechanical \nproperties; nodular iron; tensile strength; yield strength ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0775.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3971,
  "bestTextAlphaRatio": 0.7582
}