{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 561,
  "globalPageIndex": 561,
  "width": 606.0,
  "height": 848.88,
  "text": "ASME BPVC.II.A-2025 SA-335/SA-335M (ASTM A335/A335M) \n0 Alternatively, in lieu of this ratio minimum, the material shall have a minimum hardness of 275 HV in the hardened condition, defined as after austenitizing and cooling \nto room temperature but prior to tempering. Hardness testing shall be performed at mid-thickness of the product. Hardness test frequency shall be two samples of product \nper heat treatment lot and the hardness testing results shall be reported on the material test report. \n0 Applies to both heat and product analyses. \n\"Chromium-Nickel Balance is defined as CNB =(Cr+ 6Si + 4Mo + 1.5W + 11V + 5Nb + 9Ti + 12AI)- (40C + 30N + 4Ni + 2Mn + 1CU). \n'ihe terms Niobium (Nb) and Columbium (Cb) are alternate names for the same element. \nA5.29/A5.29M Low-Alloy Steel Electrodes for Flux Cored \nArc Welding \n2.4 Other Documents: \nSNT-TC- lA Recommended Practice for Nondestructive Per­\nsonnel Qualification and Certification 5 \nSAE J 1086 Practice for Numbering Metals and Alloys \n(UNS) 6 \n3. Ordering Information \n3.1 Orders for material under this specification should \ninclude the following, as required, to describe the desired \nmaterial adequately: \n3.1.1 Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material (seamless alloy steel pipe), \n3.1.3 Grade (Table 1), \n3.1.4 Manufacture (hot-finished or cold-drawn), \n3.1.5 Size using one of the following: \n3.1.5.1 NPS and schedule number, \n3.1.5.2 Outside diameter and nominal wall thickness, \n3.1.5.3 Outside diameter and minimum wall thickness, \n3.1.5.4 Inside diameter and nominal wall thickness, and \n3.1.5.5 Inside diameter and minimum wall thickness. \n3.1.6 Length (specific or random), \n3.1.7 End finish (Ends Section of Specification A999/ \nA999M), \n3.1.8 Optional requirements (Section 8, 12, and 13 of this \nspecification. See the Sections on Hydrostatic Test Require­\nments and Permissible Variation in Weight for Seamless Pipe in \nSpecification A999/A999M), \n3.1.9 Specification designation, and \n3.1.10 Special requirements or any supplementary require­\nments selected, or both. \n3.1.11 The flattening or bend test shall be performed on 5 % \nof the pipe (or fewer in accordance with 14.2) unless Supple­\nmentary Requirement S3 is specified. \n4. General Requirements \n4.1 Material furnished to this specification shall conform to \nthe applicable requirements of the current edition of Specifi­\ncation A999/ A999M, unless. otherwise provided herein. \n5. Materials and Manufacture \n5.1 Pipe may be either hot finished or cold drawn with the \nfinishing treatment as required in 5.2. \n5.2 Heat Treatment: \n5.2.1 All pipe shall be reheated for heat treatment and heat \ntreated in accordance with the requirements of Table 2. \n5 Available from American Society for Nondestructive Testing (ASNT), P.O. Box \n28518, 1711 Arlingate Ln., Columbus, OH 43228-0518, http://www.asnt.org. \n6 Available from SAE International (SAE), 400 Commonwealth Dr., Warrendale, \nPA 15096-0001, http://www.sae.org. \n509 \nNoTB 3-lt is recommended that the temperature for tempering should \nbe at least 100 °P [50 °C] above the intended service temperature; \nconsequently, the purchaser should advise the manufacturer if the service \ntemperature is to be over 1100 °P [600 °C]. \nN OTB 4-Certain of the ferritic steels covered by this specification will \nharden if cooled rapidly from above their critical temperature. Some will \nair harden, that is, become hardened to an undesirable degree when cooled \nin air from high temperatures. Therefore, operations involving heating \nsuch steels above their critical temperatures, such as welding, flanging, \nand hot bending, should be followed by suitable heat treatment. \n6. Chemical Composition \n6.1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n7. Workmanship, Finish, and Appearance \n7 .1 The pipe manufacturer shall explore a sufficient number \nof visual surface imperfections to provide reasonable assurance \nthat they have been properly evaluated with respect to depth. \nExploration of all surface imperfections is not required but may \nbe necessary to ensure compliance with 7.2. \n7.2 Surface imperfections that penetrate more than 12½ % \nof the nominal wall thickness or encroach on the minimum \nwall thickness shall be considered defects. Pipe with such \ndefects shall be given one of the following dispositions: \n7.2.1 The defect may be removed by grinding provided that \nthe remaining wall thickness is within specified limits. \n7.2.2 Repaired in accordance with the repair welding pro­\nvisions of 7.6. \n7 .2.3 The section of pipe containing the defect may be cut \noff within the limits of requirements on length. \n7 .2.4 Rejected. \n7.3 To provide a workmanlike finish and basis for evaluat­\ning conformance with 7.2, the pipe manufacturer shall remove \nby grinding the following: \n7.3.1 Mechanical marks, abrasions (!'fee Note 5) and pits, \nany of which imperfections are deeper than 1/16 in. [1.6 mm]. \nNoTB 5-Marks and abrasions are defined as cable marks, dinges, guide \nmarks, roll marks, ball scratches, scores, die marks, and the like. \n7.3.2 Visual imperfections, commonly referred to as scabs, \nseams, laps, tears, or slivers, found by exploration in accor­\ndance with 7 .1 to be deeper than 5 % of the nominal wall \nthickness. \n7.4 At the purchaser's discretion, pipe shall be subject to \nrejection if surface imperfections acceptable under 7.2 are not \nscattered, but appear over a large area in excess of what is \nconsidered a workmanlike finish. Disposition of such pipe shall \nbe a matter of agreement between the manufacturer and the \npurchaser. \n7 .5 When imperfections or defects are removed by grinding, \na smooth curved surface shall be maintained, and the wall \nthickness shall not be decreased below that permitted by this ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0561.json",
  "tabulaTablesCsv": "tables_tabula/page-0561.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0561.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5817,
  "bestTextAlphaRatio": 0.7368,
  "noteOcrPath": "note_ocr/page-0561.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0561.txt",
  "noteOcrHighDpiCount": 1,
  "noteOcrHighDpiNotes": [
    "Note 4—Certain of the ferritic steels covered by this specification will"
  ]
}