{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 394,
  "globalPageIndex": 1192,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-671/SA-671M (ASTM A671/A671M) ASME BPVC.II.A-2025 \n11. Dimensions, Mass and Permissible Variations \n11.1 The wall thickness and weight for welded pipe fur­\nnished to this specification shall be governed by the require­\nments of the specification to which the manufacturer ordered \nthe plate. \n11.2 Permissible variations in dimensions at any point in a \nlength of pipe shall not exceed the following: \n11.2.1 Outside Diameter-Based on circumferential mea­\nsurement ± 0.5 % of the specified outside diameter. \n11.2.2 Out-of-Roundness-Difference between major and \nminor outside diameters, 1 %. \n11.2.3 Alignment-Using a 10-ft [3-m] straight edge placed \nso that both ends are in contact with the pipe, 1/s in. [3 mm]. \n11.2.4 Thickness-The minimum wall thickness at any point \nin the pipe shall not be more than 0.01 in. [0.3 mm] under the \nspecified nominal thickness. \n11.3 Circumferential welded joints of the same quality as \nthe longitudinal joints shall be permitted by agreement between \nthe manufacturer and the purchaser. \n11.4 Lengths with unmachined ends shall be within -0, +½ \nin. [-0, + 13 mm] of that specified. Lengths with machined ends \nshall be as agreed between the manufacturer and the purchaser. \n12. Workmanship, Finish, and Appearance \n12.1 The finished pipe shall be free of injurious defects and \nshall have a workmanlike finish. This requirement is to mean \nthe same as the identical requirement that appears in Specifi­\ncation A20/ A20M with respect to steel plate surface finish. \n13. Product Marking \n13.1 In addition to the marking provision of Specification \nA530/A530M, class marking in accordance with 1.3.3 shall \nfollow the grade marking, for example, CC 70-10. \n13.2 Bar Coding-In addition to the requirements in 13.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall be applied only when specified by \nthe purchaser in the inquiry, contract, or order. Details of these supplementary requirements shall be \nagreed upon in writing by the manufacturer and purchaser. Supplementary requirements shall in no \nway negate any requirement of the specification itself. \nSl. Tension and Bend Tests \nSl.1 Tension tests in accordance with 8.1 and bend tests in \naccordance with 8.2 shall be made on specimens representing \neach length of pipe. \nS2. Charpy V-Notch Test \nS2.1 Requirements-The acceptable test energies for mate­\nrial shown in Specification A20/ A20M shall conform to the \nenergy values shown in Specification A20/ A20M. \nS2. l .1 Materials not listed in Specification A20/ A20M shall \nbe in accordance with the purchase order requirements. \nS2.2 Number of Specimens-Each test shall consist of at \nleast three specimens. \nS2.2.1 One base metal test shall be made from one pipe \nlength per heat per heat-treat charge per nominal wall thick­\nness. For pipe from Classes 10, 11, 12, and 13, one base metal \ntest shall be made per heat per size and per wall thickness. \nS2.2.2 One weld-metal test shall be made in accordance \nwith UG-84 of Section VIII of the ASME Boiler and Pressure \nVessel Code. \nS2.2.3 One heat-affected-zone test shall be made in accor­\ndance with UG-84 of Section VIII of the ASME Boiler and \nPressure Vessel Code. \nS2.3 Test Specimen Location and Orientation: \nS2.3.1 Specimens for base-metal tests in Grades CA, CB, \nand CC in the as rolled stress relieved or normalized condition \n(classes of the 10, 20, 30, and 40 series) shall be taken so that \nthe longitudinal axis of the specimen is parallel to the longi­\ntudinal axis of the pipe. \nS2.3.2 Base-metal specimens of quench and tempered pipe, \nwhen the quenching and tempering follows the welding \noperation, shall be taken in accordance with the provision of \nN330 of Section III of the ASME Boiler and Pressure Vessel \nCode. \nS2.4 Test Method-The specimen shall be Charpy-V Type A \nin accordance with Test Methods and Definitions A370. The \nspecimens shall be tested in accordance with Test Methods and \nDefinitions A370. Unless otherwise indicated by the purchaser, \nthe test temperature shall be as given in Specification A20/ \nA20M for those base materials covered by Specification \nA20/A20M. For materials not covered by Specification A20/ \nA20M the test temperature shall be 10 °F [-12 °C] unless \notherwise stated in the purchase order. \nS3. Hardness Test \nS3.1 Hardness tests shall be made in accordance with Test \nMethods and Definitions A370 or Test Method Ell0 across the \nwelded joint of both ends of each length of pipe. In addition, \nhardness tests shall be made to include the heat-affected zone \n1102 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1192.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4726,
  "bestTextAlphaRatio": 0.7455
}