{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 173,
  "globalPageIndex": 173,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-31 \n5.2 Heat Analysis - An analysis of each heat of steel \nshall be made by the bar manufacturer to determine for \nGrades A and B the percentages of carbon, manganese, \nphosphorus, and sulfur. This analysis shall be made from \na test ingot taken during the pouring of the heat. The \nchemical composition thus determined shall be reported to \nthe purchaser or his representative and shall conform to the \nrequirements for heat analysis in accordance with Table 1. \n5.3 Product Analysis - An analysis may be made by \nthe purchaser from finished materials representing each \nheat. The chemical composition thus determined shall con­\nform to the requirements for product analysis prescribed \nin Table 1. \n5.4 Application of heats of steel to which bismuth, \nselenium, tellurium, or lead has been intentionally added \nshall not be permitted. \n5.5 Chemical analyses shall be performed in accor­\ndance with Test Methods, Practices, and Terminology \nA 751. \n6. Mechanical Properties \n6.1 Rivet Bend Tests: \n6.1.1 The rivet shank of Grade A steel shall stand \nbeing bent cold through 180° flat on itself, as shown in \nFig. 1, without cracking on the outside of the bent portion. \n6.1.2 The rivet shank of Grade B steel shall stand \nbeing bent cold through 180° without cracking on the \noutside of the bent portion in accordance with Table 2. \n6.2 Rivet Flattening Tests - The rivet head shall stand \nbeing flattened, while hot, to a diameter 2½ times the \ndiameter of the shank, as shown in Fig. 2, without cracking \nat the edges. \n6.3 Bar Tensile Properties - Bars shall conform to the \ntensile requirements in accordance with Table 3. \n6.4 Bar Bend Tests: \n6.4.1 The test specimen for Grade A steel bars shall \nstand being bent cold through 180° flat on itself without \ncracking on the outside of the bent portion. \n6.4.2 The test specimen for Grade B steel bars shall \nstand being bent cold through 180° without cracking on \nthe outside of the bent portion to an inside diameter which \nshall have a relation to the diameter of the specimen in \naccordance with Table 4. \n7. Dimensions, Mass, and Permissible Variations \n7.1 Rivets: \n7.1.1 The dimensions of rivets shall conform to \nB18.l.2 for nominal diameters in. and larger and Bl8.l.1 \nfor nominal diameters ½_ 6 in. and less. \n7 .1.2 Snap gage measurement shall be made at the \npoint of minimum diameter, but it is not required that the \nrivet shall turn completely in the gage. Measurements of \nthe maximum tolerance shall be made with a ring gage, \nall rivets to slip full to the head in the gage of the required \nsize for the various diameters. \n7 .2 Bars - The diameter of hot- finished rivet bars shall \nnot vary from the size specified by more than the amounts \nin accordance with Table 5. \n8. Workmanship, Finish, and Appearance \n8.1 Rivets - The finished rivets shall be true to form, \nconcentric, and free of injurious defects. \n8.2 Bars: \n8.2.1 Bars shall be free of visible pipe, undue segre­\ngation, and injurious surface imperfections. \n8.2.2 Surface Finish- The bars shall have a commer­\ncial hot-wrought finish obtained by conventional hot roll­\ning. See 4.4 for producer's descaling option. \n121 \n9. Number of Tests and Retests \n9.1 Rivets - Sampling for rivet bend and rivet flattening \ntests shall be in accordance with Guide F 1470, detection \nprocess. \n9.2 Bars: \n9.2.1 Two tension tests shall be made from each \nheat, unless the finished material from a heat is less than \n50 tons ( 45 Mg), when one tension test will be sufficient. \nHowever, for material 2 in. (51 mm) and under in thickness, \nwhen the material from one heat differs¾ in. (9.5 mm) or \nmore in thickness, one tension test shall be made from \nboth the thickest and the thinnest material rolled regardless \nof the weight represented. Each test shall conform to the \nspecified requirements. \n9.2.2 Retests on bars may be made in accordance \nwith Specification A 29 I A 29M. \n10. Specimen Preparation \n10.1 Rivets - Rivets shall be tested in their full-size \nfinished condition. \n10.2 Bars: \n10.2.1 Test specimen selection and preparation shall \nbe in accordance with Specification A 29 I A 29M and Test \nMethods and Definitions A 370. \n10.2.2 Tension and bend test specimens for rivet \nbars which have been cold drawn shall be normalized \nbefore testing. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0173.json",
  "tabulaTablesCsv": "tables_tabula/page-0173.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0173.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4311,
  "bestTextAlphaRatio": 0.7421
}