{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 235,
  "globalPageIndex": 235,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A--2025 SA-134/SA-134M \n15. Finish \n15.1 Repair by Welding-The welding of injurious defects \nin the pipe wall, provided their depth does not exceed one third \nthe specified wall thickness, will be permitted. Defects in the \nwelds, such as sweats or leaks, shall be repaired or the piece \nrejected at the option of the manufacturer. Repairs of this \nnature shall be made by completely removing the defect, \ncleaning the cavity, and then welding. \n15.2 All repaired pipe shall be tested hydrostatically in \naccordance with Section 11, unless otherwise specified in 11.3. \n16. Inspection \n16.1 The inspector representing the purchaser shall have \nentry at all times while work on the contract of the purchaser \nis being performed, to all parts of the manufacturer's works \nthat concern the manufacture of the material ordered. The \nmanufacturer shall afford the inspector all reasonable facilities \nto satisfy him that the material is being furnished in accordance \nwith this specification. All tests and inspection shall be made at \nthe place of manufacture prior to shipment and unless other­\nwise specified, shall be so conducted as not to interfere \nunnecessarily with the operation of the works. If agreed upon, \nthe manufacturer shall notify the purchaser in time so that he \nmay have his inspector present to witness any part of the \nmanufacture or tests that may be desired. The certification shall \ninclude reference to this specification and the pipe grade \n(ASTM plate specification designation and plate grade, when \napplicable). \n16.2 Certification-Upon request of the purchaser in the \ncontract or order, a manufacturer's certification that the mate­\nrial was manufactured and tested in accordance with this \nspecification together with a report of the chemical and tensile \ntests shall be furnished. When hydrostatic test is omitted, the \ncertificate shall include the letters \"NH.\" \n17. Rejection \n17.1 Each length of pipe received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of this specification based on the inspection and \ntest method as outlined in the specification, the length may be \nrejected, and the manufacturer shall be notified. Disposition of \nrejected pipe shall be a matter of agreement between the \nmanufacturer and the purchaser. \n17 .2 Pipe found in fabrication or in installation to be \nunsuitable for the intended use, under the scope and require­\nments of this specification, may be set aside and the manufac­\nturer notified. Such pipe shall be subject to mutual investiga­\ntion as to the nature and severity of the deficiency and the \nforming or installation, or both, conditions involved. Disposi­\ntion shall be a matter of agreement between the purchaser and \nthe manufacturer. \n18. Certification \n18.1 Upon request of the purchaser in the contract or order, \na manufacturer's certification that the material was manufac­\ntured and tested in accordance with this specification, including \nyear date, together with a report of the chemical and tensile \ntests shall be furnished. The pipe grade shall be identified by \nthe plate specification designation (year date not required) and \nthe plate grade (where applicable). \n19. Product Marking \n19.1 Each section of pipe shall be marked with the manu­\nfacturer's distinguishing marking, this specification number, \nand the pipe grade. The marking need not include the year date \nof the pipe or plate specification. \n19.2 Bar Coding-In addition to the requirements in 19.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. \n20. Protective Coating \n20.1 If agreed upon between the purchaser and the \nmanufacturer, the pipe shall be given a protective coating of the \nkind and in the manner specified by the purchaser. \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall be applied only when specified by \nthe purchaser in the inquiry, contract, or order. Details of these supplementary requirements shall be \nagreed upon in writing by the manufacturer and purchaser. Supplementary requirements shall in no \nway negate any requirement of the specification itself. \nSl. ASME Section III Construction \nS 1.1 Products furnished under this specification that are \nintended for application under the rules of the ASME Boiler \nand Pressure Vessel Code Section III, Class 3 Piping, shall be \nmanufactured by holders of the appropriate ASME Certificate \nof Authorization and Certification Mark. The product is subject \nto all applicable requirements of Section III, Class 3 Piping, \n183 \nincluding welding, heat treatment, nondestructive examination, \nauthorized inspection at the point of manufacture, and appli­\ncation of the Certification Mark. \nS 1.2 The applicable ASME Partial Data Report Form, \nsigned by an Authorized Nuclear Inspector, and a material test \nreport shall be furnished for each lot of pipe. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0235.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4995,
  "bestTextAlphaRatio": 0.7922
}