{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 537,
  "globalPageIndex": 1335,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-788/SA-788M \n1.3 The purchaser may specify additional requirements (see \n4.2.3) that do not negate any of the provisions of either this \nspecification or of the individual product specifications. The \nacceptance of any such additional requirements shall be \ndependent on negotiations with the supplier and must be \nincluded in the order. \n1.4 If, by agreement, forgings are to be supplied in a \npartially completed condition, that is, all of the provisions of \nthe product specification have not been filled, then the material \nmarking (see Section 17) and certification (see Section 16) \nshall reflect the extent to which the product specification \nrequirements have been met. \n1.5 As noted in the Certification Section (16), the number \nand year date of this specification, as well as that of the product \nspecification, are required to be included in the product \ncertification. \n1.6 When the SI version of a product specification is \nrequired by the purchase order, Specification A788/A788M \nshall be used in conjunction with Test Methods A1058 instead \nof Test Methods and Definitions A370. \n1. 7 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.8 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety and health practices and determine the applica­\nbility of regulatory limitations prior to use. \n2. Referenced Documents \n2.1 ASTM Standards: \nA266/A266M Specification for Carbon Steel Forgings for \nPressure Vessel Components \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA288 Specification for Carbon and Alloy Steel Forgings for \nMagnetic Retaining Rings for Turbine Generators \nA289/A289M Specification for Alloy Steel Forgings for \nNonmagnetic Retaining Rings for Generators \nA290/ A290M Specification for Carbon and Alloy Steel \nForgings for Rings for Reduction Gears \nA291/A291M Specification for Steel Forgings, Carbon and \nAlloy, for Pinions, Gears and Shafts for Reduction Gears \nA336/ A336M Specification for Alloy Steel Forgings for \nPressure and High- Temperature Parts \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA372/A372M Specification for Carbon and Alloy Steel \nForgings for Thin-Walled Pressure Vessels \n1273 \nA388/A388M Practice for Ultrasonic Examination of Steel \nForgings \nA427/A427M Specification for Wrought Alloy Steel Rolls \nfor Cold and Hot Reduction \nA469/A469M Specification for Vacuum-Treated Steel Forg­\nings for Generator Rotors \nA4 70/ A4 70M Specification for Vacuum-Treated Carbon and \nAlloy Steel Forgings for Turbine Rotors and Shafts \nA471/A471M Specification for Vacuum-Treated Alloy Steel \nForgings for Turbine Rotor Disks and Wheels \nA504/A504M Specification for Wrought Carbon Steel \nWheels \nA508/ A508M Specification for Quenched and Tempered \nVacuum-Treated Carbon and Alloy Steel Forgings for \nPressure Vessels \nA521/A521M Specification for Steel, Closed-Impression \nDie Forgings for General Industrial Use \nA541/A541M Specification for Quenched and Tempered \nCarbon and Alloy Steel Forgings for Pressure Vessel \nComponents \nA551/A551M Specification for Carbon Steel Tires for Rail­\nway and Rapid Transit Applications \nA579/ A579M Specification for Superstrength Alloy Steel \nForgings \nA592/A592M Specification for High-Strength Quenched \nand Tempered Low-Alloy Steel Forged Parts for Pressure \nVessels \nA646/ A646M Specification for Premium Quality Alloy Steel \nBlooms and Billets for Aircraft and Aerospace Forgings \nA649/A649M Specification for Forged Steel Rolls Used for \nCorrugating Paper Machinery \nA668/ A668M Specification for Steel Forgings, Carbon and \nAlloy, for General Industrial Use \nA711/A711M Specification for Steel Forging Stock \nA 723/ A 723M Specification for Alloy Steel Forgings for \nHigh-Strength Pressure Component Application \nA 729/ A 729M Specification for Alloy Steel Axles, Heat­\nTreated, for Mass Transit and Electric Railway Service \nA751 Test Methods, Practices, and Terminology for Chemi­\ncal Analysis of Steel Products \nA765/A765M Specification for Carbon Steel and Low-Alloy \nSteel Pressure-Vessel-Component Forgings with Manda­\ntory Toughness Requirements \nA768/A768M Specification for Vacuum-Treated 12 % Chro­\nmium Alloy Steel Forgings for Turbine Rotors and Shafts \nA833 Practice for Indentation Hardness of Metallic Materi­\nals by Comparison Hardness Testers \nA837/A837M Specification for Steel Forgings, Alloy, for \nCarburizing Applications \nA859/A859M Specification for Age-Hardening Alloy Steel \nForgings for Pressure Vessel Components \nA891/A891M Specification for Precipitation Hardening Iron \nBase Superalloy Forgings for Turbine Rotor Disks and \nWheels \nA909/ A909M Specification for Steel Forgings, Microalloy, \nfor General Industrial Use \nA939/A939M Practice for Ultrasonic Examination from \nBored Surfaces of Cylindrical Forgings ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1335.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5231,
  "bestTextAlphaRatio": 0.7693
}