{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 628,
  "globalPageIndex": 628,
  "width": 612.6,
  "height": 853.8,
  "text": "SA-369/SA-369M (ASTM A369/A369M) ASME BPVC.II.A-2025 \n& Designation: A369/A369M - 23 \n~ull 7 \nINTERNATIONAi. \nStandard Specification for \nCarbon and Ferritic Alloy Steel Forged and Bored Pipe for \nHigh-Temperature Service 1 \nThis standard is issned under the fixed designation A369/ A369M; the number immediately following the designation indicates the year \nof odginal adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscdpt epsilon (e) indicates an editodal change since the last revision or reapproval. \n1. Scope* \n1.1 This specification 2 covers heavy-wall carbon and alloy \nsteel pipe (Note 1) made from turned and bored forgings and is \nintended for high-temperature service. Pipe ordered under this \nspecification shall be suitable for bending and other forming \noperations and for fusion welding. Selection will depend on \ndesign, service conditions, mechanical properties and high­\ntemperature characteristics. \nNoTE 1-The use of the word \"pipe\" throughout the several sections of \nthis specification is used in the broad sense and intended to mean pipe \nheaders, or leads. \nNoTE 2-The dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiameter,\" \"size,\" and '\"nominal size.\" \n1.2 Several grades of ferritic steels are covered. Their \ncompositions are given in Table 1. \n1.3 Supplementary requirements (S 1 to S7) of an optional \nnature are provided. Supplementary requirements S 1 to S5 call \nfor additional tests to be made, and when desired shall be so \nstated in the order, together with the number of such tests \nrequired as applicable. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom-\n1 This specification is under the jurisdiction of ASTM Committee AO! on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.10 on Stainless and Alloy Steel Tubular Products. \nCurrent edition approved May 1, 2023. Published May 2023. Originally \napproved in 1953. Last previous edition approved in 2018 as A369/A369M - !Sa. \nDOI: 10.1520/A0369_A0369M-23. \n2 For ASME Boiler and Pressure Vessel Code applications see related Specifi­\ncation SA-369 in Section II of that Code. \nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.l ASTM Standards: 3 \nA999/ A999M Specification for General Requirements for \nAlloy and Stainless Steel Pipe \nE290 Test Methods for Bend Testing of Material for Ductil­\nity \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \n2.2 ASME Boiler and Pressure Vessel Code: 4 \nSection IX \n2.3 ASME Standard: 4 \nB 46.1 Surface Texture \n2.4 A WS Specifications: 5 \nA5.5/A5.5M Specification for Low-Alloy Steel Electrodes \nfor Shielded Metal Arc Welding \nA5.23/A5.23M Specification for Low-Alloy Steel Elec­\ntrodes and Fluxes for Submerged Arc Welding \nA5.28/A5.28M Specification for Low-Alloy Steel Elec­\ntrodes for Gas Shielded Arc Welding \nA5.29/A5.29M Low-Alloy Steel Electrodes for Flux Cored \nArc Welding \n3. Ordering Information \n3.1 Orders for material to this specification should include \nthe following, as required, to describe the desired material \nadequately: \n3.1.1 Quantity (feet, centimetres, or number of lengths), \n3.1.2 Name of material (forged and bored pipe), \n3.1.3 Grade (Table 1), \n3.1.4 Size (inside diameter and minimum wall thickness), \n3 For referenced ASTM standards, visit the ASTM website, www.astm.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \n4 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n5 Available from American Welding Society (AWS), 550 NW LeJeune Rd., \nMiami, FL 33126, http://www.aws.org. \n* A Summary of Changes section appears at the end of this standard \n576 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0628.json",
  "tabulaTablesCsv": "tables_tabula/page-0628.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0628.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4757,
  "bestTextAlphaRatio": 0.7511,
  "noteOcrPath": "note_ocr/page-0628.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 1—The use of the word “pipe” throughout the several sections of"
  ]
}