{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 542,
  "globalPageIndex": 1340,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-788/SA-788M ASME BPVC.II.A-2025 \n8.5 Residual and Unspecified Elements-Provisions for the \nlimitation of certain residual and unspecified elements have \nbeen made in Supplementary Requirements Sl and S2, respec­\ntively. \n8.6 Grade substitution is not permitted. \n8.7 Method of Analysis-Methods included in Test \nMethods, Practices, and Terminology A751 shall be used for \nreferee purposes. \n9. Heat Treatment \n9.1 Heat treatment shall be performed as specified in the \nproduct specification. Supplementary Requirement S4 con­\ncerns a specialized heat treat process (see 3.5.3) whose \napplication will be controlled in the product specification. \nUnless otherwise specified during a heat treating hold cycle, \nthe recorded furnace temperature shall be within ±25°F \n[± 15°C) of the controlling set point temperature. Material \nshall be heat treated in the working zone of a furnace that has \nbeen surveyed in accordance with Test Method A991/A991M \nprovided that the working zone was established using a \nvariation of ±25°F [± 15°C] or less from the furnace set point. \n10. Mechanical Testing \n10.1 Test Methods-Except as specified in 4.1.5 or 10.2.1 \nand 10.2.2, all tests shall be conducted in accordance with Test \nMethods and Definitions A37O. When forgings are ordered to \nSI requirements (M suffix standard) Test Methods A1058 shall \nbe used (see 4.1.5). \n10.1.1 In addition to the hardness testing provisions of Test \nMethods and Definitions A37O or, when required, Test Meth­\nods Al058, comparison hardness testing in accordance with \nPractice A833 may be used in determining the hardness of \nforgings. \n10.2 Fracture Appearance Transition Temperature \n( FAIT ,J-For a product specification (including M suffix SI \nspecifications) that requires the determination of the fracture \nappearance transition temperature (FATT 0 ) where n is the \nrequired minimum percentage of shear fracture as measured on \nthe fracture surface of a Charpy V-notch sample by one of the \nmethods described in Test Methods and Definitions A37O, the \nCharpy test specimen location and orientation shall be as \nspecified in the product standard. \n10.2.1 When the actual fracture appearance transition tem­\nperature is required, break at least four specimens that have \nbeen taken from a comparable location. Test each specimen at \na different temperature such that the percentage of shear \nfracture will be both above and below the value of n, but within \na range of ±0.60 times that of the specified value of n. It is \ndesirable that two of the specimens will have values of \ncleavage fracture above the value of n, and two will have \nvalues below this level. Plot the percentage shear fracture \nagainst test temperature and determine the transition tempera­\nture by interpolation (extrapolation is not permitted). \n10.2.2 When rather than calling for an actual FATTn as \ndescribed in 10.2.1, the product specification requires a mini­\nmum PATT n at a given temperature then, unless otherwise \nspecified, a single test run at the required temperature satisfies \nthe requirement provided that the fracture appearance value is \nat least n. For example, a single test run at 10O°P [38°C] with \na fracture appearance of 55 % shear fracture satisfies a require­\nment of FATT 50 at 10O°F [38°C]. \n10.3 Retests-If the results of the tests do not conform to the \nrequirements specified, retests are permitted as outlined in Test \nMethods and Definitions A37O or as follows: \n10.3.1 If the percentage of elongation or reduction of area of \nany tension test specimen is less than specified because a flaw \nbecomes evident in the test specimen during testing, a retest \nshall be allowed provided that the defect was not attributable to \nruptures, cracks, or flakes in the steel. \n10.3.2 If the average impact energy value meets the speci­\nfication requirements, but the energy value for one specimen is \nbelow the specified minimum value for individual specimens \nprescribed in the material specification, a retest is permitted. \nThis shall consist of two impact specimens from a location \nadjacent to and on either side of the specimen that failed. Each \nof the retested specimens must exhibit an energy value equal to \nor greater than the minimum average value required by the \nproduct specification. \n11. Reheat Treatment \n11.1 If the results of the initial mechanical tests do not \nconform to the specified requirements, the forgings may be \nheat treated (if initially tested in the as-forged condition) or \nreheat treated (if heat treated prior to initial testing). \n12. Repair Welding \n12.1 Repair welding of forgings is not permitted unless \nspecifically allowed by the product specification (see also \n4.2.4). \n13. Dimensions and Finish \n13.1 The forgings shall conform to the dimensions, \ntolerances, and finishes required by the ordering information \n(4.1.2). Supplementary Requirements S5 or S6, concerning \nstraightening of forgings, may be used. \n13.2 When surface finish, roughness, or texture is specified \nin a steel forging product standard, unless otherwise required \nby the purchaser, the roughness average (Ra), as defined in \nANSI/ASME B46.1, shall be used (see 4.1.2). \n14. Inspection \n14.1 The manufacturer is responsible for the performance of \nall inspection and test requirements specified. The absence of \nany inspection requirements in the specification shall not \nrelieve the contractor of the responsibility for ensuring that all \nproducts comply with all requirements of the contract. The \nmanufacturer may use his own or any other suitable facilities \nfor the performance of the inspection and test requirements \nunless disapproved by the purchaser at the time the order is \nplaced. \n14.2 The manufacturer shall afford the purchaser's inspector \nall reasonable facilities necessary to satisfy him that the \nmaterial is being produced and furnished in accordance with \nthe material specification. \n1278 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1340.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5908,
  "bestTextAlphaRatio": 0.7703
}