{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 630,
  "globalPageIndex": 1428,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-859/SA-859M (ASTM A859/A859M) ASME BPVC.II.A-2025 \nA Designation: A859/A859M - 04 (Reapproved 2019t 1 \n~u11 7 \nINTERNATIONAL \nStandard Specification for \nAge-Hardening Alloy Steel Forgings for Pressure Vessel \nComponents 1 \nThis standard is issued under the fixed designation A859/A859M; the number immediately following the designation indicates the year \nof original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscript epsilon (e) indicates an editorial change since the last revision or reapproval. \ne 1 NOTE-MPa value was added in 1.2.2 editorially in April 2019. \n1. Scope \n1.1 This specification covers requirements for low-carbon \nage-hardening nickel-copper-chromium-molybdenum­\ncolumbium alloy steel forgings for pressure vessel compo­\nnents. \n1.2 Forgings under this specification are available as Grades \nA or B. Grade A may be ordered in one or two classes as \nfollows: \n1.2.1 Grade A Class J-Normalized-and-precipitation-heat­\ntreated, providing a minimum yield strength of 55 ksi \n[380 MPa] and a minimum tensile strength of 65 ksi \n[450 MPa]. \n1.2.2 Grade A Class 2-Quenched-and-precipitation-heat­\ntreated, providing a minimum yield strength of 65 ksi \n[450 MPa] and a minimum tensile strength of 75 ksi \n[515 MPa]. \n1.2.3 Grade A was the original steel composition in this \nspecification. \n1.3 Although the material is readily weldable, welding \nprocedures are of fundamental importance and must be such as \nnot to affect adversely the properties of the material, especially \nin the heat-affected zone. It is presupposed that welding \nprocedures will be suitable for the material being welded. \n1.4 Supplementary requirements, including those applicable \nin Specification A788/A788M, are provided for use when \nadditional testing or inspection is desired. These shall apply \nonly when specified individually by the purchaser in the order. \n1.5 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system are not necessarily exact equivalents; therefore, to \nensure conformance with the standard, each system shall be \nused independently of the other and values from the two \nsystems shall not be combined. \n1 This specification is under the jurisdiction of ASTM Committee AO! on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.06 on Steel Forgings and Billets. \nCurrent edition approved March I, 2019. Published April 2019. Originally \napproved in 1986. Last previous edition approved in 2014 as A859/A859M---04 \n(2014 ). DOI: 10.1520/ A0859 _A0859M---04Rl 9E01. \n1.6 This specification is expressed in both inch-pound and \nSI units. However, unless the order specifies the applicable \n\"M\" specification designation [SI units], the material shall be \nfurnished to inch-pound units. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards:2 \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA388/A388M Practice for Ultrasonic Examination of Steel \nForgings \nA 788/ A 788M Specification for Steel Forgings, General Re­\nquirements \nE208 Test Method for Conducting Drop-Weight Test to \nDetermine Nil-Ductility Transition Temperature of Fer­\nritic Steels \nE604 Test Method for Dynamic Tear Testing of Metallic \nMaterials \n2.2 ASME Standard: 3 \nASME Boiler and Pressure Vessel Code-Section IX \n3. Ordering Information and General Requirements \n3.1 In addition to the ordering information required by \nSpecification A788/A788M, the purchaser shall include with \nthe inquiry and order a detailed drawing, sketch, or written \n2 For referenced ASTM standards, visit the ASTM website, www.asttn.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \n3 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n1366 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1428.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4495,
  "bestTextAlphaRatio": 0.7539,
  "noteOcrPath": "note_ocr/page-1428.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1428.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}