{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 225,
  "globalPageIndex": 225,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC,II.A-2025 SA-106/SA-106M \n14.3 The following information is for the benefit of the user \nof this specification: \n14.3.1 The reference standards defined in 14.4 through 14.6 \nare convenient. standards for calibration of nondestructive \ntesting equipment. The dimensions of such standards are not to \nbe construed as the minimum sizes of imperfections detectable \nby such equipment. \n14.3.2 The ultrasonic testing referred to in this specification \nis capable of detecting the presence and location of significant \nlongitudinally or circumferentially oriented imperfections; \nhowever, different techniques need to be employed for the \ndetection of such differently oriented imperfections. Ultrasonic \ntesting is not necessarily capable of detecting short, deep \nimperfections. \n14.3.3 The eddy current examination referenced in this \nspecification has the capability of detecting significant \nimperfections, especially of the short abrupt type. \n14.3.4 The flux leakage examination referred to in this \nspecification is capable of detecting the presence and location \nof significant longitudinally or transversely oriented imperfec­\ntions; however, different techniques need to be employed for \nthe detection of such differently oriented imperfections. \n14.3.5 The hydrostatic test referred to in Section 13 has the \ncapability of finding defects of a size permitting the test fluid \nto leak through the tube wall and may be either visually seen \nor detected by a loss of pressure. Hydrostatic testing is not \nnecessarily capable of detecting very tight, through-the-wall \nimpe1fections or imperfections that extend an appreciable \ndistance into the wall without complete penetration. \n14.3.6 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of discontinuities that can \nbe detected in the specific applications of these examinations is \ndirected to discuss this with the manufacturer of the tubular \nproduct. \n14.4 For ultrasonic testing, the calibration reference notches \nshall be, at the option of the producer, any one of the three \ncommon notch shapes shown in Practice E213. The depth of \nnotch shall not exceed 12½ % of the specified wall thickness of \nthe pipe or 0.004 in. [0.1 mm], whichever is greater. \n14.5 For eddy current testing, the calibration pipe shall \ncontain, at the option of the producer, any one of the following \ndiscontinuities to establish a minimum sensitivity level for \nrejection: \n14.5.1 Drilled Hole-The calibration pipe shall contain \ndepending upon the pipe diameter three holes spaced 120° \napart or four holes spaced 90° apart and sufficiently separated \nlongitudinally to ensure separately distinguishable responses. \nThe holes shall be drilled radially and completely through the \npipe wall, care being taken to avoid distortion of the pipe while \ndrilling. Depending upon the pipe diameter the calibration pipe \nshall contain the following hole: \nNPS ON Diameter of Drilled Hole \ns ½ s 15 0.039 in. [1 mm] \n> ½ s 1¼ > 15 s 32 0.055 in. [1.4 mm] \n> 1¼ s 2 > 32 s 50 0.071 in. [1.8 mm] \n> 2 s 5 > 50 s 125 0.087 in. [2.2 mm] \n>5 > 125 0.106 in. [2.7 mm] \n14.5.2 Transverse Tangential Notch-Using a round tool or \nfile with a ¼-in. [6-mm] diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the pipe. The notch shall have a depth not \nexceeding 12 ½ % of the specified wall thickness of the pipe or \n0.004 in. [0.1 mm], whichever is greater. \n14.5.3 Longitudinal Notch-A notch 0.031 in. [0.8 mm] or \nless in width shall be machined in a radial plane parallel to the \ntube axis on the outside surface of the pipe, to have a depth not \nexceeding 12 ½ % of the specified wall thickness of the tube or \n0.004 in. [0.1 mm], whichever is greater. The length of the \nnotch shall be compatible with the testing method. \n14.5.4 Compatibility-The discontinuity in the calibration \npipe shall be compatible with the testing equipment and the \nmethod being used. \n14.6 For flux leakage testing, the longitudinal calibration \nreference notches shall be straight-sided notches machined in a \nradial plane parallel to the pipe axis. For wall thicknesses under \n½ in. [12.7 mm], outside and inside notches shall be used; for \nwall thicknesses equal to and above½ in. [12.7 mm], only an \noutside notch shall be used. Notch depth shall not exceed \n12½ % of the specified wall thickness, or 0.004 in. [0.1 mm], \nwhichever is greater. Notch length shall not exceed 1 in. [25 \nmm], and the width shall not exceed the depth. Outside \ndiameter and inside diameter notches shall be located suffi­\nciently apart to allow separation and identification of the \nsignals. \n14.7 Pipe containing one or more imperfections that pro­\nduce a signal equal to or greater than the signal produced by the \ncalibration standard shall be rejected or the area producing the \nsignal shall be reexamined. \n14.7.1 Test signals produced by imperfections which cannot \nbe identified, or produced by cracks or crack-like imperfections \nshall result in rejection of the pipe, unless it is repaired and \nretested. To be accepted, the pipe must pass the same specifi­\ncation test to which it was originally subjected, provided that \nthe remaining wall thickness is not decreased below that \npennitted by this specification. The OD at the point of grinding \nmay be reduced by the amount so reduced. \n14.7.2 Test signals produced by visual imperfections such as \nthose listed below may be evaluated in accordance with the \nprovisions of Section 18: \n173 \n14.7.2.1 Dinges, \n14.7.2.2 Straightener marks, \n14.7.2.3 Cutting chips, \n14.7.2.4 Scratches, \n14.7.2.5 Steel die stamps, \n14.7.2.6 Stop marks, or \n14.7.2.7 Pipe reducer ripple. \n14.8 The test methods described in this section are not \nnecessarily capable of inspecting the end portion of pipes, a \ncondition referred to as \"end effect.\" The length of such end \neffect shall be determined by the manufacturer and, when \nspecified in the purchase order, reported to the purchaser. \n15. Nipples \n15.1 Nipples shall be cut from pipe of the same dimensions \nand quality described in this specification. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0225.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6153,
  "bestTextAlphaRatio": 0.7457
}