{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 703,
  "globalPageIndex": 1501,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-985/SA-98SM \nS21. Heat-Treatment Furnace Record \nS21.1 A heat-treatment chart showing time and temper­\nature shall be prepared and be available for inspection by \nthe purchaser. \nS22. Heat Treatment \nS22.1 Test specimens shall be heat treated together \nwith the castings they represent. Heat-treated specimens \nshall be tested and shall meet the tensile and impact proper­\nties specified. \nS22.2 The remaining test specimens from Supplemen­\ntary Requirement S22. l representing the casting shall be \ntreated thermally after the final (foundry) heat treatment \nto simulate heat treatments below the transformation tem­\nperature, which the casting may receive during fabrication, \nand then tested for mechanical properties. Time, tempera­\nture, and cooling rate shall be as stated in the order. In the \ncase of postweld heat treatment, the total time at tempera­\nture or temperatures for the test material shall be at least \n80% of the total time at temperature or temperatures during \nactual postweld heat treatment of the fabrication of which \nthe casting or castings are a part. The total time at tempera­\nture or temperatures for the test material may be performed \nin a single cycle. When this Supplementary Requirement \nis specified, the welding qualification test metal must be \nprocessed in the same manner. \nS23. Macroetch Test \nS23.1 Apply Supplementary Requirement S 1 for the \nspectrographic determination and reporting of the total \nresidual aluminum content of all heats of ferritic and mar­\ntensitic steels subjected to this macroetch test. \nS23.2 When the heat analysis indicates a total residual \naluminum content in excess of 0.08%, the manufacturer \nshall etch a cross section of the casting with the heaviest \nsection for which this supplementary requirement is \ninvoked, or a coupon attached to that heaviest section or \nan area directly under a riser (see Note S23.l). Cross sec­\ntions, from a separately cast test block from the same heat \nand a thickness representative of the heaviest section of \ncastings purchased under this supplementary requirement, \nalso may be used for macroetch testing. The etching shall \nbe performed on the selected section after its heat treatment, \nthat is, after annealing, normalizing, or quenching and \ntempering following the initial cooling of the steel below \nthe transformation range. \nNOTE S23.l - High-strength martensitic castings, in particular, may \nbe damaged beyond use if the etch is applied directly to the casting. \nS23.3 The preparation of the surface and the macro­\netching procedure with solution No. 1 (1: 1 HCl) of Table 5 \nin Test Method E 340 shall be followed. The resulting \netched surface shall be compared and rated with the refer­\nence photographs in Fig. S23.l depicting ten levels of \nseverity of intergranular network structures indicative of \nthe presence of aluminum nitride, or other constituents \nprone toward precipitating at grain boundaries during solid­\nification and subsequent cooling. Table S23.1 relates the \nseverity levels shown in these photographs with specific \ndelineation widths and percent of boundary outlining in \nthe etched structures. \nS23.4 Castings represented by etched structures exhib-\n. iting a network rating in excess of Severity Level 4 shall \nbe considered unacceptable until further evaluations are \ncompleted. The acceptability of individual castings may \nbe determined by etching sections of each casting to ascer­\ntain the network severity level. Disposition ofunacceptable \ncastings shall be a matter of agreement between the manu­\nfacturer and purchaser. Those castings exhibiting etched \nseverity levels greater than four may be further evaluated \nby any of the following agreed upon methods. \nS23.4.1 Fracture testing to determine the amount of \n\"rock candy\" structure. \nS23.4.2 Mechanical testing (bend, tensile, and so \nforth) to determine the ductility characteristics. \nS23.4.3 Weld testing to determine crack susceptibil­\nity in the heat~affected zone of a circular groove welded \nwith cellulose coated electrodes. \nS23.5 Alternatively, by agreement, it is permissible \nto subject castings from an unacceptable heat to a high \ntemperature solution treatment prior to the normal produc­\ntion heat-treatment and subsequently macroetch test each \ncasting. \nS24. Specified Ferrite Content Range \nS24.1 The chemical composition of the heat shall be \ncontrolled such that the ferrite content, as determined by \nthe chemical composition procedure of Practice \nA 800 / A 800M, shall be in accordance with the specified \nferrite content range. \nS24.2 The specified ferrite content range shall be as \nagreed upon between the manufacturer and the purchaser. \nThe minimum specified ferrite content range shall be 10% \nwith the minimum ferrite content being no lower than \nthe percent necessary to achieve the minimum mechanical \nproperties required for the alloy. \nS24.3 Should the purchaser wish to have the ferrite \ncontent determined by either magnetic response or metallo­\ngraphic methods, the purchaser should impose Supplemen­\ntary Requirement S 1 or S2 of Practice A 800 / A 800M. \n1445 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1501.json",
  "tabulaTablesCsv": "tables_tabula/page-1501.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1501.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5136,
  "bestTextAlphaRatio": 0.788
}