{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 524,
  "globalPageIndex": 524,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-320 /SA-320M ASME BPVC.II.A-2025 \nstarting material; steel bars-alloy; steel bolting; steel flanges; \nsteel valves; temperature service applications-low \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall apply only when specified by the purchaser in the \ninquiry, contract, and order. \nSl. Impact Properties \nS 1.1 When impact properties are desired for austenitic steel \ngrades exempt from testing under 6.2.1, test shall be made as \nagreed between the manufacturer and the purchaser. \nS2. Lateral Expansion \nS2. l When lateral expansion measurements for ferritic \nsteels are required in addition to the energy absorption require­\nments of 6.2.1.1, the minimum value for each specimen of a set \nmust be .015 in. [0.38 mm]. The test temperature shall be \nspecified by the purchaser and agreed upon by the producer. \nNorn S2.1-Grades 17, 17A, 17B will generally have diffi.culty \nmeeting the minimum value at -150 °F [-101 °C]. Grade 143 may be \npreferred. \nS3. Hardness Testing of Class 2 Bolting Components for \nASME Applications \nS3.l The maximum hardness shall be Rockwell C35 imme­\ndiately under the thread roots. The hardness shall be taken on \na flat area at least Vs in. [3 mm] across, prepared by removing \nthreads. No more material than necessary shall be removed to \nprepare the flat area. Hardness determinations shall be made at \nthe same frequency as tensile tests. \nS4. Restriction to Use Only Ingot Cast Steel \nS4.1 The starting material must be ingot cast. Use of \ncontinuous cast material is not permitted. \nAPPENDIX \n(Nonmandatory Information) \nXl. STRAIN HARDENING OF AUSTENITIC STEELS \nXl.1 Strain hardening is the increase in strength and hard­\nness that results from plastic deformation below the recrystal­\nlization temperature (cold work). This effect is produced in \naustenitic stainless steels by reducing oversized bars or wire to \nthe desired final size by cold drawing or other process. The \ndegree of strain hardening achievable in any alloy is limited by \nits strain hardening characteristics. In addition, the amount of \nstrain hardening that can be produced is further limited by the \nvariables of the process, such as the total amount of cross­\nsection reduction, die angle, and bar size. In large diameter \nbars, for example, plastic deformation will occur principally in \nthe outer regions of the bar, so that the increased strength and \nhardness due to strain hardening is achieved predominantly \nnear the surface of the bar. That is, the smaller the bar, the \n472 \ngreater the penetration of strain hardening. \nXl.2 Thus, the mechanical properties of a given strain \nhardened bolting components, such as a bolt, screw, or stud, are \ndependent not just on the alloy, but also on the size of bar from \nwhich it is machined. The minimum bar size that can be used, \nhowever, is established by the configuration of the component, \nso that the configuration can affect the strength of the compo­\nnent. \nXl.3 For example, a stud of a particular alloy and size may \nbe machined from a smaller diameter bar than a bolt of the \nsan1e alloy and size because a larger diameter bar is required to \naccommodate the head of the bolt. The stud, therefore, is likely \nto be stronger than the same size bolt in a given alloy. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0524.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3274,
  "bestTextAlphaRatio": 0.7724
}