{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 760,
  "globalPageIndex": 760,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-423 /SA-4Z3M ASME BPVC.11.A-Z0ZS \n13. Product Marking \n13.1 In addition to the marking prescribed in Specification \nA450/ A450M, the marking shall include whether hot finished \nor cold finished, and whether seamless or welded. \n14. Keywords \n14.1 seamless steel tube; steel tube; alloy; welded steel tube \nSUPPLEMENTARY REQUIREMENTS \nSl. Surface Condition \nS 1.1 If pickling or shot blasting, or both, are required, this \nshall be specifically stated in the order and shall be done at the \npurchaser's expense. Pickling or shot blasting shall apply only \nwhen specified by the purchaser in the inquiry, contract, or \norder. Details of this supplementary requirement shall be \nagreed upon by the manufacturer and the purchaser. \nS2. Additional Testing of Welded Tubing per ASME \nRequest \nS2.1 Each tube shall be subjected to an ultrasonic inspection \nemploying Practices E273 or E213 with the rejection criteria \nreferenced in Specification A450/ A450M. \nS2.2 If Practice E273 is employed, a 100 % volumetric \ninspection of the entire length of each tube shall also be \nperformed using one of the non-destructive electric tests \npermitted by Specification A450/A450M. \n710 \nS2.3 The test methods described in the supplement may not \nbe capable of inspecting the end portions of tubes. This \ncondition is referred to as end effect. This portion, as deter­\nmined by the manufacturer, shall be removed and discarded. \nS2.4 In addition to the marking prescribed in Specification \nA450/ A450M, \"S2'' shall be added after the grade designation. \nS2.5 Additional Testing of Welded Tubing shall have been \nspecified in the inquiry or invitation to bid, and purchase order \nor contract. The requirements shall not be considered unless \nspecified in the order and the necessary tests shall be made at \nthe mill. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0760.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 1804,
  "bestTextAlphaRatio": 0.7561
}