{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 138,
  "globalPageIndex": 936,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-508/SA-S0BM ASME BPVC.II.A-2025 \nSpecification for \nQuenched and Tempered Vacuum-Treated Carbon and Alloy \nSteel Forgings for Pressure Vessels \n1. Scope \n1.1 This specification covers quenched and tempered \nvacuum-treated carbon and alloy steel forgings for pressure \nvessels such as those used in reactor systems. Specifically, it \ncovers forgings for vessel closures, shells, flanges, tube sheets, \nrings, heads, and similar parts. \n1.2 All grades are considered weldable under proper condi­\ntions. Welding technique is of fundamental importance, and it \nis presupposed that welding procedure and inspection will be in \naccordance with approved. methods for the grade of material \nused. \n1.3 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.4 Unless the order specifies the applicable \"M\" specifica­\ntion designation, the material shall be furnished to the inch­\npound units. \nNorn I-Grades 1 and lA are composed of different chemistries but \nhave the same mechanical requirements. \nNom 2-Designations have been changed as follows: \nCurrent \nGrade 1 \nGrade 1A \nGrade 2 Class 1 \nGrade 2 Class 2 \nGrade 3 Class 1 \nGrade 3 Class 2 \nGrade 4N Class 1 \nGrade 4N Class 2 \nFormerly \nClass 1 \nClass 1A \nClass 2 \nClass 2A \nClass 3 \nClass 3A \nClass 4 \nClass 4A \nGrade 4N Class 3 \nGrade 5 Class 1 \nGrade 5 Class 2 \nGrade 22 Class 3 \nGrade 22 Classes 4, 5, 6, and 7 \nClass 4B \nClass 5 \nClass SA \nClass 22B \nGrade 3V Class 3V \n1.5 This standard does not purport to address all of the \nsafety concerns, if any, associated with _its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n836 \n2. Referenced Documents \n2.1 ASTM Standards: \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA388/A388M Practice for Ultrasonic Examination of Steel \nForgings \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nA966/ A966M Practice for Magnetic Particle Examination of \nSteel Forgings Using Alternating Current \nE208 Test Method for Conducting Drop-Weight Test to \nDetermine Nil-Ductility Transition Temperature of Fer­\nritic Steels \nE428 Practice for Fabrication and Control of Metal, Other \nthan Aluminum, Reference Blocks Used in Ultrasonic \nTesting ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0936.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3014,
  "bestTextAlphaRatio": 0.7631
}