{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 380,
  "globalPageIndex": 380,
  "width": 602.64,
  "height": 846.48,
  "text": "SA-234/SA-234M (ASTM A234/A234M) ASME BPVC.II.A-2025 \ncft Designation: A234/A234M - 23a \n~ull \nINTERNATIONAi. \nStandard Specification for \nPiping Fittings of Wrought Carbon Steel and Alloy Steel for \nModerate and High Temperature Service 1 \nThis standard is issued under the fixed designation A234/A234M; the number immediately following the designation indicates the year \nof original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscript epsilon (e) indicates an editorial change since the last revision or reapproval. \nThis standard has been approved for use by agencies of the U.S. Department of Defense. \n1. Scope* \n1.1 This specification 2 covers wrought carbon steel and \nalloy steel fittings of seamless and welded construction covered \nby the latest revision of ASME B16.9, B16.11, MSS-SP-79, \nMSS-SP-83, MSS-SP-95, and MSS-SP-97. These fittings are \nfor use in pressure piping and in pressure vessel fabrication for \nservice at moderate and elevated temperatures. Fittings differ­\ning from these ASME and MSS standards shall be furnished in \naccordance with Supplementary Requirement S58 of Specifi­\ncation A960/ A960M. \n1.2 Optional supplementary requirements are provided for \nfittings where a greater degree of examination is desired. When \ndesired, one or more of these supplementary requirements may \nbe specified in the order. \n1.3 This specification does not cover cast welding fittings or \nfittings machined from castings. Cast steel welding fittings are \ngoverned by Specifications A216/A216M and A217/A217M. \n1.4 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the mate­\nrial shall be furnished to inch-pound units. \n1.5 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \n1 This specification is under the jurisdiction of ASTM Committee A0l on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.22 on Steel Forgings and Wrougbt Fittings for Piping Applications and Bolting \nMaterials for Piping and Special Purpose Applications. \nCurrent edition approved May 1, 2023. Published May 2023. Originally \napproved in 1940. Last previous edition approved in 2023 as A234/A234M- 23. \nDOI: 10.1520/A0234_A0234M-23A. \n2 For ASME Boiler and Pressure Vessel Code applications see related Specifi­\ncation SA-234 in Section II of that Code. \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 In addition to those reference documents listed in \nSpecification A960/A960M, the following list of standards \napply to this specification. \n2.2 ASTM Standards: 3 \nAl05/A105M Specification for Carbon Steel Forgings for \nPiping Applications \nA216/A216M Specification for Steel Castings, Carbon, Suit­\nable for Fusion Welding, for High-Temperature Service \nA217 / A217M Specification for Steel Castings, Martensitic \nStainless and Alloy, for Pressure-Containing Parts, Suit­\nable for High-Temperature Service \nA960/ A960M Specification for Common Requirements for \nWrought Steel Piping Fittings \n2.3 ASME Standards.A \nB16.9 Steel Butt-Welding Fittings \nB16.ll Forged Steel Fittings, Socket Welding and Threaded \n2.4 ASME Boiler and Pressure Vessel Code: 4 \nSection ill \nSection V \nSection VIII, Division 1 \nSection IX \n2.5 MSS Standards: 5 \nMSS-SP-25 Standard Marking System for Valves, Fittings, \nFlanges, and Unions \nMSS-SP- 79 Socket Welding Reducer Inserts \n3 For referenced ASTM standards, visit the ASTM website, www.astm.org, or \ncontact ASTM Customer Service at service@astm.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Document Summary page on \nthe ASTM website. \n4 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n5 Available from Manufacturers Standardization Society of the Valve and Fittings \nIndustry (MSS), 127 Park St., NE, Vienna, VA 22180-4602, http://www.mss­\nhq.com. \n* A Summary of Changes section appears at the end of this standard \n328 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0380.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4800,
  "bestTextAlphaRatio": 0.7562
}