{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 258,
  "globalPageIndex": 1056,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-563 ASME BPVC.II.A-2025 \n5.5 Chemical analyses shall be performed in accor­\ndance with Test Methods, Practices, and Terminology \nA 751. \n6. Mechanical Properties \n6.1 Hardness: \n6.1.1 The hardness of nuts of each grade shall not \nexceed the maximum hardness specified for the grade in \nTable 3. \n6.1.2 Jam nuts, slotted nuts, nuts smaller in width \nacross flats or thickness than standard hex nuts (7.1), and \nnuts that would require a proof load in excess of 160 000 lbf \nmay be furnished on the basis of minimum hardness \nrequirements specified for the grade in Table 3, unless proof \nload testing is specified in the inquiry and purchase order. \n6.2 Proof Load: \n6.2.1 Nuts of each grade, except those listed in 6.1.2, \nshall withstand the proof load stress specified for the grade, \nsize, style, thread series, and surface finish of the nut in \nTable 3 and Table 4. \n6.2.2 Nuts hot dip or mechanically zinc coated in \naccordance with 4.7.2 or 4.7.3 shall be proof load tested \nafter zinc coating and overtapping. \n7. Dimensions \n7.1 Unless otherwise specified, nuts shall be plain \n(uncoated) and shall conform to the dimensions prescribed \nin ANSI B18.2.2. \n7.2 Hex and hex-slotted nuts over 1½ to 2 in. inclusive \nshall have dimensions conforming to ANSI Bl8.2.2 calcu­\nlated using the formulas for the 1 ¼ through 1 ½ in. size \nrange in Appendix III (Formulas for Nut Dimensions) of \nANSI Bl8.2.2. \n7.3 Threads: Plain (Uncoated) Nuts \n7.3.1 Unless otherwise specified, the threads shall \nconform to the dimensions for coarse threads with Class 2B \ntolerances prescribed in ANSI B 1.1. \n7.4 Threads: Nuts Hot Dip Zinc Coated Specification \nF 2329 (4.7.2) \n7.4.1 Nuts to be used on bolts with Class 2A threads \nbefore hot-dip zinc coating, and then hot-dip zinc coated \nin accordance with Specification F 2329, shall be tapped \noversize after coating, to the minimum and maximum \nthread dimensions in Table 5. The major and minor diame­\nters shall also be increased by the allowance to provide the \ncorresponding minimum and maximum major and minor \ndiameters. \n1.5 Threads: Nuts With Other Coatings \n7.5.1 Nuts to be used on bolts mechanically zinc \ncoated or on bolts hot-dip zinc-coated to a specification \nother than Specification F 2329, or otherwise hot-dip \ncoated, shall be tapped oversize by a diametral amount \nsufficient to permit assembly on the coated bolt thread, \nunless other requirements are specified in the inquiry or \npurchase order. \n7.5.2 When specifically permitted by the purchaser, \nnuts for bolts with electrodeposited coating, such as cad­\nmium, zinc, and so forth, or with chemically applied coat­\ning may be tapped oversize by a diametral amount sufficient \nto permit assembly on the coated bolt thread. \n956 \n7 .5.3 The allowable oversize tapping shall not \nexceed that specified in Table 5. \n8. Workmanship \n8.1 Surface discontinuity limits shall be in accordance \nwith Specification F 812/F 812M. \n9. Number of Tests \n9.1 The requirements of this specification shall be met \nin continuous mass production for stock, and the manufac­\nturer shall make sample inspections to ensure that the prod­\nuct conforms to the specified requirements. Additional tests \nof individual shipments of material are not ordinarily con­\ntemplated. Individual heats of steel are not identified in \nthe finished product. \n9.2 When additional tests are specified in the inquiry \nand purchase order, a lot, for purposes of selecting test \nsamples, shall consist of all material offered for inspection \nat one time that has the following common characteristics: \n9.2.1 Grade, \n9.2.2 Nominal size, \n9.2.3 Style of nut, \n9.2.4 Thread series and class, and \n9.2.5 Surface finish. \n9.3 Unless otherwise specified in the inquiry and pur­\nchase order, the number of tests for each lot of required \nproperty shall be as follows: \nNumber of Nuts in Lot \n800 and under \n801 to 8 000 \n8 001 to 22 000 \nOver 22 000 \nNumber of Specimens \n2 \n3 \n5 \n9.4 If any test specimen shows flaws, it may be dis­\ncarded and another specimen substituted. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1056.json",
  "tabulaTablesCsv": "tables_tabula/page-1056.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1056.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4043,
  "bestTextAlphaRatio": 0.7344
}