{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 166,
  "globalPageIndex": 964,
  "width": 618.6,
  "height": 796.8,
  "text": "SA-513/SA-513M (ASTM A513/A513M) ASME BPVC.II.A-2025 \nTABLE Continued \nYield Ultimate \nStrength, Strength, \nksi [MPa], ksi [MPa], \nmin min \n1020 55 [380] 65 [450] \n1021 58 [400] 68 [470] \n1025 60 [415] 70 [480] \n1026 65 [450] 75 [515] \n1030 70 [480] 80 [550] \n1035 75 [515] 85 [585] \n1040 75 [515] 85 [585] \n1340 80 [550] 90 [620] \n1524 75 [515] 85 [585] \n4130 80 [550] 90 [620] \n4140 95 [655] 105 [725] \nmm], whichever is greater. For welded tubing the notch shall \nbe placed in the weld, if visible. \nSS.4 For flux leakage testing, each of the longitudinal \ncalibration notches shall be a straight sided notch not over \n12½ % of the wall thickness in depth and not over 1.0 in. [25 \nmm] in length. Both outside diameter and inside diameter \nnotches shall be placed in the tube located sufficiently apart to \nenable separation and identification of the signals. \nS8.5 Tubing producing a signal equal to or greater than the \ncalibration defect shall be subject to rejection. The area \nproducing the signal may be examined. \nS8.5.1 Test signals produced by imperfections which cannot \nbe identified, or produced by cracks or crack-like defects shall \nresult in rejection of the tube subject to rework and retest. \nS8.5.2 Test signals produced by imperfections such as those \nlisted below may be judged as injurious or noninjurious \ndepending on visual observation of their severity or the type of \nsignal they produce on the testing equipment used, or both: \nS8.5.2.1 Dings, \nSS.5.2.2 Straightener marks, \nS8.5.2.3 Loose inside diameter bead and cutting chips, \nSS.5.2.4 Scratches, \nS8.5.2.5 Steel die stamps, \nS8.5.2.6 Chattered flash trim, \nS8.5.2.7 Stop marks, or \nS8.5.2.8 Tube reducer ripple. \nss-.--53 Any miperfection of the above type exceeding 0.0M \nin. [0.101 mm] or 12Y2 % of the specified wall thickness \n(whichever is greater) in depth shall be considered injurious. \nS8.5.3.1 If the imperfection is judged as injurious, tl1e tubes \nshall be rejected but may be reconditioned and retested \nproviding the dimensional requirements are met. \nElongation \nin 2 in. \n[50 mm], \n%, RB RB \nmin min max \n10 75 \n10 75 \n10 77 \n10 80 \n10 81 \n10 85 \n10 85 \n10 87 \n10 85 \n10 87 \n10 90 \nS8.5.3.2 If the imperfection is explored to the extent that it \ncan be identified as noninjurious, the tubes may be accepted \nwithout further test providing the imperfection does not en­\ncroach on the minimum wall thickness, after due allowance for \ncleanup in mandrel drawn tubes. \nS9. Certification for Government Orders \nS9.l A producer's or supplier's certification shall be fur­\nnished to the Government that the material was manufactured, \nsampled, tested, and inspected in accordance with this speci­\nfication and has been found to meet the requirements. This \ncertificate shall include a report of heat analysis (product \nanalysis when requested in the purchase order), and when \nspecified in the purchase order or contract, a report of test \nresults shall be furnished. \nS10. Rejection Provisions for Government Orclers \nS 10.1 Each length of tubing received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of the specification based on the inspection and \ntest method as outlined in the specification, the tube may be \nrejected and the manufacturer shall be notified. Disposition of \nrejected tubing shall be a matter of agreement between the \nmanufacturer and the purchaser ... ____ _ \nS 10.2 Material that fails in any of the forming operations or \nin the process of installation and is found to be defective shall \nbe set aside and the manufacturer shall be notified for mutual \nevaluation of the material's suitability. Disposition of such \nmaterial shall be a matter for agreement. \n864 \n-·-,, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0964.json",
  "tabulaTablesCsv": "tables_tabula/page-0964.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0964.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3744,
  "bestTextAlphaRatio": 0.684
}