{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 174,
  "globalPageIndex": 174,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-31 ASME BPVC.II.A-2025 \n11. Test Methods \n11.1 Rivets - Rivet bend and flattening tests shall be \nin accordance with the manufacturers standard test proce­\ndures. \n11.2 Bars - Tension and bend tests shall be conducted \nin accordance with Test Methods and Definitions A 370, \nand especially Supplement I thereof, on steel bar products. \n12. Inspection \n12.1 If the testing described in Section 9 is required \nby the purchaser, it shall be specified in the inquiry and \ncontract or order. \n12.2 The inspector representing the purchaser shall \nhave free entry at all times, while work on the contract \nof the purchaser is being performed, to all parts of the \nmanufacturer's works that concern the manufacture of the \nmaterial ordered. The manufacturer shall afford the inspec­\ntor all reasonable facilities, without charge, to satisfy him \nthat the material is being furnished in accordance with \nthis specification. All tests (except product analysis) and \ninspection shall be made at the place of manufacture prior \nto shipment, unless otherwise specified, and shall be so \nconducted as not to interfere unnecessarily with the opera­\ntion of the works. \n13. Rejection and Rehearing \n13.1 Rivets - Rivets that fail to conform to the require­\nments of this specification may be rejected. Rejection \nshould be reported to the producer or supplier promptly \nand in writing. In case of dissatisfaction with the results \nof the test, the producer or supplier may make claim for \na rehearing. \n13.2 Bars - Rejection and rehearing shall be in accor­\ndance with Specification A 29 / A 29M. \n14. Certification \n14.1 The manufacturer shall furnish certification that \nthe material was manufactured and tested in accordance \nwith this specification together with a report of the heat \nanalysis (5.2) and mechanical property test results (Section \n6) as applicable to the product ordered. The report shall \ninclude the manufacturer's name, ASTM designation, \ngrade, heat number (bars only), and authorized signature. \n122 \n15. Responsibility \n15.1 The party responsible for the fastener shall be the \norganization that supplies the fastener to the purchaser. \n16. Packaging and Package Marking \n16.1 Rivets - Rivets shall be properly packed and \nmarked to prevent damage and loss during shipment. \n16.2 Bars - Bars shall be packed and marked in accor­\ndance with Specification A 29 / A 29M. \n17. Keywords \n17.1 bars; carbon steel; pressure vessel rivets; rivets; \nsteel \nFIG. 1 BEND TEST OF RIVET ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0174.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2487,
  "bestTextAlphaRatio": 0.7616
}