{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 631,
  "globalPageIndex": 631,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-369/SA-369M (ASTM A369/A369M) \nchemical composition thus determined, or that determined \nfrom a product analysis made by the tubular product \nmanufacturer, shall conform to the requirements specified. \n7.2 In the case of large ingots poured from two or more \nheats, the weighted average of the chemical determinations of \nthe several heats, made in accordance with 7.1, shall conform \nto the requirements specified in Section 6. \n8. Product Analysis \n8.1 At the request of the purchaser, a product analysis shall \nbe made by the manufacturer on every heat. \n8.2 The results of these analyses shall be reported to the \npurchaser or his representative, and shall conform to the \nrequirements specified in Section 6. \n8.3 If the analysis of one of the tests specified in Section 7 \nor Section 8 does not conform to the requirements specified in \nSection 6 an analysis of each billet or pipe from the same heat \nmay be made, and all billets or pipes conforming to the \nrequirements shall be accepted. \n9. Tensile Requirements \n9 .1 The material shall conform to the requirements as to \ntensile properties prescribed in Table 2. Tests for acceptance \nshall be made after final heat treatment of the forging. \n9.2 For Grade FP91 Type 1 and Type 2, when requested by \nthe purchaser, the tensile and hardness properties shall be met \nand verified on material taken from the half-thickness location. \n10. Mechanical Tests Required \n10.1 Transverse or Longitudinal Tension Test-One test \nshall be made on a specimen from one end of one length of \npipe representing each heat in each heat-treatment lot. \n10.2 Flattening Test-For pipe NPS 14 or less, and diameter \nto wall thickness ratios of more than 7 .0, a flattening test shall \nbe carried out in accordance with Specification A999/ A999M. \nA test shall be carried out on a specimen taken from one end of \neach length of pipe. \n10.3 Bend Test-For pipe larger than NPS 14 or NPS where \ndiameters to wall thickness ratio is 7 .0 or less, a bend test shall \nbe carried out in accordance with Test Methods E290. Unless \notherwise specified, the test specimens shall be taken in a \ntransverse direction. The diameter of the pin shall be 2/3 t for \nlongitudinal specimens or 1 1/3 t for transverse specimens, \nwhere t is the specimen thickness. The bend test specimens \nshall be bent at room temperature through 180° without \ncracking. One bend test shall be taken from one end of each \nlength of pipe. \n11. Workmanship \n11.1 The pipe shall conform to the sizes and shapes speci­\nfied by the purchaser. \n12. Ends \n12.1 Pipe ends shall be machined as specified in the \npurchase order. \n13. Finish \n13.1 The finished pipe shall be reasonably straight and shall \nhave a workmanlike finish. \n13.2 Repair of defects by welding shall be permitted only \nsubject to the approval of the purchaser. Defects shall be \nthoroughly chipped or ground out before welding. Only quali­\nfied operators and procedures in accordance with the ASME \nBoiler and Pressure Vessel Code, Section IX, shall be used. \nLocal or full heat treatment in accordance with 5.4 shall follow \nwelding. Local grinding following welding and retreating shall \nbe considered as meeting the requirements of 5.3. \n14. Product Marking \n14.1 In addition to the marking prescribed in Specification \nA999/A999M, the marking shall include the wall thickness, \npiece mark, length, and additional symbol \"S\" if the pipe \nconforms to the supplementary requirements specified in \nSupplementary Requirements Sl to S5, and the heat number or \nthe manufacturer's number by which the heat can be identified. \nIndentation stamping, instead of stenciling, will be permitted \nonly with the written approval of the purchaser. \n14.2 For FP91, additional marking shall include the appro­\npriate Type. \nTABLE 2 Tensile Requirements \nGrade \nTensile strength, min; ksi [MPa] \nYield strength, min; ksi [MPa] \nGrade \nElongation in 2 in. or 50 mm, min, %: \nFPA \n48 [330] \n30 [210] \nBasic minimum elongation for wall 5 /1• in. [8 mm] \nand over in thickness, strip tests, and for all small \nsizes tested in full-section \nWhen standard round 2-in. or 50-mm gage length \ntest specimen is used \nFPB \n60 [415] \n35 [240] \nLongitu-\ndinal \n35 \n28 \nFPA \nFP1, FP2 \n55 [380] \n30 [210] \nTrans-\nverse \n25 \n20 \n579 \nFP12 \n60 [415] \n32 [220] \nFP91 Type 1 \nand T e 2 \n85 [585] \n60 [415] \nFP92 \n90 [620] \n64 [440] \nElon ation Re uirements \nFP115 \n90 [620] \n65 [450] \nAll Others \n60 [415] \n30 [210] \nFPB FP91 Type 1 and Type 2 All Others FP92 and FP115 \nLongitu- Trans- Longitu- Trans- Longitu- Trans-\ndinal verse dinal verse dinal verse \n30 17 27 18 30 20 \n22 12 20 13 22 14 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0631.json",
  "tabulaTablesCsv": "tables_tabula/page-0631.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0631.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4648,
  "bestTextAlphaRatio": 0.7145
}