{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 377,
  "globalPageIndex": 1175,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-666 \n6.1.15 Certification, and \n6.1.16 Packaging, marking, and loading. \n7. Sampling \n7.1 Tension and bend-test specimens of sheet, strip, \nand plate products shall be selected from finished material \nand shall be selected in the transverse direction, except in \nthe case of strip under 9 in. (229 mm) in width, in which \ncase tension test specimens shall be selected in the longitu­\ndinal direction. \n7.2 Flat bar tension and bend-test specimens shall be \nselected from the finished material and shall be in the \nlongitudinal direction. \n7.3 Corrosion samples, if required, shall be taken from \nmaterial after final annealing and descaling and prior to \ncold working. \n8. Number of Tests \n8.1 For cold-worked product produced in coil form, \none tension test shall be made from each end of each coil. \nOne bend test shall be made from one end of each coil. \n8.2 For cold-worked flat bar and plate products, two \ntension test and one bend test shall be made on each size \nof flat bar and each thickness of plate from each heat in a \nlot annealed in a single charge or under the same conditions \nin a continuous furnace. \n8.3 Annealed material produced to Table 2 require­\nments shall be tested in accordance with Specification \nA 480/ A 480M. \n9. Test Meth.ods \n9.1 Tension Test: \n9.1.1 The yield strength shall be determined by the \noffset method as described in Test Methods and Definitions \nA 370. An alternative method of determining field strength \nmay be used based on the following total extension \nunder load: \nYield Strength, min. psi \n45 000 \n75 000 \n110 000 \n135 000 \n140 000 \nTotal Extension under Load in 2 in. \nGage Length, incl. \n0.0071 \n0.0098 \n0.0125 \n0.0144 \n0.0148 \n9.1.2 The requirement of this specification for yield \nstrength will be considered as having been fulfilled if the \nextension under load for the specified yield strength does \nnot exceed the specified values. The values obtained in \nthis manner should not, however, be taken as the actual \nyield strength for 0.2%. In case of dispute, the offset \nmethod of determining yield strength shall be used. \n9.2 Bend Test: \n9.2.1 Bend-test specimens shall withstand cold bend­\ning without cracking when subjected to either the free­\nbend method or the controlled-bend (V-block) method at \nthe condition specified by Table 3 or Table 4, respectively. \nSpecimens shall be bent around a diameter equal to the \nproduct of the bend factor times the specified thickness of \nthe test specimen. The choice of test method for materials \nin conditions other than annealed shall be at the option of \nthe seller. \n9.2.2 Free-bend test specimens shall be bent cold, \neither by pressure or by blows. However, in the case of \ndispute, tests shall be made by pressure. \n9.2.3 Controlled-bend (V-block) test specimens shall \nbe bent cold by means of V-blocks or a mating punch \nand die having an included angle of 45° and with proper \ncurvature of surface at the bend areas to impart the desired \nshape and diameter of bend to the specimen. \n10. Keywords \n10.1 austenitic stainless steel; cold-worked stainless \nsteel; stainless steel flat bar; stainless steel plate; stainless \nsteel sheet; stainless steel strip \n1083 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1175.json",
  "tabulaTablesCsv": "tables_tabula/page-1175.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1175.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3202,
  "bestTextAlphaRatio": 0.737
}