{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 774,
  "globalPageIndex": 1572,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-1011/SA-1011M (ASTM A1011/A1011M) ASME BPVC.II.A-2025 \n5.1.1 AS1M specification number and year of issue, \n5.1.2 Name of material and designation (hot-rolled steel \nsheet) (include grade, type and class, as appropriate, for CS, \nDS, SFS, SS, HSLAS, HSLAS-F, and UHSS) (see 4.1), \n5.1.2.1 When a chemistry grade is specified in accordance \nwith Specification A568/A568M Table X2.3, the grade shall be \nfurnished as; CS Type B - 1008, DS Type A - 1005, and so \nforth, \n5.1.2.2 When a chemistry grade is specified in accordance \nwith Specification A568/A568M Table X2.l, with no reference \nto CS Type A, CS Type B, DS Type A, DS Type B, or SFS, the \ngrade shall be furnished as CS - 1005, CS - 1008, CS - 1020 \nand so forth, and meet chemistry specified in accordance with \nSpecification A568/A568M Table X2.l, \n5.1.2.3 When a type is not specified for CS or DS and there \nis no reference to a chemistry grade such as 1005, 1006, and so \nforth, Type B will be furnished (see 4.1), \n5.1.2.4 When SFS is specified, a chemistry grade designa­\ntion shall also be specified in accordance with Specification \nA568/A568M Table X2.1 (that is, 1010, 1020, and so forth), or \ncarbon & manganese in accordance with Table X2.2 (that is, C \n0.12-0.18 %, Mn 0.50--0.80 %, and so forth). The characteris­\ntics identifying the enhanced formability or mechanical prop­\nerties shall be specified by the user or purchaser, on the \npurchase order. If requested, the producer or seller shall \nprovide verification of special practices or mechanical proper­\nties supporting enhanced formability. \n5.1.2.5 When a class is not specified for HSLAS, Class 1 \nwill be furnished (see 4.1), \n5.1.2.6 When a type is not specified for SS Grades, Type 1 \nwill be furnished (see 4.1), \n5.1.2.7 When a type is not specified for UHSS, Type 1 shall \nbe furnished (see 4.1). \n5.1.3 Finish (see 9.1) \n5.1.4 Type of edge (see 9.3), \n5.1.5 Oiled or not oiled, as required (see 9.2), \n5.1.6 Dimensions (thickness, width, and whether cut lengths \nor coils), \nNoTE 1-Not all producers are capable of meeting all the limitations of \nthe thickness tolerance tables in Specifications A568/A568M and A749/ \nA749M. The purchaser should contact the producer prior to placing an \norder. \n5.1.7 Coil size (inside diameter, outside diameter, and maxi-\nmum weight), \n5.1.8 Copper bearing steel (if required), \n5.1.9 Quantity, \n5.1.10 Application (part identification and description), \n5.1.11 A report of heat analysis will be supplied, if \nrequested, for CS, DS and SFS. For materials with required \nmechanical properties, SS, HSLAS, HSLAS-F, and UHSS, a \nreport is required of heat analysis and mechanical properties as \ndetermined by the tension test, and \n5.1.12 Special requirements (if any). \n5.1.12.1 When the purchaser requires thickness tolerances \nfor 3/s in. [10 mm] minimum edge distance (see Supplementary \nRequirement in Specification A568/A568M), this requirement \nshall be specified in the purchase order or contract. \n5.1.12.2 Tighter requirements can be specified based on \nagreement between seller and purchaser. \nNoTE 2-A typical ordering description is as follows: ASTM AlOll­\nXX, hot rolled steel sheet, CS Type A, pickled and oiled, cut edge, 0.075 \nby 36 by 96 in., 100 000 lb, for part no. 6310, for shelf bracket. \nOr, ASTM AlOl lM-XX, hot rolled steel sheet, CS Type B, pickled and \noiled, cut edge, 3.7 by 117 mm by coil, ID 600 mm, OD 1500 mm, max \nweight 10 000 kg, 50 000 kg, for upper control arm. \n6. General Requirements for Delivery \n6.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A568/A568M for sheets and Specification A749/ \nA749M for strip, unless otherwise provided for herein. \n7. Chemical Composition \n7.1 The heat analysis of the steel shall conform to the \nchemical composition requirements of the appropriate desig­\nnation shown in Table 1 for CS, DS and SFS, and Table 2 for \nSS, HSLAS, HSLAS-F, and UHSS. \n7 .1.1 A report of heat analysis will be supplied, if requested, \nfor CS and DS. For materials with required mechanical \nproperties, SS, HSLAS, HSLAS-F, and UHSS, a report of heat \nanalysis is required. \n7.2 Each of the elements listed in Table 1, Table 2, and \nSpecification A568/ A568M Table X2.3 shall be included in the \nreport of the heat analysis. When the amount of copper, nickel, \nchromium, or molybdenum is less than 0.02 %, report the \nanalysis as <0.02 % or the actual determined value. When the \namount of vanadium, columbium, or titanium is less than \n0.008 %, report the analysis as <0.008 % or the actual deter­\nmined value. When the amount of boron is less than 0.0005 %, \nreport the analysis as <0.0005 % or the actual determined \nvalue. \n7.3 Sheet steel grades defined by this specification are \nsuitable for welding if appropriate welding conditions are \nselected. For certain welding processes, if more restrictive \ncomposition limits are desirable, they shall be specified at the \ntime of inquiry and confirmed at the time of ordering. \n8. Mechanical Properties \n8.1 CS and DS: \n8.1.1 Typical, nonmandatory mechanical properties for CS \nand DS for all grades specified in Table 1 and Specification \nA568/A568M Table X2.3 are found in Table 3. \n8.1.2 The material represented by all grades specified in \nTable 1 and Specification A568/ A568M Table X2.3 shall be \ncapable of being bent at room temperature in any direction \nthrough 180° flat on itself without cracking on the outside of \nthe bent portion (see the section on bend test in Test Methods \nand Definitions A370). The bend test is not a requirement of \ndelivery. However, if testing is performed by the purchaser, \nmaterial not conforming to the requirement shall be subject to \nrejection. \n8.2 SS, HSLAS, HSLAS-F, and UHSS: \n8.2.1 The available grades and corresponding mechanical \nproperties for SS, HSLAS, HSLAS-F, and UHSS are shown in \nTable 4. \n1518 \n-~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1572.json",
  "tabulaTablesCsv": "tables_tabula/page-1572.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1572.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5930,
  "bestTextAlphaRatio": 0.6985
}