{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 396,
  "globalPageIndex": 1194,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-671/SA-671M (ASTM A671/A671M) ASME BPVC.II.A-2025 \nS14. Description of Term \nS14.1 lot-all pipe of the same mill heat of plate material \nand wall thickness (within±¼ in. [6 mm]) heat treated in one \nfurnace charge. For pipe that is not heat treated or that is heat \ntreated in a continuous furnace, a lot shall consist of each 200 \nft [60 m] or fraction thereof of all pipe of the same mill heat of \nplate material and wall thickness (within ± ¼ in. [6 mm]), \nsubjected to the same heat treatment. For pipe heat treated in a \nbatch-type furnace that is automatically controlled within a 50 \n°F [30 °C] range and is equipped with recording pyrometers so \nthat heating records are available, a lot shall be defined the \nsame as for continuous furnaces. \nS15. ASME Section III Construction \nS15.1 Products furnished under this specification that are \nintended for application under the rules of Section ill of the \nASME Boiler and Pressure Vessel Code shall be manufactured \nby holders of the appropriate ASME Certificate of Authoriza­\ntion and Certification Mark. The product is subject to all \napplicable requirements of Section ill, including welding, heat \ntreatment, nondestructive examination, authorized inspection \nat the point of manufacture, and application of the Certification \nMark. \nS15.2 The applicable ASME Partial Data Report form, \nsigned by an Authorized Nuclear Inspector, and a material test \nreport shall be furnished for each lot of pipe. \nS15.3 The plate used to fabricate the pipe shall conform to \nthe applicable SA specification in ASME Boiler and Pressure \nVessel Code, Section II. The welded joints shall be full \npenetration butt welds as obtained by double welding or by \nother means that will obtain the same quality of deposited weld \nmetal on the inside and outside. Welds using metal backing \nstrips that remain in place are prohibited. \nS15.4 In addition to the requirements of S14 and Section 13 \nProduct Marking, each length of pipe shall be so marked as to \nidentify each such piece of pipe with the lot and the material \ntest report. \nSUMMARY OF CHANGES \nCommittee A0l has identified the location of selected changes to this standard since the last issue, \nA671/A671M- 19, that may impact the use of this standard. (Approved March 1, 2020.) \n( 1) Added clarification of tensile requirements in 8.1.1 for all \ngrades and classes listed. \nCommittee A0l has identified the location of selected changes to this specification since the last issue, \nA671/A671M- 16a, that may impact the use of this specification. (Approved Nov. 1, 2019.) \n( 1) Added Supplementary Requirement S 15 for ASME Section \nIII Construction. \nASTM International takes no position respecting the validity of any patent rights asselted in connection with any item mentioned \nin this standard. Users of this standard are expressly advised that detennination of the validity of any such patent rights, and the risk \nof infringement of such rights, are entirely their own responsibility. \nThis standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and \nif not revised, either reapproved or withdrawn. Your comments are invited either for revision of this standard or for additional standards \nand should be addressed to ASTM International Headqualters. Your comments will receive careful consideration at a meeting of the \nresponsible technical committee, which you may attend. If you feel that your comments have not received a fair hearing you should \nmake your views known to the ASTM Committee on Standards, at the address shown below. \nThis standard is copyrighted by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959, \nUnited States. Individual reprints (single or multiple copies) of this standard may be obtained by contacting ASTM at the above \naddress or at 610-832-9585 (phone), 610-832-9555 (fax), or service@astm.org (e-mail); or through the ASTM website \n(www.astm.org). Permission rights to photocopy the standard may also be secured from the Copyright Clearance Center, 222 \nRosewood Drive, Danvers, MA 01923, Tel: (978) 646-2600; http://www.copyright.com/ \n1104 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1194.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4190,
  "bestTextAlphaRatio": 0.7609
}