{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 482,
  "globalPageIndex": 1280,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-738/SA-738M ASME BPVC.II.A-2025 \nSpecification for \nPressure Vessel Plates, Heat-Treated, Carbon-Manganese­\nSilicon Steel, for Moderate and Lower Temperature Service \n1. Scope \n1.1 This specification covers heat-treated carbon­\nmanganese-silicon steel plates intended for use in welded \npressure vessels at moderate and lower temperature service. \n1.2 Material under this specification is available in four \nstrength levels, 75 ksi [515 MPa], 85 ksi [585 MPa], 80 ksi \n[550 MPa], and 90 ksi [620 MPa] minimum ultimate tensile \nstrengths. \n1.3 The maximum thickness of plates for Grades A, B, and \nC is limited only by the capacity of the chemical composition \nand heat treatment to meet the specified mechanical property \nrequirements; however, current practice normally limits the \nmaximum thickness of plates furnished under this specification \nto 6 in. [150 mm] for Grade A, 4 in. [100 mm] for Grade B, and \n6 in. [150 mm] for Grade C. The maximum permitted nominal \nthickness is 1.5 in. [40 mm] for Grade D and 2 in. [50 mm] for \nGrade E. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \n3. General Requirements and Ordering Information \n3.1 Material supplied to this material specification shall \nconform to Specification A20/A20M. These requirements out­\nline the testing and retesting methods and procedures, permit­\nted variations in dimensions, and mass, quality and repair of \ndefects, marking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/ A20M. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/ A20M, the require­\nments of this specification shall prevail. \n4. Manufacture \n4.1 Steelmaking Practice-The steel shall be killed and \nshall conform to the fine austenitic grain size requirement of \nSpecification A20/ A20M. \n5. Heat Treatment \n5.1 Grade A plates 2.5 in. [65 mm] and under in thickness \nshall be supplied in the normalized condition or in the \nquenched and tempered condition at the option of the manu­\nfacturer. \n5.2 Grade A plates over 2.5 in. [65 mm] in thickness and \nGrade B, Grade C, Grade D, and Grade E plates in all \nthicknesses shall be quenched-and-tempered. \n1202 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1280.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3248,
  "bestTextAlphaRatio": 0.7608
}