{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 223,
  "globalPageIndex": 1021,
  "width": 632.52,
  "height": 808.08,
  "text": "ASME BPVC.II.A-2025 SA-541/SA-541M \nadditional ordering information, manufacturing require­\nments, testing and retesting methods and procedures, mark­\ning, certification, product analysis variations, and \nadditional supplementary requirements. \n3.3 If the requirements of this specification are in con­\nflict with the requirements of Specification A 788, the \nrequirements of this specification shall prevail. \n4. Chemical Composition \n4.1 Heat Analysis - The heat analysis obtained from \nsampling in accordance with Specification A 788 shall \ncomply with Table 1 except that the additional features of \nSupplementary Requirements S8, S9, SlO, S12, and S15 \nshall also apply as individually specified in the ordering \ninformation. \n4.2 Product Analysis - The manufacturer shall use the \nproduct analysis provision of Specification A 788 to obtain \na product analysis from a forging representing each heat \nor multiple heat. The permissible variations of Table 1 of \nSpecification A 788 do not apply to carbon, phosphorus, \nsilicon, and sulphur for all classes, vanadium for Grade \n1 C, and columbium and calcium for Grades 22V and 3VCb. \nBoron is not subject. to product analysis. The purchaser \nmay also make this determination in accordance with Spec­\nification A 788. \n5. Heat Treatment for Mechanical Properties \nshall be tempered at a subcritical temperature as described \nin 5.1. \n6. Mechanical Properties \n6.1 General Requirements - The forgings shall con­\nform to the requirements of Table 2. The forgings shall \nalso conform to the requirements of Table 3 unless either \nSupplementary Requirement S6 or S 13 is specified, in \nwhich case the requirements of those sections shall apply. \nThe largest obtainable tension test specimen as specified \nin Fig. 4 of Test Methods and Definitions A 370 shall be \nused. Impact specimens shall be Charpy V-notch, as shown \nin Fig. 10 of Test Methods and Definitions A 370. The \nusage of subsize impact specimens due to material limita­\ntions must have prior purchaser approval. \n6.2 Sampling - The longitudinal axis and mid-length \nof tension and impact test specimens shall be positioned \nin accordance with one of the following methods as speci­\nfied by the purchaser: \n6.2.1 Method 1 - This method shall always be used \nwhen the maximum quenched thickness does not exceed \n2 in. [50 mm]. Specimens shall be located in the production \nforging or test forging ( as described in Method 4) at mid­\nthickness and at least 2 in. from other quenched surfaces. \n6.2.2 Method 2 - t by 2t, where t is the distance \nfrom the area of significant loading (see 3.1) to the nearest \nquenched surface. However, the specimens shall not be \nnearer to one quenched surface than ¾ in. [20 mm] and to \nthe second quenched surface than 1½ in. [40 mm]. When \n5.1 After complete austenitization, the forgings shall this method of testing is employed, forgings are usually \nbe quenched in a suitable liquid medium by spraying or manufactured in accordance with a purchaser-approved \nimmersion. For Grade 22V forgings, the minimum austeni- drawing showing pre-quenched dimensions and the loca-\ntizing temperature shall be 1650°F [900°C]. Quenching tion of mechanical test specimens. \nshall be followed by tempering at a subcritical temperature \nand holding at this temperature for a minimum time of . 6.2.3 Method 3_ - ¼ T by T, where Tis the 1:1aximum \n- - •• - - - - • - - -~hfin:-tz5-mm:l-ofma*imum-Section-thicknes,'>. Minim.i.1iJ1_ _ ~ckn~ss o: the forgmg as heat treat_ed. ~~re _this method \ntempering temperatures shall be: ortestmgis-empluyed;--the-follewmg lumtatwrn;_for_a&c -·· ____ , \ntreated thickness shall apply, unless otherwise agreed upon: \nGrade \n1, lA, 2 Class 2, 3 Class 2 \n2, 3 Class 1, 22 Class 3 \nIC, 11 Class 4, 22 Class 4, 4N Class 1, 4N Class 2, 5 \nClass l, 5 Class 2 \n22 Class 15 \n4N Class 3 \n3V, 3VCb \n22V \nop [oCJ \n1150 [620] \n1200 [650] \n1100 [595] \n1050 [565] \n1125 [605] \n1250 [675] \n1250 [675] \n5.2 For Classes 1, IA, 2, 2A, 3, or 3A, a multiple stage \naustenitizing procedure may be used whereby the forging \nis first fully austenitized and liquid quenched, followed \nby reheating within the intercritical temperature range to \npartially reaustenitize, and again liquid quenched. On com­\npletion of the austenitizing/quenching cycles, the forgings \n921 \nGrade \n1 and IA \n2 Class 2 and 3 Class 2 \n2 Class 1 and 3 Class 1 \nlC \nl l Class 4 \n22 Class 4, 4N Class 2, 5 Class 2 \n22 Class 5 \n4N Class 1, 5 Class 1, 4N Class 3, 3V, 3VCb, \n22V, and 22 Class 3 \nin. [mm], max \n3 [75] \n6 [150] \n8 [200] \n4 [100] \n5 [125] \n6 [150] \n8 [200] \n10 [250] \n6.2.4 Method 4 - Test specimens shall be taken from \na representative separate test forging or bar made from the \nsame heat of steel, which shall receive substantially the \nsame reduction and type of hot working as the production ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1021.json",
  "tabulaTablesCsv": "tables_tabula/page-1021.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1021.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4828,
  "bestTextAlphaRatio": 0.7086
}