{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 740,
  "globalPageIndex": 1538,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-995/SA-995M ASME BPVC.II.A-2025 \nS52.4 Weld Qualifications-Repairs shall be made utilizing \nwelding procedures qualified in accordance with Section IX of \nthe ASME Boiler and Pressure Vessel Code, and repair welding \nshall be done by welders or welding operators meeting the \nqualification requirements of Section IX. In addition to the \nSection IX qualification limits, the weld test plate thickness \nshall be as agreed upon between the casting supplier and the \npurchaser, but no less than 1.5 times the maximum weld repair \ndepth. The weld deposit thickness shall be at least 80 % of the \nmaximum repair depth. \nS52.4.1 When the thickness of the qualification coupon is \nless than or equal to 4 in. [100 mm], and the qualification \ncoupon is subjected to a post-weld solution heat treatment in \naccordance with Table 1, Charpy impact testing shall be \nperformed at one of the test temperatures listed in Table S52.2. \nTABLE S52.2 Weld Qualification Impact Testing for'Post-Weld \nSolution-Treated Coupons \nNOTE 1-It is recommended that test temperature selection be deter­\nmined based on the intended service temperature of the casting. \nTest Temperature \nOF [OC] \n-51 [-46] \n-105 (-76] \n-150 [-101] \nCharpY V-Notch Impact Requirements \nEnergy Value, ft-lbf [J], min \nvalue for two specimens Energy Value, ft-lb! [J], min \nand min average of three for single specimen \nspecimens \n74 [100] \n44 [60] \n33 [45] \n55 [75] \n33 (45] \n26 [35] \nThe test temperature shall be provided by the purchaser. If the \ntest temperature is not specified, the test temperature used shall \nbe-51 °P [-46 °C]. Charpy impact test locations shall be at the \nweld cap and mid-thickness of the weld deposit. Three speci­\nmens shall be removed from each of these three locations: the \nfusion line, fusion line + 2 mm, and fusion line + 5 mm. The \naverage value of the three specimens shall not be less than \nspecified in Table Table S52.2, with no more than one value \npermitted below the average minimum specified and no value \npermitted below the minimum specified for a single specimen. \nTABLE S52.3 Weld Qualification Impact Testing for As-Welded \nCoupons \nTest Temperature \n°F [°C] \n-51 [-46] \n-105 [-76] \n-150 [-101] \nCharpy V-Notch Impact Requirements \nEnergy Value, ft-lbf [J], min \nvalue for two specimens Energy Value, ft-lb! [J], min \nand min average of three for single specimen \nspecimens \n89 [120] \n44 [60] \n33 [45] \n66 [90] \n33 [45] \n26 (35] \nS52.4.2 When the thickness of the qualification coupon is \nless than or equal to 4 in. [100 mm], and the qualification \ncoupon is not subjected to a post-weld solution heat treatment, \nCharpy impact testing shall be performed at one of the test \ntemperatures listed in Table S52.3. The test temperature shall \nbe provided by the purchaser. If the test temperature is not \nspecified, the test temperature used shall be -51, 0 P [-46 °C]. \nCharpy impact test locations shall be at the weld cap and \nmid-thickness of the weld deposit. Three specimens shall be \nremoved from each of these three locations: the fusion line, \nfusion line + 2 mm, and fusion line + 5 mm. The average value \nof the three specimens shall not be less than specified in Table \nS52.3, with no more than one value permitted below the \naverage minimum specified and no value permitted below the \nminimum specified for a single specimen. \nS52.4.3 When the thickness· of the qualification coupon is \ngreater than 4 in. [100 mm], test temperature, specimen \nlocation and quantity, and absorbed energy values shall be \nagreed upon between the purchaser and the manufacturer. \nS52.4.4 A Test Methods G48 Method A test shall be \nperformed on a sample removed from the weld qualification \ncoupon; the sample shall include approximately 50 % weld \nmaterial and 50 % base material. Weld test coupons subjected \nto a post-weld solution heat treatment shall be tested at 60 °C. \nWeld test coupons not being subjected to a post-weld solution \nheat treatment shall be tested at 50 °C. Regardless of heat treat \ncondition, the acceptance criteria and test time shall be the \nsame as outlined in S52.3. \n1484 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1538.json",
  "tabulaTablesCsv": "tables_tabula/page-1538.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1538.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4098,
  "bestTextAlphaRatio": 0.7262
}