{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 149,
  "globalPageIndex": 947,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-513/SA-513M (ASTM A513/A513M) \nE570 Practice for Flux Leakage Examination of Ferromag-\nnetic Steel Tubular Products \n2.2 ASME Standard: 3 \nB46.1 Surface Texture \n2.3 Military Standards.A \nMIL-STD-129 Marking for Shipment and Storage \n2.4 Federal Standard: 4 \nFed. Std. No. 123 Marking for Shipments (Civil Agencies) \n3. Ordering Information \n3.1 Orders for material under this specification should \ninclude the following as required to adequately describe the \ndesired material: \n3.1.1 Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material (electric resistance-welded carbon \nor alloy steel mechanical tubing), \n3.1.3 Types, conditions and code letters, (See Sections 1 and \n12), \n3.1.4 Thermal condition, (See 12.2), \n3.1.5 Flash condition, (See 12.3), \n3.1.6 Grade designation, if required, (See Section 5), \n3.1.7 Report chemical analysis and product analysis, if \nrequired (See Sections 6 and 7), \n3.1.8 Individual supplementary requirements, if required \n(Sl to SlO, inclusive), \n3.1.9 Cross section (round, square, rectangular and special \nshapes), \n3.1.10 Dimensions, round, outside and inside and wall \nthickness (See 8.1 and 8.2) or square and rectangular, outside \ndimension and wall thickness and comer radii, if required (See \n9.1 and 9.2), \n3.1.11 Length, round, mill lengths or definite cut length (See \n8.3), square and rectangular, specified length (See 9.4), \n3.1.12 Squareness of cut, round tubing, if required, (See \n8.4), \n3.1.13 Burrs removed, if required (See 11.2), \n3.1.14 Protective coating (See 14.1), \n3.1.15 Special packaging (See 17.1), \n3.1.16 Specification designation, \n3 .1.17 End use, \n--3-.-1.18 Special reqUirement_s_, -- ---\n3.1.19 Special marking (See Section 16), and \n3.1.20 Straightness Test Method (See 8.5 and 9.6). \n4. Materials and Manufacture \n4.1 The steel may be made by any process. \n4.2 If a specific type of melting is required by the purchaser, \nit shall be as stated on the purchase order. \n4.3 The primary melting may incorporate separate degas­\nsing or refining, and may be followed by secondary melting, \nsuch as electroslag or vacuum-arc remelting. If secondary \n3 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n4 Available from Standardization Documents Order Desk, Bldg. 4 Section D, 700 \nRobbins Ave., Philadelphia, PA 19111-5094, Attn: NPODS. \nmelting is employed, the heat shall be defined as all of the \ningots remelted from a single primary heat. \n4.4 Steel may be cast in ingots or may be strand cast. When \nsteel of different grades is sequentially strand cast, identifica­\ntion of the resultant transition material is required. The \nproducer shall remove the transition material by an established \nprocedure that positively separates the grades. \n4.5 Tubes shall be made by the electric-resistance-welded \nprocess and shall be made from hot- or cold-rolled steel as \nspecified. \n4.5.1 The weld shall not be located within the radius of the \ncomers of any shaped tube unless specified by the purchaser. \n5. Chemical Composition \n5 .1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1 or Table 2 (See \nSpecification A1040). If no grade is specified, Grades MT 1010 \nto MT 1020 may be furnished. Analyses of steels other than \nthose listed are available. To determine their availability, the \npurchaser should contact the producer. \n5.2 When a carbon steel grade is ordered under this \nspecification, supplying an alloy grade that specifically re­\nquires the addition of any element other than those listed for \nthe ordered grade in Tables 1 and 2 is not permitted. \n5.3 Mechanical tubing with improved ductility may be \nproduced from Drawing Steel (Types A and B), Deep Drawing \nSteel, or Extra Deep Drawing Steels identified in Specifications \nA1008/A1008M, A1011/A1011M, or Al039/A1039M. Those \nSpecifications offer guidance in the form of nonmandatory \nTypical Ranges of Mechanical Properties. \n6. Heat Analysis \n6.1 An analysis of each heat of steel shall be made by the \nsteel manufacturer to determine the percentages of the ele­\nments specified; if secondary melting processes are employed, \nthe heat analysis shall be obtained from one remelted ingot or \nthe product of one remelted ingot of each primary melt. The \nheat analysis shall conform to the requirements specified, \n847 \nTABLE 1 Chemical Requirements for Standard Low-Carbon \nSteelsA \nNorn 1- Chemistry represents heat analysis. Product analysis, except \nfor rimmed or capped steel, is to be in accordance with usual practice as \nshown in Table 3. \nChemical Composition Limits, % \nGrade Sulfur, \nDesignation Carbon Manganese Phosphorus, max max \nMT 8 1010 0.02-0.15 0.30-0.60 0.035 0.035 \nMT 1015 0.10-0.20 0.30-0.60 0.035 0.035 \nMT X 1015 0.10-0.20 0.60-0.90 0.035 0.035 \nMT 1020 0.15-0.25 0.30-0.60 0.035 0.035 \nMT X 1020 0.15-0.25 0.70-1.00 0.035 0.035 \nA Rimmed or capped steels which may be used for the above grades are \ncharacterized by a lack of uniformity in their chemical composition, and for this \nreason product analysis is not technologically appropriate unless misapplication is \nclearly indicated. \n8 The letters MT under grade designation indicate Mechanical Tubing. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0947.json",
  "tabulaTablesCsv": "tables_tabula/page-0947.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0947.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5316,
  "bestTextAlphaRatio": 0.7024
}