{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 540,
  "globalPageIndex": 1338,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-788/SA-788M ASME BPVC.II.A-2025 \nThe capacity of the system must also be sufficiently high to \nreduce the initial surge pressure at the start of the pour to a low \nlevel within 2 min. \n5.2.1.2 When the vacuum-lift process is utilized, the molten \nmetal shall be repeatedly drawn into the evacuated vessel to \ngive a recirculation factor (see Annex Al) of at least 2.5 to \nensure thorough degassing and mixing of the entire heat. The \nevacuation system shall be capable of reducing the pressure \nsurges, which occur each time a new portion of steel is \nadmitted to the vessel to increasingly lower levels, until a \nblank-off pressure (usually less than 1000 µm) is achieved \nsignifying the end of the degassing treatment. \n5.2.1.3 When the ladle degassing process is used, the \nevacuation system shall be capable of reducing the system \nvacuum pressure to a low level (usually less than 1000 µm). \nThe molten metal shall be adequately stirred for a sufficient \nlength of time to maximize exposure to the evacuated atmo­\nsphere. \n5.2.1.4 Other methods of vacuum treatment may be used if \nthe supplier can demonstrate adequate degassing and accept­\nable properties in the finished forging to the satisfaction of the \npurchaser. \n6. Forging \n6.1 Forgings shall be made in accordance with 3.2.1. \n6.2 Because of differences in manufacture, hot-rolled, or \nhot-rolled and cold-finished bars (semi-finished or finished), \nbillets, or blooms are not considered to be forgings. \n6.3 Cold worked forgings shall be made from material \npreviously hot worked by forging or rolling; however, a \nhot-cold worked forging may be produced in one continuous \noperation wherein the material is first hot worked and then cold \nworked by control of the finishing temperature. \n7. Cooling Prior to Heat Treatment \n7.1 After forging and before reheating for heat treatment, \nthe forgings shall be allowed to cool in such a manner as to \nprevent injury and, in the case of ferritic forgings, to permit \nsubstantially complete transformation of austenite. \n8. Chemical Composition \n8.1 Heat Analysis: \n8.1.1 An analysis of each heat of steel shall be made by the \nsteel producer to determine the percentages of those elements \nspecified in the product specification. This analysis shall be \nmade from a test sample preferably taken during the pouring of \nthe heat and shall conform to the requirements of the product \nspecification. \n8.1.2 When multiple heats are tapped into a common ladle, \nthe ladle chemistry shall apply. The chemical composition thus \ndetermined shall conform to the requirements of the product \nspecification. \n8.1.3 For multiple-heat ingots, either individual heat analy­\nses or a weighted average (see Annex A2) may be taken. The \nresults of the method used shall conform to the requirements of \nthe product specification. \n8.1.4 With the exception of the product from multiple heats \nsequentially cast in strand casting machines (see 8.1.5), if the \ntest sample taken for a heat analysis is lost or declared \ninadequate for chemical determinations, the steel producer may \ntake alternative samples from appropriate locations near the \nsurface of the ingot or forging as necessary to establish the \nanalysis of the heat in question. \n8.1.5 For multiple heats sequentially cast in strand casting \nmachines, the heat analysis shall be determined for each \nindividual heat in accordance with 8.1.1 or 8.1.2 if applicable. \n8.1.5.1 If, for multiple heats sequentially strand cast, the test \nsample is lost or declared inadequate for chemical analysis \ndetermination, alternative samples, remote from the transition \nzones, may be taken by the steel producer from the cast \nmaterial or product of that heat, as defined in 8.2 or 8.3 as \nappropriate. \n8.1.6 Heat Analysis for Remelted Ingots: \n8.1.6.1 When consumable remelting processes are used, a \nchemical analysis shall be taken from a remelted ingot ( or the \nproduct of a remelted ingot) for the remelt heat analysis. \n8.1.6.2 When more than one electrode is prepared from a \nmaster or parent heat for remelting in the same facility by the \nsame process, then the heat analysis obtained from one \nremelted ingot, or the product from that ingot, shall be taken as \nthe heat analysis for all of the remelted ingots from that master \nheat. For analysis from each remelted ingot, see S27. \n8.1.6.3 When electrodes from different master heats are \nremelted sequentially, an analysis shall be made in each zone \nof the remelted ingot corresponding to at least one electrode \nfrom each master heat. The resultant chemical analysis of each \nzone shall conform to the requirements of the product specifi­\ncation. The heat analysis of the remelted ingot shall be \nrepresented by a weighted average (see Annex A2) of the \nindividual chemical analyses for each zone. \n8.1.6.4 Limits on aluminum content in remelt ingots shall be \nset as required in the product specification. \n8.2 Heat Number Assignment for Sequentially Strand Cast \nMaterial-When heats of the same chemical composition are \nsequentially strand cast, the heat number assigned to the cast \nproduct may remain unchanged until all of the steel in the \nproduct is from the following heat, except when Supplemen­\ntary Requirement S3 is invoked. \n8.3 Identification of Material of Different Chemical Compo­\nsition Ranges, Sequentially Strand Cast-Because of intermix­\ning in the tun dish, separation and identification of the resultant \ntransition material is required when steels of different chemical \ncomposition ranges are sequentially strand cast. The steel \nproducer shall remove the transition material by any estab­\nlished procedure that positively separates the grades. \n8.4 Product Analysis: \n8.4.1 An analysis may be made by the purchaser from a \nforging representing each heat or multiple heat (see 8.1). \nSamples for analysis may be taken from the forging or from a \nfull-size prolongation. The sampling location shall be at any \npoint from the midradius to the outer surface of disk or other \nsolid forgings or midway between the inner and outer surfaces \nof hollow or bored forgings. The analysis may also be taken \nfrom a mechanical test specimen or the mechanical test \nlocation as defined in the product specification. \n1276 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1338.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6245,
  "bestTextAlphaRatio": 0.7782
}