{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 66,
  "globalPageIndex": 66,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-6/SA-6M ASME BPVC.II.A-2025 \n11.5.3.4 For bars other than those to be used for pins and \nrollers, the manufacturer or processor shall have the option of \nusing test specimens that are machined to a thickness or \ndiameter of at least ¾ in. [20 mm] for a length of at least 9 in. \n[230 mm]. \n11.5.3.5 Test specimens for bars to be used for pins and \nrollers shall conform to the requirements shown in Fig. 4 of \nTest Methods and Definitions A370 for the 0.500-in. [12.5-\nmm] diameter test specimen. \n11.6 Elongation Requirement Adjustments: \n11.6.1 Due to the specimen geometry effect encountered \nwhen using the rectangular tension test specimen for testing \nthin material, adjustments in elongation requirements must be \nprovided for thicknesses under 0.312 in. [8 mm]. Accordingly, \nthe following deductions from the base elongation require­\nments shall apply: \nNominal Thickness Range, \nin.(mm] \n0.299-0.311 (7.60-7.89] \n0.286-0.298 (7.30-7.59] \n0.273-0.285 (7.00-7.29] \n0.259-0.272 (6.60-6.99] \n0.246-0.258 (6.20-6.59] \n0.233-0.245 (5.90-6.19] \n0.219-0.232 [5.50-5.89] \n0.206-0.218 (5.20-5.49] \n0.193-0.205 [4.90-5.19] \n0.180-0.192 [4.60-4.89] \n0.166-0.179 [4.20-4.59] \n0.153-0.165 [3.90-4.19] \n0.140-0.152 [3.60-3.89] \n0.127-0.139 [3.20-3.59] \n< 0.127 [3.20] \nElongation \nDeduction, % \n0.5 \n1.0 \n1.5 \n2.0 \n2.5 \n3.0 \n3.5 \n4.0 \n4.5 \n5.0 \n5.6A \n6.0A \n6.6A \n7.0A \n7.6A \nA Elongation deductions for thicknesses less than 0.180 in. [4.60 mm] apply to \nplates and structural shapes only. \n11.6.2 Due to the specimen geometry effect encountered \nwhen using full-section test specimens for angles, the elonga­\ntion requirements for structural-size angles shall be increased \nby six percentage points when full-section test specimens are \nused. \n11.6.3 Due to the inherently lower elongation that is obtain­\nable in thicker structural products, adjustments in elongation \nrequirements shall be provided. For structural products over \n3.5 in. [90 mm] in thickness, a deduction of 0.5 percentage \npoint from the specified percentage of elongation in 2 in. [50 \nmm] shall be made for each 0.5-in. [12.5-rnm] increment of \nthickness over 3.5 in. [90 mm], up to a maximum deduction of \n3.0 percentage points. Accordingly, the following deductions \nfrom the base elongation requirements shall apply: \nNominal Thickness Range, Elongation \nin. [mm] Deduction, % \n3.600-3.999 [90.00-102.49] 0.6 \n4.000-4.499 [102.50-114.99] 1.0 \n4.500-4.999 (115.00-127.49] 1.5 \n5.000-5.499 [127.50-139.99] 2.0 \n6.500-5.999 (140.00-152.49] 2.5 \n6.000 and thicker [152.50 and thicker] 3.0 \n11.6.4 The tensile property requirements tables in many of \nthe product specifications covered by this general requirements \nspecification specify elongation requirements in both 8-in. \n[200-mm] and 2-in. [50-mm] gage lengths. Unless otherwise \n14 \nprovided in the applicable product specification, both require­\nments are not required to be applied simultaneously and the \nelongation need only be determined in the gage length appro­\npriate for the test specimen used. After selection of the \nappropriate gage length, the elongation requirement for the \nalternative gage length shall be deemed not applicable. \n11.7 Yield Strength Application: \n11.7.1 When test specimens do not exhibit a well-defined \ndisproportionate yield point, yield strength shall be determined \nand substituted for yield point. \n11.7.2 The manufacturer or processor shall have the option \nof substituting yield strength for yield point if the test specimen \nexhibits a well-defined disproportionate yield point. \n11. 7.3 Yield strength shall be determined either by the \n0.2 % offset method or by the 0.5 % extension-under-load \nmethod. \n11.8 Product Tension Tests-This specification does not \nprovide requirements for product tension testing subsequent to \nshipment (see 15.1). Therefore, the requirements of 11.1-11.7 \ninclusive and Section 13 apply only for tests conducted at the \nplace of manufacture prior to shipment. \nNorn 6-Compliance to this specification and the applicable product \nspecification by a manufacturer or processor does not preclude the \npossibility that product tension test results might vary outside specified \nranges. The tensile properties will vary within the same heat or piece, be \nit as-rolled, control-rolled, or heat-treated. Tension testing according to the \nrequirements of this specification does not provide assurance that all \nproducts of a heat will be identical in tensile properties with the products \ntested. If the purchaser wishes to have more confidence than that provided \nby this specification testing procedures, additional testing or requirements, \nsuch as Supplementary Requirement S4, should be imposed. \n11.8.1 Appendix X2 provides additional information on the \nvariability of tensile properties in plates and structural shapes \n12. Permitted Variations in Dimensions and Weight \n[Mass] \n12.1 One cubic foot of rolled steel is assumed to weigh 490 \nlb. One cubic metre of rolled steel is assumed to have a mass \nof 7850 kg. \n12.2 Plates-The permitted variations for dimensions and \nweight [mass] shall not exceed the applicable limits in Tables 1 \nto 15 [Annex Al, Tables Al.1 to Al.15] inclusive. \n12.3 Shapes: \n12.3.1 Annex A2 lists the designations and dimensions, in \nboth inch-pound and SI units, of shapes that are most com­\nmonly available. Radii of fillets and toes of shape profiles vary \nwith individual manufacturers and therefore are not specified. \n12.3.2 The permitted variations in dimensions shall not \nexceed the applicable limits in Tables 16 to 25 [Annex Al, \nTables Al.16 to Al.25] inclusive. Permitted variations for \nspecial shapes not listed in such tables shall be as agreed upon \nbetween the manufacturer and the purchaser. \nNorn 7-Permitted variations are given in Tables 16 to 25 [Annex Al, \nTables Al.16 to Al.25] inclusive for some shapes that are not listed in \nAnnex A2 (that is, bulb angles, tees, zees). Addition of such sections to \nAnnex A2 will be considered by Subcommittee A0l.02 when and if a need \nfor such listing is shown. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0066.json",
  "tabulaTablesCsv": "tables_tabula/page-0066.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0066.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6055,
  "bestTextAlphaRatio": 0.6799
}