{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 322,
  "globalPageIndex": 322,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-209 /SA-209M ASME BPVC.II.A-2025 \nStandard Specification for \nSeamless Carbon-Molybdenum Alloy-Steel Boiler and \nSuperheater Tubes \nl. Scope \n1.1 This specification covers several grades of minimum­\nwall-thickness, seamless, carbon-molybdenum alloy-steel, \nboiler and superheater tubes. \n1.2 This specification covers tubes l/2 to 5 in. [12.7 to 127 \nmm] inclusive, in outside diameter and 0.035 to 0.500 in. [0.9 \nto 12.7 mm], inclusive, in minimum wall thickness. \n1.3 An optional supplementary requirement is provided and, \nwhen desired, shall be so stated in the order. \n1.4 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n2. Referenced Documents \n2.1 ASTM Standards: \nAl016/Al016M Specification for General Requirements for \nFerritic Alloy Steel, Austenitic Alloy Steel, and Stainless \nSteel Tubes \n3. General Requirements \n3J Product furnished under this specification shall conform \nto the requirements of Specification A1016/A1016M, includ-\ning any supplementary requirements that are indicated in the \npurchase order. Failure to comply with the general require­\nments of Specification A1016/Al016M constitutes nonconfor­\nmance with this specification. In case of conflict with the \nrequirements of this specification and Specification Al016/ \nAl016M, this specification shall prevail. \n4. Materials and Manufacture \n4.1 Steelmaking Practice--The steel shall be killed. \n4.2 The tubes shall be made by the seamless process and \nshall be either hot-finished or cold-finished, as specified. \n4.3 Heat Treatment-Hot-finished tubes shall be heat treated \nat a temperature of 1200 °F [650 °C] or higher. Cold-finished \ntubes shall, after the final cold finishing, be heat treated at a \ntemperature of 1200 °F [650 °C] or higher, or tubing may be \nfurnished in the full-annealed, isothermal annealed, or nonnal­\nized and tempered condition. If furnished in the normalized \nand tempered condition, the minimum tempering temperature \nshall be 1200 °F [ 650 °C]. \n5. Chemical Composition \n270 \n5 .1 The steel shall conform to the requirements given in \nTable L \n5.2 Product Analysis \n5.2.1 An analysis shall be made by the manufacturer of one \nbillet or one tube from each heat. The chemical composition \nthus determined, shall conform to the requirements given in \nTable 1. \n5.2.2 If the original test for product analysis fails, retests of \ntwo additional billets or tubes shall be made. Both retests for \nthe elements in question shall meet the requirements of the \nspecification; otherwise all remaining material in the heat or lot \n(See 7.1) shall be rejected or, at the option of the producer, each \nbillet or tube may be individually tested for acceptance. Billets \nor tubes that do not meet the requirements of the specification \nshall be rejected. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0322.json",
  "tabulaTablesCsv": "tables_tabula/page-0322.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0322.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3197,
  "bestTextAlphaRatio": 0.7557
}