{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 233,
  "globalPageIndex": 233,
  "width": 613.92,
  "height": 793.2,
  "text": "\\. . --..___, \nASME BPVC.II.A-2025 SA-134/SA-134M \n2.3 American National Standards Institute Standard: \nB 16.25 Buttwelding Ends \nB 36.10 Welded and Seamless Wrought Steel Pipe \n3. Ordering Information \n3.1 Orders for electric-fusion arc-welded pipe under this \nspecification shall contain information concerning as many of \nthe following items as are required, to describe the desired pipe \nadequately: \n3.1.1 Quantity (feet, metres, or number of lengths), \n3.1.2 Name of material (electric-fusion (arc)-welded pipe), \n3.1.3 ASTM Specification A134 or A134M and year date, \n3.1.4 Grade (if applicable) of steel from which the pipe shall \nbe made (Section 4), \n3.1.5 Size (inside or outside diameter and nominal wall \nthickness), and \n3.1.6 Length (specified or random). \n3.2 The purchaser shall have the option to order additional \nrequirements, including, but not limited to the following: \n3.2.1 Specific straightness requirements (see 12.3), \n3.2.2 End finish (Section 14), \n3.2.3 Hydrostatic Test Pressure (Section 11), \n3.2.4 Protective coating (Section 20), \n3.2.5 End use of pipe, and \n3.2.6 Other special or supplementary requirements, if any. \n4. Material \n4.1 The steel from which the pipe is made shall conform to \nSpecifications A36/A36M, A283/A283M, A285/A285M, \nAlOll/AlOllM, A1018/A1018M, or to other ASTM specifi­\ncations for equally suitable weldable material, as specified. For \npurposes of marking and certification, when required, the pipe \ngrade of material shall be established by the A xxx plate \nspecification designation and plate grade, when applicable. \n5. Manufacture \n5.1 The longitudinal edges of the steel shall be shaped to \ngive the most satisfactory results by the particular welding \nprocess employed. The steel shall then be properly formed and \nmay be tacked preparatory to welding. The weld shall be made \nby automatic means (except tack welds) and shall be of \nreasonably uniform width and height for the entire length of the \npipe. By agreement between the purchaser and the \nmanufacturer, manual welding by qualified procedure and \nwelders may be used as an equal alternate under this specifi­\ncation. \n5.2 All longitudinal seams, spiral seams, and shop girth \nseams shall be butt-welded. \n6. Number of Production Weld Tests \n6.1 One weld test specimen specified in Section 8 shall be \nmade from each lot of 3000 ft [900 m] of pipe or fraction \nthereof of each size and wall thickness. \n6.2 If any test specimen shows defective machining or \ndevelops flaws not associated with the welding, it may be \ndiscarded and another specimen substituted. \n6.3 Each length of pipe shall be subjected to the hydrostatic \ntest specified in Section 11, unless otherwise specified in 11.3. \n7. Retests \n7.1 If any specimen tested in accordance with Section 10 \nfails to meet the requirements, retests of two additional \nspecimens from the same lot of pipe shall be made, each of \nwhich shall meet the requirements specified. If any of the \nretests fail to conform to the requirements, test specimens may \nbe taken from each untested pipe length at the manufacturer's \noption. Each specimen shall meet the requirements specified, \nor that pipe shall be rejected. \n8. Test Specimens of Production Welds \n8.1 The weld-test specimens for the reduced-section tension \ntest shall be taken perpendicularly across the weld and from the \nend of the pipe or, alternatively, from flat test pieces of material \nconforming to the requirements in the specifications used in the \nmanufacture of the pipe. The alternative weld-test specimens \nshall be welded with the same procedure and by the same \noperator and equipment, and in sequence with the welding of \nthe longitudinal joints in the pipe. The test pieces shall have the \nweld approximately in the middle of the specimen. The \nspecimens shall be straightened cold, and shall be tested at \nroom temperature. \n8.2 Reduced-section tension-test specimens shall be pre­\npared in accordance with Fig. A2.3 of Test Methods and \nDefinitions A370, Annex A2 Steel Tubular Products. \n9. Qualification of Welding Procedure \n9.1 The welding procedure shall be qualified in accordance \nwith the American Welding Society Standard Qualification \nProcedure 5 or ASME Section IX of the Boiler and Pressure \nVessel Code as agreed to between the manufacturer and the \npurchaser using the tests and test values specified in 9.2 and \n9.3. Thicknesses less than 3/s in. [10 mm] shall be qualified for \neach wall thickness of pipe manufactured. Thicknesses 3/s to ¾ • \nin. [10 mm to 19 mm], inclusive, shall be qualified in 3/s-in. \n[10-mm] thickness. \n181 \n9.2 Two reduced-section tension specimens (transverse \nweld) made in accordance with Fig. A2.3 of Test Methods and \nDefinitions A370, with the weld reinforcement removed, shall \nshow a tensile strength not less than 100 % of the minimum \nspecified tensile strength of the base material used. \n9.3 Two face-bend test specimens shall be prepared in \naccordance with Section A2.5.l.7 of Test Methods and Defi­\nnitions A370 and shall withstand being bent 180° in a jig \nsubstantially in accordance with Fig. A2.15.3 of Test Methods \nand Definitions A370. The bend test shall be acceptable if no \ncracks·or other defects exceeding 1/s in. [3 mm] in any direction \nbe present in the weld metal or between the weld and the pipe ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0233.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5324,
  "bestTextAlphaRatio": 0.7468
}