{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 642,
  "globalPageIndex": 642,
  "width": 617.52,
  "height": 857.4,
  "text": "SA-370 ASME BPVC.II.A-2025 \nG- R \nDIMENSIONS \nStandard Specimen Small-size Specimens Proportional to Standard \nNominal Diameter in. mm in. mm in. mm in. mm in. mm \n0.500 12.5 0.350 8.75 0.250 6.25 0.160 4.00 0.113 2.50 \nG-Gauge length 2.00± 50.0 ± 1.400± 35.0 ± 1.000± 25.0 ± 0.640± 16.0 ± 0.450± 10.0 ± \n0.005 0.10 0.005 0.10 0.005 0.10 0.005 0.10 0.005 0.10 \nD-Diameter (Note 1) 0.500± 12.5± 0.350± 8.75 ± 0.250± 6.25 ± 0.160± 4.00 ± 0 .. 113± 2.50 ± \n0.010 0.25 0.007 0.18 0.005 0.12 0.003 0.08 0.002 0.05 \nA-Radius of fillet, min 3/a 10 ¼ 6 3/16 5 5/32 4 3 /32 2 \nA-Length of reduced section, min 2¼ 60 1¾ 45 1¼ 32 ¾ 20 % 16 \n(Note 2) \nNorn 1-The reduced section may have a gradual taper from the ends toward the ceuter, with the ends not more than 1 % larger in diameter than the \ncenter (controlling dimension). \nNorn 2-If desired, the length of the reduced section may be increased to accommodate an extensometer of any convenient gauge length. Reference \nmarks for the measurement of elongation should, nevertheless, be spaced at the indicated gauge length. \nNorn 3-The gauge length and fillets shall be as shown, but the ends may be of any form to fit the holders of the testing machine in such a way that \nthe load shall be axial (see Fig. 9). If the ends are to be held in wedge grips it is desirable, if possible, to make the length of the grip section great enough \nto allow the specimen to extend into the grips a distance equal to two thirds or more of the length of the grips. \nNorn 4-On the round specimens in Fig. 5 and Fig. 6, the gauge lengths are equal to four times the nominal diameter. In some product specifications \nother specimens may be provided for, but unless the 4-to-1 ratio is maintained within dimensional tolerances, the elongation values may not be comparable \nwith those obtained from the standard test specimen. \nNorn 5-The use of specimens smaller than 0.250-in. (6.25 mm) diameter shall be restricted to cases when the material to be tested is of insufficient \nsize to obtain larger specimens or when all parties agree to their use for acceptance testing. Smaller specimens require suitable equipment and greater \nskill in both machining and testing. \nNorn 6-Five sizes of specimens often used have diameters of approximately 0.505, 0.357, 0.252, 0.160, and 0.113 in., the reason being to permit easy \ncalculations of stress from loads, since the corresponding cross sectional areas are equal or close to 0.200, 0.100, 0.0500, 0.0200, and 0.0100 in.2, \nrespectively. Thus, when the actual diameters agree with these values, the stresses (or strengths) may be computed using the simple multiplying factors \n5, 10, 20, 50, and 100, respectively. (The metric equivalents of these fixed diameters do not result in correspondingly convenient cross sectional area and \nmultiplying factors.) \nFIG. 4 Standard 0.500-in. (12.5 mm) Round Tension Test Specimen With 2-in. (50 mm) Gauge Length and Examples of Small-size Speci­\nmens Proportional to Standard Specimens \nmeasured at the center of the gauge length to the nearest \n0.001 in. (0.025 mm) (see Table 1). \n9.6 General-Test specimens shall be either substantially \nfull size or machined, as prescribed in the product specifica­\ntions for the material being tested. \n9.6. l It is desirable to have the cross-sectional area of the \nspecimen smallest at the center of the gauge length to ensure \nfracture within the gauge length. This is provided for by the \ntaper in the gauge length permitted for each of the specimens \ndescribed in the following sections. \n9.6.2 For brittle materials it is desirable to have fillets of \nlarge radius at the ends of the gauge length. \n10. Plate-type Specimens \n10.1 The standard plate-type test specimens are shown in \nFig. 3. Such specimens are used for testing metallic materials \nin the form of plate, strnctural and bar-size shapes, and flat \nmaterial having a nominal thickness of 3/16 in. (5 mm) or over. \nWhen product specifications so permit, other types of speci­\nmens may be used. \nNorn 4-When called for in the product specification, the 8-in. (200 \n590 \nmm) gauge length specimen of Fig. 3 may be used for sheet and strip \nmaterial. \n11. Sheet-type Specimen \n11.1 The standard sheet-type test specimen is shown in Fig. \n3. This specimen is used for testing metallic materials in the \nform of sheet, plate, flat wire, strip, band, and hoop ranging in \nnominal thickness from 0.005 to 1 in. (0.13 to 25 mm). When \nproduct specifications so permit, other types of specimens may \nbe used, as provided in Section 10 (see Note 4). \n12. Round Specimens \n12.1 The standard 0.500-in. (12.5 mm) diameter round test \nspecimen shown in Fig. 4 is frequently used for testing metallic \nmaterials. \n12.2 Fig. 4 also shows small size specimens proportional to \nthe standard specimen. These may be used when it is necessary \nto test material from which the standard specimen or specimens \nshown in Fig. 3 cannot be prepared. Other sizes of small round \nspecimens may be used. In any such small size specimen it is \nimportant that the gauge length for measurement of elongation \nbe four times the diameter of the specimen (see Note 5, Fig. 4). ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0642.json",
  "tabulaTablesCsv": "tables_tabula/page-0642.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0642.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5157,
  "bestTextAlphaRatio": 0.6905,
  "noteOcrPath": "note_ocr/page-0642.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0642.txt",
  "noteOcrHighDpiCount": 1,
  "noteOcrHighDpiNotes": [
    "Note 4—When called for in the product specification, the 8-in. (200 be four times the diameter of the specimen (see Note 5, Fig. 4)."
  ]
}