{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 498,
  "globalPageIndex": 1296,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-749/SA-749M ASME BPVC.II.A-2025 \ndeterminations of any element in a cast shall not vary both \nabove and below the specified range. \n5.4 Sampling for Product Analysis: \n5.4.1 To indicate adequately the representative com­\nposition of a cast by product analysis, it is general practice \nto select samples to represent the steel, as fairly as possible, \nfrom a minimum number of pieces as follows: 3 pieces \nfor lots up to 15 tons inclusive, and 6 pieces for lots over \n15 tons [15 Mg]. \n5.4.2 When the steel is subject to tension test require­\nments, samples for product analysis may be taken either \nby drilling entirely through the used tension test specimens \nthemselves or in accordance with 5.4.3. \n5.4.3 When the steel is not subject to tension test \nrequirements, the samples for analysis must be taken by \nmilling or drilling entirely through the stlip in a sufficient \nnumber of places so that the samples are representative of \nthe entire stlip. The sampling may be facilitated by folding \nthe stlip both ways, so that several samples may be taken \nat one drilling. Steel subjected to certain heating operations \nby the purchaser may not give chemical analysis results \nthat properly represent its original composition. Therefore, \nusers must analyze chips taken from the steel in the condi­\ntion in which it is received from the steel manufacturer. \n5.5 Specimen Preparation - Drillings or chips must be \ntaken without the application of water, oil, or other lubri­\ncant, and must be free of scale, grease, dirt, or other foreign \nsubstances. They must not be overheated during cutting to \nthe extent of causing decarburization. Chips must be well \nniixed, and those too coarse to pass a No. 10 (2.00 mm) \nsieve or too fine to remain on a No. 30 (600 µ,m) sieve \nare not suitable for proper analysis. Sieve size numbers \nare in accordance with Specification E 11. \n5.6 Test Methods-In case a referee analysis is required \nand agreed upon to resolve a dispute concerning the results \nof a chemical analysis, the procedure for performing the \nreferee analysis must be in accordance with the latest issue \nof Test Methods, Practices, and Terminology A 751, unless \notherwise agreed upon between the manufacturer and the \npurchaser. \n6. Mechanical Properties \n6.1 The mechanical property requirements, number of \nspecimens, test locations, and specimen orientation shall \nbe in accordance with the applicable product specification. \n6.2 Unless otherwise specified in the applicable product \nspecification, test specimens must be prepared in accor­\ndance with Test Methods and Definitions A 370. \n6.3 Mechanical tests shall be conducted in accordance \nwith Test Methods and Definitions A 370. \n6.4 Bend tests, where required, shall be conducted in \ncompliance with Test Methods E 290. \n6.5 To determine conformance with the product speci­\nfication, a calculated value should be rounded to the nearest \n1 ksi [7 MPa] tensile strength and yield point or yield \nstrength, and to the nearest unit in the right hand place of \nfigures used in expressing the limiting value for other val­\nues in accordance with the rounding off method given in \nPractice E 29. \n6.6 Structural steels are commonly fabricated by cold \nbending. There are many interrelated factors that affect the \nability of a given steel to cold form over a given radius \nunder shop conditions. These factors include thickness, \nstrength level, degree of restraint, relationship to rolling \ndirection, chemistry, and microstructure. Each of the appro­\npriate product specifications lists in the appendix the sug­\ngested minimum inside radius for cold bending. These radii \nshould be used as minima for 90° bends. They presuppose \n\"hard way\" bending (bend axis parallel to rolling direction) \nand reasonably good shop forming practices. Where possi­\nble, the use of larger radii or \"easy way\" bends are recom­\nmended for improved performance. \n6.7 Fabricators should be aware that cracks may initiate \nupon bending a sheared or burned edge. This is not consid­\nered to be a fault of the steel but is rather a function of \nthe induced cold-work or heat-affected zone. \n7. Dimensions, Tolerances, and Allowances \n7 .1 Dimensions, tolerances, and allowances applicable \nto products covered by this specification are contained in \nTable 2 through Table 9 [Annex Al, Tables Al.1 through \nAl.7]. The appropriate tolerance tables shall be identified \nin each individual specification. \n8. Workmanship \n8.1 Cut lengths shall have a workmanlike appearance \nand shall not have imperfections of a nature or degree for \nthe product, the grade, and the quality ordered that will be \ndetlimental to the fabrication of the finished part. \n8.2 Coils may contain some abnormal imperfections \nthat render a portion of the coil unusable since the inspec­\ntion of coils does not afford the producer the same opportu­\nnity to remove portions containing imperfections as in the \ncase with cut lengths. \n9. Finish and Condition \n9.1 Hot-rolled stlip has a surface with an oxide or scale \nresulting from the hot-rolling operation. The oxide or scale \ncan be removed by pickling or blast cleaning when required \n1224 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1296.json",
  "tabulaTablesCsv": "tables_tabula/page-1296.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1296.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5157,
  "bestTextAlphaRatio": 0.7762
}