{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 889,
  "globalPageIndex": 1687,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 \n100°F (50°C) above the maximum intended service tem­\nperature for which allowable stresses for the base mate­\nrial are requested. \n(-c) at a minimum of four stresses calculated to \nproduce rupture times of at least 1,000 hr and with one \ntest exceeding 10,000 hr. \n(-d) the test temperature; stress; rupture time; \nspecimen size and configuration, including weld location; \nand failure location (base metal, weld metal, or heat af­\nfected zone), for all test samples. \n(-e] the creep-rupture data shall be compared to \nthe scatter bands of data for the base metal. For the eva­\nluation of creep strength enhanced ferritic (CSEF) steels, a \npreference shall be placed on cross-weld test specimens \nwith large cross-sectional area or vessel tests or other \nfeature-type tests. The extent of testing described in \nIV-1500 may be reduced in lieu of feature-type tests. \n(-f] post-test metallographic evaluation shall be \nperformed on at least three actual test specimens includ­\ning the longest-duration test samples at the time of sub­\nmission. The assessment shall be limited to a test \ntemperature not higher than the maximum intended use \ntemperature and not lower than the temperature transi­\ntion to time-dependent behavior. The assessment shall in­\nclude macro-images to document the overall appearance \n(oxidation, necking, intergranular fracture, etc.), as well \nas micro-images to document the nature and extent of ca­\nvitation damage. \nIV-1600 LONG-TERM PROPERTIES \nSTABILITY \nFor new materials, and particularly for those whose \ncreep-rupture properties are affected by heat treatment \nor deformation processes or a combination of these, it \nis important to know the structural stability characteris­\ntics and the degree of retention of properties with long­\nterm exposure at temperature. Where particular tem­\nperature ranges of service exposure or fabrication heat \ntreatment, cooling rates, and combination of mechanical \nworking and thermal treatments cause significant \nchanges in the microstructure on which the \ncreep-rupture properties depend, these shall be brought \nto the attention of the BPV Committee. \nIV-1700 REQUESTS FOR ADDITIONAL DATA \nThe Committee may request additional data, including \ndata on properties or material behavior not explicitly \ntreated in the Construction Code for which approval is \ndesired. \nIV-1800 NEW MATERIALS CHECKLIST \nTo assist inquirers desiring Code coverage for new ma­\nterials, or extending coverage of existing materials, the \nCommittee has developed the following checklist of items \nthat ought to be addressed in each inquiry. While taking \ninto account the intended application of the product, the \nCommittee may require specific information from the \ninquirer, as shown above for certain material \ncharacteristics. \n(a) Has a qualified inquirer request been provided? \n(b J Has a request either for revision to existing Code re­\nquirements or for a Code Case been defined? \n(c) Has a letter to ASTM or AWS been submitted re­\nquesting coverage of the new material in a specification? \nAlternatively, is this material already covered by a speci­\nfication issued by a recognized national or international \norganization and has an English language version been \nprovided? \n( d} Has the Construction Code and, if applicable, a Divi­\nsion, Subsection, or Part been identified? \n(e] Have product forms, size range, and the applicable \nspecification( s) been defined? \n(f) Has the range (maximum/minimum) of tempera­\nture application been defined? \n(g) Has the chemistry been submitted and the related \nrequirements been addressed? \n(h) Have the metallurgical structure and heat treatment \nrequirements been submitted? \n(i) Have mechanical property data been submitted (ul­\ntimate tensile strength, yield strength, reduction of area, \nand elongation at 100°F (50°C) intervals, from room tem­\nperature to 100°F (50°C) above the maximum intended \nuse temperature, for three heats of appropriate product \nforms and sizes? \n(j) if requested temperatures of coverage are above \nthose at which time-dependent properties begin to gov­\nern design values, have appropriate time-dependent \nproperty data for base metal and weldments been \nsubmitted? \n(k) if higher allowable stresses for material to be used \nbelow room temperature are requested, have appropriate \nmechanical property data below room temperature been \nsubmitted? \n(I) Have toughness considerations required by the \nConstruction Code been defined and have appropriate \ndata been submitted? \n(m) Have stress-strain curves been submitted for the \nestablishment of External Pressure Charts? \n(n) if cyclic service considerations are required by the \nrequested Construction Code application, have appropri­\nate fatigue data been submitted? \n( o) Have physical properties data ( coefficient of ther­\nmal expansion, thermal conductivity and diffusivity, mod­\nulus of elasticity, Poisson's ratio, and density) been \nsubmitted? \n1633 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1687.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4957,
  "bestTextAlphaRatio": 0.7896
}