{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 618,
  "globalPageIndex": 618,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-358/SA-358M ASME BPVC.11.A-2025 \nSpecification for \nElectric-Fusion-Welded Austenitic Chromium-Nickel \nStainless Steel Pipe for High-Temperature Service and \nGeneral Applications \n1. Scope \n1.1 This specification covers electric-fusion-welded auste­\nnitic chromium-nickel stainless steel pipe suitable for corrosive \nor high-temperature service, or both, or for general applica­\ntions. \nNoTE 1-The dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiaineter,\" \"size,\" and \"n01ninal size.\" \n1.2 This specification covers the grades of alloy and stain­\nless steel listed in Table 1. The selection of the proper grade \nand requirements for heat treatment shall be at the discretion of \nthe purchaser, dependent on the service conditions to be \nencountered. \n1.3 Five classes of pipe are covered as follows: \n1.3.l Class I-Pipe shall be double welded by processes \nemploying filler metal in all passes and shall be completely \nradio graphed. \n1.3.2 Class 2-Pipe shall be double welded by processes \nemploying filler metal in all passes. No radiography is re­\nquired. \n1.3.3 Class 3-Pipe shall be single welded by processes \nemploying filler metal in all passes and shall be completely \nradiographed. \n1.3.4 Class 4-Same as Class 3 except that the weld pass \nexposed to the inside pipe surface may be made without the \naddition of filler metal (see 6.2.2.1 and 6.2.2.2). \nl.3.5 Class 5-Pipe shall be double welded by processes \nemploying filler metal in all passes and shall be spot radio­\ngraphed. \n1.4 Supplementary requirements covering provisions rang­\ning from additional testing to formalized procedures for \n566 \nmanufacturing practice are provided. Supplementary Require­\nments S 1 through S6 are included as options to be specified \nwhen desired. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in nonconformance with the \nspecification. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA240/ A240M Specification for Chromium and Chromium­\nNickel Stainless Steel Plate, Sheet, and Strip for Pressure \nVessels and for General Applications \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA480/A480M Specification for General Requirements for \nFlat-Rolled Stainless and Heat-Resisting Steel Plate, \nSheet, and Strip \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA999/A999M Specification for General Requirements for \nAlloy and Stainless Steel Pipe \nE527 Practice for Numbering Metals and Alloys in the \nUnified Numbering System (UNS) ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0618.json",
  "tabulaTablesCsv": "tables_tabula/page-0618.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0618.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3344,
  "bestTextAlphaRatio": 0.7781
}