{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 792,
  "globalPageIndex": 792,
  "width": 635.52,
  "height": 871.68,
  "text": "SA-450/SA-450M ASME BPVC.II.A-2025 \nwhere: \nH = distance between flattening plates, in. [mm], \nt = specified wall thickness of the tube, in. [mm], \nD = specified outside diameter of the tube, in. [mm], and \ne = deformation per unit length (constant for a given grade \nof steel: 0.07 for medium-carbon steel (maximum \nspecified carbon 0.19 % or greater), 0.08 for low alloy \nsteel, and 0.09 for low-carbon steel (maximum speci­\nfied carbon 0.18 % or less)). \nDuring the second step, which is a test for soundness, the \nflattening shall be continued until the specimen breaks or the \nopposite walls of the tube meet. Evidence of laminated or \nunsound material, or of incomplete weld that is revealed during \nthe entire flattening test shall be cause for rejection. \n19.2 Surface imperfections in the test specimens before \nflattening, but revealed during the first step of the flattening \ntest, shall be judged in accordance with the finish requirements. \n19.3 Superficial ruptures resulting from surface imperfec­\ntions shall not be cause for rejection. \n19.4 When low D-to-t ratio tubular products are tested, \nbecause the strain imposed due to geometry is unreasonably \nhigh on the inside surface at the six and twelve o'clock \nlocations, cracks at these locations shall not be cause for \nrejection if the D to t ratio is less than 10. \n20. Reverse Flattening Test \n20.1 A 5 in. [100 mm] in length of finished welded tubing in \nsizes down to and including ½ in. [12.7 mm] in outside \ndiameter shall be split longitudinally 90° on each side of the \nweld and the sample opened and flattened with the weld at the \npoint of maximum bend. There shall be no evidence of cracks \nor lack of penetration or overlaps resulting from flash removal \nin the weld. \n21. Flaring Test \n21.1 A section of tube approximately 4 in. [100 mm] in \nlength shall stand being flared with a tool having a 60° included \nangle until the tube at the mouth of the flare has been expanded \nto the percentages specified in Table 5 without cracking or \nshowing imperfections rejectable under the provisions of the \nproduct specification. \nTABLE 5 Flaring Test Requirements \nRatio of Inside \nDiameter to Outside \nDiameters \n0.9 \n0.8 \n0.7 \n0.6 \n0.5 \n0.4 \n0.3 \nMinimum Expansion of Inside \nDiameter,% \nCarbon Steels \n21 \n22 \n25 \n30 \n39 \n51 \n68 \nLow \nAlloy Steels \n15 \n17 \n19 \n23 \n28 \n38 \n50 \nA In determining the ratio of inside diameter to specified outside diameter, the \ninside diameter shall be defined as the actual mean inside diameter of the material \ntested. \n22. Flange Test \n22.1 A section of tube shall be capable of having a flange \nturned over at a right angle to the body of the tube without \ncracking or showing imperfections rejectable under the provi­\nsions of the product specification. The width of the flange for \ncarbon and alloy steels shall be not less than the percentages \nspecified in Table 6. \n23. Hardness Test \n23.1 For tubes 0.200 in. [5.1 mm] and over in wall \nthickness, either the Brinell or Rockwell hardness test shall be \nused. When Brinell hardness testing is used, a 10-mm ball with \n3000, 1500, or 500-kg load, or a 5-mm ball with 750-kg load \nmay be used, at the option of the manufacturer. \n742 \n23.2 For tubes less than 0.200 in. [5.1 mm] to and including \n0.065 in. [1.7 mm] in wall thickness, the Rockwell hardness \ntest shall be used. \n23.3 For tubes less than 0.065 in. [1.7 mm] in wall \nthickness, the hardness test shall not be required. \n23.4 The Brinell hardness test may be made on the outside \nof the tube near the end, on the outside of a specimen cut from \nthe tube, or on the wall cross section of a specimen cut from the \ntube at the option of the manufacturer. This test shall be made \nso that the distance from the center of the impression to the \nedge of the specimen is at least 2.5 times the diameter of the \nimpression. \n23.5 The Rockwell hardness test may be made on the inside \nsurface, on the wall cross section, or on a flat on the outside \nsurface at the option of the manufacturer. \n23.6 For tubes furnished with upset, swaged, or otherwise \nformed ends, the hardness test shall be made as prescribed in \n23.1 and 23.2 on the outside of the tube near the end after the \nforming operation and heat treatment. \n23.7 For welded or brazed tubes, the hardness test shall be \nmade away from the joints. \n23.8 When the product specification provides for Vickers \nhardness, such testing shall be in accordance with Test Method \nE92. \n24. Hydrostatic Test \n24.1 Except as provided in 24.2 and 24.3, each tube shall be \ntested by the manufacturer to a minimum hydrostatic test \npressure determined by the following equation: \nInch - Pound Units: P = 32000 t/D \nSI Units: P = 220.6t/D \nTABLE 6 Flange Requirements \nOutside Diameter of Tube, in. [mm] \nTo 2½ [63.5], incl \nOver 2½ to 3¾ [63.5 to 95.2], incl \nOver 3¾ to 8 [95.2 to 203.2], incl \nWidth of Flange \n15%ofOD \n12½%ofOD \n10%ofOD \n(3) ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0792.json",
  "tabulaTablesCsv": "tables_tabula/page-0792.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0792.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4913,
  "bestTextAlphaRatio": 0.7116
}