{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 381,
  "globalPageIndex": 381,
  "width": 604.32,
  "height": 847.68,
  "text": "ASME BPVC.II.A-2025 SA-234/SA-234M (ASTM A234/A234M) \nMSS-SP-83 Steel Pipe Unions, Socket-Welding and \nThreaded \nMSS-SP-95 Swage(d) Nipples and Bull Plugs \nMSS-SP-97 Integrally Reinforced Forged Branch Outlet \nFittings-Socket Welding, Threaded and Buttwelding \nEnds \n2.6 ASNT Standard: 6 \nSNT-TC-lA Recommended Practice for Nondestructive \nTesting Personnel Qualification and Certification \n2.7 AWS Specifications 7 \nA5.5/A5.5M Specification for Low-Alloy Steel Electrodes \nfor Shielded Metal Arc Welding \nA5.23/A5.23M Specification for Low-Alloy Steel Elec­\ntrodes and Fluxes for Submerged Arc Welding \nA5.28/A5.28M Specification for Low-Alloy Steel Elec­\ntrodes for Gas Shielded Arc Welding \nA5.29/A5.29M Low-Alloy Steel Electrodes for Flux Cored \nArc Welding \n3. Terminology \n3.1 Definitions-For definitions of terms used in this speci­\nfication refer to Specification A960/A960M. \n4. Ordering Information \n4.1 See Specification A960/ A960M. \n5. General Requirements \n5.1 Product furnished to this specification shall conform to \nthe requirements of Specification A960/ A960M, including any \nsupplementary requirements that are indicated in the purchase \norder. Failure to comply with the requirements of Specification \nA960/A960M constitutes non-conformance with this specifi­\ncation. In case of a conflict between the requirements of this \nspecification and Specification A960/ A960M, this specification \nshall prevail. \n6. Materials \n6.1 The starting material for fittings shall be killed steel, \nconsisting of forgings, bars, plates, sheet, and seamless or \nfusion-welded tubular products with filler metal added and \nshall conform to the chemical requirements of Table 1. Unless \notherwise specified for carbon steel plates and sheet, the steel \nmay be made to either coarse grain or fine grain practice. Grade \nWP9 shall be made to fine grain practice. \n6.2 A starting material specification that specifically re­\nquires the addition of any element beyond those listed for the \nmaterials in Table 1 for the applicable grade of material is not \npermitted. This does not preclude the use of deoxidizers or the \njudicious use of elements for grain size control. \n7. Manufacture \n7 .1 Forging or shaping operations may be performed by \nhammering, pressing, piercing, extruding, upsetting, rolling, \n6 Available from American Society for Nondestructive Testing (ASNT), P.O. Box \n28518, 1711 Arlingate Ln., Columbus, OH 43228-0518, http://www.asnt.org. \n7 Available from American Welding Society (AWS), 550 NW LeJeune Rd., \nMiami, FL 33126, http://www.aws.org. \nbending, fusion welding, machining, or by a combination of \ntwo or more of these operations. The forming procedure shall \nbe so applied that it will not produce injurious imperfections in \nthe fittings. \n7 .2 Fittings NPS-4 and under may be machined from \nhot-forged or rolled, cold-sized, and straightened bar stock \nhaving the chemical composition of the Grade in Table 1 and \nthe mechanical properties of the Grade in Table 2. Heat \ntreatment shall be in accordance with Section 8. All caps \nmachined from bar stock shall be examined by liquid penetrant \nor magnetic particle in accordance with S52 or S53 in \nSpecification A960/A960M. \n7.3 All welds including welds in tubular products from \nwhich fittings are made shall be (1) made by welders, welding \noperators, and welding procedures qualified under the provi­\nsions of ASME Section IX, (2) heat treated in accordance with \nSection 8 of this specification, and (3) radiographically exam­\nined throughout the entire length of each weld in accordance \nwith Article 2, ASME Section V with acceptance limits in \naccordance with Paragraph UW-51 of ASME Section VIIl, \nDivision 1 of the ASME Boiler & Pressure Vessel Code. In \nplace of radiographic examination, welds may be ultrasonically \nexamined in accordance with Appendix 12 of Section VIIl. The \nNDE of welds in Grades WPB, WPC, WPl, WPll Class 1, \nWPll Class 2, WPll Class 3, WP12 Class 1, WP12 Class 2, \nand WPR may be performed either prior to or after forming. \nNDE of welds in Grades WPS, WP9, WP91 Types 1 and 2, \nWP911, WP92, WP22 Class 1, WP22 Class 3, and WP24 shall \nbe done after forming. \n7.3.1 All welds in WP91 Types 1 and 2 shall be made with \none of the following welding processes and consumables: \nSMAW, A5.5/A5.5M E90:XX-B9; SAW, A5.23/A5.23M EB9 + \nflux; GTAW, A5.28/A5.28M ER90S-B9; and FCAW AS.29/ \nA5.29M E91Tl-B9. In addition, the Ni+Mn content of all \nwelding consumables used to fabricate WP91 Type 1 and Type \n2 fittings shall not exceed 1.0 %. \n7.3.2 All welds in WP92 and WP911 shall be made using \nwelding consumables meeting the chemical requirements for \nthe grade in Table 1. \n329 \n7.3.3 All welds in WP115 shall be made using deposited \nfiller metal suitable for the composition being welded. Any \ndefects shall be thoroughly chipped or ground out before \nwelding and each welded length shall be re-heat treated or \nstress relieved as required by the application specification. \nAlternately, the weld shall be made with the welding products \nand procedures of 7 .3 .1. \n7.4 Personnel performing NDE examinations shall be quali­\nfied in accordance with SNT-TC- lA. \n7 .5 The welded joints of the fittings shall be finished in \naccordance with the requirements of Paragraph UW-35 (a) of \nASME Section Vlll, Division 1. \n7.6 All butt-weld tees manufactured by cold-forming meth­\nod(s) shall be liquid penetrant or magnetic particle examined \nby one of the methods specified in Supplementary Requirement \nS52 or S53 in Specification A960/A960M. This examination \nshall be performed after final heat treat. Only the side wall area \nof the tees need be examined. This area is defined by a circle ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0381.json",
  "tabulaTablesCsv": "tables_tabula/page-0381.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0381.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5699,
  "bestTextAlphaRatio": 0.7419
}