{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 444,
  "globalPageIndex": 1242,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-703/SA-703M ASME BPVC.II.A-2025 \n10. Quality \n10.1 The surface of the casting shall be free of adhering \nsand, scale, cracks, and hot tears as determined by visual \nexamination. Other surface discontinuities shall meet the visual \nacceptance standards specified in the order. Practice A802/ \nA802M or other visual standards may be used to define \nacceptable surface discontinuities and finish. Unacceptable \nvisual surface discontinuities shall be removed and their \nremoval verified by visual examination of the resultant cavi­\nties. \n10.2 The castings shall not be peened, plugged, or impreg­\nnated to stop leaks or disguise rejectable indications. \n10.3 Internal chills and chaplets may be used in the manu­\nfacture of castings. However, the chills, chaplets, and affected \ncast material must be completely removed. \n11. Hydrostatic Tests \n11.1 Each casting shall be tested after machining to the \nhydrostatic shell test pressures prescribed in ANSI B16.5 for \nthe applicable steel rating for which the casting is designed. \nCasting shall show no leaks. Castings ordered for working \npressures other than those in the standard ANSI ratings, or \nthose listed for which test pressures are not specified by ANSI \nB16.5, shall be tested at a pressure agreed upon between \nmanufacturer and the purchaser. \n11.2 It is realized that the foundry may be unable to perform \nthe hydrostatic test prior to shipment, or that the purchaser may \nwish to defer testing until additional work or machining has \nbeen performed on the casting. Castings ordered in the rough \nstate for final machining by the purchaser may be tested \nhydrostatically prior to shipment by the manufacturer at \npressures to be agreed upon with the purchaser. However, the \nfoundry is responsible for the satisfactory performance of the \ncastings under the final test required in 11. 1. \n12. Workmanship, Finish, and Appearance \n12.1 All castings shall be made in a workmanlike manner \nand shall conform to the dimensions on drawings furnished by \nthe purchaser. When the pattern is supplied by the purchaser, \nthe dimensions of the casting shall be as predicated by the \npattern unless otherwise agreed upon. \n12.2 Machined welding ends shall be suitably protected \nagainst damage during shipping. \n13. Retests \n13.1 If a specimen is machined improperly or if flaws are \nrevealed by machining or during testing, the specimen may be \ndiscarded and another substituted from the same heat. \n13.2 If the results of the mechanical tests for any heat, lot, \nor casting do not conform to the requirements specified, \ncastings may be reheat treated and retested. When castings are \nreheat treated, they may not be re-austenitized more than three \ntimes without the approval of the purchaser. Testing after \nreheat treatment shall consist of the full number of specimens \ntaken from locations complying with the specification or order. \nNoTE 1-Test Methods and Definitions A370, paragraph 4.4 and Test \nMethods A1058, paragraph 3.5 address retesting because of mechanical \nreasons such as failure of the test equipment. Test Methods and Definitions \nA370, paragraph 14.4.2 addresses retesting for reasons such as fracture \noutside of the middle half of the gauge length or at a punch mark. \n14. Inspection \n14.1 The manufacturer shall afford the purchaser's inspector \nall reasonable facilities necessary to satisfy that the material is \nbeing produced and furnished in accordance with the appli­\ncable specification. Foundry inspection by the purchaser shall \nnot interfere unnecessarily with the manufacturer's operations. \nAll tests and inspections, with the exception of product \nanalysis (5.2), shall be made at the place of manufacture unless \notherwise agreed. \n15. Rejection and Rehearing \n15.1 Any rejection based on test reports shall be reported to \nthe manufacturer within 30 days from the receipt of the test \nreports by the purchaser. \n15.2 Material that shows unacceptable discontinuities as \ndetermined by the acceptance standards specified in the order \nsubsequent to its acceptance at the manufacturer's works will \nbe rejected, and the manufacturer shall be notified within \n30 days after discovery of the rejectable condition. \n15.3 Samples that represent rejected material shall be pre­\nserved for two weeks from the date of transmission of the test \nreport. In case of dissatisfaction with the results of the tests, the \nmanufacturer may make claim for a rehearing within that time. \n16. Certification \n16.1 The manufacturer's certification shall be furnished to \nthe purchaser stating that the material was manufactured, \nsampled, tested, and inspected in accordance with the material \nspecification (including year of issue) and was found to meet \nthe requirements. When the purchaser imposes the require­\nments of this specification, the manufacturer is responsible for \ncompliance with the specification requirements during the \nproduction and processing of the casting by themselves and \nany of their subcontractors. \n16.2 As applicable, the certification shall also include: \n16.2.1 Material specification and grade, \n16.2.2 Pattern number, \n16.2.3 Heat number or serial number traceable to a heat \nnumber, \n16.2.4 Chemical analysis of the heat, \n16.2.5 Mechanical property results required by the specifi­\ncation and supplementary requirements specified in the pur­\nchase order, \n16.2.6 Statement of satisfactory inspection, visual, and non-\ndestructive testing specified in the purchase order, \n16.2.7 Manufacturer's name, and \n16.2.8 Additional purchase order requirements. \n16.3 A signature is not required on the certification. \nHowever, the document shall clearly identify the organization \nsubmitting the certification. Notwithstanding the absence of a \nsignature, the organization submitting the certification is re­\nsponsible for its content. \n1156 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1242.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5843,
  "bestTextAlphaRatio": 0.7825
}