{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 601,
  "globalPageIndex": 1399,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-815/SA·815M \n12. Hydrostatic Tests \n12.1 Hydrostatic testing is not required by this specification. \n12.2 Each fitting of Class WP shall be capable of withstand­\ning without failure, leakage, or impairment of serviceability, a \ntest pressure equal to that prescribed for the specified matching \npipe or equivalent material. \n12.3 Each fitting of Class CR, except tees covered in 12.3 .1, \nshall be capable of withstanding without failure, leakage, or \nimpairment of serviceability, a test pressure based on the \nratings in MSS SP-43. \n12.3.1 Class CR tees fabricated using intersection welds \nshall be capable of passing a hydrostatic test based on 70 % of \nthe ratings in MSS SP-43. \n13. Rejection \n13.1 Unless otherwise specified, any rejection based on tests \nby the purchaser shall be reported to the manufacturer within \n30 working days from the receipt of samples or test reports by \nthe purchaser. \n13.2 Each fitting that develops surface discontinuities \ndeeper than 5 % of the specified nominal wall thickness in shop \nworking or application operations may be rejected and the \nmanufacturer so notified. \n14. Rehearing \n14.1 Test samples that represent fittings rejected by the \npurchaser shall be preserved for four weeks from the date of \nthe rejection report. In case of dissatisfaction with the test \nresults, the manufacturer may make claim for a rehearing \nwithin the period that the samples are preserved. \n15. Test Reports \n15.1 Test reports are required for all fittings covered by this \nspecification. Each test report shall include the following \ninformation: \n15.1.1 The year-date of the specification to which the fitting \nwas furnished, \n15.1.2 Heat number or serial number traceable to a heat \nnumber, \n15.1.3 Chemical analysis for all starting materials, \n15.1.4 Starting material; plate, bar, pipe (specify welded or \nseamless), forging, \n15.1.5 Mechanical test results (Section 8), \n15.1.6 Seamless or welded construction, \n15.l.7 For construction with filler metal added, weld metal \nspecification number, \n15.l.8 For welded fittings, construction method, weld pro-\ncess, and procedure specification number, \n15.1.9 Heat treatment type, \n15 .1.10 Results of all nondestructive examinations, \n15.1.11 Results of all tests required by Supplementary \nRequirements and the order, and \n15 .1.12 Statement that the fitting was manufactured, \nsampled, tested, and inspected in accordance with the specifi­\ncation and was found to meet the requirements. \n16. Product Marking \n16.1 All fittings shall have the prescribed information \nstamped or otherwise suitably marked on each fitting in \naccordance with Section 19 of Specification A960/ A960M. \n16.2 Marking paint or ink shall not contain harmful amounts \nof chlorides, metals, or metallic salt, such as zinc or copper, \nthat cause corrosive attack on heating. On wall thicknesses \nthinner than 0.083 in. [2.1 mm], no metal impression stamps \nshall be used. Vibrating pencil marking is acceptable. \n16.3 The prescribed information for butt-welding fittings \nshall be: the manufacturer's name or trademark (see Note 2), \nschedule number or nominal wall thickness designation, size, \ngrade, class, and the heat number or manufacturer's heat \nidentification. \n16.4 The prescribed information for threaded or socket­\nwelding fittings shall be: the manufacturer's nan1e or trademark \n(see Note 2), pressure class or schedule number, grade and \nclass, and heat number or manufacturer's heat identification. \nThe class S marking need not be added to the material grade for \nthreaded or socket-welded fittings. \nNoTE 2-For purposes of identification marking, the manufacturer is \nconsidered the organization that certifies that the piping component \ncomplies with this specification. \n16.5 Bar Coding-In addition to the requirements in \n16.1-16.4, bar coding is acceptable as a supplemental identifi­\ncation method. The purchaser may specify in the order a \nspecific bar coding system to be used. The bar coding system, \nif applied at the discretion of the supplier, should be consistent \nwith one of the published industry standards for bar coding. If \nused on small fittings, the bar code may be applied to the box \nor a substantially applied tag. \n17. Keywords \n17 .1 corrosive service applications; ferritic/austenitic stain­\nless steel; ferritic stainless steel; martensitic stainless steel; \npipe fittings-steel; piping applications; pressure containing \nparts; stainless steel fittings \n1337 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1399.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4487,
  "bestTextAlphaRatio": 0.7604,
  "noteOcrPath": "note_ocr/page-1399.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1399.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}