{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 656,
  "globalPageIndex": 656,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-370 ASME BPVC.11.A-2025 \nc::c::J \nL......__ 55 mm ___ _J ,---{2.1651n.)~l \nL \n. LI\n·. .2mm.{(l..07·9.·.1n,) x· O.ZSmm r7 l:__ 10 mm (0.010 In,) rad. \n_b:.::J .L(o.394111.) : \ni+,rnmm • ' (0.394 In.) 45\" \nNorn I-Permissible variations shall be as follows: \nNotch length to edge \nAdjacent sides shall be at \nCross-section dimensions \nLength of specimen (L) \nCentering of notch (U2) \nAngle of notch \nRadius of notch \nNotch depth \nFinish requirements \n90 ±2° \n90° ± 10 min \n±0.075 mm (±0.003 in.) \n+ o, - 2.5 mm ( + o, - 0.100 in.) \n±1 mm (±0.039 in.) \n±10 \n±0.025 mm (±0.001 in.) \n±0.025 mm (±0.001 in.) \n2 µm (63 µin.) on notched surface and \nopposite face; 4 µm (125 µin.) on other \ntwo surfaces \n(a) Standard Full Size Specimen \n\\7o~ mm t;f mm t;f5 mm \n'4197 ~ ~264 t ,;2ss in~ \n[J [J [] \nNorn 2-On subsize specimens, all dimensions and tolerances of the \nstandard specimen remain constant with the exception of the width, which \nvaties as shown above and for which the tolerance shall be ± 1 %. \n(b) Standard Subsize Specimens \nFIG. 11 Charpy (Simple Beam) Impact Test Specimens \n23.2.2.4 Tolerances for standard subsize specimens are \nshown in Fig. 11. Standard subsize test specimen sizes are: \n10 x 7.5 mm, 10 x 6.7 mm, 10 x 5 mm, 10 x 3.3 mm, and \n10 x2.5 mm. \n23.2.2.5 Notch the narrow face of the standard subsize \nspecimens so that the notch is perpendicular to the 10 mm wide \nface. \n23.3 Notch Preparation-The machining (for example, \nmilling, broaching, or grinding) of the notch is critical, as \nminor deviations in both notch radius and profile, or tool marks \nat the bottom of the notch may result in variations in test data, \nparticularly in materials with low-impact energy absorption. \n(see Annex AS). \n24. Calibration \n24.1 Accuracy and Sensitivity-Calibrate and adjust Charpy \nimpact machines in accordance with the requirements of Test \nMethods E23. \n25. Conditioning-Temperature Control \n25.1 When a specific test temperature is required by the \nspecification or purchaser, control the temperature of the \nheating or cooling medium within ±2 °F (1 °C). \nNorn 17-For some steels there may not be a need for this restticted \ntemperature, for example, austenitic steels. \nNorn 18-Because the temperature of a testing laboratory often varies \nfrom 60 to 90 °F (15 to 32 °C) a test conducted at \"room temperature\" \nmight be conducted at any temperature in this range . \n26. Procedure \n26.l Temperature: \n26.1.1 Condition the specimens to be broken by holding \nthem in the medium at test temperature for at least 5 min in \nliquid media and 30 min in gaseous media. \n26.1.2 Prior to each test, maintain the tongs for handling test \nspecimens at the same temperature as the specimen so as not to \naffect the temperature at the notch. \n26.2 Positioning and Breaking Specimens: \n26.2.1 Carefully center the test specimen in the anvil and \nrelease the pendulum to break the specimen. \n26.2.2 If the pendulum is not released within 5 s after \nremoving the specimen from the conditioning medium, do not \nbreak the specimen. Return the specimen to the conditioning \nmedium for the period required in 26.1.1. \n26.3 Recovering Specimens-In the event that fracture ap­\npearance or lateral expansion must be determined, recover the \nmatched pieces of each broken specimen before breaking the \nnext specimen. \n26.4 Individual Test Values: \n26.4.1 Impact Energy-Record the impact energy absorbed \nto the nearest ft· lbf (J). \n604 \n26.4.2 Fracture Appearance: \n26.4.2.1 Determine the percentage of shear fracture area by \nany of the following methods: \n(I) Measure the length and width of the brittle portion of \nthe fracture surface, as shown in Fig. 13 and determine the \npercent shear area from either Table 7 or Table 8 depending on \nthe units of measurement. \n(2) Compare the appearance of the fracture of the specimen \nwith a fracture appearance chart as shown in Fig. 14. \n(3) Magnify the fracture surface and compare it to a \nprecalibrated overlay chart or measure the percent shear \nfracture area by means of a planimeter. \n(4) Photograph the fractured surface at a suitable magnifi­\ncation and measure the percent shear fracture area by means of \na planimeter. \n26.4.2.2 Determine the individual fracture appearance val­\nues to the nearest 5 % shear fracture and record the value. \n26.4.3 Lateral Expansion: \n26.4.3.1 Lateral expansion is the increase in specimen \nwidth, measured in thousandths of an inch (mils), on the \ncompression side, opposite the notch of the fractured Charpy \nV-notch specimen as shown in Fig. 15. \n26.4.3.2 Examine each specimen half to ascertain that the \nprotrusions have not been damaged by contacting the anvil, \nmachine mounting smface, and so forth. Discard such samples \nsince they may cause erroneous readings. \n26.4.3.3 Check the sides of the specimens perpendicular to \nthe notch to ensure that no burrs were formed on the sides \nduring impact testing. If burrs exist, remove them carefully by \nrubbing on emery cloth or similar abrasive surface, making \nsure that the protrusions being measured are not rubbed during \nthe removal of the burr. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0656.json",
  "tabulaTablesCsv": "tables_tabula/page-0656.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0656.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5093,
  "bestTextAlphaRatio": 0.7017
}