{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 547,
  "globalPageIndex": 1345,
  "width": 617.04,
  "height": 795.6,
  "text": "r..------.., \nASME BPVC.II.A-2025 SA-788/SA-788M \nJfacto,= (Mn+Si) (P+Sn) X 104 \nHas been found to be effective in reducing temper embrittle­\nment effects. \nS24.2 The purchaser shall specify the required maximum \nvalue of Jfactor in both the inquiry and ordering documents. \nS24.3 The determination of the tin content of the steel is \nnecessary for the application of this supplementary require­\nment even if there is no chemical analysis requirement for tin \nin the product specification. \nNote-In Dr. Paul Bates's paper,1 it was noted that the \nFracture Appearance Transition Temperature (PATT) fell \nsteadily from Jfactor 120 to 60, but below 20, the drop in PATT \nwas much less apparent. \nS25. Positive Material Identification \nS25.1 Forgings shall receive positive material identification \nto ensure that forgings are of the ordered material grade prior \nto shipment. \nS25.2 Forgings shall receive a positive material identifica­\ntion in accordance with Guide B1916. \nS25.3 The entire ordered quantity of forgings shall be \nexamined. \nS25.4 Forgings not conforming to the ordered grade shall be \nrejected. \n1 Bates, P., \"The Production of Safety Critical Forgings for Pressure Vessel \nApplications,\" International Forgemasters Conference, Wiesbaden, Germany, Sep­\ntember 2000. \nS25.5 Following this material identification examination, \nacceptable forgings shall be marked as agreed between the \npurchaser and producer. \nS26. Pressure Equipment Directive-Mechanical Testing \nS26.1 Charpy impact testing shall be done at the lowest \nscheduled operating temperature, but not higher than 68°F \n[20oC]. \nS26.2 The frequency of Charpy impact testing shall be the \nsame as that specified in the product specification for the \ntension test, with one Charpy test (3 specimens) for each \nrequired tension test. \nS26.3 The minimum individual absorbed energy for the \nCharpy impact test shall be 20 ft·lbf [27 J]. \nS26.4 The minimum elongation in the tension test shall be \nmeasured on a gauge length of five times the diameter of the \ntest specimen (5D), and shall be not less than 14 %. • \nS26.5 The results of the impact and tension tests shall be \nincluded in the product certification. \nS27. Heat Analysis for Remelted Ingots \nS27.1 Instead of the heat analysis provisions in 8.1.6.2 of \nSpecification A788/A788M for consumable electrode remelt­\ning processes, a heat analysis shall be obtained from each \nremelted ingot (or the product from it) from single master or \nparent heat. \nS27.2 The product analysis provisions of Specification \nA788/A788M shall not apply. \nANNEXES \n(Mandatory Information) \nAl. RECIRCULATION FACTOR \nAl. 1 The recirculation factor for the vacuum lift process is \nobtained as follows: \nTons {kg) of Steel Lifted per Cycle X Number of Cycles \nHeat Weight in Tons [kg] \nA2. EXPLANATORY NOTE FOR WEIGHTED AVERAGE ANALYSIS \nA2.l A weighted average analysis is mandatory whenever \nan ingot is poured from the combination of two or more heats \nwherein the resultant chemistry of the ingot assumes an \nidentity attributable to each heat involved in the combination. \nIt is necessary to make this determination to ensure that each \nelement in the official chemistry is represented by proportion to \nits amount in each individual furnace heat. An example of the \ndetermination of a weighted average analysis for an ingot made \nfrom a three-heat combination pour with varying weights and \nchemistry involved in each heat is shown below: \n1283 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-1345.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3459,
  "bestTextAlphaRatio": 0.7612
}