{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 537,
  "globalPageIndex": 537,
  "width": 599.4,
  "height": 844.08,
  "text": ",✓~--\nASME BPVC.II.A-2025 SA-333/SA-333M \nTABLE 1 Chemical Requirements 8 \nElement \nGrade 1 Grade 3 Grade 4· Grade 6 \nCarbon, max 0.30 0.19 0.12 0.30 \nManganese 0.4Q-1.06A 0.31-0.64 0.50-1.05 0.29-1.06A \nPhosphorus, 0.025 0.025 0.025 0.025 \nmax \nSulfur, max 0.025 0.025 0.025 0.025 \nSilicon 0.18-0.37 0.08-0.37 0.10 min \nNickel 3.18-3.82 0.47-0.98 0.40 max \nChromium 0.44-1.01 0.30 max \nCopper 0.40-0.75 0.40 max \nAluminum 0.04-0.30 \nVanadium, max ... 0.08 \nColumbium, 0.02° \nmax \nMolybdenum, ... 0.12 \nmax \nCobalt \nComposition, % \nGrade 7 Grade 8 Grade 9 \n0.19 0.13 0.20 \n0.90 max 0.90 max 0.40-1.06 \n0.025 0.025 0.025 \n0.025 0.025 0.025 \n0.13-0.32 0.13-0.32 \n2.03-2.57 8.40-9.60 1.60-2.24 \n0.75-1.25 \nGrade 10 \n0.20 \n1.15-1.50 \n0.035 \n0.015 \n0.10-0.35 \n0.25 max \n0.15 max \n0.15 max \n0.06 max \n0.12 \n0.05 \n0.05 \nGrade 11 \n0.10 \n0.60 max \n0.025 \n0.025 \n0.35 max \n35.0-37.0 \n0.50 max \n0.50 max \n0.50 max \nA For each reduction of 0.01 % carbon below 0.30 %, an increase of 0.05 % manganese above 1.06 % would be permitted to a maximum of 1.35 % manganese. \n8 Where an ellipsis ( ... ) appears in this table, there is no requirement and analysis for the element need not to be determined or reported. \nc By agreement between the manufacturer and the purchaser, the limit for columbium may be increased up to 0.05 % on heat analysis and 0.06 % on product analysis. \naddition of no filler metal in the welding operation. Grade 4 \nshall be made by the seamless process. \nNorn 2-For electric-fusion-welded pipe, with filler metal added, \nfabricated of pressure vessel quality plates, see Specification A671. \n4.2 Grade 11 pipe may be produced by welding with or \nwithout the addition of filler metal. The following requirements \nshall apply for Grade 11 welded with the addition of filler \nmetal. \n4.2. l The joints shall be full-penetration, full fusion double­\nwelded or single-welded butt joints employing fusion welding \nprocesses as defined in \"Definitions,\" ASME Boiler and \nPressure Vessel Code, Section IX. This specification makes no \nprovision for any difference in weld quality requirements \nregardless of the weld joint type employed (single or double) in \nmaking the weld. Where backing strips are employed, the ring \nor strip material shall be the same as the plate being joined. \nBacking rings or strips shall be completely removed after \nwelding, prior to any required radiography, and the exposed \nweld surface shall be examined visually for conformance to the \nrequirements of 4.2.2. Welds made by procedures employing \nbacking strips or rings which remain in place are prohibited. \nWelding procedures and welding operators shall be qualified in \naccordance with ASME Boiler and Pressure Vessel Code, \nSection IX. \n4.2.2 The weld surface on either side of the weld may be \nflush with the base plate or may have a reasonably uniform \ncrown, not to exceed 1/s in. [3 mm]. Any weld reinforcement \nmay be removed at the manufacturer's option or by agreement \nbetween the manufacturer and purchaser. The contour of the \nreinforcement shall be reasonably smooth and free from \nin-egularities. The deposited metal shall be fused uniformly \ninto the plate surface. No concavity of contour is permitted \nunless the resulting thickness of weld metal is equal to or \ngreater than the minimum thickness of the adjacent base metal. \n4.2.3 Radiographic Examination-All welded joints shall \nbe fully radiographed in accordance with the requirements of \nthe ASME Boiler and Pressure Vessel Code, Section VIII, \nDivision 1, latest edition, paragraph UW-51. \n4.2.3.1 As an alternative, the welded joints may be ultra­\nsonically examined in accordance with Appendix 12 of the \nASME Boiler and Pressure Vessel Code, Section VIII, Division \nl. \n4.2.4 Repair Welding-Weld metal defects shall be repaired \nby removal to sound metal and repair welding if approved by \nthe purchaser. \n4.2.4. l The repair shall be blended smoothly into the \nsurrounding base metal surface and examined by the magnetic \nparticle examination in accordance with Practice E709, or by \nthe liquid penetrant method in accordance with Practice E165. \n4.2.4.2 Each repair weld of a cavity where the cavity, before \nrepair welding, has a depth exceeding the lesser of 1/s in. [9.5 \nmm] or 10.5 % of the nominal thickness shall be radiographi­\ncally examined as required for the original welds. \n4.2.5 Transverse Tension Test-One test shall be made to \nrepresent each lot (Note 3) of finished pipe. The test specimens \nshall be taken across the welded joint. The tension test results \nof the welded joints shall conform to the tensile properties for \nGrade 11 in Table 2. \n485 \n4.2.5 .1 The test specimens shall be taken from the end of the \nfinished pipe. As an alternative, the tension test specimens may \nbe taken from a welded prolongation of the same material as \nthe pipe, which is attached to the end of the pipe and welded as \na ·prolongation of the pipe longitudinal seam. \n4.2.5.2 The test specimens shall be in accordance with \nSection IX, Part QW, paragraph QW-150 of the ASME Boiler \nand Pressure Vessel Code and shall be one of the types shown \nin QW-462.l of that code. The tension test specimen may be \nflattened cold before final machining to size. \n4.2.6 Transverse Guided-Bend Weld Test-One transverse \nguided bend test (two specimens) shall be made to represent \neach lot (Note 3) of finished pipe. \n4.2.6.1 The two bend test specimens shall be taken from the \nweld at the end of the finished pipe. As an alternative, by \nagreement between the purchaser and the manufacturer, the test \nspecimens may be taken from a test plate of the san1e material ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0537.json",
  "tabulaTablesCsv": "tables_tabula/page-0537.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0537.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5628,
  "bestTextAlphaRatio": 0.6894,
  "noteOcrPath": "note_ocr/page-0537.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0537.txt",
  "noteOcrHighDpiCount": 1,
  "noteOcrHighDpiNotes": [
    "Note 2—For electric-fusion-welded pipe, with filler metal added,"
  ]
}