{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 677,
  "globalPageIndex": 677,
  "width": 596.16,
  "height": 841.8,
  "text": "ASME BPVC.II.A-2025 SA-370 \nexamining specimen fractures and by plotting energy value and \nfracture appearance versus temperature from tests of notched \nbars at a series of temperatures. When the test temperature has \nbeen carried low enough to start cleavage fracture, there may \nbe an extremely sharp drop in impact value or there may be a \nrelatively gradual falling off toward the lower temperatures. \nThis drop in energy value starts when a specimen begins to \nexhibit some crystalline appearance in the fracture. The tran­\nsition temperature at which this embrittling effect takes place \nvaiies considerably with the size of the part or test specimen \nand with the notch geometry. \nAS.4.2 A problem peculiar to Charpy-type tests occurs \nwhen high-strength, low-energy specimens are tested at low \ntemperatures. These specimens may not leave the machine in \nthe direction of the pendulum swing but rather in a sidewise \ndirection. To ensure that the broken halves of the specimens do \nnot rebound off some component of the machine and contact \nthe pendulum before it completes its swing, modifications may \nbe necessary in older model machines. These modifications \ndiffer with machine design. Nevertheless the basic problem is \nthe same in that provisions must be made to prevent rebound­\ning of the fractured specimens into any part of the swinging \npendulum. Where design permits, the broken specimens may \nbe deflected out of the sides of the machine and yet in other \ndesigns it may be necessary to contain the broken specimens \nwithin a certain area until the pendulum passes through the \nanvils. Some low-energy high-strength steel specimens leave \nimpact machines at speeds in excess of 50 ft (15.3 m)/s \nalthough they were struck by a pendulum traveling at speeds \napproximately 17 ft (5.2 m)/s. If the force exerted on the \npendulum by the broken specimens is sufficient, the pendulum \nwill slow down and erroneously high energy values will be \nrecorded. This problem accounts for many of the inconsisten­\ncies in Charpy results reported by various investigators within \nthe 10 to 25-ft-lbf (14 to 34 J) range. The Apparatus section \n(subsection regarding specimen clearance) of Test Methods \nE23 discusses the two basic machine designs and a modifica­\ntion found to be satisfactory in minimizing jamming. \nAS.5 Velocity of Straining \nA5.5.1 Velocity of straining is likewise a variable that \naffects the notch behavior of steel. The impact test shows \nsomewhat higher energy absorption values than the static tests \nabove the transition temperature and yet, in some instances, the \nreverse is true below the transition temperature. \nAS.6 Correlation With Service \nA5.6.1 While Charpy or Izod tests may not directly predict \nthe ductile or brittle behavior of steel as commonly used in \nlarge masses or as components of large structures, these tests \ncan be used as acceptance tests of identity for different lots of \nthe same steel or in choosing between different steels, when \ncmrelation with reliable service behavior has been established. \nIt may be necessary to make the tests at properly chosen \ntemperatures other than room temperature. In this, the service \ntemperature or the transition temperature of full-scale speci­\nmens does not give the desired transition temperatures for \nCharpy or Izod tests since the size and notch geometry may be \nso different. Chemical analysis, tension, and hardness tests may \nnot indicate the influence of some of the important processing \nfactors that affect susceptibility to brittle fracture nor do they \ncomprehend the effect of low temperatures in inducing brittle \nbehavior. \nA6. PROCEDURE FOR CONVERTING PERCENTAGE ELONGATION OF STANDARD ROUND TENSION TEST SPECIMEN \nTO EQUIVALENT PERCENTAGE ELONGATION OF STANDARD FLAT SPECIMEN \nA6.1 Scope \nA6. l .1 This method specifies a procedure for converting \npercentage elongation after fracture obtained in a standard \n0.500-in. (12.7 mm) diameter by 2-in. (51 mm) gauge length \ntest specimen to standard flat test specimens ½ by 2 in. and 1 ½ \nby 8 in. (38.1 by 203 mm). \nA6.2 Basic Equation \nA6.2.1 The conversion data in this method are based on an \nequation by Bertella, and used by Oliver and others. The \nrelationship between elongations in the standard 0.500-in. \ndiameter by 2.0-in. test specimen and other standard specimens \ncan be calculated as follows: \ne = e 0 [ 4.47 ( \\IA)!L] 0 (A6.1) \nwhere: \n627 \ne = 0 percentage elongation after fracture on a standard test \nspecimen having a 2-in. gauge length and 0.500-in. \ndiameter, \ne \na \n= percentage elongation after fracture on a standard test \nspecimen having a gauge length L and a cross-sectional \narea A, and \n= constant characteristic of the test material. \nA6.3 Application \nA6.3.1 In applying the above equation the constant a is \ncharacteristic of the test material. The value a = 0.4 has been \nfound to give satisfactory conversions for carbon, carbon­\nmanganese, molybdenum, and chromium-molybdenum steels \nwithin the tensile strength range of 40 000 to 85 000 psi (275 \nto 585 MPa) and in the hot-rolled, in the hot-rolled and ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0677.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5106,
  "bestTextAlphaRatio": 0.7752
}