{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 497,
  "globalPageIndex": 1295,
  "width": 613.92,
  "height": 793.2,
  "text": "\\~ \nASME BPVC.II.A-2025 SA-749/SA-749M \nE 290 Test Method for Semi-Guided Bend Test for Ductil­\nity of Metallic Materials \n2.2 Military Standards: \nMIL-STD-129 Marking for Shipment and Storage \nMIL-STD-163 Steel Mill Products, Preparation for Ship­\nment and Storage \n2.3 Federal Standards: \nFed. Std. No. 123 Marking for Shipments (Civil Agencies) \nFed. Std. No. 183 Continuous Identification Marking of \nIron and Steel Products \n3. Terminology \n3.1 Definitions of Terms Specific to This Standard: \nDescriptions of Terms Specific to This Standard: \n3.1.1 Steel Types: \n3.1.2 carbon steel - the designation for steel when \nno minimum content is specified or required for aluminum, \nchromium, cobalt, columbium, molybdenum, nickel, tita­\nnium, tungsten, vanadium, zirconium, or any element \nadded to obtain a desired alloying effect; when the specified \nminimum for copper does not exceed 0.40%; or when \nthe maximum content specified for any of the following \nelements does not exceed the percentages noted; manga­\nnese 1.65, silicon 0.60, or copper 0.60. \nDiscussion - In all carbon steels small quantities of \ncertain residual elements unavoidably retained from raw \nmaterials are sometimes found which are not specified or \nrequired, such as copper, nickel, molybdenum, chromium, \netc. These elements are considered as incidental and are \nnot normally determined or reported. \n3.1.3 high-strength, low-alloy steel - a specific \ngroup of steels in which higher strength, and in some cases \nadditional resistance to atmospheric corrosion, are obtained \nby moderate amounts of one or more al\\oying elements. \n3.1.4 Product Types: \n3.1.5 hot-rolled strip - manufactured by hot rolling \nbillets or slabs to the required thickness. It may be produced \nsingle width or by rolling multiple width and slitting to \nthe desired width. It can be supplied in coils or cut lengths \nas specified. \nWidth, in. Thickness, in. \nOver Through Over Through \n3½ 0.044 0.203 \n3½ 6 0.044 0.203 \n6 12 0.044 0.230 excl \nWidth, mm Thickness, mm \nOver Through Over Through \n100 1.2 5.0 \n100 200 1.2 5.0 \n200 300 1.2 6.0, excl \nHot-rolled, high-strength, low-alloy strip is commonly \navailable by size as follows: \nWidth, in. Thickness, in. \nOver Through From Through \n6 \n6 \n12 \n0.054 \n0.054 \nCoils & Cut \nLengths \n0.203 \n0.230 \nCoils \nOnly \n0.230 excl \n0.230 excl \nWidth, mm Thickness, mm \nOver \n200 \n4. \nThrough \n200 \n300 \nOver \n1.8 \n1.8 \nMaterials and Manufacture \nThrough \n5.0 \n6.0, excl \n4.1 Unless otherwise specified, hot-rolled material shall \nbe furnished hot-rolled, not annealed or pickled. \n5. C11emical Composition \n5.1 Limits: \n5.1.1 The chemical composition shall be in accor­\ndance with the applicable product specification. However, \nif other compositions are required for carbon steel, they \nshall be prepared in accordance with Appendix Xl. \n5.1.2 Where the material is used for fabrication by \nwelding, care must be exercised in the selection of chemical \ncomposition or mechanical properties to ensure compatibil­\nity with the welding process and its effect on altering the \nproperties. \n5.2 Cast or Heat (Formerly Ladle) Analysis: \n5.2.1 An analysis of each cast or heat of steel shall \nbe made by the manufacturer to determine the percentage \nof elements specified or restricted by the applicable speci­\nfication. \n5.2.2 When requested, cast or heat analysis for ele­\nments listed or required shall be reported to the purchaser \nor to his representative. \n5.3 Product, Check, or Verification Analysis: \n5.3.1 Nonkilled steels (such as capped or rimmed) \nare not technologically suited to product analysis due to \nthe nonuniform character of their chemical composition \nand therefore, the tolerances in Table 1 do not apply. Prod­\nuct analysis is appropriate on these types of steel only \nwhen misapplication is apparent or for copper when copper \nsteel is specified. \n5.3.2 For steels other than nonkilled (capped or \nrimmed), product analysis may be made by the purchaser. \nThe chemical analysis shall not vary from the limits speci­\nfied by more than the amounts in Table 1. The several \n1223 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1295.json",
  "tabulaTablesCsv": "tables_tabula/page-1295.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1295.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4091,
  "bestTextAlphaRatio": 0.7265
}