{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 507,
  "globalPageIndex": 1305,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-751 \nOther Similar Medium- and High-Alloy Steels \nE353 Test Methods for Chemical Analysis of Stainless, \nHeat-Resisting, Maraging, and Other Similar Chromium­\nNickel-Iron Alloys \nE354 Test Methods for Chemical Analysis of High­\nTemperature, Electrical, Magnetic, and Other Similar Iron, \nNickel, and Cobalt Alloys \nE415 Test Method for Analysis of Carbon and Low-Alloy \nSteel by Spark Atomic Emission Spectrometry \nE548 Guide for General Criteria Used for Evaluating Labo­\nratory Competence (Withdrawn 2002) \nE572 Test Method for Analysis of Stainless and Alloy Steels \nby Wavelength Dispersive X-Ray Fluorescence Spectrom­\netry \nE743 Guide for Spectrochemical Laboratory Quality Assur­\nance (Withdrawn 1998) \nE851 Practice for Evaluation of Spectrochemical Laborato­\nries (Withdrawn 1998) \nE882 Guide for Accountability and Quality Control in the \nChemical Analysis Laboratory \nE1019 Test Methods for Determination of Carbon, Sulfur, \nNitrogen, and Oxygen in Steel, Iron, Nickel, and Cobalt \nAlloys by Various Combustion and Inert Gas Fusion \nTechniques \nE1085 Test Method for Analysis of Low-Alloy Steels by \nWavelength Dispersive X-Ray Fluorescence Spectrometry \nEl086 Test Method for Analysis of Austenitic Stainless Steel \nby Spark Atomic Emission Spectrometry \nE1097 Guide for Determination of Various Elements by \nDirect Current Plasma Atomic Emission Spectrometry \nE1184 Practice for Determination of Elements by Graphite \nFurnace Atomic Absorption Spectrometry \nE1282 Guide for Specifying the Chemical Compositions and \nSelecting Sampling Practices and Quantitative Analysis \nMethods for Metals, Ores, and Related Materials \nE1329 Practice for Verification and Use of Control Charts in \nSpectrochemical Analysis (Withdrawn 2019) \nE1476 Guide for Metals Identification, Grade Verification, \nand Sorting \nEl806 Practice for Sampling Steel and Iron for Determina­\ntion of Chemical Composition \n2.2 ISO Standards: \nISO/IEC 17025 General Requirements for the Competence \nof Testing and Calibration Laboratories \n3. Terminology \n3.l Definitions: \n3 .1.1 For definitions of terms used in these test methods and \npractices, see Terminology A941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.1 product, check, or verification analysis, n-a chemical \nanalysis of the semifinished or finished product, usually for the \npurpose of determining conformance to the specification re­\nquirements. \n3.2.1.1 Discussion-The range of the specified composition \napplicable to product analysis is normally greater than that \napplicable to heat analysis in order to take into account \ndeviations associated with analytical reproducibility (Note 1) \nand the heterogeneity of the steel. \nNoTE 1-All of the chemical analysis procedures referenced in these \ntest methods include precision statements with reproducibility data, with \nthe exception of Test Methods E50. \n3.2.2 product analysis tolerances, n-a permissible varia­\ntion over the maximum limit or under the minimum limit of a \nspecified element and applicable only to product analyses, not \ncast or heat analyses (Note 2). \nNoTE 2-The term \"analysis tolerance\" is often misunderstood. It does \nnot apply to cast or heat analyses determined to show conformance to \nspecified chemical limits. It applies only to product analysis and becomes \nmeaningful only when the heat analysis of an element falls close to one of \nthe specified limits. For example, stainless steel UNS 30400 limits for \nchromium are 18.00 to 20.00 %. A heat that the producer reported as \n18.01 % chromium may be found to show 17.80 % chromium by a user \nperforming a product analysis. If the product analysis tolerance for such a \nchromium level is 0.20 %, the product analysis of 17.80 % chromium \nwould be acceptable. A product analysis of 17.79 % would not be \nacceptable. \n3.2.3 proprietary analytical method, n-a non-standard ana­\nlytical method, not published by ASTM, utilizing reference \nstandards traceable to the National Institute of Standards and \nTechnology (NIST), when available, or other sources refer­\nenced in Section 10. \n3.2.4 referee analysis, n-performed using ASTM test \nmethods listed in 9.1.1, NIST reference standards or methods, \nand reference standards agreed upon between parties. \n3.2.4.1 Discussion-The selection of a laboratory to per­\nform the referee analysis shall be a matter of agreement \nbetween the supplier and the purchaser. \n3.2.5 certified reference material, n-a specimen of material \nspecially prepared, analyzed, and certified for chemical content \nunder the jurisdiction of a recognized standardizing agency or \ngroup, such as the NIST, for use by analytical laboratories as an \naccurate basis for comparison. \n3.2.5.1 Discussion-Reference samples should bear suffi­\ncient resemblance to the material to be analyzed so that no \nsignificant differences are required in procedures or corrections \n(for example, for interferences or inter-element effects). \n3.2.6 working reference materials, n-reference materials \nused for routine analytical control and traceable to NIST \nstandards and other recognized standards when appropriate \nstandards are available. \n1235 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1305.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5157,
  "bestTextAlphaRatio": 0.7758,
  "noteOcrPath": "note_ocr/page-1305.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-1305.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": [],
  "gapOcrHighDpiPath": "gap_ocr_highdpi/page-1305.txt",
  "gapOcrHighDpiLength": 5073
}