{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 773,
  "globalPageIndex": 773,
  "width": 604.32,
  "height": 847.68,
  "text": "ASME BPVC.II.A-2025 SA-439 /SA-439M \ncycle, castings may be cooled in still air after the temperature \nhas dropped to 600 °F [310 °C]. \n4.4 By agreement between the manufacturer and the \npurchaser, the castings may be in-mold stress relieved by \nallowing castings to cool slowly in the mold at a rate not \nexceeding 400 °FAi [220 °CAi]. Once the temperature has \ndropped below 600 °F [310 °C], castings can be removed from \nthe mold and cooled in still air. \n4.5 Whenever dimensional changes in high-temperature \nservice are a problem, by agreement between the manufacturer \nand the purchaser, the castings may be stabilized by heating at \n1600 °F [870 °C] for a period of 1 h per inch [25 mm] of \nsection, with a minimum period of 1 h, followed by uniform \ncooling, preferably in still air. Otherwise, the austenite, which \nis super saturated with respect to carbon, can reject carbon \nduring service and produce dimensional changes. \n4.6 By agreement between the manufacturer and the \npurchaser, castings with chilled edges or excessive carbides \nmay be annealed at 1750 to 1900 °F [960 to 1040 °C] for 0.5 h \nto 5 h followed by uniform cooling, preferably in still air. \n4. 7 Repair by welding, plugging, or other methods is not \npermitted. \n5. Magnetic Properties \n5.1 In the event that nonmagnetic castings are specified, the \nmagnetic permeability test shall be used. The maximum \nmagnetic permeability value shall be agreed upon between the \nmanufacturer and the purchaser. \nNorn 1-A convenient shop test for differentiating the various types of \naustenitic ductile iron is based on the fact that a ground face of either the \ntest bar or the castings of Types D-2 and D-2C does not attract a small \nsteel horseshoe-type magnet which is normally attracted to steel (Alnico \nmagnet should not be used). Types D-3, D-3A, D-5, and D-5B are \nattracted, and types D-2B, D-2S, D-4, and D-5S are slightly attracted. This \nnonmagnetic test is a convenient qualitative test only for Types D-2 and \nD-2C, and shall not be used as a basis for acceptance. \n6. Chemical Requirements \n6.1 Many combinations of alloys can be used to obtain an \naustenitic ductile iron. This specification includes ten general \ntypes defined by the composition limits in Table 1. \n6.2 Samples taken from test coupons, broken test \nspecimens, or castings shall conform to the requirements as to \nchemical composition prescribed in Table 1. Sampling shall be \nconducted in accordance with Practice E59 and chemical \nanalyses in accordance with Test Methods E351 and E30. Test \nMethods E30 should only be used for analyzing those elements \nfor which specific coverage is not provided for in Test Methods \nE351. \n6.3 Spectrometric techniques may also be used for analysis, \nbut should a dispute arise concerning chemical composition, \nTest Methods E351 and E30 shall be used for referee methods. \n6.4 The chemical analysis for total carbon shall be made on \neither chilled cast pencil-type specimens or thin wafers ap­\nproximately v.~2 in. [1.0 mm] thick cut from test coupons. \nDrillings shall not be used because of attendant loss of \ngraphite. \n7. Mechanical Requirements \n7 .1 Test specimens of austenitic ductile iron made according \nto this specification shall meet the test requirements prescribed \nin Table 2. \n7 .2 The yield strength shall be determined in accordance \nwith Test Methods E8/E8M, using one of the following \nprocedures: the 0.2 % offset method or the extension-under­\nload method may be used, by agreement between the purchaser \nand the manufacturer. \n7.3 Brinell hardness shall be determined as HBW 10/3000 \nin accordance with Test Method ElO. \n8. Workmanship, Fiuish, and Appearance \n8.1 The castings shall conform substantially to the dimen­\nsions on the drawings furnished by the purchaser, or if no \ndrawing has been provided, to the dimensions predicated by \nthe pattern supplied by the purchaser. The castings shall be free \nof injurious defects. Surfaces of the castings shall be free of \nburnt-on sand and shall be reasonably smooth. Runners, risers, \nfins, and other cast-on pieces shall be removed. In other \nrespects, the castings shall conform to whatever points are \nspecifically agreed upon between the manufacturer and the \npurchaser. \n9. Test Bars \n9.1 The standard test bars shall be the 1-in. [25-mm] \"Y\" \nblock and 1-in. [25-mm] keel block as shown in Figs. 1 and 2, \nTABLE 1 Chemical Requirements \nType \nElement D-2A D-2B D-2C D-2S D-3A D-3A \nComposition, % \nTotal carbon, \nmax 3.00 3.00 2.90 2.6 2.60 2.60 \nSilicon 1.50-S.00 1.5Cl--3.00 1.00-3.00 4.80-5.80 1.00--2.80 1.00--2.80 \nManganese 0.70--1.25 0.70-1.25 1.80--2.40 1.00 max 1.00 max 8 1.00 max 8 \nPhosphorus, \nmax 0.08 0.08 0.08 0.08 0.08 0.08 \nNickel 18.00--22.00 18.00--22.00 21.00--24.00 24.00-28.00 28.00-32.00 28.00-32.00 \nChromium 1.75-2.75 2.75-4.00 0.50 max 8 1.75-2.25 2.5Cl--3.50 1.00-1.50 \nA Additions of 0.7 to 1.0 % of molybdenum can increase the mechanical properties above 800 °F [425 °C]. \n8 Not intentionally added. \n723 \nD-4 D-5 D-5B D-5S \n2.60 2.40 2.40 2.30 \n5.00--6.00 1.00-2.80 1.00-2.80 4.90--5.50 \n1.00 max 8 1.00 max 8 1.00 max 8 1.00 max \n0.08 0.08 0.08 0.08 \n28.0Q-32.00 34.00--36.00 34.00--36.00 34.00--37.00 \n4.50-5.50 0.10 max 2.00--3.00 1.75-2.25 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0773.json",
  "tabulaTablesCsv": "tables_tabula/page-0773.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0773.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5250,
  "bestTextAlphaRatio": 0.6722
}