{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 593,
  "globalPageIndex": 593,
  "width": 619.08,
  "height": 858.72,
  "text": "ASME BPVC.ILA-2025 SA-351/SA-351M \n3. General Conditions for Delivery TABLE 1 Heat-Treatment Requirements \n3.1 Other Than Investment Castings-Material furnished to \nthis specification shall conform to the requirements of Speci­\nfication A703/A703M, including any supplementary require­\nments that are indicated in the purchase order. Failure to \ncomply with the general requirements of Specification A 703/ \nA 703M constitutes nonconformance with this specification. In \ncase of conflict between the requirements of this specification \nand Specification A703/A703M, this specification shall pre­\nvail. \n3.2 Investment Castings-Material furnished to this specifi­\ncation shall conform to the requirements of Specification \nA985/ A985M, including any supplementary requirements that \nare indicated in the purchase order. Failure to comply with the \ngeneral requirements of Specification A985/A985M consti­\ntutes nonconformance with this specification. In case of con­\nflict between the requirements of this specification and Speci­\nfication A985/A985M, Specification A985/A985M shall \nprevail. \n3.3 The post-weld heat treatment requirements of Supple­\nmentary Requirement S50 may be specified when austenitic \ncastings other than HK, HT, or CT15C are to be subjected to \nsevere corrosive service. \n4. Ordering Information \n4.1 The inquiry and order should include or indicate the \nfollowing: \n4. 1. 1 A description of the casting by pattern number or \ndrawing (dimensional tolerances shall be included on the \ncasting drawing), \n4.1.2 Grade of steel, \n4.1.3 Options in the specification, and \n4.1.4 Supplementary requirements desired, including the \nstandards of acceptance. \n5. Process \n5 .1 The steel shall be made by the electric furnace process \nwith or without separate refining such as argon-oxygen decar­\nburization (AOD). \n6. Heat Treatment \n6.1 All castings shall receive a heat treatment at the tem­\nperature specified in Table 1, followed by a quench in water or \nrapid cool by other means except as noted. \nNoTE 2-Proper heat treatment of these alloys is usually necessary to \nenhance corrosion resistance and, in some cases, to meet mechanical \nproperties. Minimum heat-treat temperatures are specified; however, it is \nsometimes necessary to heat treat at higher temperatures, hold for some \nminimum time at temperature, and then rapidly cool the castings in order \nto enhance the corrosion resistance and meet mechanical properties. \n7. Chemical Composition \n7 .1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 2. \n8. Tensile Properties \n8.1 Steel used for the castings shall conform to the require­\nments as to tensile properties prescribed in Table 3. \nGrade \nHK30, HK40, HT30, CT15C, HG10MnN \nCF3,CF3A, CF8,CF8A,CF3M, \nCF3MA, CFBM, CF3MN, CG3M, CF10, \nCF10M, CGBM \nCF10SMnN, CFBC, CF10MC \nCN7M, CG6MMnN \nCHS, CH10, CH20, CK20 \nCK3MCuN, CN3MN 8 \nCE20NA \nTemperature, min \n'F \nas-cast \n1900 \n1950 \n2050 \n2100 \n2200 \n2225 \n'C \nas-cast \n1040 \n1065 \n1120 \n1150 \n1200 \n1220 \nA Grade shall be quenched in water or the castings may be furnace cooled to \n2050 'F [1120 'CJ minimum, held for 15 min minimum, and then quenched in water \nor rapidly cooled by other means. \n8 Castings of these grades shall be held at the specified temperature for a \nminimum of 4 h. \n9. Quality \n9.1 The surface of the casting shall be examined visually \nand shall be free of adhering sand, scale, cracks, and hot tears. \nOther surface discontinuities shall meet the visual acceptance \nstandards specified in the order. Visual Method SP-55 or other \nvisual standards may be used to define acceptable surface \ndiscontinuities and finish. Unacceptable visual surface discon­\ntinuities shall be removed and their removal verified by visual \nexamination of the resultant cavities. \n9.2 When additional inspection is desired, Supplementary \nRequirements S5, S6, and SlO may be ordered. \n9.3 The castings shall not be peened, plugged, or impreg­\nnated to stop leaks. \n10. Repair by Welding \nI 0.1 Repairs shall be made using procedures and welders \nqualified under Practice A488/ A488M. \n10.2 Weld repairs shall be inspected to the same quality \nstandards that are used to inspect the castings. When castings \nare produced with Supplementary Requirement S5 specified, \nweld repairs on castings that have leaked on hydrostatic test, or \non castings in which the depth of any cavity prepared for repair \nwelding exceeds 20 % of the wall thickness or 1 in. [25 mm], \nwhichever is smaller, or on castings in which any cavity \nprepared for welding is greater than approximately 10 in.2 \n[65 cm 2 ], shall be radiographed to the same standards that are \nused to inspect the castings. When castings are produced with \nSupplementary Requirement S6 specified, weld repairs shall be \ninspected by liquid penetrant examination to the same stan­\ndards that are used to inspect the castings. \n10.3 For Grade HGlOMnN, the filler metal to be used shall \nbe established by mutual agreement between the manufacturer \nand the purchaser. \nNoTE 3-When austenitic steel castings are to be used in services where \nthey will be subject to stress corrosion, the purchaser should so indicate in \nhis order and such castings should be solution heat treated following all \nweld repairs. \n11. Keywords \n11.1 austenitic stainless steel; pressure containing parts; \nstainless steel; steel castings \n541 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0593.json",
  "tabulaTablesCsv": "tables_tabula/page-0593.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0593.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5266,
  "bestTextAlphaRatio": 0.761
}