{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 178,
  "globalPageIndex": 178,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-36/SA-36M ASME BPVC.II.A-2025 \nSpecification for \nCarbon Structural Steel \n1. Scope \n1.1 This specification covers carbon steel shapes, plates, \nand bars of structural quality for use in riveted, bolted, or \nwelded construction of bridges and buildings, and for general \nstructural purposes. \n1.2 Supplementary requirements are provided for use where \nadditional testing or additional restrictions are required by the \npurchaser. Such requirements apply only when specified in the \npurchase order. \n1.3 When the steel is to be welded, a welding procedure \nsuitable for the grade of steel and intended use or service is to \nbe utilized. See Appendix X3 of Specification A6/A6M for \ninformation on weldability. \n1.4 The text of this specification contains notes or footnotes, \nor both, that provide explanatory material. Such notes and \nfootnotes, excluding those in tables and figures, do not contain \nany mandatory requirements. \n1.5 For structural products produced from coil and fur­\nnished without heat treatment or with stress relieving only, the \nadditional requirements, including additional testing require­\nments and the reporting of additional test results, of Specifi­\ncation A6/ A6M apply. \n1.6 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system is to \nbe used independently of the other, without combining values \nin any way. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA6/ A6M Specification for General Requirements for Rolled \nStructural Steel Bars, Plates, Shapes, and Sheet Piling \nA27 / A27M Specification for Steel Castings, Carbon, for \nGeneral Application \nA307 Specification for Carbon Steel Bolts, Studs, and \nThreaded Rod 60 000 PSI Tensile Strength \nA500 Specification for Cold-Formed Welded and Seamless \nCarbon Steel Structural Tubing in Rounds and Shapes \nA501 Specification for Hot-Formed Welded and Seamless \nCarbon Steel Structural Tubing \nA502 Specification for Rivets, Steel, Structural \n126 \nA563 Specification for Carbon and Alloy Steel Nuts \nA563M Specification for Carbon and Alloy Steel Nuts (Met-\nric) \nA668/ A668M Specification for Steel Forgings, Carbon and \nAlloy, for General Industrial Use \nA1011/A1011M Specification for Steel, Sheet and Strip, \nHot-Rolled, Carbon, Structural, High-Strength Low­\nAlloy, High-Strength Low-Alloy with Improved \nFormability, and Ultra-High Strength \nAl018/A1018M Specification for Steel, Sheet and Strip, \nHeavy-Thickness Coils, Hot-Rolled, Carbon, \nCommercial, Drawing, Structural, High-Strength Low­\nAlloy, High-Strength Low-Alloy with Improved \nFormability, and Ultra-High Strength \nF568M Specification for Carbon and Alloy Steel Externally \nThreaded Metric Fasteners (Metric) (Withdrawn 2012) \nF1554 Specification for Anchor Bolts, Steel, 36, 55, and \n105-ksi Yield Strength ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0178.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3280,
  "bestTextAlphaRatio": 0.7753
}