{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 276,
  "globalPageIndex": 276,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-182/SA-182M (ASTM A182/A182M) ASME BPVC.II.A-2025 \n13.5.3 If the imperfection is explored to the extent that it can \nbe identified as non-rejectable, the forging may be accepted \nwithout further test provided that the imperfection does not \nencroach on the minimum required wall thickness. \n14. Surface Finish, Appearance, and Corrosion \nProtection \n14.1 Forgings and finished parts shall conform to the \nrequirements of Specification A961/A961M. \n14.2 The forgings and finished parts shall be free of scale, \nmachining burrs which might hinder fit-up, and other injurious \nimperfections as defined herein. The forgings and finished parts \nshall have a workmanlike finish, and machined surfaces ( other \nthan surfaces having special requirements) shall have a surface \nfinish not to exceed 250 AA (arithmetic average) roughness \nheight. \n15. Repair by Welding \n15.1 Weld repairs shall be permitted (see Supplementary \nRequirement S58 of Specification A961/A961M) at the discre­\ntion of the manufacturer with the following limitations and \nrequirements: \n15 .1.1 The welding procedure and welders shall be qualified \nin accordance with Section IX of the ASME Boiler and \nPressure Vessel Code. \n15.1..2 The weld metal shall be deposited using the elec­\ntrodes specified in Table 4 except as otherwise provided in \nSupplementary Requirement S5. The electrodes shall be pur­\nchased in accordance with AWS Specifications A5.4/A5.4M, \nA5.5/A5.5M, A5.9/A5.9M, A5.ll/A5.11M, A5.14/A5.14M, \nA5.23/A5.23M, A5.28/A5.28M, or A5.29/A5.29M. The sub­\nmerged arc process with neutral flux, the gas metal-arc process, \nthe gas tungsten-arc process, and gas shielded processes using \nflux-core consumables, may be used. For weld deposits made \non S20910, the deposited weld metal shall correspond to either \nthe alloy content of the base metal or AWS A5.4 E209 or A5.9 \nER209. For weld deposits made on N08367, N08700, N08925 \nor N08926, the deposited weld metal shall correspond to either \nthe alloy content of the base metal or one of the following filler \nmetals in AWS A5.ll ENiCrMo-3 or A5.14 ERNiCrMo-3, \nA5.ll ENiCrMo-4 or A5.14 ERNiCrMo-4, or A5.11 \nENiCrMo-10 or A5.14 ERNiCrMo-10. For weld deposits made \non N08020, the deposited weld metal shall correspond to either \nthe alloy content of the base metal or AWS A5.4 E320/E320LR \nor A5.9 ER320/320LR. For weld deposits made on N08800, \nN08810 and N08811, the deposited weld metal shall corre­\nspond to either the alloy content of the base metal or A WS \nA5.ll ENiCr-3 or A5.14 ERNiCr-3. However, the fillers used \non these alloys (as well as other listed above) may be \ndependent on the end service use and service temperature and \nshall be agreed upon between purchaser and manufacturer. \n15.1.2.1 Weld deposits made on S20910, N08020, N08367, \nN08700, N08800, N08810, N08811, N08925, N08926, and \nF35030 (UNS S35030) shall be made using filler metal with a \ncomposition conforming to the base material or the equivalent \nclassification in the AWS Filler Metal Specification A5.11 and \nA5.14. It is possible that weld deposit chemistry will not meet \nthe limits· of either the base metal or the filler metal for some \nelements. The weld deposit chemistry shall meet the lowest \nminimum and highest maximum values for each specification \nelement in either of the base metal or filler metal specification. \nDilution of the base metal and filler metal must be considered \nwhen determining weld deposit criteria for over-alloyed filler \nmetals. In either case, the weld deposit chemistry shall be \ntested and recorded on the Procedure Qualification Record. \n15.1.3 Defects shall be completely removed prior to weld­\ning by chipping or grinding to sound metal as verified by \nmagnetic-particle inspection in accordance with Test Method \nA275/A275M for the low alloy steels and ferritic, martensitic, \nor ferritic-austenitic stainless steels, or by liquid-penetrant \ninspection in accordance with Test Method E165/E165M for \nall grades. \n15 .1.4 After repair welding, the welded area shall be ground \nsmooth to the original contour and shall be completely free of \ndefects as verified by magnetic-particle or liquid-penetrant \ninspection, as applicable. \n15.1.5 The preheat, interpass temperature, and post-weld \nheat treatment requirements given in Table 4 shall be met. \nAustenitic stainless steel forgings may be repair-welded with­\nout the post-weld heat treatment of Table 4, provided purchaser \napproval is obtained prior to repair. \n15.1.6 Repair by welding shall not exceed 10 % of the \nsurface area of the forging nor 331/3 % of the wall thickness of \nthe finished forging or 3/s in. [9.5 mm], whichever is less, \nwithout prior approval of the purchaser. \n15.1.7 When approval of the purchaser is obtained, the \nlimitations set forth in 15.1.6 may be exceeded, but all other \nrequirements of Section 15 shall apply. \n15.1.8 No weld repairs are permitted for F 6a Classes 3 and \n4. \n15.1.9 Post-weld heat treatment times for F 36 are: for Class \n• 1, up to 2 in. [50 mm] in thickness, 1 h per in. [25 nun], 15 \nminutes minimum, and over 2 in. [50 mm], 15 minutes for each \nadditional in. of thickness or fraction thereof; for Class 2, 1 h \nper in. [25 mm], ½ h minimum. \n224 \n16. Inspection \n16.1 Inspection provisions of Specification A961/A961M \napply. \n17. Rejection and Rehearing \n17 .1 The purchaser shall comply with the provisions of \nSpecification A961/A961M. \n18. Certification \n18.1 In addition to the certification requirements of Speci­\nfication A961/A961M, test reports shall be furnished to the \npurchaser or his representative. \n18.2 Test reports shall provide the following where appli­\ncable: \n18.2.1 Type heat treatment, Section 7, \n18.2.2 Product analysis results, Section 8 of Specification \nA961/A961M, \n18.2.3 Tensile property results, Section 9 (Table 3), report \nthe yield strength and tensile strength, in ksi [MPa], elongation \nand reduction in area, in percent, ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0276.json",
  "tabulaTablesCsv": "tables_tabula/page-0276.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0276.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5937,
  "bestTextAlphaRatio": 0.715
}