{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 527,
  "globalPageIndex": 1325,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-781/SA-781M \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall be applied only when specified by the purchaser. Details \nof the supplementary requirements shall be agreed upon by the manufacturer and purchaser. \nThe specified tests shall be performed by the manufacturer prior to shipment of the castings. \nS1. Magnetic Particle Examination \nS1.1 Castings shall be examined for surface and near \nsurface discontinuities by magnetic particle examination. \nThe examination shall be in accordance with Guide E 709. \nExtent of examination and the basis for acceptance shall \nbe agreed upon between the manufacturer and purchaser. \nS2. Radiographic Examination \nS2.1 Castings shall be examined for internal defects \nby means of X rays or gamma rays. The procedure shall \nbe in accordance with Guide E 94, and types and degrees \nof discontinuities considered shall be judged by Reference \nRadio graphs E 446, E 186, or E 280. Extent of examination \nand basis for acceptance shall be agreed upon between the \nmanufacturer and purchaser. \nS3. Liquid Penetrant Examination \nS3.1 Castings shall be examined for surface discontinu­\nities by means of liquid penetrant examination. The exami­\nnation shall be in accordance with Test Method E 165. \nAreas to be inspected, methods and types of liquid pene­\ntrants to be used, developing procedure, and basis for \nacceptance shall be agreed upon between the manufacturer \nand purchaser. \nS4. Ultrasonic Examination \nS4.1 Castings shall be examined for internal defects \nby means of ultrasonic examination. The examination pro­\ncedure shall be in accordance with Practice \nA 609 I A 609M. Extent of examination, methods of testing, \nand basis for acceptance shall be agreed upon between the \nmanufacturer and purchaser. \nS5. Examination of Weld Preparation \nS5.1 Magnetic particle or liquid penetrant examination \nof cavities prepared for welding shall be performed to \nverify removal of those discontinuities found unacceptable \nby the examination method specified for the casting. Unless \nother degrees of shrinkage or types of discontinuities found \nin the cavities are specified, Type II, Internal Shrinkage, \nof Reference Photographs E 125, of Degree 2 in sections \nup to 2 in. [50.8 mm] thick and of Degree 3 in sections \nover 2 in. thick shall be acceptable. \nS6. Certification \nS6.1 The manufacturer's certification shall be furnished \nto the purchaser stating that the material was manufactured, \nsampled, tested, and inspected in accordance with the mate­\nrial specification (including year date) and was found to \nmeet the requirements. \nS6.2 A manufacturer's certification printed from or \nused in electronic form from an electronic data interchange \n(EDI) transmission shall be regarded as having the same \nvalidity as a counterpart printed in the certifier's facility \nprovided it conforms to any existing EDI agreement \nbetween the purchaser and the supplier. \nS7. Prior Approval of Major Weld Repairs \nS7.1 Major weld repairs as defined and agreed upon \nbetween the manufacturer and purchaser shall be subject \nto the prior approval of the purchaser. \nS8. Marking \nS8.1 The manufacturer's name or identification mark \nand the pattern number shall be cast or stamped on all \ncastings. When further specified, the heat numbers or serial \nnumbers shall be marked on individual castings. \nS9. Charpy Impact Test \nS9.1 Charpy impact test properties shall be determined \nby testing a set of three Charpy V-notch specimens made \nfrom each heat at a test temperature agreed upon by the \nmanufacturer and purchaser. The material from which the \ntest specimens are prepared shall be cast in accordance with \n6.2. The acceptance requirements shall be either energy \nabsorbed, lateral expansion, or percent shear area, or all \nthree, and shall be that agreed upon between the manufac­\nturer and purchaser. Test specimens shall be prepared as \nType A and tested in accordance with Test Methods and \nDefinitions A 370. \nS9.2 Absorbed Energy-Average energy value of three \nspecimens shall be not less than specified, with not more \n1259 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1325.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4105,
  "bestTextAlphaRatio": 0.7868
}