{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 805,
  "globalPageIndex": 1603,
  "width": 613.92,
  "height": 793.2,
  "text": ",,......-----....., \nASME BPVC.II.A-2025 SA-1058 \nTABLE 6 Approximate Hardness Conversion Numbers for Austenitic Steels (Rockwell B to other Hardness Numbers) \nRockwell B Scale, Brinell Indentation Brinell Hardness, \n100-kgf Load, Diameter, 3000-kgf Load, \n1/10-in. (1.588-mm) mm 10-mm \nBall Ball \n100 3.79 256 \n99 3.85 248 \n98 3.91 240 \n97 3.96 233 \n96 4.02 226 \n95 4.08 219 \n94 4.14 213 \n93 4.20 207 \n92 4.24 202 \n91 4.30 197 \n90 4.35 192 \n89 4.40 187 \n88 4.45 183 \n87 4.51 178 \n86 4.55 174 \n85 4.60 170 \n84 4.65 167 \n83 4.70 163 \n82 4.74 160 \n81 4.79 156 \n80 4.84 153 \n15.1.1 A range of hardness can properly be specified only \nfor quenched and tempered or normalized and tempered \nmaterial. For annealed material a maximum figure only should \nbe specified. For normalized material a minimum or a maxi­\nmum hardness may be specified by agreement. In general, no \nhardness requirements should be applied to untreated material. \n15.1.2 Brinell hardness may be required when tensile prop­\nerties are not specified. \n15.2 Test Specimen-Brinell hardness tests are made on \nprepared areas and sufficient metal must be removed from the \nsurface to eliminate decarburized metal and other surface \nirregularities. The thickness of the piece tested must be such \nthat no bulge or other marking showing the effect of the load \nappears on the side of the piece opposite the indentation. \n15.3 Procedure: \n15.3.1 It is essential that the applicable product specifica­\ntions state clearly the position at which Brinell hardness \nindentations are to be made and the number of such indenta­\ntions required. The distance of the center of the indentation \nfrom the edge of the specimen or edge of another indentation \nmust be at least two and one-half times the diameter of the \nindentation. \n15.3.2 Measure two diameters of the indentation at right \nangles to the nearest 0.1 mm, estimate to the nearest 0.05 mm, \nand average to the nearest 0.05 mm. If the two diameters differ \nby more than 0.1 mm, discard the readings and make a new \nindentation. \n16. Rockwell Test \n16.1 The Rockwell Test shall be carried out in accordance \nwith the requirements of Test Methods El 8, ISO 6508-1, or TIS \nZ 2245. \nRockwell Superficial Hardness \nRockwell A Scale, 15T Scale, 30T Scale, 45T Scale, \n60-kgf Load, 15-kgf Load, 30-kgf Load, 45-kgf Load, \nDiamond ¼a-in. (1.588- 1/1a-in. (1.588- 1/10-in. (1.588-\nPenetrator mm) mm) mm) \nBall Ball Ball \n61.5 91.5 80.4 70.2 \n60.9 91.2 79.7 69.2 \n60.3 90.8 79.0 68.2 \n59.7 90.4 78.3 67.2 \n59.1 90.1 77.7 66.1 \n58.5 89.7 77.0 65.1 \n58.0 89.3 76.3 64.1 \n57.4 88.9 75.6 63.1 \n56.8 88.6 74.9 62.1 \n56.2 88.2 74.2 61.1 \n55.6 87.8 73.5 60.1 \n55.0 87.5 72.8 59.0 \n54.5 87.1 72.1 58.0 \n53.9 86.7 71.4 57.0 \n53.3 86.4 70.7 56.0 \n52.7 86.0 70.0 55.0 \n52.1 85.6 69.3 54.0 \n51.5 85.2 68.6 52.9 \n50.9 84.9 67.9 51.9 \n50.4 84.5 67.2 50.9 \n49.8 84.1 66.5 49.9 \n17. Portable Hardness Test \n17 .1 Although this standard generally prefers the use of \nfixed-location Brinell or Rockwell hardness test methods, it is \nnot always possible to perform the hardness test using such \nequipment due to the part size, location, or other logistical \nreasons. In this event, hardness testing using portable equip­\nment as described in Test Methods A956/A956M, A1038, and \nEll0 shall be used with strict compliance for reporting the test \nresults in accordance with the selected standard (see examples \nbelow). Standard Practice A833 may be used, although it might \nnot always be suitable as a criterion for acceptance or rejection \nsince Practice A833 does not contain a precision and bias \nstatement. \n17.1.1 Practice A833-The measured hardness number \nshall be reported in accordance with the standard methods and \ngiven the HBC designation followed by the comparative test \nbar hardness to indicate that it was determined by a portable \ncomparative hardness tester, as in the following example: \n17 .1.1.1 232 HBC/2.40 where 232 is the hardness test result \nusing the portable comparative test method (HBC) and 240 is \nthe Brinell hardness of the comparative test bar. \n17.1.2 Practice A956/A956M: \n17 .1.2.1 The measured hardness number shall be reported in \naccordance with the standard methods and appended with a \nLeeb impact device in parenthesis to indicate that it was \ndetermined by a portable hardness tester, as in the following \nexample: \n( 1) 350 HW where 350 is the hardness test result using the \nportable Leeb hardness test method with the HLD impact \ndevice. \n1549 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1603.json",
  "tabulaTablesCsv": "tables_tabula/page-1603.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1603.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4471,
  "bestTextAlphaRatio": 0.6191
}