{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 738,
  "globalPageIndex": 738,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-409 /SA-409M ASME BPVC.II.A-2025 \ncrown, not to exceed V16 in. [2 mm]. Any weld reinforcement \nmay be removed at the manufacturer's option or by agreement \nbetween the manufacturer and purchaser. The contour of the \nreinforcement should be reasonably smooth and free from \nirregularities. The weld metal shall be fused uniformly into the \nplate surface. No concavity of contour is permitted unless the \nresulting thickness of weld metal is equal to or greater than the \nminimum thickness of the adjacent base metal. \n5.2.3 Weld defects, as determined by specified inspection \nrequirements, shall be repaired by removal to sound metal and \nrewelding. \n5.3 Heat Treatment: \n5.3.1 Except as provided in 5.3.2, all pipe shall be furnished \nin the heat-treated condition. For H grades and S30815, \nseparate solution heat treatments are required for solution \nannealing; in-process heat treatments are not permitted as \na substitute for the separate solution heat treatments. The \nheat-treatment procedure shall consist of heating the material to \na minimum temperature of 1900 °F [1040 °C], except for S31254, \nS31266, and S30815 which shall be heat treated to 2100 °F \n[1150°C] and 1920°F [1050 °C] respectively, S31727 and \nS32053 which shall be heat treated in the range 1975 to 2155 °F \n[1080 to 1180 °C], S34565 which shall be heat treated in \n2050 °F [1120 °C] to 2140 °F [1170 °C], and N08367, which \nshall be heated to a minimum temperature of 2025 °F \n[ 1107 °C], all materials to be followed by quenching in \nwater or rapidly cooling by other means. \n5.3.2 The purchase order shall specify one of the following \nconditions if the heat-treated condition specified in 5.3.1 is not \ndesired by the purchaser: \n5 .3 .2.1 A final heat-treatment temperature under 1900 °F \n[1040 °C]. Each pipe supplied under this requirement shall be \nstenciled with the final heat-treatment temperature in degrees \nFahrenheit or degrees Celsius after the suffix \"HT.\" Controlled \nstructural or special service characteristics may be specified as \na guide for the most suitable heat treatment. \n5.3.2.2 DELETED \n5.3.2.3 DELETED \n5.4 A solution annealing temperature above 1950 °F \n[1065 °C] may impair the resistance to intergranular corrosion \nafter subsequent exposure to sensitizing conditions in TP321, \nTP347, and TP348. When specified by the purchaser, a lower \ntemperature stabilization or re-solution anneal shall be used \nsubsequent to the initial high temperature solution anneal (see \nSupplementary Requirement S5). \n6. Chemical Composition \n6.1 The steel shall conform to the chemical composition in \nTable 1. \n6.2 When specified on the purchase order, a product analy­\nsis shall be supplied from ohe tube or coil of steel per heat. The \nproduct analysis tolerance of Specification A480/A480M shall \napply. \n6.3 Unless otherwise specified in the purchase order, the \nchemical composition of the welding filler metal shall conform \nto the requirements of the applicable A WS specification for the \ncorresponding grade shown in Table 2. Grades with no filler \nmetal classification indicated shall be welded with filler metals \nproducing deposited weld metal having a composition in \naccordance with the chemical composition specified in Table 1. \nThe method of analysis for nitrogen and cerium shall be a \nmatter of agreement between the purchaser and manufacturer. \nThe purchaser may choose a higher-alloy filler metal when \nneeded for corrosion resistance. \n7. Tensile Requirements \n7 .1 The tensile properties of the plate or sheet used in \nmaking the pipe shall conform to the requirements prescribed \nin Table 3. Certified mill test reports shall be submitted to the \npipe manufacturer. \n7 .2 A transverse tension test taken across the welded joint of \nthe finished pipe shall meet the same minimum tensile strength \nrequirements as the sheet or plate. The weld section on the \ntension specimen shall be in the same condition as the finished \npipe (with or without bead as specified). \n8. Mechanical Tests Required \n8.1 Tension Test-One transverse tension test of the weld \nshall be made on each lot (Note 2) of finished pipe. \nNoTE 2-The term \"lot\" applies to each 200 ft [60 m] or less of pipe of \nthe same NPS and wall thickness (or schedule number) which is produced \nfrom the same heat of steel and subjected to the same finishing treatment \nin a continuous furnace. When final heat treatment is in a batch-type \nfurnace, the lot shall include only that pipe which is heat treated in the \nsame furnace charge. When no heat treatment is performed following final \nforming operations, the lot shall include each 200 ft [60 m] or less of pipe \nof the same NPS and wall thickness (or schedule number) which is \nproduced from the same heat of steel. \n8.2 Transverse Guided-Bend Weld Test-One test (two \nspecimens) of the weld shall be made on each lot (Note 2) of \nfinished pipe. \n8.3 Pressure or Nondestructive Electric Test-Each length \nof pipe shall be subjected to a pressure test or a nondestructive \nelectric test as prescribed in Section 15. \n9. Permissible Variations in Wall Thickness \n9 .1 The minimum wall thickness at any point shall not be \nmore than 0.018 in. [0.46 mm] under the specified wall \nthickness. (This tolerance is slightly more than commercial \ntolerances on sheet and plate to allow for possible loss of \nthickness caused by manufacturing operations.) \n10. Permissible Variations in Dimensions \n10.1 Permissible variations in dimensions shall not exceed \nthe following at any point in each length of pipe. \n10.1.1 Specified Diameter-Where the specified wall thick­\nness is less than 0.188 in. [4.8 mm], the actual outside \ndiameter, based on circumferential measurement, shall not vary \nmore than ±0.20 % from the specified outside diameter. Where \nthe specified wall thickness is 0.188 in. [4.8 mm] and heavier, \nthe actual outside diameter, based on circumferential \n688 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0738.json",
  "tabulaTablesCsv": "tables_tabula/page-0738.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0738.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5831,
  "bestTextAlphaRatio": 0.752,
  "noteOcrPath": "note_ocr/page-0738.txt",
  "noteOcrCount": 0,
  "noteOcrNotes": [],
  "noteOcrHighDpiPath": "note_ocr_highdpi/page-0738.txt",
  "noteOcrHighDpiCount": 0,
  "noteOcrHighDpiNotes": []
}