{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 218,
  "globalPageIndex": 1016,
  "width": 626.4,
  "height": 803.04,
  "text": "SA-540/SA-540M ASME BPVC.II.A-2025 \nTABLE 3 Rolled BarsA -Permissible Grinding Depth for Removal \nof Surface Defects \nDiameter, in. [mm] \n1 to 1'/a [25 to 29), incl \nOver 11/a to 1 ¼ [29 to 32), incl \nOver 1¼ to 1% [32 to 35), incl \nOver 1% to 1½ [35 to 38), incl \nOver 1 ½ to 2 [38 to 50), incl \nOver 2 to 2 1k [50 to 65), incl \nOver 2½ to 3½ [65 to 90), incl \nOver 3 1k to 4½ [90 to 115), incl \nOver 4½ to 5½ [115 to 140], incl \nOver 5½ to 6½ [140 to 165], incl \nOver 6½ to 8¼ [165 to 210], incl \nOver 8¼ to 9½ [21 0 to 240], incl \nMinimum Stock Removal \nPer Side \nin. mm \n0.025 \n0.028 \n0.030 \n0.033 \n0.042 \n0.052 \n0.072 \n0.090 \n0.110 \n0.125 \n0.155 \n0.203 \n0.64 \n0.71 \n0.76 \n0.84 \n1.07 \n1.32 \n1.83 \n2.29 \n2.79 \n3.18 \n3.94 \n5.16 \nA Consult the manufacturer on forged bars, cold-finished bars, bored bars, \nseamless tubes, and forged hollows. \n13.1.1 One test coupon shall be removed from each end of \none bar, one seamless tube, or one bored bar or from each of \ntwo forged hollows from each size of each heat in each \ntempering charge, or each 10 000 lb [4540 kg], whichever is \nless. One tension test and one impact test consisting of three \nCharpy V-notch specimens shall be taken from each test \ncoupon. For testing in accordance with 15.1.1, two tests shall \nbe obtained from two representative production pieces from \neach size of each heat in each tempering charge or each 10 000 \nlb [4540 kg], whichever is less. \n13.1.2 Hardness Test: \n13.1.2.1 Bars 2 in. [50 mm] and over and all seamless tubes \nor bored bars shall be tested near each end of each mill-treated \nlength. Each forged hollow with thickness 2 in. [50 mm] or \nover shall be tested on the surface. \n13.1.2.2 Bars under 2 in. [50 mm] shall be tested near each \nend of not less than 10 % of the bars. Forged hollows less than \n2 in. [50 mm] thick shall be tested on the surface of not less \nthan 10 % of the forgings. \n13.2 Hardness Tests of Annealed Bolting Material: \n13.2.1 Hardness tests shall be made on the annealed bars to \nassure compliance with 10.2. \n13.3 Bolting Components: \n------13.3rTfie number of bolting components tested shall be as \nspecified in Specification A962/ A962M. \n14. Retests \n14.1 If the results of the mechanical tests of any test lot do \nnot conform to the specified requirements, the manufacturer \nshall reject the lot or the manufacturer may re-heat treat such \na lot no more than twice. After the lot is re-heat treated, all of \nthe tests specified in Section 13 shall be repeated, and all shall \nconform to the specified requirements. \n15. Test Specimens and Methods of Testing \n15.1 A discard equivalent to the diameter of the bar when \nheat treated as a solid or a discard equivalent to the wall \nthickness when heat treated as a seamless tube, bored bar, or \nhollow forging shall be taken prior to removal of test coupons. \n15.1.1 When production pieces are not of sufficient length to \npermit removal of test coupons in accordance with 15.1, the \nmid-length of the specimens shall be at the mid-length of the \nproduction pieces selected for destruction to provide test \ncoupons of the bolting material. The production pieces selected \nfor test shall be identical with respect to the quenched contour \nand size except for length which shall equal or exceed the \nlength of the represented production pieces. \n15.2 Tension and impact specimens from bolting compo­\nnents with cross sections of 1 ½ in. [38 mm] or less shall be \ntaken so that their longitudinal axis is on a line representing the \ncenter of the diameter or thickness. \n15.3 Tension test specimens from bolting components with \ncross sections exceeding 1 ½ in. [38 mm] shall be taken so that \ntheir longitudinal axis is midway between mid-thickness and \nsurface. \n15.4 Impact specimens from bolting components with cross \nsections exceeding 1 ½ in. [38 mm] shall be taken so that their \nlongitudinal axis is midway between mid-thickness and surface \nor 1 in. [25 mm] below the surface plus the machining \nallowance per side, whichever is less. \n16. Certification \n16.1 When requested in the purchaser's order, a test report \nshall be furnished to the purchaser. In addition to the require­\nments of Specification A962/A962M the report shall include \nany other tests which may be specified in writing by the \npurchaser. \n17. Product Marking \n916 \n17.1 Bars under 2 in. [50 mm] in diameter shall be bundled \nand tagged with the specification, grade symbol, and mill heat \nnumber. The specification number marked on the tag need not \ninclude specification year date and revision number. \n17.2 Bars 2 in. [50 mm] and over in diameter and all \nseamless tubes and bored bars shall be die-stamped with the \n11.1iU heat number and grade symbol on one surface. \n17 .3 Each hollow forging shall be die-stamped with the heat \nnumber or heat symbol code and grade symbol. \n17.4 See Specification A962/ A962M for marking bolting \ncomponents. Use the grade symbol shown in Table 1. \n18. Keywords \n18.1 bolts-steel; chromium-molybdenum alloy steel; \nchromium-molybdenum-vanadium alloy steel; chromium­\nnickel-molybdenum-vanadium alloy steel; bolting \ncomponents-steel; nickel-chromium-molybdenum alloy \nsteel; nuclear applications; nuts-steel; steel bars-alloy; steel \nbolting material ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1016.json",
  "tabulaTablesCsv": "tables_tabula/page-1016.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1016.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5242,
  "bestTextAlphaRatio": 0.691
}