{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 447,
  "globalPageIndex": 447,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-266/SA-266M \ndiscard shall be made to secure freedom from injurious pipe \nand undue segregation. \n4.2 The material shall be forged as close as practical to the \nspecified shape and size. \n4.3 The finished product shall be a hot-worked forging as \ndefined by Specification A788/A788M. \n5. Machining \n5.1 Surfaces shall be machined as designated by the pur­\nchaser. Unmachined surfaces shall be sufficiently free of scale \nto permit inspection. \n5.2 Machining may be performed either prior to or after heat \ntreatment at the option of the manufacturer unless specified in \naccordance with Supplementary Requirement S 1. \n6. Heat Treatment \n6.1 After forging and before reheating for heat treatment, \nthe forgings shall be cooled in such a manner as to prevent \ninjury and to accomplish transformation. \n6.2 All forgings shall be annealed, normalized, or normal­\nized and tempered, but alternatively may be liquid quenched \nand tempered when mutually agreed upon between the manu­\nfacturer and the purchaser. When tempering is performed, it \nshall be at a subcritical temperature, but no less than 1100 ~F \n[595 °C], \n6.3 A multiple stage austenitizing procedure may be used \nwhereby the forging is first fully austenitized and liquid \nquenched, followed by reheating within the intercritical tem­\nperature range to partially reaustenitize, and again liquid \nquenched. On completion of the austenitizing/quenching \ncycles, tempering at a temperature between ll00 °F [595 °C] \nand the lower critical temperature shall follow. \nNoTE 2-Although liquid quenching from the austenitizing tempera­\ntures is more effective in enhancing impact properties, air cooling from the \naustenitizing temperatures is also beneficial and may be used instead of \nthe normalizing procedure in 6.2. \n7. Chemical Composition \n7 .1 Heat Analysis-The heat analysis obtained from sam­\npling in accordance with Specification A788/A788M shall \ncomply with Table 1 except that the additional features of \nSupplementary Requirements Sll and S12 shall also apply as \nindividually specified in the ordering information. \n7 .2 Product Analysis-The purchaser may use the product \nanalysis provision of Specification A788/A788M to obtain a \nproduct analysis from a forging representing each heat or \nmultiple heat. \nTABLE 1 Chemical Requirements \nComposition,% \nGrades 1 and 2 Grade 3 Grade 4 \nCarbon, max 0.30 0.35 0.30 \nManganese 0.40-1.05 0.80-1.35 0.80-1.35 \nPhosphorus, max 0.025 0.025 0.025 \nSulfur, max 0.025 0.025 0.025 \nSilicon 0.15-0.35 0.15-0.35 0.15-0.35 \n8. Mechanical Properties \n8.1 General Requirements-Except when otherwise speci­\nfied in accordance with Supplementary Requirement S2, the \nmaterial shall conform to the requirements for mechanical \nproperties prescribed in Table 2 when tested in accordance with \nthe latest issue of Test Methods and Definitions A370 or Test \nMethods Al058 when the M suffix standard has been specified. \nThe largest obtainable tension test specimen as specified in Test \nMethods and Definitions A370 or Test Methods A1058, as \napplicable, shall be used. \n8.1.1 Except when otherwise specified in accordance with \nSupplementary Requirement S2, the longitudinal axis of the \nspecimens shall be parallel to the direction of major working of \nthe forging. For upset-disc forgings, the longitudinal axis of the \ntest specimen shall be in the tangential direction. \n8.1.1.1 The longitudinal axis of the specimen shall be \nlocated midway between the parallel surfaces of the test \nextension if added to the periphery of disks or midway between \nthe center and surface of solid forgings. For hollow forgings, or \nthose heat-treated after boring, the specimen shall be located at \nmidwall. For the special case of forgings that are heat-treated \nsolid, but are subsequently bored, the tension test specimen \nmay be taken at the location of the minimum inside diameter \nafter boring instead of the mid-radius position. When sepa­\nrately forged test blocks are employed as defined in 8.1.3, the \ntension test specimens shall be taken from a location that \nrepresents the midwall of the heaviest section of the production \nforgings. When specimens are required from opposite ends, \nthey shall be taken from the diagonal comers of an axial plane. \n8.1.2 Except as specified herein, tests for acceptance shall \nbe made after heat treatment has been completed. When the \nends of the cylindrical forgings are closed in by reforging, the \ncylindrical forgings may be annealed, normalized, or normal­\nized and tempered and tested prior to reforging. After \nreforging, the entire forging shall be reheat-treated in the same \nmanner and at the same temperature range as employed when \nthe forging was heat-treated prior to certification testing. \n8.1.3 When mutually agreed upon between manufacturer \nand purchaser, test specimens may be machined from a \nspecially forged block suitably worked and heat-treated with \nthe production forgings. Such a special block shall be obtained \nfrom an ingot, slab, or billet from the same heat used to make \nthe forgings it represents. This block shall receive essentially \nthe same type of hot working and forging reduction as the \nproduction forgings; however, a longitudinally forged bar with \ndimensions not less than T by T by 3 T may be used to represent \na ring forging. The dimension T shall be representative of the \nheaviest effective cross section of the forging. For quenched \nTABLE 2 Tensile Requirements \nGrade 1 Grades Grade 3 2 and 4 \nTensile strength, min, ksi [MPa] 60-85 70-95 75-100 \n[415-585] [485-655] [515-690] \nYield strength (0.2 % offset), 30 [205] 36 [250] 37.5 [260] \nmin, ksi [MPa] \nElongation in 2 in. [62.5 mm], 23 [21] 20 [18] 19 [17] \nmin,% \nReduction of area, min, % 38 33 30 \n395 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0447.json",
  "tabulaTablesCsv": "tables_tabula/page-0447.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0447.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5645,
  "bestTextAlphaRatio": 0.761
}