{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 684,
  "globalPageIndex": 684,
  "width": 615.84,
  "height": 856.2,
  "text": "SA-372/SA-372M ASME BPVC.II.A-2025 \nSpecification for \nCarbon and Alloy Steel Forgings for Thin-Walled Pressure \nVessels \n1. Scope \n1.1 This specification covers relatively thin-walled forg­\nings (including gas bottles) for pressure vessel use. Three types \nof carbon steel and six types of alloy steel are included. \nProvision is made for integrally forging the ends of vessel \nbodies made from seamless pipe or tubing. \nNoTE I-When working to the chemical and tensile requirements of \nthis specification, the influence of wall thickness and cooling rate will \nnecessarily eliminate certain forging sizes in each class. \nNoTE 2-Designations have been changed as follows: \nCurrent Formerly \nG~A fy~I \nGrade B Type II \nGrade C Type Ill \nGrade D Type IV \nGrade E Class 55 Type V Grade 1 Class 55 \nGrade E Class 65 Type V Grade 1 Class 65 \nGrade E Class 70 Type V Grade 1 Class 70 \nGrade F Class 55 Type V Grade 2 Class 55 \nGrade F Class 65 Type V Grade 2 Class 65 \nGrade F Class 70 Type V Grade 2 Class 70 \nGrade G Class 55 Type V Grade 3 Class 55 \nGrade G Class 65 Type V Grade 3 Class 65 \nGrade G Class 70 Type V Grade 3 Class 70 \nGrade H Class 55 Type V Grade 4 Class 55 \nGrade H Class 65 Type V Grade 4 Class 65 \nGrade H Class 70 Type V Grade 4 Class 70 \nGrade J Class 55 Type V Grade 5 Class 55 \nGrade J Class 65 Type V Grade 5 Class 65 \nGrade J Class 70 Type V Grade 5 Class 70 \nGrade K Type VI \nGrade L Type VII \nGrade J Class 110 Type VIII \nGrade M Class 85 Type IX Class A \nGrade M Class 100 Type IX Class B \n1.2 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \n634 \neach system are not necessarily exact equivalents; therefore, to \nensure conformance with the standard, each system shall be \nused independently of the other, and values from the two \nsystems shall not be combined. \n1.3 Unless the order specifies the applicable \"M\" specifica­\ntion designation (SI units), the mate1ial shall be furnished to \ninch-pound units. \n1.4 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA275/A275M Practice for Magnetic Particle Examination of \nSteel Forgings \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA388/A388M Practice for Ultrasonic Exatnination of Steel \nForgings \nA530/A530M Specification for General Requirements for \nSpecialized Carbon and Alloy Steel Pipe \nA788/A788M Specification for Steel Forgings, General Re­\nquirements \nE112 Test Methods for Detertnining Average Grain Size \nE165/El65M Practice for Liquid Penetrant Testing for Gen­\neral Industry \nE290 Test Methods for Bend Testing of Material for Ductil­\nity \nE433 Reference Photographs for Liquid Penetrant Inspec­\ntion ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0684.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3024,
  "bestTextAlphaRatio": 0.7417
}