{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 603,
  "globalPageIndex": 603,
  "width": 635.52,
  "height": 871.68,
  "text": "ASME BPVC.II.A-2025 SA-352/SA-352M \n11. Keywords \n11.1 alloy steel; carbon steel; ferritic steel; low temperature \napplications; mrutensitic stainless steel; pressure containing \nparts; stainless steel; steel castings \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall not apply unless specified in the purchase order. A \nlist of standardized supplementary requirements for use at the option of the purchaser is included in \nSpecification A 703/ A 703M. Those which are ordinarily considered suitable for use with this \nspecification are given below together with additional supplementary requirements that are applicable \nonly to this specification. Other supplementary requirements enumerated in A703/A703M may be \nused with this specification upon agreement between the manufacturer and purchaser. \nSl. Unspecified Elements \nS2. Destruction Tests \nS4. Magnetic Particle Inspection \nS5. Radiographic Inspection \nS9. Drop Weight Tests \nS10. Examination of Weld Preparation \nSl0.1 The method of performing the magnetic particle or \nliquid penetrant test shall be in accordance with Practice E709 \nor Practice E 165. \nS21. Heat Treatment \nS21.1 Castings shall be liquid quenched and tempered. \nS22. Impact Test Temperatures \nS22.1 When an impact test temperature other than that listed \nin Table 1 is used, the lowest test temperature at which the \nmaterial met the impact test requirements shall be stamped \nwith low-stress stamps on a raised pad located immediately \nahead of the material symbol; for example, 25 LCB for +25°F \n[-4°C] and 025 LCB for -25°F [-32°C]. \nS22.2 Lateral expansion of V-notch specimens shall be \nmeasured in accordance with 23.2.3.1 of Test Methods and \nDefinitions A370, and reported for information. \nS23. Carbon Equivalent \nS23.1 When specified on the order the maximum carbon \nequivalent shall be: \nGrade Carbon Equivalent, max \nLCA 0.50 \nLCB 0.50 \nLCC 0.55 \nS23.2 Determine carbon equivalent, CE, as follows: \nMn Cr+Mo+V Ni+Cu \nCE= C+6+ 5 +-15-\nAPPENDIX \n(Nonmandatory Information) \nXl. EXPLANATION OF THE USE OF NOTCHED BAR IMPACT TESTS IN DETERMINING THE ACCEPTABILITY OF \nSTEELS FOR LOW-TEMPERATURE SERVICE \nXl. 1 Years of experience and test work have shown that \nsome materials, particularly ferritic steels, change from tough \nto brittle behavior with a decrease in temperature. The transi­\ntion temperatures and the levels of notch toughness vary with \ndifferent materials, depending on many factors. When materi­\nals are used under conditions where brittle behavior may occur, \nthere is danger that flaws, which would be considered nonhaz­\nardous if the material were tough, may propagate to disastrous \nfailure of the equipment. \nXl.2 Accordingly, many varieties of tests have been devel­\noped in an effort to evaluate the toughness of materials and the \nconditions under which they will transform from tough to \nbrittle behavior. There are many opinions and shadings of \n551 \nopinion as to which test is most suitable for evaluating the \nsuitability of materials for service at low temperatures; how­\never, as yet, only the Charpy impact test has received sufficient \ngeneral acceptance and has been used as a basis for purchasing \nfor sufficient time to be included in ASTM standards. Further­\nmore, this test is required for low-temperature service vessels \nand piping constructed in accordance with ASME Code for \nUnfired Pressure Vessels and the American National Standard \nCode for Pressure Piping (ANSI B31), respectively. These \nASTM specifications for materials for low-temperature service \nare primarily used in piping and pressure vessel construction \nthat are subjected to temperatures lower than ambient; conse­\nquently, the notched bar impact test requirements are written to \nprovide material that in quality and by its testing can be ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0603.json",
  "tabulaTablesCsv": "tables_tabula/page-0603.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0603.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3816,
  "bestTextAlphaRatio": 0.7783
}