{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 672,
  "globalPageIndex": 1470,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-962/SA-962M ASME BPVC.II.A-2025 \nSpecification for \nCommon Requirements for Bolting Intended for Use at Any \nTemperature from Cryogenic to the Creep Range \n1. Scope \n1.1 This specification covers a group of common require­\nments that shall apply to carbon, alloy, stainless steel, and \nnickel alloy bolting under any of the following ASTM Speci­\nfications ( or under any other ASTM Specifications that invoke \nthis specification or portions thereof): \nTitle of Specifications ASTM Designation \nAlloy-Steel and Stainless Steel Bolting for A 193/ A 193M \nHigh Temperature or High Pressure Service and \nOther Special Purpose Applications \nCarbon Steel, Alloy Steel, and Stainless Steel Nuts A194/A194M \nfor Bolts for High Pressure or High Temperature \nService, or Both \nAlloy-Steel and Stainless Steel Bolting for Low'. A320/A320M \nTemperature Service \nStainless and Alloy-Steel Turbine-Type Bolting A437/A437M \nSpecially Heat Treated for High-Temperature \nService \nHigh-Temperature Bolting, with Expansion A453/A453M \nCoefficients Comparable to Austenitlc Stainless \nSteels \nAlloy-Steel Bolling for Special Applications A540/A540M \nPrecipitation-Hardening Bolting (UNS N07718) A1014/A1014M \nfor High Temperature Service \nHigh Strength Precipitation Hardening and Duplex A1082/A1082M \nStainless Steel Bolting for Special Purpose \nApplications \n1.2 In case of conflict, the requirements of the individual \nproduct specification shall prevail over those of this specifica­\ntion. \n1.3 Fasteners are a wide-ranging classification that includes \nscrews, bolts, nuts, washers, stud bolts, rivets, powder-actuated \nstuds, staples, tacks, and pins. Bolting, which is composed of \nbolting materials, such as rods, bars, flats, and forgings, which \nare subsequently manufactured into bolting components, are a \nspecial sub-group of fasteners. Bolting materials and compo­\nnents have designated compositions and specific properties \nintended for applications in aggressive service where commer­\ncial generic fasteners may not be suitable or have insufficient \nfitness for purpose under certain conditions. These conditions \ninclude cryogenic or high temperature service, or excessive \nvibration, impact, or shock. To further address any other \nspecial service conditions where bolting is intended for use, \nadditional requirements may be specified by mutual agreement \nbetween the purchaser and supplier. \n1.4 Supplementary requirements are provided for use at the \noption of the purchaser. The supplementary requirements only \napply when specified individually by the purchaser in the \npurchase order or contract. \n1.5 This specification is expressed in both inch-pound units \nand in SI units. Unless the purchase order or contract specifies \nthe applicable \"M\" specification designation (SI units) the \ninch-pound units shall apply. The values stated in either SI \nunits or inch-pound units are to be regarded separately as \nstandard. Within the text, the SI units are shown in brackets. \nThe values stated in each system may not be exact equivalents; \ntherefore, each system shall be used independently of the other. \nCombining values from the two systems may result in noncon­\nformance with the specification. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \nThe following documents shall form a part of this specifica­\ntion to the extent specified. The latest issue shall apply un­\nless otherwise specified. \n2.1 ASTM Standards: \nA29/A29M Specification for General Requirements for Steel \nBars, Carbon and Alloy, Hot-Wrought \nA193/A193M Specification for Alloy-Steel and Stainless \nSteel Bolting for High Temperature or High Pressure \nService and Other Special Purpose Applications \n1412 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1470.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3991,
  "bestTextAlphaRatio": 0.7915
}