{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 150,
  "globalPageIndex": 150,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-Z0/SA-Z0M ASME BPVC.II.A-2025 \nA3. REQUIREMENTS FOR THE INTRODUCTION OF NEW MATERIALS \nA3.l Proposals for the introduction of new plate materials \nto be covered by the general requirements in this specification, \neither by the addition of new grades within existing \nspecifications, or by the creation of a new specification shall be \nsubject to the following conditions: \nA3.l.1 The application for the addition of a new grade to a \nspecification or a new specification shall be made to the chair \nof the subcommittee. Applications for new specifications \nremain subject to the approval of Committee A0l. Revisions to \nexisting specifications for such reasons as chemistry or thick­\nness limitation are not subject to this annex. \nA3.l.2 The application shall contain documentation citing \nthe requisite need for the new material and its intended use as \noutlined in Form and Style for ASTM Standards, BS. Scope.3 \nThat documentation may be in the form of a letter from a user, \nfabricator, another standards development organization, or \nproducer stating the purpose and intended use for said new \nmate1ial. The Subcommittee may consider other evidence of \nneed for the proposal. Additional background information as \nmay be pertinent to the introduction of tlie new material may \nalso be presented with the proposal. \nA3.l.3 The application shall be accompanied by test data as \nrequired by the applicable specification. Test data from a \nminimum of three test lots, as defined by the specification, each \nfrom a different heat, shall be furnished and shall include: \nA3.l.3.l Chemical data reflecting a suitable representation \nof tlie required chemistry range requested. \nA3.l.3.2 Mechanical property data representing the pro­\nposed requirements in the delivered condition from each of the \nheats supplied. \nNoTE A3. l-To assist the balloting process, data from plates represent­\ning the maximum proposed thickness should be provided recognizing that \nin some cases the standard may be \"limited only by the capacity of the \ncomposition to meet the specified mechanical property requirements.\" \nA3.l.3.3 Mechanical property data in the simulated Post­\nWeld Heat Treatment (PWHT) condition if the product speci­\nfication lists Supplementary Requirement S3. \nA3.l.3.4 Evidence of weldability if the material is intended \nfor welded construction as may be referenced in the Scope \nsection of the new or existing standard. \nNoTE A3.2-Such evidence is at the discretion of the submitter. \nCommon methodology may include but not be limited to a single ASME \nSection IX qualification such as is referenced in 9 .4 of this specification. \nA3.l.4 Other properties that are not specification require­\nments that further describe the material, including physical \nproperties, are not mandatory. However, to the extent that such \ninformation may assist the Subcommittee in evaluating the \nproposal they may be included. Omission of such non-essential \ndocumentation shall not be a cause for rejection of the \napplication by the subcommittee. \nA3.l.5 The application shall state whether or not a patent \ncovers ilie new material. \nAPPENDIXES \n(Nonmandatory Information) \nXl. COILED STEEL \nXl.1 Continuous wide hot strip rolling mills are nonnally \nequipped with coilers. Regardless of the different types of \nsystems employed during or following the rolling operations, it \nis common for the steel to be reeled into the coiler at \ntemperatures in the stress-relieving range. In general, such \ntemperatures are higher as the steel thickness increases. The \ncoils subsequently cool to ambient temperature with outer and \ninner laps cooling more rapidly than central laps. The differ-\n98 \nence in cooling rate can result in measurable differences in the \nmechanical properties throughout a coil. Data confirm reduced \nyield and tensile strength, and increased percent elongation, for \nthe product wiili slower cooling rates from the coiling tem­\nperature to ambient. Such differences are in addition to the \neffects on mechanical properties caused by differences in heat \nanalysis and chemical segregation. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0150.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4099,
  "bestTextAlphaRatio": 0.8002
}