{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 657,
  "globalPageIndex": 1455,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-960 /SA-960M \nexamination in accordance with Guide E709 or liquid penetrant \ninspection in accordance with Test Method E165/El65M, as \napplicable. \n16.2.4 Repair welding shall not exceed 10 % of the external \nsurface area of the part, or 33 1/3 % of the wall thickness of the \nfinished product, or 3/s in. [10 mm] deep maximum at the \nlocation of the repair, without prior approval of the purchaser. \n16.2.5 Weld repaired material or parts, or both, shall be \nmarked \"RW\" when required by the product specification. \n16.3 The weld repair shall conform to the additional \nrequirements, if any, invoked in the product specification. \n17. Inspection \n17 .1 The supplier shall provide the purchaser's inspector \nwith all reasonable facilities necessary to satisfy him that the \nmaterial is being produced and furnished in accordance with \nthis specification and the applicable product specification. Site \ninspection by the purchaser shall not interfere unnecessarily \nwith the supplier's operations. \n18. Rejection and Rehearing \n18.1 Samples representing material rejected by the pur­\nchaser shall be preserved until disposition of the claim has been \nagreed to between the supplier and the purchaser. \n19. Marking \n19.l Each piece shall be legibly marked in a position as not \nto injure the usefulness of the fitting with the product specifi­\ncation number, grade or marking symbol, class, certifying \norganization's name or symbol, the heat number or heat \nidentification, size, and schedule number or wall thickness, if \napplicable. Dual or multiple marking with the product speci­\nfication number, grade or marking symbol, and class is \nacceptable provided the material meets all the requirements \nwith which it is marked. It is not required to mark the product \nwith the specification year and date of issue. When size or \nshape does not permit the inclusion of all the required marking \nas described, see 19.2. Manufacturer can also choose the use of \ntags, box labels, etc. for identification when per piece marking \nis not practical due to size or shape. \n19.2 The Standard Marking System of Valves, Fittings, \nFlanges and Unions MSS-SP-25 shall be followed except the \nword \"steel\" shall not be substituted for the specification grade. \n19.3 Product marking shall conform to the additional \nrequirements, if any, invoked in the product specification or \npurchase order. \n20. Certification \n20.1 A test report and certificate of compliance are required. \n20.2 Test reports shall include the product specification \nnumber and year/date of issue, the results of all tests required \nby this specification, and the purchaser order, and shall be \ntraceable to the part represented. \n20.3 A single document containing the test report informa­\ntion and certificate of compliance information may be used. \n20.4 A certificate printed from or used in electronic data \ninterchange (EDI) transmission shall be regarded as having the \nsame validity as a counterpart printed in the certifier's facility. \nThe content of the EDI transmitted document shall conform to \nany existing EDI agreement between the purchaser and the \nsupplier. \n20.5 Not withstanding the absence of a signature, the \norganization submitting either a printed certificate or an EDI \ntransmitted certificate is responsible for the content of the \nreport. \n21. Packaging, Marking and Loading for Shipment \n21.1 Packaging, marking, and loading for shipment shall be \nin accordance with Practices A 700. \n22. Keywords \n22.1 austenitic stainless steel; corrosive service applica­\ntions; ferritic/austenitic stainless steel; ferritic stainless steel; \nhigh strength low alloy steel; martensitic stainless steel; piping \napplications; pressure containing parts; pressure vessel service; \nstainless steel fittings; temperature service applications­\nelevated; temperature service applications-low; temperature \nservice applications-moderate \nSUPPLEMENTARY REQUIREMENTS \nThese requirements shall not be considered unless specified in the order, in which event, the \nsupplementary requirements specified shall be made at the place of manufacture, unless otherwise \nagreed upon, at the purchaser's expense. The test specified shall be witnessed by the purchaser's \ninspector before shipment of material, if so specified in the order. The rationale for beginning the \nsection numbering with SS0 is to eliminate the possibility of confusion with supplementary \nrequirements existing in individual product specifications. \nSSO. Product Analysis (See Note SSO.l) \nSS0.1 A product analysis shall be made from each heat of \nbase metal and, if of welded construction, from each lot \nnumber of welding material of the fittings offered for delivery. \nThe analysis shall conform to the requirements specified in \nSection 8. \nS51. Tension Test (See Note SS0.1) \nSS 1.1 One tension test shall be made on one fitting or \nrepresentative test piece (See Note SS0.2) per lot (See Note \nSS0.3) of fittings. If the fittings are of welded construction, the \ntension specimen shall include the weld and shall be prepared \nso that the weld is at the midlength location of the specimen. \n1395 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1455.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5146,
  "bestTextAlphaRatio": 0.7814
}