{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 183,
  "globalPageIndex": 183,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-47 /SA-47M \n7.2 Tension Test Specimens: \n7 .2.1 The tension test specimens shall be cast to the \nform and dimensions shown in Fig. 1 or Fig. 2, in the same \nkind of molding material used for the production castings. \nAt least three such specimens shall be cast from a represen­\ntative ladle of iron either from each batch-melted heat or, \nin continuous melting, from each 4 h pour period during \nwhich the purchaser's castings were poured, or as otherwise \nagreed upon between manufacturer and purchaser. \n7.2.2 All test specimens shall be suitably identified \nwith the designation of either the batch-melted heat or the \npour period of a continuous heat. \n7 .2.3 All test specimens shall be heat treated in the \nsame production furnaces and in the same cycles as the \ncastings they represent. However, in those instances \nwherein the critical sections of the production castings \ndiffer appreciably from that of the central portion of the \ntest specimens, the time cycle for tempering the test speci­\nmens may be altered from that of the production lot in \norder to obtain similar microstructures or hardness, or both, \nin both specimen and castings. In such cases the hardness \nof the specimens shall be tested and reported along with \nthe tensile test results. \n7.2.4 The tension test is usually performed on unma­\nchined specimens. However, for referee work, the speci­\nmen may be machined from the standard cast bar to the \ndimensions shown in Fig. 3. \n7.3 Tension Test Method: \n7.3.1 The gage length of the standard tension speci­\nmen shall be 2.00 ± 0.ol in. [50.0 ± 0.3 mm]. \n7 .3.2 The diameter used to compute the cross-sec­\ntional area shall be the average between the largest and \nsmallest diameters in that section of the 2 in. [50 mm] \ngage length having the smallest diameter and shall be mea­\nsured to the nearest 0.001 in. [0.2 mm]. No cast bar having \na mean diameter less than 0.590 in. [15.0 mm] shall be \naccepted for test. \n7.3.3 After reaching a stress equivalent to approxi­\nmately half of the anticipated yield stress, the speed of the \nmoving head of the testing machine shall not exceed \n0.50 in./min [12.5 mm/min] through the breaking load. \n7.3.4 While the values for yield point and yield \nstrength are not identical, they are sufficiently close for \nmost applications of ferritic malleable irons to be used \ninterchangeably. They may be determined by any of the \napproved techniques described in the paragraphs on Deter­\nmination of Yield Strength and Yield Point of Test Methods \nE 8. If determined as yield strength, that stress producing \nan extension under load of 0.01 in. [0.25 mm] over the \n2 in. [50 mm] gage length (for example, 0.5% extension) \nor an offset of 0.2% shall be taken as the yield stress, \nwhich shall be converted to yield strength by dividing by \nthe original cross-sectional area of the gage length found \nin accordance with 7.3.2. It shall be reported to the nearest \n100 psi [MPa]. In referee work, yield strength shall be \ndetermined as the stress that produces an extension under \nload of 0.5% of the gage length. \n7 .3.5 The tensile strength shall be the maximum load \ncarried by the specimen during the test divided by the \noriginal cross-sectional area of the gage length, as found \nin accordance with 7.3.2. It shall be reported to the nearest \n100 psi [MPa]. \n7 .3.6 The elongation is the increase in gage length \nafter fracture of a tensile specimen, measured to the nearest \n0.01 in. [0.25 mm], expressed as a percentage of the origi­\nnal gage length. It shall be reported to the nearest 0.5%. \n7.4 Retesting: \n7.4.1 If, after testing, a specimen shows evidence of \na defect, another tension test may be made on a companion \nspecimen. Also, a retest shall be permitted whenever frac­\nture occurs outside the central 50% of the gage length. \n7 .4.2 If the results of a valid test fail to conform to \nthe requirements of this specification, two retests shall be \nmade. If either retest fails to meet the specification, the \ncastings represented by these test specimens shall be \nrejected. A valid test is one wherein the test specimen has \nbeen properly prepared and appears to be sound and on \nwhich the approved test procedure has been followed. \n131 \n7.4.3 If sufficient companion test bars are unavail­\nable, the manufacturer shall have the option of testing a \nspecimen cut from a representative casting. Therefore, as \nstated in Xl.3, the mechanical properties of such tension \ntest specimen removed from a production casting will not \nnecessarily correspond to those of a standard separately \ncast test specimen, the values in Table 1 do not apply. \nInstead, the mechanical properties of the test specimen \nfrom the casting must equal or exceed the average of those \nfrom similar test specimens removed from the same loca­\ntion from two castings of the same design where separately \ncast test bars meet the requirements of Table 1. \n7 .4.4 If the first test results indicate that a reheat \ntreatment is needed to meet the test requirements, the entire \nlot of castings and the representative test specimens shall \nbe reheat treated together. Testing shall then be repeated \nin accordance with 7.4.1-7.4.3. \n7 .4.5 The results of all tests, including retests, shall \nbe posted in permanent record, which shall state any abnor­\nmalities observed during the test and in the fractured ends. \nSuch records shall be kept for at least 1 year after shipment \nof the production castings and shall be available for exami­\nnation by the purchaser or by his authorized representative. \n7 .4.6 If not covered in the purchase agreement, the \nfrequency of tension testing shall be in accordance with \n7.2.1 and sufficiently often to ensure uniformity of product \nand compliance with minimum test requirements. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0183.json",
  "tabulaTablesCsv": "tables_tabula/page-0183.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0183.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5791,
  "bestTextAlphaRatio": 0.7557
}