{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 630,
  "globalPageIndex": 630,
  "width": 617.52,
  "height": 857.4,
  "text": "SA-369/SA-369M (ASTM A369/A369M) ASME BPVC.II.A-2025 \n3.1.5 Length (Permissible Variations in Length Section of \nSpecification A999/ A999M), \n3.1.6 Verification of tensile and hardness properties at \nmid-thickness for Grade FP91 Type 1 and Type 2 (9.2), \n3.1.7 End finish (13), \n3.1.8 Optional requirements (Sections 8, Supplementary \nRequirements Sl to S7; 13.2), \n3.1.9 Test report required (Certification Section of Specifi­\ncation A999/ A999M), \n3 .1.10 Specification designation, and \n3.1.11 Special requirements or exceptions to this specifica­\ntion. \n4. General Requirements \n4.1 Material furnished under this specification shall con­\nform to the applicable requirements of the current edition of \nSpecification A999/ A999M, unless otherwise provided herein. \n5. Materials and Manufacture \n5.1 Discard: \n5 .1.1 A sufficient discard shall be made from each ingot to \nsecure freedom from injurious defects. The steel shall have a \nhomogeneous structure. \n5.2 Manufacture: \n5.2.1 Material for forging shall consist of ingots or of \nblooms, billets, or solid-rolled bars forged or rolled from an \ningot, and cut to the required length by a process that will not \nproduce injurious defects in the forging. \n5.2.2 The material shall be forged (Note 3) by hammering or \npressing, and shall be brought as nearly as practicable to the \nfinished shape and size by hot working. \nNoTE 3-The cross-sectional area of the solid forging shall have a \nreduction by forging or by rolling and forging from that of the ingot in the \nratio of not less than 3 to 1. \n5.2.3 Unless otherwise specified, the final forging operation \nshall be followed by a treatment suitable to the grade as \nspecified in 5.4. \n5.3 Machining: \n5.3.1 All forgings shall have both the inner and outer \nsurfaces machined. \n5.3.2 After heat treatment, the pipe shall be machined to a \nfinish with a roughness value no greater than 250-µin. [6.4-µm] \narithmetical average deviation (AA), terms as defined in ANSI \nB 46.1-1962, unless otherwise specified. \n5.4 Heat Treatment: \n5.4.1 All pipe of the grades shown in Table 1 other than \nFPA, FPB, FPl, FP2, FP12, FP91 Type 1 and Type 2, FP92, \nand FP115 shall be reheated and furnished in the full-annealed \nor normalized and tempered condition. If furnished in the \nnormalized and tempered condition (Note 4), the temperature \nfor tempering shall be 1250 °F [680 °C] or higher for Grades \nFPS, FP9, FP21, and FP22, and 1200 °F [650 °C] or higher for \nGrades FP36 and FPll. \nNoTE 4-It is recommended that the temperature for tempering should \nbe at least 100 °P [50 °C] above the intended service temperature; \nconsequently, the purchaser should advise the manufacturer if the service \ntemperature is to be over ll00 0 P [600 °C]. \n578 \n5.4.2 Pipe in Grades FPA and FPB as a final heat treatment \nshall be either normalized or shall be given a stress relieving \ntreatment at 1200 to 1300 °F [650 to 705 °C]. Pipe in Grades \nFPl, FP2, and FP12, as a final heat treatment shall be given a \nstress-relieving treatment at 1200 to 1300 °F [650 to 705 °C). \nNoTE 5-Certain of the ferritic steels covered by this specification tend \nto harden if cooled rapidly from above their critical temperature. Some \nwill air harden, that is, become hardened to an undesirable degree when \ncooled in air from high temperatures. Therefore, operations involving \nheating such steels above their critical temperatures, such as welding, \nhot-bending and other forming operations, should be followed by suitable \nheat treatment. \n5.4.3 Except when Supplementary Requirement S6 is speci­\nfied by the purchaser, Grade FP91 Type 1 and Type 2 shall be \nnormalized and tempered by reheating within the temperature \nrange from 1900 to 1975 °F [1040 to 1080 °C), followed by air \ncooling and tempering in the temperature range of 1350 to \n1470 °F [730 to 800 °C). \n5.4.4 Except when Supplementary Requirement S6 is speci­\nfied by the purchaser, Grade FP92 shall be normalized and \ntempered by reheating within the temperature range of 1900 to \n1975 °F [1040 to 1080 °C], followed by air cooling and \ntempering in the temperature range of 1350 to 1470 °F [730 to \n800 °C]. \n5.4.5 Grade FP115 shall be nonnalized and tempered by \nreheating within the temperature range of 1920 to 2010 °F \n[1050 to 1100 °C] and tempered in the range of 1380 to 1455 \n°F [750 to 790 °C]. The rate of cooling at mid thickness from \n1650 to 900 °F [900 to 482 °C] shall be no slower than 9 \n°F/minute [5 °C/minute]. \n5.5 Repair by Welding: \n5.5.1 Weld repair shall be pennitted only subject to the \napproval of the purchaser and in accordance with Specification \nA999/ A999M. \n5.5.2 All repair welds in FP91 shall be made with one of the \nfollowing welding processes and consumables: SMAW, A5.5/ \nA5.5M E90XX-B9; SAW, A5.23/A5.23M EB9 + neutral flux; \nGTAW, A5.28/A5.28M ER90S-B9; and FCAW A5.29/A5.29M \nE91Tl-B9. In addition, the sum of the Ni+ Mn content of all \nwelding consumables used to weld repair FP91 Type 1 and \nType 2 shall not exceed 1.0 %. \n5.5.3 All repair welds in FP92 shall be made using welding \nconsumables meeting the chemical requirements for the grade \nin Table 1. \n5.5.4 After weld repair, Grades FP91 Type 1 and Type 2 and \nFP92 shall be heat treated at 1350-1470 °F [730-800 °C). \n5.5.5 After weld repair, Grades FP115 shall be heat treated \nat 1345 to 1435 °F [730 to 780 °C). \n6. Chemical Composition \n6.1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n7. Heat Analysis \n7.1 An analysis of each heat of steel shall be made by the \nsteel manufacturer to detennine the percentages of the ele­\nments specified. If secondary melting processes are employed, \nthe heat analysis shall be obtained from one remelted ingot or \nthe product of one remelted ingot of each primary melt. The ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0630.json",
  "tabulaTablesCsv": "tables_tabula/page-0630.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0630.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5810,
  "bestTextAlphaRatio": 0.6909,
  "noteOcrPath": "note_ocr/page-0630.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 3—The cross-sectional area of the solid forging shall have a"
  ]
}