{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 601,
  "globalPageIndex": 601,
  "width": 627.36,
  "height": 865.08,
  "text": "ASME BPVC.II.A-2025 SA-352/SA-352M \nthis specification. In case of conflict between the requirements \nof this specification and Specification A 703/ A 703M, this \nspecification shall prevail. \n4. Ordering Information \n4.1 The inquiry and order should include or indicate the \nfollowing: \n4.1.1 A description of the casting by pattern number or \ndrawing (dimensional tolerances shall be included on the \ncasting drawing), \n4.1.2 Grade of steel, \n4.1.3 Options in the specification, and \n4.1.4 The supplementary requirements desired, including \nthe standards of acceptance. \n5. Heat Treatment \n5.1 All castings shall receive a heat treatment proper to their \ndesign and chemical composition. It should be recognized that \nliquid quenching of the forritic grades is normally required to \nmeet the mechanical properties of heavier sections and will \ngreatly enhance the low-temperature properties of thinner \nsections. \n5.2 Fe1Titic castings shall be furnished in the normalized and \ntempered or liquid-quenched and tempered condition, except \nfor Grade LC9, which shall be liquid-quenched and tempered. \nCastings shall be tempered at a minimum of 1100°F [590°C], \nexcept Grade LC4, which shall be 1050°F [565°C], and Grade \nLC9, which shall be tempered in the range of 1050 to ll 75°F \n[565 to 635°C], followed by cooling in air or liquid. \n5.3 CA6NM castings shall be heat-treated by heating to \n1850°F [1010°C] minimum, and air cooling to 200°F [95°C] \nmaximum before any optional intermediate temper, but shall \ncool to 100°F [40°C] maximum before the final temper, which \nshall be between 1050 and 1150°F [565 and 620°C). \n5.4 Castings shall be allowed to cool below the transforma­\ntion range directly after pouring and solidification before they \nare reheated for normalizing or liquid quenching. \n5.5 Temperature Control---Fumace temperature for heat \ntreating shall be controlled by use of pyrometers. \n6. Chemical Composition \n6.1 The steel shall conform to the requirements as to \nchemical composition for the grade ordered as specified in \nTable 1. \n7. Mechanical Requirements \n7.1 Tension Test: \n7 .1.1 Tensile properties of steel used for the castings shall \nconfonn to the requirements specified in Table 1. \n7.2 Impact Test: \n7 .2.1 The notched bar impact properties of the material shall \nbe determined by testing a set of three Charpy V-notch impact \nspecimens for each heat at one of the standard test temperatures \nshown in Table 1, depending on the intended service tempera­\nture (see Appendix XI). The average energy value of the three \nspecimens shall not be less than specified, with not more than \n549 \none value permitted below the average minimum specified and \nno value permitted below the minimum specified for a single \nspecimen. \n7.2.2 The notched bar impact test shall be made in accor­\ndance with Test Methods and Definitions A370. \n7.2.3 Impact test specimens shall be machined to the form \nand dimensions shown in Test Methods and Definitions A370, \nFig. 11. \n8. Quality \n8.1 The surface of the casting shall be examined visually \nand shall be free of adhering sand, scale, cracks, and hot tears. \nOther surface discontinuities shall meet the visual acceptance \nstandards specified in the order. Visual Method SP-55 or other \nvisual standards may be used to define acceptable surface \ndiscontinuities and finish. Unacceptable visual surface discon­\ntinuities shall be removed and their removal verified by visual \nexamination of the resultant cavities. When methods involving \nhigh temperature are used in the removal of discontinuities, \ncastings shall be preheated to at least the minimum tempera­\ntures in Table 2. \n8.2 When additional inspection is desired, Supplementary \nRequirements S4, S5, and SlO, may be ordered. \n8.3 The castings shall not be peened, plugged, or impreg­\nnated to stop leaks. \n9. Repair by Welding \n9.1 Repairs shall be made using procedures and welders in \naccordance with Practice A488/ A488M. \n9.2 Welding of Grade LC9 shall be accomplished using \nnonmagnetic filler material of AWS classification ENiCrFe-2, \nand shall require liquid penetrant inspection of the weld \n(Supplementary Requirement S6) when magnetic particle in­\nspection (Supplementary Requirement S4) is specified for the \ncasting. \n9.3 Weld repairs shall. be inspected to the same quality \nstandards that are used to inspect the castings. When castings \nare produced with Supplementary Requirement S4 specified, \nweld repairs shall be inspected by magnetic particle examina­\ntion to the same standards that are used to inspect the castings. \nWhen castings are produced with Supplementary Requirement \nS5 specified, weld repairs on castings that have leaked on \nhydrostatic tests, or on castings in which the depth of any \ncavity prepared for repair welding exceeds 20 % of the wall \nthickness or 1 in. [25 mm] whichever is smaller, or on castings \nin which any cavity prepared for welding is greater than \napproximately 10 in.2 [65 cm 2 shall be radiographed to the \nsame standards that are used to inspect the castings. \n9.4 Castings containing any repair weld that exceeds 20 % \nof the wall thickness, or 1 in. [25 mm], whichever is smaller, \nor that exceeds approximately 10 in. 2 [65 cm 2 J in area, or that \nwas made to correct hydrostatic test defects shall be stress \nrelieved or heat treated after welding. This mandatory stress \nrelief or heat treatment shall be in accordance with the \nprocedure qualification used. When stress relief is required for \nGrade LC9, cooling shall be in still air. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0601.json",
  "tabulaTablesCsv": "tables_tabula/page-0601.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0601.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5532,
  "bestTextAlphaRatio": 0.7578
}