{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 154,
  "globalPageIndex": 154,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-29/SA-29M ASME BPVC.II.A-2025 \nSpecification for \nGeneral Requirements for Steel Bars, Carbon and Alloy, \nHot-Wrought \n1. Scope \n1.1 This specification covers a group of common require­\nments which, unless otherwise specified in the purchase order \nor in an individual specification, shall apply to carbon and alloy \nsteel bars under each of the following ASTM specifications ( or \nunder any other ASTM specification which invokes this \nspecification or portions thereof): \nTitle of Specification \nHot-Rolled Carbon Steel Bars: \nSteel Bars, Carbon, Quenched and Tempered \nSteel Bars and Shapes, Carbon Rolled from \"T\" Rails \nSteel Bars, Carbon, Merchant Quality, M-Grades \nSteel Bars, Carbon, Hot-Wrought, Special Quality \nSteel Bars, Carbon, Merchant Quality, Mechanical \nProperties \nSteel Bars, Carbon, Hot-Wrought, Special Quality, Me­\nchanical Properties \nSteel Bars for Springs, Carbon and Alloy \nCold-Finished Carbon Steel Bars: \nSteel Bars, Carbon and Alloy, Cold-Finished \nCold-Drawn Stress-Relieved Carbon Steel Bars Sub­\nject to Mechanical Property Requirements \nHot-Rolled Alloy Steel Bars: \nSteel Bars, Alloy, Standard Grades \nCarbon and Alloy Steel Bars Subject to End-Quench \nHardenability Requirements \nSteel Bars, Alloy, Hot-Wrought or Cold-Finished, \nQuenched and Tempered \nSteel Bars, Alloy, Hot-Wrought, for Elevated Tempera­\nture or Pressure-Containing Parts, or Both \nCold-Finished Alloy Steel Bars: \nSteel Bars, Alloy, Hot-Rolled or Cold-Finished, \nQuenched and Tempered \nSteel Bars, Carbon, Hot-Wrought or Cold-Finished, \nSpecial Quality, for Pressure Piping Components \nASTM \nDesignationA \nA321 \nA499 \nA575 \nA576 \nA663/A663M \nA675/A675M \nA689 \nA108 \nA311/A311M \nA322 \nA304 \nA434/A434M \nA739 \nA434/A434M \nA696 \nA These designations refer to the latest issue of the respective specifications, \nwhich appear either in the Annual Book of ASTM Standards, Vol 01.05, or as \nreprints obtainable from ASTM. \n102 \n1.2 In case of any conflict in requirements, the requirements \nof the purchase order, the individual material specification, .and \nthis general specification shall prevail in the sequence named. \n1.3 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. The values stated in \neach system are not necessarily exact equivalents; therefore, to \nensure conformance with the standard, each system shall used \nindependently of the other, and values from the two systems \nshall not be combined. \n1.4 For purposes of determining conformance to this speci­\nfication and the various material specifications referenced in \n1.1, dimensional values shall be rounded to the nearest unit in \nthe right-hand place of figures used in expressing the limiting \nvalues in accordance with the rounding method of Practice \nE29. \nNoTE I-Specification A29/A29M previously listed dimensional toler­\nances for cold-finished bars; these are now found in Specification A108. \nl .5 This standard does not purport to address all of the \nsafety concerns, if any, associated with its use. It is the \nresponsibility of the user of this standard to establish appro­\npriate safety, health, and environmental practices and deter­\nmine the applicability of regulatory limitations prior to use. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA108 Specification for Steel Bar, Carbon and Alloy, Cold­\nFinished \nA304 Specification for Carbon and Alloy Steel Bars Subject \nto End-Quench Hardenability Requirements ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0154.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3784,
  "bestTextAlphaRatio": 0.773
}