{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 300,
  "globalPageIndex": 300,
  "width": 615.84,
  "height": 856.2,
  "text": "SA-194/SA-194M ASME BPVC.11.A-2025 \nSpecification for \nCarbon Steel, Alloy Steel, and Stainless Steel Nuts for Bolts \nfor High Pressure or High Temperature Service, or Both \n1. Scope \n1.1 This specification covers a variety of carbon, alloy, and \nmartensitic stainless steel nuts in the size range ¼ through 4 in. \nand metric M12 through MlO0 nominal. It also covers auste­\nnitic stainless steel nuts in the size range ¼ in. and Ml2 \nnominal and above. These nuts are intended for high-pressure \nor high-temperature service, or both. Grade substitutions with­\nout the purchaser's permission are not allowed. \n1.2 Bars from which the nuts are made shall be hot-wrought. \nThe material may be further processed by centerless grinding \nor by cold drawing. Austenitic stainless steel may be solution \nannealed or annealed and strain-hardened. When annealed and \nstrain hardened austenitic stainless steel is ordered in accor­\ndance with Supplementary Requirement S 1, the purchaser \nshould take special care to ensure that 8.2.2, Supplementary \nRequirement Sl, and Appendix Xl are thoroughly understood. \n1.3 Supplementary requirements of an optional nature are \nprovided. These shall apply only when specified in the inquiry, \ncontract, and order. \n1.4 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the mate­\nrial shall be furnished to inch-pound units. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. Within the text, the SI units are shown in \nbrackets. \n248 \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA153/A153M Specification for Zinc Coating (Hot-Dip) on \nIron and Steel Hardware \nA276/A276M Specification for Stainless Steel Bars and \nShapes \nA320/A320M Specification for Alloy-Steel and Stainless \nSteel Bolting for Low-Temperature Service \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA962/ A962M Specification for Common Requirements for \nBolting Intended for Use at Any Temperature from Cryo­\ngenic to the Creep Range \nB633 Specification for Electrodeposited Coatings of Zinc on \nIron and Steel \nB695 Specification for Coatings of Zinc Mechanically De­\nposited on Iron and Steel \nB696 Specification for Coatings of Cadmium Mechanically \nDeposited \nB766 Specification for Electrodeposited Coatings of Cad­\nmium \nE112 Test Methods for Determining Average Grain Size \nE566 Practice for Electromagnetic (Eddy Current/Magnetic \nInduction) Sorting of Ferrous Metals \nF606/F606M Test Methods for Determining the Mechanical \nProperties of Externally and Internally Threaded \nFasteners, Washers, Direct Tension Indicators, and Rivets ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0300.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3298,
  "bestTextAlphaRatio": 0.7817
}