{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 650,
  "globalPageIndex": 1448,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-941 ASME BPVC.II.A-2025 \nDrscussION-This result is accomplished by a proper balance be­\ntween section size, hardenability, and severity of quench. \nslack quenching, n-the incomplete hardening of a steel \nobject due to quenching from the austenitizing temperature \nat a rate slower than the critical cooling rate for the \nparticular steel composition, resulting in the formation of \none or more transformation products in addition to marten­\nsite. \nsnap temper, n-a precautionary interim stress-relieving treat­\nment applied to a high-hardenability steel immediately after \nquenching to prevent cracking because of delay in temper­\ning it at the prescribed higher temperature. \nsoaking, n-prolonged holding at a selected temperature. \nsolution heat treatment, n-heating a steel object to a suitable \ntemperature, holding it at that temperature long enough to \ncause one or more constituents to enter into solid solution, \nand then cooling it rapidly enough to hold such constituents \nin solution. \nspecified element, n-in steel, an element controlled to a \nspecified minimum, maximum, or range, in accordance with \nthe requirements of the applicable product specification. \nspheroidizing, n-heating and cooling a steel object to pro­\nduce a spheroidal or globular form of carbide in its micro­\nstructure. \nD1scussION-Spheroidizing methods commonly used are the follow­\ning: (1) prolonged holding at a temperature just below Ae 1 ; (2) heating \nand cooling alternately between temperatures that are just above, and \njust below, Ae 1 ; (3) heating to a temperature above Ae 1 or Ae 3 and then \ncooling very slowly in the furnace or holding at a temperature just \nbelow Ae 1 ; (4) cooling, from the minimum temperature at which all \ncarbide is dissolved, at a rate suitable to prevent the reformation of a \ncarbide network, and then reheating in accordance with Method (1) or \n(2) above. (Applicable to hypereutectoid steels containing a carbide \nnetwork.) \nspray quenching, n-quenching in a spray of liquid. \nstabilized stainless steel, n-a stainless steel that conforms to \na specification that prescribes limits (minimum or range) for \nniobium (columbium), tantalum, titanium, or a combination \nthereof. \nD1scussION-Such limits are sometimes expressed as a function of \nthe carbon and nitrogen contents. In an appropriately annealed \ncondition, a stabilized stainless steel will resist sensitization to \nintergranular corrosion associated with the precipitation of chromium \ncarbide at grain boundaries as a result of thermal exposure, such as \nannealing, stress relieving, welding, or high temperature service. \nResistance to sensitization to intergranular corrosion is dependent upon \nthe corrosivity of the environment. The condition of being stabilized \nwith respect to sensitization is frequently demonstrated by passing one \nor more standard corrosion tests for sensitization. \nstabilizing treatment, n-any treatment intended to stabilize \nthe microstructure or dimensions of a steel object. \nstainless steel, n-a steel that conforms to a specification that \nrequires, by mass percent, a minimum chromium content of \n10.5 or more, and a maximum carbon content of less than \n1.20. \nsteel, n-a material that conforms to a specification that \nrequires, by mass percent, more iron than any other element \nand a maximum carbon content of generally less than 2. \nDIScuss10N-The iron content requirement is not normally stated in \nthe specification and is not normally determined by chemical analysis, \nbut is taken to be 100 % minus the sum of the mean values permitted \nby the specification for all other elements having a specified range or a \nspecified maximum. For conformance purposes, this calculated value \nfor iron is compared on an individual basis to the mean values \npermitted by the specification for each of the other elements having a \nspecified range or a specified maximum. Some chromium-containing \nsteels may contain more than 2 % carbon; however, 2 % carbon is \ngenerally considered to be the demarcation between steel and cast iron. \nstrain aging, n-aging induced by cold working. \nstrain hardening, n-an increase in hardness and strength of a \nmetal caused by plastic deformation at temperatures below \nits recrystallization temperature. (Syn. work hardening) \nstress relieving, n-heating a steel object to a suitable \ntemperature, holding it long enough to reduce residual \nstresses, and then cooling it slowly enough to minimize the \ndevelopment of new residual stresses. \nsubcritical annealing, n-annealing at a temperature slightly \nbelow Ac 1 . \nsurface hardening, n-a generic term covering any of several \nprocesses that, by quench hardening only, produce in a \nsteel object a surface layer that is harder or more wear \nresistant than the core. \nDIScussION-There is no significant alteration of the chemical \ncomposition of the surface layer. Where applicable, it is preferred that \nthe following more specific terms be used: induction hardening, flame \nhardening, and shell hardening. \ntemper brittleness, n-brittleness that results when certain \nsteels are held within, or are cooled slowly through, a certain \nrange of temperature below the transformation range. \ntempering, n-reheating a quench hardened or normalized \nsteel object to a temperature below Ac 1 , and then cooling it \nat any desired rate. \ntest record, n-a document or electronic record that contains \nthe observations and derived data obtained by applying a \ngiven test method. \ntest report, n-a document that presents the applicable quali­\ntative or quantitative results obtained by applying one or \nmore given test methods. \nDIScussION-A single document, containing test report information \nand certificate of compliance information, may be used. \nThermal-Mechanical Control Process (TMCP), n-a rolling \nprocess that produces a fine-grained ferritic steel by a \nparticular combination of controls on the manufacturing \nprocess, from slab reheating to post-rolling cooling, thereby \nachieving enhanced mechanical properties. \nD1scuss10N-(TMCP) requires appropriate selection of chemical \ncomposition and accurate control of steel temperature and rolling \nreduction. \nthermochemical treatment, n-a heat treatment carried out \nin a medium suitably chosen to produce a change in the \nchemical composition of the steel object by exchange with \nthe medium. \n1386 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1448.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6358,
  "bestTextAlphaRatio": 0.8006
}