{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 611,
  "globalPageIndex": 611,
  "width": 645.48,
  "height": 879.72,
  "text": "ASME BPVC.II.A-2025 SA-354 \nF1470 Practice for Fastener Sampling for Specified Me­\nchanical Properties and Performance Inspection \nF1789 Terminology for F16 Mechanical Fasteners \nF2329 Specification for Zinc Coating, Hot-Dip, Require­\nments for Application to Carbon and Alloy Steel Bolts, \nScrews, Washers, Nuts, and Special Threaded Fasteners \n2.2 ASME Standards: \nB 1.1 Unified Screw Threads \nB18.2.1 Square and Hex Bolts and Screws, Inch Series \nB18.24 Part Identifying Number (PIN) Code System Stan-\ndard for B 18 Fastener Products \n3. Ordering Information \n3.1 Orders for bolts and studs (including nuts and accesso-\nries) under this specification shall include the following: \n3.1.1 ASTM designation and year of issue, \n3.1.2 Name of product (that is, bolt or stud), \n3.1.3 Grade (that is, BC or BD), \n3.1.4 Quantities (number of pieces by size, including nuts), \n3.1.5 Size and length, \n3.1.6 Washers-Specify quantity and size (separate from \nbolts) (4.3), \n3.1.7 Zinc Coating-When zinc-coated Grade BC fasteners \nare required, specify the zinc-coating process required, for \nexample hot-dip, mechanically deposited, or no preference (see \n4.4). \n3.1.8 Other Finishes-Specify other protective finish, if \nrequired. \n3.1.9 Specify if inspection at point of manufacture is \nrequired, \n3.1.10 Specify if Certification (Section 14) is required, and \n3.1.11 Specify additional testing (Section 9) or special \nrequirements. \n3.1.12 For establishment of a part identifying system, see \nASME Bl8.24. \n4. Materials and Manufacture \n4.1 The steel shall be made by the open-hearth, electric­\nfumace, or basic-oxygen process. \n4.2 All fasteners shall be heat-treated. At the option of the \nmanufacturer, heat treatment may be performed on the raw \nmaterial, during the manufacturing operations, or after final \nmachining. Heat treatment shall consist of quenching in a \nliquid medium (except Grade BD sizes l ½in.and smaller shall \nbe quenched in oil) from above the transformation temperature \nand then temperating by reheating to a temperature of not less \nthan 800°F (427°C) for Grade BC and for Grade BD. \n4.3 When used, suitable hardened washers shall be \nquenched and tempered (non-carburized) in accordance with \nSpecification F436. \n4.4 Zinc Coatings, Hot-Dip and Mechanically Deposited: \n4.4.1 When zinc-coated fasteners are required, the pur­\nchaser shall specify the zinc coating process, for example, \nhot-dip, mechanically deposited, or no preference. \n4.4.2 When \"hot-dip\" is specified, the fasteners shall be zinc \ncoated by the hot-dip process in accordance with the require­\nments of Specification F2329. \n4.4.3 When mechanically deposited is specified, the fasten­\ners shall be zinc-coated by the mechanical-deposition process \nin accordance with the requirements of Class 55 of Specifica­\ntion B695. \n4.4.4 When no preference is specified, the supplier may \nfurnish either a hot-dip zinc coating in accordance with \nSpecification F2329, or a mechanically deposited zinc coating \nin accordance with Specification B695, Class 55. Threaded \ncomponents (bolts and nuts) shall be coated by the same \nzinc-coating process and the supplier's option is limited to one \nprocess per item with no mixed processes in a lot. \nNorn 3-When the intended application requires that assembled \ntension exceeds 50 % of minimum bolt proof load, an anti-galling \nlubricant may be needed. Application of such a lubricant to nuts and a test \nof the lubricant efficiency are provided in Supplementary Requirement Sl \nof Specification A563 and should be specified when required. \n4.5 Zinc-coated bolts and nuts shall be shipped in the san1e \ncontainer unless specifically requested otherwise by the pur­\nchaser. \nNoTE 4-Research conducted on bolts of similar material and manu­\nfacture indicates that hydrogen-stress cracking or stress cracking corrosion \nmay occur on hot-dip galvanized Grade BD bolts. \n5. Chemical Composition \n5. I All fasteners shall be made from alloy steel conforming \nto the chemical composition requirements in accordance with \nTable 1. The steel shall contain sufficient alloying elements to \nqualify it as an alloy steel. \n559 \nNoTE 5-Steel is considered to be alloy, by the Ametican Iron and Steel \nInstitute, when the maximum of the range given for the content of alloying \nelements exceeds one or more of the following limits: manganese, 1.65 %; \nsilicon, 0.60 %; copper, 0.60 %; or in which a definite range or a definite \nminimum quantity of any of the following elements is specified or \nrequired within the limits of the recognized field of constructional alloy \nsteels: aluminum, chromium np to 3.99 %, cobalt, columbium, \nmolybdenum, nickel, titanium, tungsten, vanadium, zirconium, or any \nother alloying elements added to obtain a desired alloying effect. \n5.2 Product analysis may be made by the purchaser from \nfinished material representing each lot of fasteners. The chemi­\ncal composition thus determined shall conform to the require­\nments given in Table 1. Choice of alloy steel composition \nnecessary to ensure meeting the specified mechanical require­\nments shall be made by the manufacturer and shall be reported \nto the purchaser for information purposes only. \n5.3 Application of heats of steel to which bismuth, \nselenium, tellurium, or lead has been intentionally added shall \nnot be permitted. \n5 .4 Chemical analyses shall be performed in accordance \nwith Test Methods, Practices, and Terminology A751. \n6. Mechanical Properties \n6.1 Fasteners shall not exceed the maximum hardness speci­\nfied in Table 2. Fasteners less than three diameters in length \nand studs less than four diameters in length shall have hardness ",
  "words": [],
  "tableCount": 0,
  "noteCount": 3,
  "tabulaTablesPath": "tables_tabula/page-0611.json",
  "tabulaTablesCsv": "tables_tabula/page-0611.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0611.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5647,
  "bestTextAlphaRatio": 0.761
}