{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 184,
  "globalPageIndex": 982,
  "width": 632.52,
  "height": 808.08,
  "text": "SA-522/SA-522M ASME BPVC.II.A-2025 \n11. Method of Impact Testing \n11.1 The impact test shall be made in accordance with \nthe simple beam, Charpy type of test described in the latest \nissue of Test Methods and Definitions A 370. \n11.2 Precaution shall be taken so that when broken, \nthe test specimens shall be within ± 3°F [l.7°C] of the \nspecified test temperature. \n12. Inspection \n12.1 The inspector representing the purchaser shall \nhave free entry, at all times while work on the contract \nof the purchaser is being performed, to all parts of the \nmanufacturer's works that concern the manufacture of the \nmaterial ordered. The manufacturer shall afford the inspec­\ntor all reasonable facilities to satisfy the inspector that \nthe material is being furnished in accordance with this \nspecification. All tests (except product analysis) and \ninspection shall be made at the place of manufacture prior \nto shipment, unless otherwise specified, and shall be con­\nducted so as not to interfere unnecessarily with the opera­\ntion of the works. \n12.2 The manufacturer shall report to the purchaser or \nthe purchaser's representative the heat treatments applied \nto the material and to the test blocks and the results of the \nchemical analysis and mechanical tests made in accordance \nwith this specification and the heat number or his heat \nidentification. \n13. Rejection \n13.1 Unless otherwise specified, any rejection based \non tests made in accordance with Section 5 and 7 shall be \nincluding the impact test temperature, and test coupon \nstress relief details if applicable, \n14.1.4 Results of any additional or supplementary \nrequirements specified by the purchaser, and \n14.1.5 The year date and revision letter, if any, of \nthe specification. Note, this information is not required to \nbe marked on the forgings. \n15. Product Marking \n15.1 Each forging shall be legibly stamped by the man­\nufacturer with the heat number or his heat identification, \nthe manufacturer's name (see Note 1) or trademark, and \nthis specification number, A 522 or A 522M as applicable, \n8Nl, or 9NI, and QT or NNT as applicable. \nNOTE 1 - For purposes of identification marking, the manufacturer \nis considered the organization that certifies the piping component was \nmanufactured, sampled, and tested in accordance with this specification \nand the results have been determined to meet the requirements of this \nspecification. \n15.2 Forgings impact tested at a temperature other than \nthat specified in Table 3, by the use of Supplementary \nRequirement S2, shall be marked with the letters LTV \nfollowing the specification number, as well as the tempera­\nture scale used. For forgings to A 522, these letters shall \nbe followed by the impact test temperature in degrees \nFahrenheit. A prefix 0 to the test temperature indicates a \ntemperature below 0°F, for example A 522 Type 1 \nLTV0300F indicates -300°F. For forgings to A 522M, the \nletters LTV shall be followed by the impact test tempera­\nture in degrees Celsius. A prefix 0 to the test temperature \nindicates a temperature below 0°C, for example A 522M \nType 1 LTV0150C indicates -150°C. \nreported to the manufacturer within 60 days from the 15.3 The purchaser may specify additional identifica-\nreceipt of samples or test reports by the purchaser. tion marking and the location of all stamping. The type of \n13.2 Each forgingJtLlYhlchJnjurious-m~tal-de-feets--are~~~tamp~-s~aU-be-f0u~d0r--'-'interrupted-ctlot'-'-drestamps nav- -~-------\nexposed during subsequent machining shall be rejected and mg a radms of ~2 m. [0.8 mm]. \nthe manufacturer notified. \n14. Certification \n14.1 Test reports, when required, shall include certifi­\ncation that all requirements of this specification have been \nmet. The manufacturer shall provide the following where \napplicable: \n14.1.1 Whether Type 1 or Type 11 material has been \nsupplied and the chemical analysis results in accordance \nwith Section 5, \n14.1.2 Type of heat treatment used, \n14.1.3 Results of tension and Charpy impact tests \n(together with absorbed energy and % shear fracture) \n882 \n15.4 Bar Coding - In addition to the requirements in \n15.1, 15.2, and 15.3, bar coding is acceptable as a supple­\nmental identification method. The purchaser may specify \nin the order a specific bar coding system to be used. The \nbar coding system, if applied at the discretion of the sup­\nplier, should be consistent with one of the published indus­\ntry standards for bar coding. If used on small parts, the \nbar code may be applied to the box or a substantially \napplied tag. \n16. Keywords \n16.1 low temperature applications; nickel alloy steel; \npipe fittings; steel; piping applications; pressure containing \nparts; steel flanges; steel forgings; alloy; steel valves ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0982.json",
  "tabulaTablesCsv": "tables_tabula/page-0982.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0982.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4749,
  "bestTextAlphaRatio": 0.7574
}