{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 272,
  "globalPageIndex": 272,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-182/SA-182M (ASTM A182/A182M) ASME BPVC.11.A-2025 \nTABLE2 Continued \nGrade/ldentifi- UNS Composition, % \ncation Desig- Carbon Manga- Phos- Sulfur Silicon Nickel Chromium Molybde- Niobium 8 1itan- Other Symbol nation nese phorus num ium Elements \nF 60 832205 0.030 2.00 0.030 0.020 1.00 4.5-6.5 22.0-23.0 3.0-3.5 N 0.14-0.20 \nF 61 832550 0.040 1.50 0.040 0.030 1.00 4.5-6.5 24.0-27.0 2.9-3.9 Cu 1.50-2.50 \nN 0.10-0.25 \nF 65 832906 0.030 0.80-1.50 0.030 0.030 0.80 5.8-7.5 28.0-30.0 1.5-2.6 Cu 0.80 \nN 0.30-0.40 \nF 66 832202 0.030 2.00 0.040 0.010 1.00 1.00-2.80 21.5-24.0 0.45 N 0.18-0.26 \nF 67 832506 0.030 1.00 0.040 0.015 0.90 5.5-7.2 24.0-26.0 3.0-3.5 N 0.08-0.20 \nW 0.05-0.30 \nF 68 832304 0.030 2.50 0.040 0.030 1.00 3.0-5.5 21.5-24.5 0.05-0.60 N 0.05-0.20 \nCu 0.05-0.60 \nF 71 832808 0.030 1.10 0.030 0.010 0.50 7.0-8.2 27.0-27.9 0.80-1.2 N 0.30-0.40 \nW 2.10-2.50 \nA All values are maximum unless otherwise stated. Where ellipses( ... ) appear in this table, there is no requirement and analysis for the element need not be determined \nor reported. \n8 Niobium and columbium are interchangeable names for the same element and both names are acceptable for use in A01.22 specifications. \nc Grade F 2 was formerly assigned to the 1 % chromium, 0.5 % molybdenum grade which is now Grade F 12. • \n0 The present grade F 5a (0.25 max carbon) previous to 1955 was assigned the identification symbol F 5. Identification symbol F 5 in 1955 was assigned to the 0.15 max \ncarbon grade to be consistent with ASTM specifications for other products such as pipe, tubing, bolting, welding fittings, and the like. \n\"Applies to both heat and product analyses. \nF For Grade F 22V, rare earth metals (REM) may be added in place of calcium, subject to agreement between the producer and the purchaser. In that case the total amount \nof REM shall be determined and reported. \n0 The ratio of Titanium to Nitrogen shall be ee 3.5. Alternatively, in lieu of this ratio limit, Grade F 23 shall have a minimum hardness of 275 HV (26 HRC, 258 HBW) in \nthe hardened condition (see 3.2.1). Hardness testing shall be performed in accordance with 9.6.3, and the hardness testing results shall be reported on the material test \nreport (see 18.2.5). \nH Grade F XM-27Cb shall have a nickel plus copper content of 0.50 max%. Product analysis tolerance over the maximum specified limit for carbon and nitrogen shall be \n0.002 %. \n'Grade F 316Ti shall have a titanium content not less than five times the carbon plus nitrogen content and not more than 0.70 %. \nJ Grade F 321 shall have a titanium content of not less than five times the carbon plus nitrogen content and not more than 0.70 %. \nKGrade F 321H shall have a titanium content of not less than four times the carbon plus nitrogen content and not more than 0.70 %. \nL Grades F 347 and F 348 shall have a niobium (columbium) content of not less than ten times the carbon content and not more than 1.1 O %. \nMGrades F 347H and F 348H shall have a niobium (columbium) content of not less than eight times the carbon content and not more than 1.10 %. \nN Grade F 347LN, Grade F 347LNCuB, and Grade F 317LNCb shall have a niobium (columbium) content of not less than 15 times the carbon content. \n0 % Cr+ 3.3 x % (Mo+½ W) + 16 x % N = 41 min. \nPChromium Nickel Balance is defined as CNB = (Cr+6Si+4Mo+1.5W+11V+5Nb+9Ti+12AI)- (40C+30N+4Ni+2Mn+1Cu). \n0 Al + Ti shall be 0.85 % min: 1.20 % max. \nR The method of analysis for nitrogen shall be a matter of agreement between purchaser and manufacturer. \nparts, or parts with thick cross-sectional areas where ¼ T x T \ntesting (see 9.3) is not practical. Sketches showing the exact \ntest locations shall be approved by the purchaser when this \nmethod is used. \n9.3.2 Metal Buffers-The required distances from heat­\ntreated surfaces may be obtained with metal buffers instead of \nintegral extensions. Buffer material may be carbon or low-alloy \nsteel, and shall be joined to the forging with a partial \npenetration weld that seals the buffered surface. Specimens \nshall be located at V2-in. [13-mm] minimum from the buffered \nsurface of the forging. Buffers shall be removed and the welded \nareas subjected to magnetic particle test to ensure freedom \nfrom cracks unless the welded areas are completely removed \nby subsequent machining. \n9 .4 For annealed low alloy steels, ferritic stainless steels, \nand martensitic stainless steels, and also for austenitic and \nferritic-austenitic stainless steels, the test specimen may be \ntaken from any convenient location. \n9.5 Tension Tests: \n9.5.l Low Alloy Steels and Ferritic and Martensitic Stain­\nless Steels-One tension test shall be made for each heat in \neach heat treatment charge. \n9.5.1.1 When the heat-treating cycles are the same and the \nfurnaces (either batch or continuous type) are controlled within \n±25 °F [ ± 14 °C] and equipped with recording pyrometers so \nthat complete records of heat treatment are available, then only \none tension test from each heat of each forging type (see Note \n1) and section size is required, instead of one test from each \nheat in each heat-treatment charge. \nNoTE !-\"Type\" in this case is used to describe the forging shape such \nas a flange, ell, tee, and the like. \n9.5.2 Austenitic and Ferritic-Austenitic Stainless Steel \nGrades-One tension test shall be made for each heat. \n9.5.2.1 When heat treated in accordance with 7.1, the test \nblank or forging used to provide the test specimen shall be heat \ntreated with a finished forged product. \n9.5.2.2 When the alternative method in 7.3.1 is used, the test \nblank or forging used to provide the test specimen shall be \nforged and quenched under the same processing conditions as \nthe forgings they represent. \n220 \n9.5.3 Testing shall be performed as specified in Specifica­\ntion A961/A961M using the largest feasible of the round \nspecimens. \n9.6 Hardness Tests: \n9.6.1 Except when only one forging is produced, a m1m­\nmum of two pieces per batch or continuous run as defined in \n9.6.2 shall be hardness tested as specified in Specification \nA961/A961M to ensure that the forgings are within the \nhardness limits given for each grade in Table 3. The purchaser ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0272.json",
  "tabulaTablesCsv": "tables_tabula/page-0272.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0272.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6173,
  "bestTextAlphaRatio": 0.664,
  "noteOcrPath": "note_ocr/page-0272.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 1—“Type” in this case is used to describe the forging shape such"
  ]
}