{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 621,
  "globalPageIndex": 621,
  "width": 632.28,
  "height": 868.92,
  "text": "ASME BPVC.II.A-2025 SA-358/SA-358M \n2.2 ASME Boiler and Pressure Vessel Code: \nSection II \nSection III \nSection VIII \nSection IX \n2.3 A WS Specifications: \nA5.4/A5.4M Stainless Steel Electrodes for Shielded Metal \nArc Welding \nA5.9/A5.9M Bare Stainless Steel Welding Electrodes and \nRods \nA5.ll/A5.11M Nickel and Nickel-Alloy Welding Electrodes \nfor Shielded Metal Arc Welding \nA5 .14/ A5. l 4M Nickel and Nickel-Alloy Bare Welding Elec­\ntrodes and Rods \nA5.22/A5.22M Stainless Steel Flux Cored and Metal Cored \nWelding Electrodes and Rods \nA5.30/A5.30M Consumable Inserts \n2.4 Other Standard: \nSAE J1086 Practice for Numbering Metals and Alloys \n(UNS) \n3. Terminology \n3.1 Definitions: \n3.1.1 The definitions in Specification A999/A999M and \nTerminology A941 are applicable to this specification. \n4. Ordering Information \n4.1 It shall be the responsibility of the purchaser to specify \nall requirements that are necessary for product under this \nspecification. Such requirements to be considered include, but \nare not limited to, the following: \n4.1.1 Quantity (feet, metres, or number of lengths), \n4.1.2 Name of material (electric-fusion-welded pipe), \n4.1.3 Grade (Table 1), \n4.1.4 Class (see 1.3), \n4.1.5 Size (outside diameter and nominal wall thickness), \n4.1.6 Length (specific or random), \n4.1.7 End finish (Section on Ends of Specification A999/ \nA999M), \n4.1.8 Authorization for repair of plate defects by welding \nand subsequent heat treatment without prior approval if such is \nintended (see 9.3), \n4.1.9 Specification designation, \n4.1.10 Special requirements, \n4.1.11 Statement invoking requirements of 16.4 if such is \nintended. \n4.1.12 Circumferential weld permissibility (see Section 16), \n4.1.13 Supplementary Requirements (Sl through SS), \n4.1.14 Applicable ASME Code if known, \n4.1.15 For ASME Code Section III applications, the service \nclassification intended, and \n4.1.16 Certification requirements (see Section on Certifica­\ntion of Specification A999/A999M). \n5. General Requirements \n5.1 Material furnished to this specification shall conform to \nthe applicable requirements of the current edition of Specifi­\ncation A999/ A999M unless otherwise provided herein. \n6. Materials and Manufacture \n6.1 Materials: \n6.1.1 The steel plate material shall conform to the require­\nments of one of the grades of Specification A240/ A240M, \nlisted in Table 1, except as provided in 6.3.2.3. \n6.2 Welding: \n6.2.1 The joints shall be full penetration double-welded or \nsingle-welded butt joints employing fusion welding processes \nas defined under \"Definitions,\" ASME Boiler and Pressure \nVessel Code, Section IX. This specification malces no provision \nfor any difference in weld quality requirements regardless of \nthe weld joint type employed (single or double) in making the \nweld. Where backing rings or strips are employed, the ring or \nstrip material shall be of the same P-Number (Table QW-422 \nof Section IX) as the plate being joined. Backing rings or strips \nshall be completely removed after welding, prior to any \nrequired radiography, and the exposed weld surface shall be \nexamined visually for conformance to the requirements of \n6.2.3. Welds made by procedures employing backing strips or \nrings that remain in place are prohibited. Welding procedures, \nand welding operators shall be qualified· in accordance with \nASME Boiler and Pressure Vessel Code, Section IX. \n6.2.2 Except as provided in 6.2.2.1 and 6.2.2.2, welds shall \nbe made in their entirety by processes involving the deposition \nof filler metal. \n6.2.2.1 For Class 4 pipe employing multiple passes, the \nroot-pass may be without the addition of filler metal. \n6.2.2.2 For Class 4 pipe, the weld surface exposed inside the \npipe may result from a single pass made from the inside of the \npipe without the addition of filler metal. \n6.2.2.3 All single-welded pipe shall be completely radio­\ngraphed. \n6.2.3 The weld surface on either side of the weld is \npermitted to be flush with the base plate or to have a reasonably \nuniform crown, not to exceed 1/s in. [3 mm]. It is pemritted at \nthe option of the manufacturer or by agreement between the \nmanufacturer and purchaser to remove any weld reinforce­\nment. The contour of the reinforcement should be reasonably \nsmooth and free from irregularities. The deposited metal shall \nbe fused uniformly into the plate surface. No concavity of \ncontour is permitted unless the resulting thickness of weld \nmetal is equal to or greater than the minimum thickness of the \nadjacent base metal. \n569 \n6.2.4 Weld defects shall be repaired by removal to sound \nmetal and rewelding. Subsequent heat treatment and examina­\ntion (that is, visual, radiographic, and dye penetrant) shall be as \nrequired on the original welds. \n6.3 Heat Treatment: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0621.json",
  "tabulaTablesCsv": "tables_tabula/page-0621.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0621.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4775,
  "bestTextAlphaRatio": 0.7374
}