{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 794,
  "globalPageIndex": 794,
  "width": 648.72,
  "height": 882.36,
  "text": "SA-450/SA-450M ASME BPVC.II.A-2025 \nfluid to leak through the tube wall and may be either visually \nseen or detected by a loss of pressure. This test may not detect \nvery tight, through-the-wall defects or defects that extend an \nappreciable distance into the wall without complete penetra­\ntion. \n26.2.6 A purchaser interested in ascertaining the nature \n(type, size, location, and orientation) of discontinuities that can \nbe detected in the specific application of these examinations \nshould discuss this with the manufacturer of the tubular \nproducts. \n26.3 Time of Examination-Nondestructive examination for \nspecification acceptance shall be performed after all deforma­\ntion processing, heat treating, welding, and straightening op­\nerations. This requirement does not preclude additional testing \nat earlier stages in the processing. \n26.4 Surface Condition: \n26.4.1 All surfaces shall be free of scale, dirt, grease, paint, \nor other foreign material that could interfere with interpretation \nof test results. The methods used for cleaning and preparing the \nsurfaces for examination shall not be detrimental to the base \nmetal or the surface finish. \n26.4.2 Excessive surface roughness or deep scratches can \nproduce signals that interfere with the test. \n26.5 Extent of Examination: \n26.5.l The relative motion of the tube and the transducer(s), \ncoil(s), or sensor(s) shall be such that the entire tube smiace is \nscanned, except for end effects as noted in 26.5.2. \n26.5.2 The existence of end effects is recognized, and the \nextent of such effects shall be determined by the manufacturer, \nand, if requested, shall be reported to the purchaser. Other \nnondestructive tests may be applied to the end areas, subject to \nagreement between the purchaser and the manufacturer. \n26.6 Operator Qualifications: \n26.6.1 The test unit operator shall be certified in accordance \nwith SNT-TC-lA, or an equivalent documented standard \nagreeable to both purchaser and manufacturer. \n26.7 Test Conditions: \n26.7.1 For examination by the ultrasonic method, the mini­\nmum nominal transducer frequency shall be 2.0 MHz, and the \nmaximum transducer size shall be 1.5 in. [38 mm]. \n26.7.2 For eddy current testing, the excitation coil fre­\nquency shall be chosen to ensure adequate penetration, yet \nprovide good signal-to-noise ratio. \n26.7.2.1 The maximum coil frequency shall be: \nSpecified Wall Thickness \n<0.050 in. \n0.050 to 0.150 \n>0.150 \n26.8 Reference Standards: \nMaximum Frequency \n100 KHz \n50 \n10 \n26.8.1 Reference standards of convenient length shall be \nprepared from a length of tube of the same grade, specified size \n(outside diameter and wall thickness), surface finish and heat \ntreatment condition as the tubing to be examined. \n26.8.2 For eddy current testing, the reference standard shall \ncontain, at the option of the manufacturer, any one of the \nfollowing discontinuities: \n26.8.2.1 Drilled Hole-The reference standard shall contain \nthree or more holes, equally spaced circumferentially around \nthe tube and longitudinally separated by a sufficient distance to \nallow distinct identification of the signal from each hole. The \nholes shall be drilled radially and completely through the tube \nwall, with care being taken to avoid distortion of the tube while \ndrilling. The holes shall not be larger than 0.031 in. [0.8 mm] \nin diameter. As an alternative, the producer may choose to drill \none hole and run the calibration standard through the test coil \nthree times, rotating the tube approximately 120° each time. \nMore passes with smaller angular increments may be used, \nprovided testing of the full 360° of the coil is obtained. For \nwelded tubing, if the weld is visible, one of the multiple holes \nor the single hole shall be drilled in the weld. \n26.8.2.2 Transverse Tangential Notch-Using a round tool \nor file with a ¼ in. [6.4 mm] diameter, a notch shall be milled \nor filed tangential to the surface and transverse to the longitu­\ndinal axis of the tube. Said notch shall have a depth not \nexceeding 12½ % of the specified wall thickness of the tube or \n0.004 in. [0.1 mm], whichever is greater. \n26.8.2.3 Longitudinal Notch-A notch 0.031 in. [0.8 mm] or \nless in width shall be machined in a radial plane parallel to the \ntube axis on the outside surface of the tube, to have a depth not \nexceeding 12½ % of the specified wall thickness of the tube or \n0.004 in. [0.1 mm], whichever is greater. The length of the \nnotch shall be compatible with the testing method. \n26.8.3 For ultrasonic testing, the reference ID and OD \nnotches shall be any one of the three common notch shapes \nshown in Practice E213, at the option of the manufacturer. The \ndepth of the notches shall not exceed 12½ % of the specified \nwall thickness of the tube or 0.004 in. [0.1 mm], whichever is \ngreater. The width of the notch shall not exceed two times the \ndepth. For welded tubing, the notches shall be placed in the \nweld, if the weld is visible. \n26.8.4 For flux leakage testing, the longitudinal reference \nnotches shall be straight-sided notches machined in a radial \nplane parallel to the tube axis on the inside and outside surfaces \nof the tube. Notch depth shall not exceed 12½ % of the \nspecified wall thickness or 0.004 in. [0.1 mm], whichever is \ngreater. Notch length shall not exceed 1 in. [25.4 mm], and the \nwidth shall not exceed the depth. Outside and inside notches \nshall have sufficient separation to allow distinct identification \nof the signal from each notch. \n744 \n26.8.5 More or smaller reference discontinuities, or both, \nmay be used by agreement between the purchaser and the \nmanufacturer. \n26.9 Standardization Procedure: \n26.9.1 The test apparatus shall be standardized at the \nbeginning and end of each series of tubes of the same specified \nsize (diameter and wall thickness), grade and heat treatment \ncondition, and at intervals not exceeding 4 h during the \nexamination of such tubing. More frequent standardizations \nmay be performed at the manufacturer's option or may be \nrequired upon agreement between the purchaser and the \nmanufacturer. \n26.9.2 The test apparatus shall also be standardized after \nany change in test system settings, change of operator, equip­\nment repair, or intem1ption due to power loss or shutdown. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0794.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6275,
  "bestTextAlphaRatio": 0.7517
}