{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 53,
  "globalPageIndex": 53,
  "width": 638.76,
  "height": 813.24,
  "text": "ASME BPVC.II.A-2025 \nSTATEMENT OF POLICY ON THE USE OF ASME MATERIAL (2s) \nSPECI Fl CATIONS \nThe ASME material specifications in Section II, Part A or \nSection II, Part B shall be used when ordering, producing, \nand certifying materials for ASME BPV Code construction. \nThe use of a specification not in Section II, Part A or Sec­\ntion II, Part B is acceptable only when it is referenced in \nan approved Code Case. \nA complete list of ASME material specifications can be \nfound in Mandatory Appendix II, Tables II-200-1 and II-\n200-2. Since the body of ASME material specifications \ndoes not originate with the Section II committee, at times \nwording may be found that differs from ASME BPV Code \nrequirements. This Statement of Policy outlines the Sec­\ntion II committee's position on the following: \n(a) Scope. Some specifications contain statements in the \nScope about the service temperatures for listed alloys. \nOthers contain statements that restrict alloy application \nto a particular component (e.g., heat exchangers, conden­\nsers). Such statements are to be viewed as guidance in the \ncorresponding ASME material specification. Alloys ap­\nproved for ASME BPV Code construction are restricted \nby maximum design temperatures stipulated in Section \nII, Part D, and any stipulations of the individual construc­\ntion Codes. \n(b) Units. Specifications often designate one system of \nunits as the standard for the specification with conver­\nsions of the other being cited as for information only. \nCompliance and acceptance for the purposes of Code \nusage is not governed by this. Section II, Part D has a \nU.S. Customary volume and an SI volume for mechanical \nand physical properties of all materials approved for Code \nconstruction. \n(c) References. References to other material specifica­\ntions within the text often carry the original title given \nto it by the parent organization. The following are two \nexamples: \n(1) From 2021 Edition of Section II, Part A, SA-203 \n4.1 Steelmaking Practice ~ The steel shall be killed and shall conform \nto the fine grain size requirement of Specification A20/A20M. \n1 \n(2) From 2021 Edition of Section II, Part B, SB-98/ \nSB-98M \n9.1 Refer to the appropriate paragraphs in Specification B249/B249M \nwith particular reference to the following tables. \nSuch references shall be interpreted as referring to the \ncorresponding ASME material specification. If no corre­\nsponding ASME specification exists, then the user is \nbound to the latest edition of the cited specification. \n(d} Ordering Information. The Ordering Information \nsection of some specifications state that furnishing test \nreports and certification is optional. This is not valid for \nASME BPVC. When alloys are purchased for use in ASME \nconstruction, test reports and certifications shall be furn­\nished to the purchaser. \n(e] Listed Alloys. To be used for Code construction, any \nalloy listed in a specification shall also have allowable \nstress values or mechanical property values, as appropri­\nate, in the ASME BPV Code. Though exceptions exist, these \nvalues are typically found in Section II, Part D or a Code \nCase for most Code-approved materials. \n(fJ Table Notes. Table notes are mandatory. \n(g) Main Body Notes. Notes within the main body of the \ntext are for information only. \n(h) Terminology. If a specification contains a term that \nhas not been defined in the ASME BPV Code, then it is ac­\nceptable to refer to the term's definition set forth by the \ncorresponding standard's organization (see Mandatory \nAppendix II, II-200 for information on how to identify \nthe organization). \nMaterial produced to an acceptable material specifica­\ntion is not limited to country of origin. Before the material \nis ordered, it is the responsibility of the user to ensure \nthat the intended construction Code permits materials \ncertified to the desired specification. \nWith the exception of ASTM International, ASME has \nnot entered into copyright agreements with publishers \nof material specifications. Limits on usage appear on the \nspecification's cover sheets. For sources from which an of­\nficial English-language version of a specification can be \npurchased, see Nonmandatory Appendix A. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0053.json",
  "tabulaTablesCsv": "tables_tabula/page-0053.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0053.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4208,
  "bestTextAlphaRatio": 0.7859
}