{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 499,
  "globalPageIndex": 499,
  "width": 597.72,
  "height": 842.88,
  "text": "ASME BPVC.II.A-2025 SA-311/SA-311M \n5. Ordering Information \n5.1 Orders for material under this specification should \ninclude the following information as required to adequately \ndescribe the desired material: \n5.1.1 Quantity (weight [mass] or number of pieces), \n5.1.2 Name of material (carbon steel bars, cold \ndrawn, stress relieved), \n5.1.3 Condition 8.3, \n5.1.4 Cross-sectional shape, \n5.1.5 Size, \n5.1.6 Length, \n5.1.7 Class and grade, \n5.1.8 Report of heat analysis, tensile properties Sec-\ntion 11, \n5.1.9 Specification designation A 311 or A 31 lM, \n5.1.10 Application, \n5.1.11 DELETED \n5.1.12 Supplementary requirements, if any, and \n5.1.13 Additional requirements, if any. \nNOTE 1 - A typical ordering description is as follows: 10000 lb carbon \nsteel bars, cold drawn, stress relieved turned and polished, ronnd 2.0 in. \n(50.8 mm) Diameter, 10 to 12 ft (3048 to 3658 mm) long, Class B, . \nGrade 1050, (UNS Gl0500), fine grain, test reports required, ASTM \nA 311/A 311M dated __ , hyclraulic cylinder piston rods. [5000 kg \ncarbon steel bars, cold clrawn, stress relieved turned and polished round \n50 mm diameter, 3050 to 3650 mm long, Class B, Grade 1050 (UNS \nG 10500), fine grain, test reports required, ASTM A 31 lM dated __ , \nhyc\\raulic cylinder piston rods.] \n6. Materials and Manufacture \n6.1 Melting Practice - The steel shall be made by one \nor more of the following primary processes: open-hearth, \nbasic-oxygen, or electric-furnace. The primary melting \nmay incorporate separate degassing or refining and may \nbe followed by secondary melting using electroslag remelt­\ning or vacuum arc remelting. Where secondary melting is \nemployed, the heat shall be defined as all of the ingots \nremelted from a single primary heat. \n6.2 Cold Working: \n6.2.1 Class A bars shall be cold drawn using normal \ndrafting practices. \n6.2.2 Class B bars shall be cold drawn using heavy \n(higher than normal) drafting practices. \n6.3 Thermal Treatment - After cold drawing, the bars \nshall be stress relieved at a temperature of not less than \n550°F [288°C] to meet the mechanical requirements speci­\nfied in Table 2. \n6.4 Condition - The bars shall be furnished in the \nfollowing cold finish conditions, as specified: \n6.4.1 Cold drawn, stress relieved; \n6.4.2 Cold drawn, stress relieved, turned, and pol­\nished; \n6.4.3 Cold drawn, stress relieved, turned, ground, \nand polished; and \n6.4.4 Cold drawn, stress relieved, ground, and pol­\nished. \nNOTE 2 - When turned bars are specified, turning may be perfonned \nprior to cold-drawing. \n7. Chemical Composition \n7.1 Composition -The cast or heat analysis shall con­\nform to the chemical composition requirements specified \nin Table 1 for the grade ordered. \n8. Mechanical Properties \n8.1 Requirements - The bars shall conform to the \nrequirements listed in Table 2. \n8.2 Number of Tests - At least one tension test shall \nbe made on each lot. A lot shall consist of bars of the same \nsize from the same heat which have been stress relieved \nin the same stationary furnace charge. For continuous type \nof treatment, a lot shall consist of 25 tons [25 Mg] or less \nof the same size of each heat, treated in the same cycle. \n8.3 Specimens - Tension test specimens shall be taken \nlongitudinally in accordance with and from the locations \nspecified in Test Methods and Definitions A 370. \n8.4 Test Methods - Tension tests shall be made in \naccordance with Test Methods and Definitions A 370. The \nyield strength shall be determined at 0.2% offset or at \n0.005 in.Jin. [0.005 mm/mm] of gage length, total extension \nunder load. \n9. Workmanship, Finish, and Appearance \n9.1 Suiface Finish - Unless otherwise specified, the \nbars shall have a commercial bright smooth surface finish \nconsistent with the cold finishing operations specified in \n6.4. \n9.2 Bars that are thermal treated after cold finishing \nmay have a discolored or oxidized surface. \n9.3 Oiling - The bars shall be given a surface coating \nof oil or other rust inhibitor to protect against rust during \nshipment. \n447 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 2,
  "tabulaTablesPath": "tables_tabula/page-0499.json",
  "tabulaTablesCsv": "tables_tabula/page-0499.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0499.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4031,
  "bestTextAlphaRatio": 0.7142
}