{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 402,
  "globalPageIndex": 1200,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-672/SA-672M ASME BPVC.II.A-2025 \n11.2.4 Thickness-The minimwn wall thickness at any point \nin the pipe shall not be more than 0.01 in. [0.3 mm] under the \nspecified nominal thickness. \n11.3 Circumferential welded joints of the same quality as \nthe longitudinal joints shall be permitted by agreement between \nthe manufacturer and the purchaser. \n11.4 Lengths with unmachined ends shall be within -0, \n+½ in. [-0, + 13 mm] of that specified. Lengths with machined \nends shall be as agreed upon between the manufacturer and the \npurchaser. \n12. Workmanship, Finish, and Appearance \n12.1 The finished pipe shall be free of injurious defects and \nshall have a workmanlike finish. This requirement is to mean \nthe same as the identical requirement that appears in Specifi­\ncation A20/ A20M with respect to steel plate surface finish. \n13. Product Marking \n13.1 In addition to the marking provision of Specification \nA530/A530M, class marking in accordance with 1.3.3 shall \nfollow the grade marking; for example, C 70-10. \n13.2 Bar Coding-In addition to the requirements in 13.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall be applied only when specified by \nthe purchaser in the inquiry, contract, or order. Details of these supplementary requirements shall be \nagreed upon in writing by the manufacturer and purchaser. Supplementary requirements shall in no \nway negate any requirement of the specification itself. \nSl. Tension and Bend Tests \nS 1.1 Tension tests in accordance with 8.1 and bend tests in \naccordance with 8.2 shall be made on specimens representing \neach length of pipe. \nS2. Charpy V-Notch Test (For pipe with nominal wall \nthickness of½ in. [13 mm] and greater) \nS2.1 Requirements-The acceptable test energies shall be as \nshown in Table Al.15 of Specification A20/A20M for the \napplicable plate specification unless otherwise stated in the \norder. As an alternative, the test temperature may be 10 °F [-12 \noc]. \nS2.2 Number of Specimens-Bach test shall consist of at \nleast three specimens. \nS2.2.1 One base-metal test shall be made from one pipe \nlength per heat, per heat-treat charge, and per nominal wall \nthickness. For pipe from Classes 10, 11, 12, and 13, one base \nmetal test shall be made per heat per size and per wall \nthickness. \nS2.2.2 One weld-metal and one heat-affected zone (HAZ) \nmetal test shall be made in accordance with NB 4335 of \nSection III of the ASME Boiler and Pressure Vessel Code. \nS2.3 Test Specimen Location and Orientation: \nS2.3.1 Base-metal specimens of stress-relieved, normalized, \nand normalized and tempered pipe shall be taken in accordance \nwith the provisions for tension specimens in the body of this \nspecification. \nS2.3.2 Base-metal specimens of quenched and tempered \npipe shall be taken in accordance with the provisions of NB \n2225 of Section III of the ASME Boiler and Pressure Vessel \nCode. \nS3. Hardness Test \nS3.1 Hardness measurements in accordance with Test Meth­\nods and Definitions A370 or Test Method B110 shall be made \nacross the welded joint at both ends of each length of pipe. The \nmaximum acceptable hardness shall be as agreed upon between \nthe manufacturer and the purchaser. \nS4. Product Analysis \nS4.1 Product analyses in accordance with 7 .1 shall be made \non each 500 ft [150 m] of pipe or fraction thereof or \nalternatively, on each length of pipe as designated in the order. \nSS. Metallography \nS5.1 The manufacturer shall furnish one photomicrograph \nto show the microstructure of 1 OOx magnification of the weld \nmetal or base metal of the pipe in the as-finished condition. The \npurchaser shall state in the order: the material, base metal or \nweld, and the nwnber and locations of tests to be made. This \ntest is for information only. \nS6. Magnetic Particle Examination of Base Metal \nS6.1 All accessible surfaces of the pipe shall be examined in \naccordance with Methods B109 or B138. Accessible is defined \nas: All outside surfaces, all inside surfaces of pipe 24 in. [600 \nmm] in diameter and greater, and inside surfaces of pipe less \nthan 24 in. [600 mm] in diameter for a distance of one pipe \ndiameter from the ends. \nS6.2 Acceptance Standards-The following relevant indi­\ncations are unacceptable: \nS6.2.1 Any linear indications greater than 1/16 in. [1 mm] \nlong for materials less than 5/s in. [16 mm] thick; greater than \n1/s in. [3 mm] long for materials 5/s in. [16 mm] thick to under \n1110 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1200.json",
  "tabulaTablesCsv": "tables_tabula/page-1200.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1200.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4597,
  "bestTextAlphaRatio": 0.7442
}