{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 587,
  "globalPageIndex": 587,
  "width": 622.44,
  "height": 861.36,
  "text": "ASME BPVC.II.A-2025 SA-350/SA-350M (ASTM A350/A350M) \nA 5.5. For Grade LF6, the electrodes shall be low-hydrogen, \nE-X:X:15, E-XX16, or E-XX18 complying with AWS A 5.1 or \nA 5.5, as applicable. \n11.3.4 After repair welding, the area welded shall be com­\npletely free of defects as verified by magnetic particle or liquid \npenetrant inspection. \n11.3.5 Forgings repair welded in the normalized, normal­\nized and tempered, or the quenched and tempered conditions \nshall be stress-relieved after repair welding at 1100 °F [590 °C] \nminimum, but not higher than the temperature previously used \nfor tempering the base metal of the same forging, or shall be \nreheat treated in accordance with 5.4. \n11.3.6 When the purchaser specifies Supplementary Re­\nquirement S5, the same requirements shall apply to the weld \nprocedure qualification tests. \n11.3.7 Repair by welding shall not exceed 10 % of the \nsurface area of the forging or 33 1/3 % of the wall thickness of \nthe finished forging, or % in. [9.5 mm], whichever is less, \nwithout prior approval of the purchaser. \n11.3.8 When approval of the purchaser is obtained, the \nlimitations set forth in 11.3.7 may be exceeded, but all other \nrequirements of 11.3 shall apply. \n12. Inspection \n12.1 Inspection provisions of Specification A961/A961M \nshall apply. \n13. Rejection and Rehearing \n13 .1 Purchaser shall comply with provisions of Specifica­\ntion A961/A961M. \n14. Certification \n14.1 In addition to the requirements of Specification A961/ \nA961M, test reports shall be furnished to the purchaser or his \nrepresentative. Test reports shall provide the following where \napplicable: \n14.1.1 Type heat treatment, Section 5, \n14.1.2 Chemical analysis results, Section 6 (Table 1), re­\nported results shall be to the same number of significant figures \nas the limits specified in Table 1 for that element, \n14.1.3 Product analysis results, 6.2 (Table 1), \n14.1.4 Tensile property results, Section 7 (Table 2) report \nthe yield strength and ultimate strength, in ksi [MPa], elonga­\ntion and reduction in area, in percent, \n14.1.5 Impact test results, 7.2 (Table 3, Table 4, Table 5, and \nTable 6), \n14.1.6 Hardness results, 7.3.1, and \n14.1.7 Any supplementary testing required by the purchase \norder. \n15. Product Marking \n15.1 In addition to the marking requirements of Specifica­\ntion A961/A961M, the following additional requirements shall \napply: \n15.1.1 If the forgings have been quenched and tempered or \nquenched-and-precipitation heat treated, the letters QT shall be \nstamped on the forgings following the ASTM designation. \n15.1.2 Forgings repaired by welding shall be marked with \nthe letter W following the ASTM designation. \n15.1.3 If identification stamps are objectionable and detri­\nmental to the forging, and when so stated on the purchase \norder, the marks may be painted or stenciled on the forging, or \nstamped on a metal or plastic tag which shall be securely \nattached to the forging. \n535 \n15.1.4 Additional marks shall be used as necessary to \nidentify the part with the test report. \n15.1.5 If the test temperature is other than the standard \ntemperature specified in Table 4, the mark shall also include \nthe suffix letter S to the grade and class and the test tempera­\nture. A prefix 0 to the test temperature shall indicate a less than \n0 °F [-18 °C] value. For example, LF2S 0175 denotes a test \ntemperature of -175 °F [-115 °C] for an LF2 part .. \n15.1.6 Parts meeting all requirements for more than one \nclass may be marked with more than one class such as LF2 \nCL1/C12; LF5 CL1/CL2, and so forth. \n15.2 Bar Coding-In addition to the requirements in 15.1, \nbar coding is acceptable as a supplemental identification \nmethod. The purchaser may specify in the order a specific bar \ncoding system to be used. The bar coding system, if applied at \nthe discretion of the supplier, should be consistent with one of \nthe published industry standards for bar coding. If used on \nsmall parts, the bar code may be applied to the box or a \nsubstantially applied tag. \n16. Keywords \n16.1 carbon equivalent; pipe fittings, steel; piping applica­\ntions; pressure containing parts; steel flanges; steel forgings, \nalloy; steel forgings, carbon; steel valves; temperature service \napplications, low ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0587.json",
  "tabulaTablesCsv": "tables_tabula/page-0587.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0587.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4259,
  "bestTextAlphaRatio": 0.7211
}