{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 151,
  "globalPageIndex": 151,
  "width": 623.28,
  "height": 800.52,
  "text": "ASME BPVC.II.A-2025 SA-20/SA-20M \nX2. VARIATION OF TENSILE PROPERTIES IN PLATE-AS-ROLLED \nX2.1 The tension requirements of this general requirements \nspecification are intended only to characterize the tensile \nproperties of a plate-as-rolled for determination of confor­\nmance to the requirements of the applicable product specifica­\ntions. Such testing procedures are not intended to define the \nupper or lower limits of tensile properties at all possible test \nlocations within a plate-as-rolled. It is well known and docu­\nmented that tensile properties vary within a plate-as-rolled or \nindividual piece of steel as a function of chemical composition, \nprocessing, testing procedure, and other factors. It is, therefore, \nincumbent on designers and engineers to use sound engineer­\ning judgement when using tension test results shown on mill \ntest reports. The testing procedures of this general require­\nments specification have been found to provide plate adequate \nfor normal pressure vessel design criteria. \nX2.2 A survey of the variation to be expected in tensile \nproperties obtained from plates and strnctural shapes was \nconducted by the American Iron and Steel Institute (AISI). \nThe results of this survey are contained in a Contributions to \nthe Metallurgy of Steel entitled \"The Variation of Product \nAnalysis and Tensile Properties-Carbon Steel Plates, and \nWide Flange Shapes\" (SU/18, SU/19, and SU/20), published in \nSeptember 197 4. The data are presented in tables of probability \nthat tensile properties at other than the official location may \ndiffer from those of the reported test location. \nX2.3 This general requirements specification contains no \nrequirements applicable to product tension tests; conformance \nto the applicable product specification is determined on the \nbasis of tests performed at the place of manufacture or \nprocessing prior to shipment, unless otherwise specified. \nX2.4 A Task Group of ASTM Subcommittee AOl.11 has \ndetermined, based on review of the AISI data (SU20), that the \nvariation in tensile properties within a plate-as-rolled can be \nexpressed as a function of specified requirements; one standard \ndeviation equals approximately 3 % of required tensile \nstrength, 5 % of required yield strength, and 3 percentage \npoints of required elongation. \nX3. VARIATION IN CHARPY V-NOTCH TESTS \nX3. l A survey of the variation to be expected in Charpy \nV-Notch test results obtained from three common fine grain \nplate steels was conducted by the American Iron and Steel \nInstitute (AISI). 7 The results of the survey are contained in a \nContributions to the Metallurgy of Steel entitled, \"The Varia­\ntions of Charpy V-Notch Impact Test Properties in Steel \nPlates,\" (SU/24), published January 1979. The survey data \nconsists of test values obtained from six locations in addition to \nthe locations specified in 12.1.3 of this specification. The plate \nconditions tested involved as-rolled, normalized, and quench \nand tempered. Sufficient full-size specimens were taken from \neach sample so that three longitudinal and three transverse \nspecimens could be broken at three test temperatures defined \nfor each grade. The data is presented in tables of probability \nthat impact properties at other than the official location which \nmay differ from those of the reported test location. Additional \ndata of the same type, but utilizing samples from thicker plates, \nwas published by AISI as SU/27. \nX4. RADIUS FOR COLD BENDING \nX4. l Suggested minimum inside bend radii for cold form­\ning are referenced to group Designations A through F as \ndefined in Table X4.1. The suggested radii listed in Table X4.2 \nshould be used as minimums in typical shop fabrication. \nMaterial that does not form satisfactorily when fabricated in \naccordance with Table X4.2 may be subject to rejection \npending negotiation with the steel supplier. When tighter bends \nare required, the manufacturer should be consulted. \nX4.2 The bend radius and the radius of the male die should \nbe as liberal as the finished part will permit. The width across \nthe shoulders of the female die should be at least 8 times the \nplate thickness. Higher strength steels require larger die open­\nings. The surface of the dies in the area of radius should be \nsmooth. \n99 \nX4.3 Since cracks in cold bending commonly originate \nfrom the outside edges, shear burrs and gas cut edges should be \nremoved by grinding. Sharp corners on edges and on punched \nor gas cut holes should be removed by chamfering or grinding \nto a radius. \nX4.4 If possible, parts should be formed such that the bend \nline is perpendicular to the direction of final rolling. If it is \nnecessary to bend with the bend line parallel to the direction of \nfinal rolling, a more generous radius is suggested (11/2 times \napplicable value given in Table X4.2 for bend lines perpen­\ndicular to the direction of rolling). \nX4.5 References \nX4.5.1 Both of these references are available from Ameri­\ncan Iron and Steel Institute (AISI): ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0151.json",
  "tabulaTablesCsv": "tables_tabula/page-0151.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0151.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5007,
  "bestTextAlphaRatio": 0.7869
}