{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 130,
  "globalPageIndex": 130,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-20/SA-Z0M ASME BPVC.II.A-2025 \nminimum value, and if the average of the three specimens \nequals or exceeds the specified minimum value, a retest of \nthree additional specimens may be made. Each of the three \nretest specimens shall equal or exceed the specified minimum \nvalue. \n16.2.3 If the required values are not obtained on Charpy \nV-notch retests as specified in 16.2.1 and 16.2.2, or if the \nvalues in the initial test are below the values required for retest, \nno further retests are permitted unless the plate is heat treated \nor reheat treated. After heat treatment or reheat treatment, a set \nof three specimens shall be tested and each shall equal or \nexceed the specified minimum value. \n16.2.4 If the option of 12.1.4.1 is used and the test result \nfalls below the 7 5 ft- lbf [ 100 J] minimum specified, another test \nmay be made using full-size test specimens. \n17. Retreatment \n17 .1 If any heat-treated plate fails to meet the mechanical \nrequirements of the applicable product specification, the manu­\nfacturer or processor shall have have the option of heat treating \nthe plate again. All mechanical-property tests shall be repeated \nand the plate surface shall be reexamined for surface defects \nwhen it is resubmitted for inspection. \n18. Rejection \n18.1 Any rejection based upon product analysis made in \naccordance with the applicable product specification shall be \nreported to the supplier and samples that represent the rejected \nplate shall be preserved for 2 weeks from the date of notifica­\ntion of such rejection. In case of dissatisfaction with the results \nof the tests, the supplier shall have the option of making claim \nfor a rehearing within that time. \n18.2 Plates that show injurious defects subsequent to their \nacceptance at the manufacturer's or processor's works may be \nrejected. In such cases, the manufacturer or processor shall be \nnotified. \n19. Test Reports \n19.1 The manufacturer or processor shall report the results \nof all tests required by the applicable product specification, the \napplicable supplementary requirements, and the purchase or­\nder. The heat number, the plate identifier of the plate tested, and \nthe nominal plate thickness shall be shown on the test report. \nThe year-date of the specification to which the plates are \nfurnished shall be included in the test report. \n19.1.1 In reporting elongation values, both the percentage \nincrease and the original gage length shall be stated. \n19.2 For plates rolled from a strand-cast slab with a reduc­\ntion ratio in the range from 2.0: 1 to 3.0: 1, exclusive, the \nspecific practices (see 5.3.4 and 5.3.6) that were used by the \nmanufacturer shall be reported, and the test reports shall state \nthat the limitations of 5.3 have been met. \n19.3 All heat treatment, exclusive of subcritical heating to \nsoften thermally cut edges, shall be reported, including tem­\nperature ranges and times at temperature. This exclusion does \nnot apply to those plates with specified minimum tensile \nstrengths of 95 ksi [655 MPa] or higher, unless such subcritical \n78 \nheating is accomplished at temperatures at least 75°F [40°C] \nbelow the minimum tempering temperature. The reports shall \nstate whether the plates only, the test coupons only, or both \nplates and test coupons were heat treated. \n19 .4 If Charpy V-notch tests are specified, the test specimen \nsize used shall be reported. \n19.5 If so specified in the purchaser order, the manufacturer \nshall also furnish a certificate of compliance stating that the \nplates have been manufactured, inspected, and tested in accor­\ndance with the requirements of the applicable product specifi­\ncation. For plates produced from coil, the processor shall \nfurnish the required certification. \n19.6 For plates produced from coil and furnished without \nheat treatment or with stress relieving only, the results of all \ntests required by 11.1.2 shall be reported for each qualifying \ncoil. \n19.7 Plates that are required to be heat treated, but have not \nbeen so heat treated, shall be certified by the responsible \nmanufacturer on the basis of tests made on heat treated \ncoupons and such tests shall be made and reported. For plates \nwhere the heat treatment of the coupons consists of quench and \ntempering, the manufacturer or processor responsible for the \nheat treatment of the plate shall repeat any required mechanical \ntests after plate heat treatment and they shall be the basis for \nfinal certification of the plate. \n19.8 A signature is not required on the test report; however, \nthe document shall clearly identify the organization submitting \nthe report. Notwithstanding the absence of a signature, the \norganization submitting the report is responsible for the content \nof the report. \n19.9 Copies of the original manufacturer's test report shall \nbe included with any subsequent test report. \n19 .10 A test report, certificate of compliance, or similar \ndocument printed from or used in electronic form from an \nelectronic data interchange (EDI) transmission shall be re­\ngarded as having the same validity as a counterpart printed in \nthe certifier's facility. The content of the EDI transmitted \ndocument must meet the requirements of the invoked ASTM \nstandard(s) and conform to any existing EDI agreement be­\ntween the purchaser and the supplier. Notwithstanding the \nabsence of a signature, the organization submitting the EDI \ntransmission is responsible for the content of the report. \n20. Packaging, Marking, and Loading for Shipment \n20.1 Packaging, marking, and loading for shipment shallbe \nin accordance with those procedures recommended by Guide \nA700. \n20.2 For USA Government Procurement-Marking for ship­\nment of material for civil agencies shall be in accordance with \nFed. Std. No. 123. \n21. Keywords \n21.1 general delivery requirement; pressure containing \nparts; pressure vessel steels; steel plates; steel plates for \npressure vessel applications ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0130.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5932,
  "bestTextAlphaRatio": 0.7763
}