{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 544,
  "globalPageIndex": 1342,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-788/SA-788M ASME BPVC.II.A-2025 \nSl. Residual Elements \nS 1.1 Small quantities of certain unspecified elements may \nbe present in carbon and low alloy steel forgings. These \nelements are considered as incidental and may be present to the \nfollowing maximum amounts: \nCopper \nNickel \nChromium \nMolybdenum \nVanadiumA \nA Unless Supplementary Requirement S2 is required. \nS2. Unspecified Elements \n0.35 % \n0.30 % \n0.25 % \n0.10% \n0.03 % \nS2.1 Vanadium used for grain refinement or deoxidation \nshall not exceed 0.08 %. \nS3. Sequential or Continuous Strand Casting \nS3.1 When multiple heats of the same chemical composi­\ntion range are sequentially strand cast, the heats shall be \nseparated by an established procedure such that intermix \nmaterial will not be supplied. \nS4. Intercritical Heat Treatment \nS4.1 The austenitizing stage in the heat treatment of ferritic \nforgings is intended to be done at suitable temperatures above \nthe upper critical temperature (Ac 3 ) for the heat of steel \ninvolved, that is, full austenitization. However, when multiple \naustenitizing stages are used the temperature for the last may \nbe set between the upper (Ac 3 ) and lower (Ac 1 ) critical \ntemperature for partial austenitizing. Such cycles shall be \nfollowed by tempering within the temperature limits required \nby the material specification. \nSS, Straightening of Forgings \nS5.1 Unless otherwise specified by Supplementary Require­\n• ment S6, straightening of forgings after heat treatment for \n• • . properties shall be performed at a temperature which is not \nmore than 100°F [55°C] below the final tempering tempera­\n. ture. Following straightening, forgings shall be stress relieved \n• at a temperature of 50 to 100°F [30 to 55°C] below the final \ntempering temperature and shall be reported on the material \n. test report. Any straightening performed before heat treatment \n• for properties does not require an intermediate stress-relief heat \ntreatment. \nS6. Post-Heat Treatment Straightening of Forgings \nS6.1 Straightening after heat treatment for specified proper­\nties is not permitted without prior approval by the purchaser. \nS7. Fracture Toughness Test \nS7 .1 The purchaser shall specify one or more of the follow­\ning test methods for fracture toughness determination. Re­\nquired information including test temperature, conditioning, \nenvironment, and acceptance criteria shall be provided as \nnecessary. \nS7 .2 Determination of the plane strain fracture toughness in \naccordance with Test Method E399. \nS7 .3 Fracture toughness determination in accordance with \nTest Method B1820. \nS7.4 Crack-tip opening displacement determination in ac­\ncordance with Test Method B1290. \nSS. Vacuum Degassing \nS8.1 The vacuum degassing requirements of 5.2 shall apply. \nS9. Vacuum Carbon Deoxidation \nS9.1 The molten steel shall be vacuum carbon deoxidized \n(VCD) during processing, in which case the silicon content \nshall be 0.10 % maximum. \nSlO. Restricted Phosphorus and Sulfur, Levels A or B \nS 10.1 For level A, the phosphorus and sulfur levels shall be \nlimited as follows: \nHeat Product \nLevel A P 0.Q15 % maximum 0.018 % maximum \nS 0.018 % maximum 0.021 % maximum \nSl0.2 For level B, the phosphorus and sulfur levels shall be \nlimited to the following: \nLevel B p \ns \nHeat Product \n0.012 % maximum 0.015% maximum \n0.015% maximum 0.Q18 % maximum \nSll. Restricted Copper, Levels A or B \nS 11.1 For level A, the heat and product analyses limits for \ncopper shall be 0.15 % maximum. \nSll.2 For level B, the heat and product analyses limits for \ncopper shall be 0.10 % maximum. \nS12. Tension Specimens for Hobbed Flat Heads and Tube \nSheets \nSl2.1 For hubbed tube sheets and flat heads to be used in \nASME Boiler and Pressure Vessel Code construction, an axial \ntension specimen shall be taken as close as possible to the hub \nand either inboard or outboard of it, using a sub size specimen \nif necessary. The longitudinal axis of the specimen shall be \nparallel to the length of the hub, as shown in Fig. S12.1. \nS12.2 By agreement with the purchaser, this test orientation \nmay replace a specified tension test specimen, provided that \nother location criteria are met. \nS13. Charpy Impact Tests \nSl3.l Charpy impact tests shall be made. The number, \norientation and location of the tests shall be specified along \nwith the test temperature and the applicable acceptance criteria \nfor absorbed energy, fracture appearance, lateral expansion, or \nboth. \nS13.2 The specimens shall be machined and tested in \naccordance with Test Methods and Definitions A370 or Test \nMethods A1058 in accordance with the purchase order. \nS14. Charpy V Notch Impact Transition Curve \nS 14.1 Sufficient impact tests shall be made from the forging \nmaterial to establish a transition temperature curve based upon \none or several of the following criteria: \nSl4.l.1 Absorbed energy (ft•lbf [J]) (See Test Methods E23 \nor, if required by the purchase order, Test Methods A1058), \n1280 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1342.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4961,
  "bestTextAlphaRatio": 0.7513
}