{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 282,
  "globalPageIndex": 1080,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-568/SA-568M (ASTM A568/A568M) ASME BPVC.II.A-2025 \nWidth, in. \nAll WidthsA,a \nWidth, mm \nAll WidthsA,a \nThickness, in. \nThrough 0.142 \nThickness, mm \nThrough 4.0 \nA Cold-rolled sheet coils and cut lengths, slit from wider coils with cut edge (only) \nand in thicknesses through 0.142 in. [4.0 mm] carbon 0.25 % maximum by cast \nanalysis. \n8 When no special edge or finish (other than matte, commercial bright, or luster \nfinish) or single strand rolling of widths, or both under 24 in. [600 mm] is not \nspecified or required. \n(2) Cold-rolled high-strength low-alloy sheet is commonly \nclassified by size as follows: \nWidth, in. \nThrough 12 A \nOver 12 8 \nWidth, mm \nTo 300, inclA \nOver300 8 \nThickness, in. \n0.D19 through 0.082 \n0.020 and over \nThickness, mm \n0.5 to 2.0, incl \n0.5 and Over \nA Cold-rolled sheet coils and cut lengths, slit from wider coils with cut edge (only) \nand in thicknesses 0.019 in. [0.5 mm] through 0.082 in. [2.0 mm] carbon 0.25 % \nmaximum by cast analysis. \n8 When no special edge or finish (other than matte, commercial bright, or luster \nfinish) or single strand rolling of widths, or both under 24 in. [600 mm] is not \nspecified or required. \n3.1.6.1 Discussion-Steel products are available in various \nthickness, width, and length combinations depending upon \nequipment and processing capabilities of various manufactur­\ners and processors. Historic limitations of a product based upon \ndimensions (thickness, width, and length) do not take into \naccount current production and processing capabilities. To \nqualify any product for a particular product specification \nrequires all appropriate and necessary tests be performed and \nthat the results meet the limits prescribed in that product \nspecification. If the necessary tests required by a product \nspecification cannot be conducted, the product cannot be \nqualified to that specification. This general requirements speci­\nfication contains permitted variations for the commonly avail­\nable sizes. Permitted variations for other sizes are subject to \nagreement between the customer and the manufacturer or \nprocessor, whichever is applicable. \n3.1.7 retests, n-additional test, or tests, made from the \noriginal material when the original test did not meet the \nappropriate acceptance criteria required by a product specifi­\ncation and the failure was mechauical in natures as described in \nSection 11. \n3.1.8 resample, n-additional test or tests made when the \ntest on the original sample did not meet the appropriate \nacceptance criteria required by the product specification, but \npossibly requiring that the material in question have an \nappropriate amount discarded prior to securing the new sample \nor samples. \n3.1.9 steel manufacturer, n-the orgauization that directly \ncontrols or is responsible for the melting and refining of steel \nand the conversion of that steel into semifinished steel products \nknown as slabs either through continuous casting, conventional \nor compact methods, or ingot casting and subsequent conver­\nsion of the ingots to slabs, and for one or more additional \noperations such as testing, marking, loading for shipment, and \ncertification. \n3.1.10 coil processor, n-the orgauization that directly con­\ntrols or is responsible for operations involved in processing the \ncoil such as leveling, cutting to length, testing, inspection, \nblanking, slitting, pickling, cold rolling (cold reduction), heat \ntreating, temper rolling, coating, packaging, marking, loading \nfor shipment, and certification. \n3 .1.10.1 Discussion-The processing operations need not be \ncontrolled by the orgauization that hot rolls the slab into a coil. \nIf only one organization controls or is responsible for (or both) \nthe hot-rolling and processing operations, that organization is \ntermed the manufacturer. If more than one organization con­\ntrols or is responsible for (or both) hot-rolling and processing \noperations, the organization that controls and is responsible for \nthe hot-rolling is termed the hot roll manufacturer and the \norganization or organizations controlling and responsible for \nthe processing operations is/are termed the processor or pro­\ncessors. Likewise, one organization may be the manufacturer \nof the hot roll coil and another the manufacturer of the cold roll \ncoil. In such case, the orgauization responsible for the conver­\nsion of the hot roll coil to a cold roll coil and other processing \noperations will also be termed the cold roll manufacturer and \norganizations performing additional processing operations to \nthe cold roll coil will be termed the coil processor or coil \nprocessors. \n3.1.11 hot roll manufacturer, n-the organization that di­\nrectly controls or is responsible for the conversion of steel \nslabs, by hot-rolling into coils, and for one or more additional \noperations such as leveling, cutting to length, testing, \ninspection, blanking, slitting, pickling, cold rolling, heat \ntreating, coating, packaging, marking, loading for shipment, \nand certification. \n3.1.12 cold roll manufacturer, n-the orgauization that di­\nrectly controls or is responsible for the conversion of hot roll \ncoils into cold roll coils, and for one or more additional \noperations such as pickling, annealing, temper rolling, slitting, \ncutting to length, testing, inspection, blanking, coating, \npackaging, marking, loading for shipment, and certification. \n3.2 Refer to Terminology A941 for additional definitions of \nterms used in this standard. \n4. Materials and Manufacture \n980 \n4.1 Unless otherwise specified, hot-rolled material shall be \nfurnished hot-rolled, not annealed, not pickled. \n4.2 Coil breaks, stretcher strains, and fluting can occur \nduring the user's processing of hot-rolled or hot-rolled pickled \nsheet. When any of these features are detrimental to the \napplication, the manufacturer shall be notified at time of \nordering in order to properly process the sheet. \n4.3 Cold-rolled carbon steel sheet is available as discussed \nin 10.2, 10.3, and in Table 1. \n4.4 Unless specified as a full-hard product, cold-rolled sheet \nis annealed after being cold reduced to thickness. The \nannealed, cold-rolled sheet can be used as annealed last (dead \nsoft) for unexposed end-use applications. When cold-rolled \nsheet is used for unexposed applications and coil breaks are a \nhazard in uncoiling, it may be necessary to further process the \nmaterial. In this case the manufacturer should be consulted. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1080.json",
  "tabulaTablesCsv": "tables_tabula/page-1080.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1080.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6444,
  "bestTextAlphaRatio": 0.7709
}