{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 86,
  "globalPageIndex": 884,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-4 79 /SA-4 79M ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nThe following may be made requirements when the purchaser specifies them to be applicable. \nSt. Materials for High-temperature Service \nSl.1 Unless an H grade has been ordered, this supplemen­\ntary requirement shall be specified for ASME Code applica­\ntions for service above 1000 °F [540 °C]. \nSl.2 The user is permitted to use an austenitic stainless steel \nas the corresponding H grade when the material meets all \nrequirements of the H grade including chemistry, annealing \ntemperature, and grain size (see Section 6). \nSl.3 The user is permitted to use an L grade austenitic \nstainless steel for service above 1000 °F [540 °C], subject to \nthe applicable allowable stress table of the ASME Code, when \nthe material meets all requirements of this specification and the \ngrain size is ASTM No. 7 or coarser as determined in \naccordance with Test Methods El12. The grain size shall be \nreported on a Certified Test Report. \nS2. Corrosion Tests \nS2.1 Intergranular corrosion tests shall be performed by the \nmanufacturer on sensitized specimens of Types 304L, 316L, \n321, 347, and 348, and for the other austenitic grades, on \nspecimens representative of the as-shipped condition. All \naustenitic stainless steels shall be capable of passing inter­\ngranular corrosion tests in the as-shipped condition. Tests shall \nbe performed in accordance with Practice E of Practices A262. \nS3. Product Analysis \nS3.1 An analysis shall be made by the manufacturer on a \nsample from one bar in each lot as defined in Specification \nA484/A484M. The analysis shall meet the requirements of \nTable 1. In the event of failure, the lot represented shall be \nrejected except that, at the option of the manufacturer, each bar \nin the lot may be tested for acceptance. Product analysis \ntolerance provisions do not apply. \nS4. Material for High Cycle Fatigue Service \nS4.1 The mechanical properties of bars furnished in lengths \nunder 20 ft [6 m] shall be determined by testing one end of \neach bar. Bars furnished in lengths of 20 ft [6 m] and over shall \nbe tested at each end. \nS5. Material for Optimum Resistance to Stress Corrosion \nCracking \nS5.1 This supplementary requirement is to be referenced \nwhen austenitic stainless steels are to be purchased with \nsolution-annealing as the final operation and with no subse­\nquent cold drawing permitted. Straightening is permitted as a \nfinal operation to meet the straightness requirements of Speci­\nfication A484/A484M unless specifically prohibited by the \npurchaser. \nS6. Demonstration of the Abse.nce of Detrimental Interme­\ntallic Phase in Austenitic and Austenitic-Ferritic (Du­\nplex) Grades \nS6.1 This supplementary requirement is to be referenced \nwhen the austenitic or duplex stainless steels are to be \npurchased with testing to demonstrate the absence of detrimen­\ntal intermetallic phases that can have negative effects on \nmechanical properties or corrosion resistance of the material. \nThe test method(s), reporting requirements, and acceptance \ncriteria shall be agreed upon by the manufacturer and purchaser \nin the purchase agreement. \nAPPENDIX \n(Nonmandatory Information) \nXl. RATIONALE REGARDING DE]flNITION OF SOLUTION ANNEALING \nXl. 1 It is generally recognized that austenitic stainless \nsteels are solution annealed by heating to a temperature that \ndissolves (takes into solution) chromium carbides and quench­\ning rapidly so that the chromium carbides will not precipitate \nin the . grain boundaries, which could cause susceptibility to \nintergranular corrosion in a critically corrosive environment. \nThus, solution annealing also can be accomplished for non­\nstabilized grades by taking advantage of hot rolling tempera­\ntures (which always exceed solution annealing temperature \nrequirements), maintaining hot rolling finishing temperatures \nwell above minimum solution annealing requirements, and \nimmediately quenching integral with hot rolling. Stabilized \ngrades (with columbium or titanium added) cannot be handled \n782 \nthis way, since they would become destabilized due to colum­\nbium or titanium carbide solution, without subsequent reheat­\ning. \nXl.2 For Boiler Code applications involving temperatures \nat which optimum resistance to creep is desired, the larger \ngrain size of material solution annealed by reheating is \ngenerally desired. For that reason, a minimum grain size has \nbeen required of the H grades ( created for optimum elevated \ntemperature properties), and a mandatory grain size test and \nreport has been added for the non- H grades so that the \ninformation is available for those desiring to reclassify a non-H \ngrade to H grade. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0884.json",
  "tabulaTablesCsv": "tables_tabula/page-0884.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0884.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4688,
  "bestTextAlphaRatio": 0.788
}