{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 258,
  "globalPageIndex": 258,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-181/SA-181M ASME BPVC.11.A-2025 \nSPECIFICATION FOR CARBON STEEL FORGINGS, FOR \nGENERAL-PURPOSE PIPING \nSA-181/SA-lSlM cO \nINTERNATIONAL \nStandards Worldwide \n(Identical with ASTM Specification A 181/A 181M-06) \n1. Scope \n1.1 This specification covers nonstandard as-forged :fit­\ntings, valve components, and parts for general service. \nForgings made to this specification are limited to a maxi­\nmum weight of 10 000 lb [ 4540 kg]. Larger forgings may \nbe ordered to Specification A 266/ A 266M. \n1.2 Two classes of material are covered, designated \nas Classes 60 and 70, respectively, and are classified in \naccordance with their mechanical properties as specified \nin 6.1. \n1.3 This specification is expressed in both inch-pound \nunits and SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the \nmaterial shall be furnished to inch-pound units. \n1.4 The values stated in either inch-pound units or SI \nunits are to be regarded separately as standard. Within the \ntext, the SI units are shown in brackets. The values stated \nin each system are not exact equivalents; therefore, each \nsystem must be used independently of the other. Combining \nvalues from the two systems may result in nonconformance \nwith the specification. \n2. Referenced Documents \n2.1 ASTM Standards: \nA 266/A 266M Specification for Carbon Steel Forgings \nfor Pressure Vessel Components \nA 788 / A 788M Specification for Steel Forgings, General \nRequirements \nA 961/A 961M Specification for Common Requirements \nfor Steel Flanges, Forged Fittings, Valves, and Parts for \nPiping Applications \n3. General Requirements and Ordering \nInformation \n3.1 Product furnished to this specification shall conform \nto the requirements of Specification A 961/ A 96 lM, \n206 \nincluding any supplementary requirements that are indi­\ncated in the purchase order. Failure to comply with the \nrequirements of Specification A 961 / A 961 M constitutes \nnon-conformance with this specification. \n3.2 It is the purchaser's responsibility to specify in \nthe purchase order all ordering information necessary to \npurchase the needed material. Examples of such informa­\ntion include but are not limited to the ordering information \nin Specification A 961/ A 96 lM and the following: \n3.2.1 Supplementary requirements, and \n3.2.2 Additional requirements (See 4.3, 9.1, 10.2, \n12.1, and 12.2). \n3.3 If the requirements of this specification are in con­\nflict with the requirements of Specification A 961 / A 961M, \nthe requirements of this specification shall prevail. \n4. Materials and Manufacture \n4.1 Except for flanges of all types, hollow, cylindrically \nshaped parts may be machined from hot-rolled or forged \nbar, provided that the axial length of the part is approxi­\nmately parallel to the metal flow lines of the stock. Other \nparts, excluding flanges of all types, up to and including \nNPS 4 may be machined from hot-rolled or forged bar. \nElbows, return bends, tees, and header tees shall not be \nmachined directly from bar stock. \n4.2 Except as permitted in 4.1, the finished product \nshall be a forging as defined in the Terminology section \n(exclusively) of Specification A 788/ A 788M. \n4.3 When specified in the order, the manufacturer shall \nsubmit for approval of the purchaser a sketch showing the \nshape of the rough forging before machining. \n4.4 Forgings shall be protected against sudden or too \nrapid cooling from the rolling or forging while passing \nthrough the critical range. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0258.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3504,
  "bestTextAlphaRatio": 0.7506
}