{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 413,
  "globalPageIndex": 413,
  "width": 624.0,
  "height": 862.56,
  "text": ". '---' \nASME BPVC.II.A-2025 SA-249 /SA-249M \nTABLE 2 Heat Treatment Requirements \nGrade UNS Number Solutioning Temperature, min or range Quenching Method \nAll grades not \nindividually listed \nbelow \n1900 °F [1040 °C] A \nS30601 \nS30815 \nS30941 \nS31009 \nS31041 \nS31254 \nS31266 \nS31277 \nS31609 \nS31727 \n2010 to 2140 °F [1100 to 1170 °C] \n1920 °F [1050 °CJ \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nB \nD \nB \nB \nB \nB \nB \nB \nB \nB \nTP309HCb \nTP310H \nTP310HCb \nTP316H \n1900 °F [1040 °CJc \n1900 °F [1040 °C] \n1900 °F [1040 °CJC \n2100 °F [1150 °C] \n2100 °F [1150 °C] \n2050 °F [1120 °C] \n1900 °F [1040 °C] \n1975 °F [1080 °C}-\n2155 °F [1180 °C] \n1975 °F [1080 °C]-\n2155 °F [1180 °C] \nTP321 \nTP321H \nS32053 \nS32100 \nS32109 \nS32654 \nS33228 \nS34565 \n1900 °F [1040 'CJC \n2000 'F [1100 'CJC \n2100 'F [1150 'CJ \n2050 'F [1120 'CJ \n2050 'F [1120 'C]-\n2140 'F [1170 'CJ \nTP347 \nTP347H \nTP34B \nTP348H \nS34700 \nS34709 \nS34800 \nS34809 \nS35045 \nS38815 \nNOB020 \nN08367 \nN08800 \nN08810 \nN08811 \nN08904 \nN08926 \n1900 °F [1040 'Cle \n2000 'F [1100 'CJC \n1900 °F [1040 'CJC \n2000 'F [1100 'CJC \n2000 'F [1100 'CJ \n1950 'F [1065 'CJ \nAlloy 20 \nBOO \n800H \n1700-1850 'F [925-1010 'CJ stabilization treatment \n2025 'F [1110 'C] \n1900 'F [1040 'CJ \n2050 'F [1120 'CJ \n2100 'F [1150 °C] \n2000 'F [1100 °C] \n2010 'F [1105 °C] \nA Quenched in water or rapidly cooled by other methods, at a rate sufficient to prevent reprecipitation of chromium carbides, as demonstrated by the capability of passing \nPractices A262, Practice E. The manufacturer is not required to run the test unless it is specified on the purchase order (See Supplementary Requirement S6). Note that \nPractices A262 requires the test to be performed on sensitized specimens in the low carbon and stabilized types and on specimens representative of the as-shipped \ncondition of the other types. In the case of low-carbon types containing 3 % or more molybdenum, the applicability of the sensitizing treatment prior to testing shall be a \nmatter for negotiation between the seller and purchaser. • \n8 Quenched in water or rapidly cooled by other methods. \nc A solution treating temperature above 1950 °F [1065 °C] may impair resistance to intergranular corrosion after subsequent exposure to sensitizing conditions in the \nindicated grades. When specified by the purchaser, a lower temperature stabilization or re-solution anneal shall be used subsequent to the higher-temperature solution \nanneal prescribed in this table (See Supplementary Requirement S4). \n0 cooled in still air, or faster. \ndifficult to test the sample as a single piece, the sample may be \nsectioned into smaller pieces provided a minimum of 4 in. of \nweld is subjected to reverse bending. \nNOTE 1-The reverse bend test is not applicable when the specified wall \nis 10 % or more of the specified outside diameter, or the wall thickness is \n0.134 in. [3.4 mm) or greater, or the outside diameter size is less than \n0.375 in. [9.5 mm). Under these conditions the reverse flattening test of \nSpecification Al016/Al016M shall apply. \n12. Grain Size Requirement \n12.1 The grain size of Grades TP309H, TP309HCb, \nTP310H and TP310HCb, as determined in accordance with \nTest Methods E112, shall be No. 6 or coarser. \n12.2 The grain size of Grades TP304H, TP316H, TP321H, \nTP347H and TP348H, as determined in accordance with Test \nMethods El12, shall be No. 7 or coarser. \n12.3 The grain size of Grade UNS S32615, as determined in \naccordance with Test Methods E112, shall be No. 3 or finer. \n12.4 The grain size of N08810 and N08811, as determined \nin accordance with Test Methods El12, shall be 5 or coarser. \n13. Mechanical Tests and Grain Size Determinations \nRequired \n13.1 Tension Test-One tension test shall be made on a \nspecimen for lots of not more than 50 tubes. Tension tests shall \nbe made on specimens from two tubes for lots of more than 50 \ntubes (See 13.9.2). \n13 .2 Flattening Test-One flattening test shall be made on \nspecimens from each end of one finished tube, not the one used \nfor the flange test, from each lot (See 13.9.1). \n13.3 Flange Test-One flange test shall be made on speci­\nmens from each end of one finished tube, not the one used for \nthe flattening test, from each lot (See 13.9.1). \n361 \n13.4 Reverse-Bend Test-One reverse-bend test shall be \nmade on a specimen from each 1500 ft [450 m] of finished \ntubing. \n13.5 Hardness Test-Brinell or Rockwell hardness tests \nshall be made on specimens from two tubes from each lot (See \n13.9.2) . ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0413.json",
  "tabulaTablesCsv": "tables_tabula/page-0413.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0413.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4493,
  "bestTextAlphaRatio": 0.6005
}