{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 549,
  "globalPageIndex": 549,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-334/SA-334M \nin the welded joint and perpendicular to the surface. When \ndiameter and thickness does not pennit obtaining trans­\nverse specimens, longitudinal specimens in accordance \nwith 14.2 shall be obtained. The bottom of the notch shall \nbe located at the weld joint. \n15. Impact Test \n15.1 Except when the size of the finished tube is insuf­\nficient to pennit obtaining subsize impact specimens, all \nmaterial furnished under this specification and marked in \naccordance with Section 17 shall be tested for impact resist­\nance at the temperature for the respective grades as pre­\nscribed in Table 6. \n15.1.1 Special impact tests on individual lots of \nmaterial may be made at other temperatures if agreed upon \nbetween the manufacturer and the purchaser. \n15.2 The notched-bar impact test shall be made in \naccordance with the procedure for the simple beam, \nCharpy-type of test of Test Methods E 23. \n15.3 Impact tests specified for temperatures lower than \n+ 70°F [20°C] should be made with the following precau­\ntions. The impact test specimens as well as the handling \ntongs shall be cooled a sufficient time in a suitable container \nso that both reach the desired temperature. The temperature \nshall be measured with thermocouples, thermometers, or \nany other suitable devices and shall be controlled within \n±3°F [2°C]. The specimens shall be quickly transferred \nfrom the cooling device to the anvil of the Charpy impact \ntesting machine and broken with a time lapse of not more \nthan 5 s. \n15.4 When subsize Charpy impact specimens are used \nand the width along the notch is less than 80% of the actual \nwall thickness of the original material, the specified Charpy \nimpact test temperature for Grades 1, 3, 6, 7, and 9 shall \nbe lower than the minimum temperature shown in Table \n6 for the respective grade. Under these circumstances the \ntemperature reduction values shall be by an amount equal \nto the difference (as shown in Table 7) between the temper­\nature reduction corresponding to the actual material thick­\nness and the temperature reduction corresponding to \nCharpy specimen width actually tested. The appendix \nshows some examples of how the temperature reductions \nare detennined. \n16. Hydrostatic or Nondestructive Electric Test \n16.1 Each tube shall be subjected to the nondestructive \nelectric test or the hydrostatic test in accordance with Speci­\nfication A 1016/ A 1016M. The type oftest to be used shall \nbe at the option of the manufacturer, unless otherwise \nspecified in the purchase order. \n17. Product Marking \n17.1 Except as modified in 16.1.1, in addition to the \nmarking prescribed in Specification A 1016/ A 1016M, the \nmarking shall include whether hot-finished, cold-drawn, \nseamless, or welded, and the letters \"LT\" followed by the \ntemperature at which the impact tests were made, except \nwhen a lower test temperature is required because of \nreduced specimen size, in which case, the higher impact \ntest temperature applicable to a full-size specimen should \nbe marked. \n17.1.1 When the size of the finished tube is insuffi­\ncient to obtain subsize impact specimens, the marking shall \nnot include the letters LT followed by an indicated test \ntemperature unless Supplementary Requirement S 1 is spec­\nified. \n497 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0549.json",
  "tabulaTablesCsv": "tables_tabula/page-0549.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0549.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3287,
  "bestTextAlphaRatio": 0.7697
}