{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 448,
  "globalPageIndex": 448,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-266/SA-266M ASME BPVC.II.A-2025 \nand tempered forgings for which tests are required at both ends \nby 8.2.2.3 and 8.2.2.4, separately forged test blocks are not \nallowed. \nNoTE 3-In using separately forged test blocks, attention is drawn to the \neffect of mass differences between the production forgings and the test \nblocks. \n8.2 Specific Requirements-The number and location of \ntests are based on forging length, weight, and heat treatment, \nand shall be as prescribed below. The length and weight to be \nused for this purpose shall be the shipped length and weight of \nforgings produced individually or the aggregate shipped length \nand weight of all pieces cut from a multiple forging. \n8.2.1 Annealed, Normalized, or Normalized and Tempered \nSteel Forgings: \n8.2.1.1 For forgings weighing 5000 lb [2250 kg] or less at \nthe time of heat treatment, one tension test shall be taken from \none forging per heat in each heat treatment charge. When heat \ntreatment is performed in continuous-type furnaces with suit­\nable temperature controls and equipped with recording pyrom­\neters so that complete heat treatment records are available, a \ntempe1ing charge may be considered as any continuous run not \nexceeding an 8 h period. \n8.2.1.2 For forgings weighing over 5000 lb [2250 kg] at the \ntime of heat treatment, one tension test shall be taken from \neach forging. , \n8.2.2 Quenched and Tempered Forgings: \n8.2.2.1 For quenched and tempered forgings weighing \n5000 lb [2250 kg] or less at the time of heat treatment, but not \nexceeding 12 ft [3.7 m] in length, one tension test shall be \ntaken from one forging per heat in each heat treatment charge. \nWhen heat treatment is performed in continuous-type furnaces \nwith suitable temperature controls and equipped with recording \npyrometers so that complete heat treatment records are \navailable, a tempering charge may be considered as any \ncontinuous run not exceeding an 8 h period. \n8.2.2.2 For quenched and tempered forgings weighing over \n5000 lb [2250 kg] to 10 000 lb [ 4500 kg] at the time of heat \ntreatment, but not exceeding 12 ft [3.7 m] in length, one \ntension test shall be taken from each forging. \n8.2.2.3 For quenched and tempered forgings that exceed \n12 ft [3.7 m] in length, one tension test shall be taken from \neach end of each forging. \n8.2.2.4 For quenched and tempered forgings weighing more \nthan 10 000 lb [ 4500 kg] at the time of heat treatment, two \ntension test specimens shall be taken from each forging. These \nshall be offset 180° from each other except that if the length of \nthe forging, excluding test prolongations, exceeds 12 ft [3.7 m], \nthen one specimen shall be taken from each end of the forging. \n9. Repair Welding \n9.1 Repair welding of forgings is permissible only at the \noption of the purchaser. If repair welding is performed, welders \nand weld procedures shall be qualified in accordance with \nSection IX of the ASME Boiler and Pressure Vessel Code. \n10. Certification \n10.1 In addition to the mandatory certification requirements \nof Specification A 788/ A 788M, the heat treatment cycle data \nshall be included. \n11. Product Marking \n11.1 Each forging shall be identified in accordance with the \nMarking Section of Specification A 788/ A 788M. In addition, \nthe forging shall be marked following the grade designation by \nthe letter \"A\" for annealed, \"N\" for nmmalized, \"NT\" for \nnormalized and tempered, and \"S\" for liquid quenched and \ntempered, as applicable. \n12. Keywords \n12.1 pressure vessel service; steel forgings-carbon \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified by the \npurchaser in the inquiry, contract, or order. Details of these supplementary requirements shall be \nagreed upon between the manufacturer and the purchaser. \nSl. Rough Turning and Boring \nS 1.1 The position of the rough turning and boring in the \nsequence of manufacturing operations shall be as specified by \nthe purchaser. \nS2. Alternative Tension Test Orientation \nS2.1 In lieu of the requirements of Section 8, the longitu­\ndinal axis of the test specimens shall be transverse to the \ndirection of major working of the forging. The results shall \n396 \nconform with requirements of Table 2, with the exception of \nthe ductility limits that shall be as follows: \nGrade 1 \nElongation in 2 in. [62.5 mm], min,% 20 [18] \nReduction of area, min, % 30 \nS3. Hydrostatic Test \n2 and 4 \n19 [17] \n25 \n3 \n18 [16] \n25 \nS3.1 A hydrostatic pressure test shall be applied. The details \nof the test, including its position in the sequence of manufac­\nturing operations, shall be specified. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0448.json",
  "tabulaTablesCsv": "tables_tabula/page-0448.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0448.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4602,
  "bestTextAlphaRatio": 0.751,
  "camelotTablesPath": "camelot_tables/page-0448.json",
  "camelotTablesCsv": "camelot_tables/page-0448.csv",
  "camelotTableCount": 1
}