{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 806,
  "globalPageIndex": 1604,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-1058 ASME BPVC.II.A-2025 \n17.1.2.2 When hardness values converted from the Leeb \nnumber are reported, the portable instrument used shall be \nreported in parentheses, for example: \n(1) 350 HB (HLD) where the original hardness test was \nperformed using the portable Leeb hardness test method with \nthe HLD impact device and converted to the Brinell hardness \nvalue (HB). \n17 .1.3 Test Method Al 038-The measured hardness number \nshall be reported in accordance with the standard methods and \nappended with UCI in parenthesis to indicate that it was \ndetermined by a portable hardness tester, as in the following \nexample: \n17.1.3.1 446 HV (UC/) 10 where 446 is the hardness test \nresult using the portable UCI test method under a force of 10 \nkgf. \n17.1.4 Test Method EJJ0: The measured hardness number \nshall be reported in accordance with the standard methods and \nappended with a IP to indicate that it was determined by a \nportable hardness tester, as follows: \n17.1.4.1 Rockwell Hardness Examples: \n( 1) 40 HRCIP where 40 is the hardness test result using the \nRockwell C portable test method. \n(2) 72 HRBW/P where 72 is the hardness test result using \nthe Rockwell B portable test method using a tungsten carbide \nball indenter. \n17.1.4.2 Brinell Hardness Examples: \n(1) 220 HBWIP 10/3000 where 220 is the hardness test \nresult using the Brinell portable test method with a ball of \n10 mm diameter and with a test force of 3000 kgf (29.42 kN) \napplied for 10 s to 15 s. \n(2) 350 HBWIP 51750 where 350 is the hardness test result \nusing the Brinell portable test method with a ball of 5 mm \ndiameter and with a test force of750 kgf (7.355 kN) applied for \n10 s to 15 s. \nCHARPY IMPACT TESTING \n18. Description \n18.1 The equipment, test specimen and testing procedures \nshall comply with the requirements of Test Methods E23, ISO \n148-1, or JIS Z 2242. \n19. Testing Machines \n19.1 Charpy machines used for testing steel generally have \ncapacities in the 300 to 400 J energy range. Sometimes \nmachines of lesser capacity are used; however, the capacity of \nthe machine should be substantially in excess of the absorbed \nenergy of the specimens (see Test Methods E23). The linear \nvelocity at the point of impact should be in the range of 4.9 to \n5.8 mis or in accordance with ISO 148-1, or JIS Z 2242. \n20. Sampling and Number of Specimens \n20.1 Sampling: \n20.1.1 Test location and orientation should be addressed by \nthe product specifications. If not, for wrought products, the test \nlocation shall be the same as that for the tensile specimen and \nthe orientation shall be longitudinal with the notch perpendicu­\nlar to the major surface of the product being tested. \n20.1.2 Number of Specimens: \n20.1.2.1 All specimens used for a Charpy impact test shall \nbe taken from a single test coupon or test location. \n20.1.2.2 When the specification calls for a minimum aver­\nage test result, three specimens shall be tested. \n20.1.2.3 When the specification requires determination of a \ntransition temperature, eight to twelve specimens are usually \nneeded. \n20.2 Type and Size: \n20.2.1 A standard full size Charpy V-notch specimen as \nshown in Test Methods E23, ISO 148-1, or JIS Z 2242 shall be \nused except as provided in the following sub-paragraphs. \n20.2.2 If a standard full-size specimen cannot be prepared, \nthe largest feasible standard subsize specimen shall be pre­\npared. The specimens shall be machined so that the specimen \ndoes not include material nearer to the surface than 0.5 mm. \n20.2.3 Tolerances for standard subsize specimens are shown \nin Test Methods E23, ISO 148-1, or JIS Z 2242. \n20.3 Notch Preparation-The machining of the notch is \ncritical, as it has been demonstrated that extremely minor \nvariations in notch radius and profile, or tool marks at the \nbottom of the notch may result in erratic test data. \n21. Calibration \n21.1 Accuracy and Sensitivity-Calibrate and adjust Charpy \nimpact machines in accordance with the requirements of the \ntest methods used Test Methods E23, ISO 148-2, or JIS B \n7722. \n22. Conditioning-Temperature Control \n22.1 When a specific test temperature is required by the \nspecification or purchaser, control the temperature of the \nheating or cooling medium within ±2 °F (1 °C). \n23. Procedure \n23.1 Individual Test Values: \n23.1.1 Impact Energy-Record the impact energy absorbed \nto the nearest J. \n23.1.2 Fracture Appearance: \n23.1.2.1 Determine the percentage of shear fracture area by \nany of the methods described in Test Methods E23, ISO 148-1, \nor JIS Z 2242. \n23.1.2.2 Determine the individual fracture appearance val­\nues to the nearest 5 % shear fracture and record the value. \n23.1.3 Lateral Expansion: \n23.1.3.1 Methods of measurement and precautions are de­\nscribed in Test Methods E23. \n23.1.3.2 Measure the individual lateral expansion values to \nthe nearest 0.025 mm and record the values. \n23.1.3.3 With the exception described as follows, any speci­\nmen that does not separate into two pieces when struck by a \nsingle blow may be reported as unbroken. If the specimen can \nbe separated by force applied by bare hands, the specimen may \nbe considered as having been separated by the blow. \n24. Interpretation of Test Result \n24.1 When the acceptance criterion of any impact test is \nspecified to be a minimum average value at a given \n1550 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1604.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5321,
  "bestTextAlphaRatio": 0.7205
}