{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 142,
  "globalPageIndex": 940,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-508/SA-508M ASME BPVC.II.A-2025 \n7.1.6.2 Method 2-¼ Tc by Tc. Specimens shall be re­\nmoved ¼ Tc from the nearest quenched surface and at least Tc \nfrom all other surfaces exclusive of the Tc dimension surfaces. \nWhere this method of testing is employed, the following \nlimitations for Tc shall generally apply: \nGrades 1 and 1 a \nGrades 2 Class 2 and 3 Class 2 \nGrades 2 Class 1 and 3 Class 1 \nGrade 4N Class 2 and 5 Class 2 \nGrade 4N Class 1 and 5 Class 1 \nGrade 4N Class 3 \nGrades 3V and 3VCb \nGrade 22 Class 3 \nGrade 22 Classes 4, 5, 6, and 7 \n3 in. [75 mm], max \n6 in. [150 mm], max \n8 in. [205 mm], max \n16 in. [405 mm], max \n30 in. [760 mm], max \n40 in. [1015 mm], max \n20 in. [510 mm], max \n20 in. [510 mm], max \n12 in. [305 mm], max \n7.1.6.3 Method 3-Test specimens shall be taken from a \nrepresentative separate test forging made from the same heat of \nsteel and shall receive substantially the same reduction and \ntype of hot working as the production forgings that it represents \nand shall have the same Tc as the as-quenched production \nforgings. The separate test forging shall be heat treated in the \nsame furnace charge and under the same conditions as the \nproduction forgings. Test specimens shall be removed from the \nregion midway between the mid-thickness and the surface, and \nnot closer than Tc to a second heat treated surface with the \nsame limitation on forging thickness as in 7.1.6.2. \nAlternatively, an extra production forging of the same configu­\nration (right and left handed configurations being considered \nequivalent) as that ordered, may be tested as described in \nMethod 2. \n7.1.6.4 Method 4-A thermal buffer ring, at least Tc by Tc \nin cross section, or segments of such a ring at least 3 Tc in \nlength, shall be welded to the test\"end of a forging prior to heat \ntreatment for mechanical properties. The buffer material may \nbe any weldable carbon or low-alloy steel and shall be joined \nto the forging with a partial-penetration type weld which \ncompletely seals the buffered surface. The test coupons shall be \nremoved from the forging in the region buffered by the ring or \nring segments. If ring segments are used, the test coupons shall \nbe removed from the forging in the area under the buffer ring \nsegment at a minimum distance of Tc from each end of that \nsegment. In either case, the test specimens shall be located at \na minimum distance of V2 in. [13 mm] from the buffered \nsurface of the forging, and at least V4 Tc from a quenched \nsurface of the forging. Where this method of testing is \nemployed, the limitations for Tc given in 7.1.6.2 shall gener­\nally apply. \nNoTE 5-For forgings with a maximum Tc of 2 in. [50 mm], the \nspecimens shall be taken at midthickness and at least 2 in. from a second \nsurface. This provision is applicable to all four methods in 7 .1.6. \n7.1.7 Tension specimens shall be the standard 0.5 in. \n[12.5 mm] round by 2 in. [50 mm] gauge length, as shown in \nTest Methods and Definitions A370. \n7.2 Impact Test-The steel shall conform to the require­\nments of Table 3, or Supplementary Requirement SlO may be \nspecified instead of these requirements. \n7.2.1 Number, Location, and Orientation of Specimens: \n7.2.1.1 One set of three Charpy V-notch specimens shall be \ntaken from each tensile specimen location required in 7 .1.2. \nOrientation shall be the same as in 7 .1.4. When S 10 is \nspecified, the required number of tests shall be governed by \nNB, NC, ND, NE, NF, or NG 2300, as applicable. \n7 .2.1.2 The requirements of 7 .1.3 also apply to impact \nspecimens. \n7.2.1.3 The longitudinal axis and mid-length of the impact \nspecimen shall be located similarly to the longitudinal axis of \nthe tension test specimens as defined in 7.1.6. The axis of the \nnotch shall be normal to the nearest heat-treated surface of the \nforging. When Supplementary Requirement S 10 is specified \nthe orientation shall be governed by NB, NC, ND, NE, NF, or \nNG 2300. \n7.2.2 Impact specimens shall be Charpy V-notch as shown \nin Test Methods and Definitions A370. \n8. Workmanship and Quality Level Requirements \n8.1 See requirements in 9.1, 9.2.2, 9.3.1.1, and 9.3.2.2. \n9. Nondestructive Inspection Requirements \n9.1 General Requirements-Dimensional and visual \ninspections, and magnetic particle and ultrasonic inspection \nshall be conducted by the manufacturer. Forgings shall be free \nof cracks, thermal ruptures, or other injurious indications. \n9.2 Magnetic Particle Inspection: \n9.2.1 Following final machining by the manufacturer all \naccessible surfaces of each forging shall be examined by the \ncontinuous current magnetic particle method. This examination \nshall be in accordance with Practice A275/A275M unless the \npurchaser has required the use of the AC yoke in accordance \nwith Practice A966/A966M instead (see 4.3.1). \n840 \n9.2.2 The following conditions are subject to rejection or \nremoval: \n9.2.2.1 Indications with major dimension exceeding 3/16 in. \n[4.8 mm]. \n9.2.2.2 Four or more indications exceeding V!6 in. [1.6 mm] \nin major dimensions that are aligned and separated by V16 in. \n[1.6 mm] or less end to end. \n9.2.2.3 Ten or more indications exceeding V16 in. [1.6 mm] \nin major dimensions contained in any 6 in.2 [39 cm 2 ] of \nsurface, with the major dimension of this area not to exceed \n6 in. [150 mm]. The area shall be taken in the most unfavorable \nlocation relative to the indications being evaluated. \n9.3 Ultrasonic Inspection-Forgings shall be ultrasonically \ninspected in accordance with the procedures of Practice A388/ \nA388M. \n9.3.1 Longitudinal Wave Inspection: \n9.3.1.1 Unless otherwise specified by Supplementary Re­\nquirement S2, the back reflection method of tuning shall be \nused in accordance with 7.2.2.1 of Practice A388/A388M. In \naddition to the reportable conditions in Section 7 of Practice \nA388/A388M, indications exceeding the resultant back reflec­\ntion shall be recorded. The following conditions are considered \nrejectable: \n9.3.1.2 Complete loss of back reflection not associated with \nforging configuration or surface and accompanied by an \nindication of a discontinuity. For this purpose, a back reflection \nless than 5 % of full screen height shall be considered complete \nloss of back reflection. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0940.json",
  "tabulaTablesCsv": "tables_tabula/page-0940.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0940.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6230,
  "bestTextAlphaRatio": 0.7217
}