{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 732,
  "globalPageIndex": 1530,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-989 /SA-989M ASME BPVC.II.A-2025 \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall apply only when specified by the purchaser in the \ncontract or order. \nSl. Macroetch Test \nS 1.1 A sample part shall be sectioned and etched to show \ninternal imperfections. The test shall be conducted according to \nTest Method E340. Details of the test shall be agreed upon \nbetween the manufacturer and the purchaser. \nS2. Chemical Composition \nS2.1 The chemical composition of a sample from one part \nfrom each lot of parts shall be determined by the manufacturer. \nThe composition of the sample shall conform to the chemical \ncomposition requirements prescribed in Table 1. \nS2.2 A product analysis in accordance with Section 10 shall \nbe made from one randomly selected part representing each \nsize and type (See 9.5.1.1) of part on the order. If the analysis \nfails to comply, each part in that lot, at the option of the \nmanufacturer, shall be checked and accepted if the analysis for \nthe part complies with the requirements, or the lot shall be \nrejected. All results shall be reported to the purchaser. \nS3. Tension Tests \nS3.1 In addition to the requirements of Section 9, one \ntension specimen shall be obtained from a representative part \nfrom each production lot at a location agreed upon between the \nmanufacturer and the purchaser. The results of the test shall \ncomply with Table 3 and shall be reported to the purchaser. \nS4. Particle Size \nS4.1 In addition to the manufacturing process of 5.1, the \nmaximum particle size is 0.020 in. [0.5 mm], and the powders \nshall be produced by the gas atomization process. \nS5. Powder Shielding \nS5.1 Immediately following atomization, the powder shall \nremain shielded by an inert gas, until the powder is below a \ntemperature of 105 °F [ 40 °C] to ensure that the detrimental \nabsorption of oxygen and other deleterious contaminants is no \nlonger possible. The powder shall be stored under a positive \nnitrogen or argon atmosphere or vacuum to minimize potential \noxidation or contamination. \nS6. Magnetic Particle Examination \nS6.1 All accessible surfaces of a finished alloy steel part \nshall be examined by a magnetic-particle method. The method \nshall be in accordance with Test Method A275/A275M. Ac­\nceptance limits shall be agreed upon between the manufacturer \nand purchaser. \nS7. Liquid Penetrant Examination \nS7 .1 All accessible surfaces shall be examined by a liquid \npenetrant method in accordance with Test Method E165/ \nE165M. Acceptance limits shall be agreed upon between the \nmanufacturer and the purchaser. \nSS. Hydrostatic Testing \nS8.l A hydrostatic test at a pressure agreed upon between \nthe manufacturer and the purchaser shall be applied by the \nmanufacturer. \nS9. Repair Welding \nS9.1 No repair welding shall be permitted without prior \napproval of the purchaser. If permitted, the restrictions of \nSection 15 shall apply. \nSlO. Heat Treatment Details \nS 10.1 The manufacturer shall furnish a detailed test report \ncontaining the information required in 16.1 and shall include \nall pertinent details of the heat treating cycle given the parts. \nSll. Hardness Test \nS 11.1 Each part shall be hardness tested and shall meet the \nrequirements of Table 3. \nS12. Alternate Heat Treatment (Grade K90901) \nSl2.l Grade K90901 shall be normalized in accordance \nwith Section 7 and tempered at a temperature, to be specified \nby the purchaser, less than 1350 °F [730 °C]. It shall be the \npurchaser's responsibility to subsequently temper at 1350 °F \n[730 °C] min to conform to the requirements of the specifica­\ntion. All mechanical tests shall be made on material heat \ntreated in accordance with Section 7. The certification shall \nreference this supplementary requirement indicating the tem­\npering temperature applied. The notation \"S 1 0\" shall be \nincluded with the required marking of the part. \nSl3. Fatigue Acceptance Test \nSl3.1 For alloy steel, except UNS K90901, components \nintended for service above 800 °F [425°C], and for UNS \nK90901 components intended for service above 1000 °F \n[540 °C] a uniaxial fatigue test shall be performed. \nS13.2 The fatigue test shall be performed in air at 1100 °F \n[595 °C] at an axial strain range of 1.0 % with a one hour hold \nperiod at the maximum positive strain point in each cycle. Test \nspecimen location and orientation shall be in accordance with \nthe general guidance of Specification A961/A961M and the \napplicable product specifications. Testing shall be conducted in \naccordance with Practice E606/E606M. The test shall exceed \n200 cycles without fracture or a 20 % drop in the load range. \nS13.3 Failure to meet this requirement shall be cause for \nrejection of all parts from that powder blend. \nS13.4 Test frequency shall be the same as for tension tests \n(see 9.5). Retesting is permitted. Two additional specimens \nproduced from the same powder blend shall be tested and both \nspecimens must pass the cyclic life requirement. Further retests \nare not permitted. \n1476 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1530.json",
  "tabulaTablesCsv": "tables_tabula/page-1530.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1530.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5022,
  "bestTextAlphaRatio": 0.7577,
  "camelotTablesPath": "camelot_tables/page-1530.json",
  "camelotTablesCsv": "camelot_tables/page-1530.csv",
  "camelotTableCount": 1
}