{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 696,
  "globalPageIndex": 1494,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-985/SA-985M ASME BPVC.II.A-2025 \n4.3.2.1 When castings are heat treated at tempera­\ntures above 2000°F [1100°C], then the working zone shall \nhave been established by a survey performed at not more \nthan 25°F [15°C] below nor more than 200°F [l10°C] \nabove the minimum heat treatment temperature specified \nfor the grade. If a minimum heat treatment temperature is \nnot specified for the grade, then the survey temperature \nshall be not more than 50°F [30°C] below nor more than \n175°F [100°C] above the furnace set point used. \n4.3.2.2 The maximum variation in measured tem­\nperature as determined by the difference between the high­\nest temperature and the lowest temperature shall be as \nagreed between the purchaser and producer except that \nduring production heat treatment no portion of the furnace \nshall be below the minimum specified temperature nor \nabove the maximum specified temperature for the grade \nbeing processed. \n4.4 Sampling: \n4.4.1 If castings are poured directly from one or \nmore master heats, then the samples for chemical and other \nrequired testing also shall be poured directly from each of \nthe master heats. \n4.4.2 If castings are poured from a subheat, then the \nsamples for chemical and other required testing also shall \nbe poured from a subheat of that same master heat, but \nnot necessarily from the same subheat as the castings. The \nsubheat used for the test samples shall be produced using \nthe same practices and additions as used for the castings. \n4.4.3 Test specimens may be taken from castings or \nfrom coupons cast either integrally with the castings, in \nthe same molds as the castings, or in separate molds. \n4.4.4 Separately cast specimens for tension testing \nshall be cast in molds of the same type and material as \nthose used for the castings, as shown in Figs. 1-4 and \nTable 2, except when Supplementary Requirement S26 is \nspecified. The test coupon in Fig. 4 shall be employed \nonly for austenitic alloy castings with cross sections less \nthan 2½ in. \n5. Chemical Composition \n5.1 Chemical Analysis - Chemical analysis of materi­\nals covered by this specification shall be in accordance \nwith Test Methods, Practices, and Terminology A 751. \n5.2 Heat Analysis - An analysis of samples obtained \nin accordance with 4.4 or Supplementary Requirement S27 \nas appropriate, shall be made by the manufacturer to deter­\nmine the percentages of the elements specified for the grade \nbeing poured. When drillings are used, they shall be taken \nnot less than ½ 6 in. [1.6 mm] beneath the surface. The \nchemical composition thus determined shall be reported to \nthe purchaser, or his representative, and shall conform to \nthe requirements in the individual specification for the \ngrade being poured. \n5.3 Product Analysis - A product analysis may be \nmade by the purchaser from material representing each \nmaster heat, subheat, lot, or casting. The analysis shall \nbe made on representative material. Samples for carbon \nanalysis shall be taken no closer than ½ 6 in. [1.6 mm] to \na cast surface except that castings too thin for this shall \nbe analyzed on representative material. The chemical com­\nposition thus determined shall meet the requirements speci­\nfied in the applicable specification for the grade involved, \nor shall be subject to rejection by the purchaser, except \nthat the chemical composition determined for carbon and \nlow-alloy steel castings may vary from the specified limits \nby the amounts shown in Table 1. The product analysis \ntolerances of Table 1 are not applicable as acceptance \ncriteria for heat analysis by the casting manufacturer. When \ncomparing product and heat analysis for other than carbon \nand low alloy steels, the reproducibility data R2, in Test \nMethods E 353 or E 354, as applicable, shall be taken into \nconsideration. \n5.4 Unspecified Elements - When chemical analysis \nfor elements not specified for the grade ordered is desired, \nSupplementary Requirement S 1 may be specified. \nNOTE 1 - All commercial metals contain small amounts of various \nelements in addition to those which are specified. It is neither practical \nnor necessary to specify limits for every unspecified element that might \nbe present, despite the fact that the presence of many of these elements \noften is determined routinely by the producer. \n5.5 The substitution of a grade or composition different \nfrom that specified by the purchaser is prohibited. \n6. Mechanical Test Methods \n6.1 All mechanical tests shall be conducted in accor­\ndance with Test Methods and Definitions A 370. \n7. Tensile Requirements \n7.1 Sampling for tension testing shall be in accordance \nwith 4.4 or with Supplementary Requirement S28 as appro­\npriate. \n7.2 The coupon from which the test specimen is taken \nshall be heat treated in production furnaces to the same \nprocedure as the castings it represents. \n7 .3 If any specimen shows defective machining or \ndevelops flaws, it may be discarded and another substituted \nfrom the same heat. \n7.4 To determine accordance with the tension test \nrequirements, an observed value or calculated value shall \nbe rounded off in accordance with Practice E 29 to the \n1436 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1494.json",
  "tabulaTablesCsv": "tables_tabula/page-1494.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1494.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5158,
  "bestTextAlphaRatio": 0.771,
  "camelotTablesPath": "camelot_tables/page-1494.json",
  "camelotTablesCsv": "camelot_tables/page-1494.csv",
  "camelotTableCount": 2
}