{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 645,
  "globalPageIndex": 1443,
  "width": 613.92,
  "height": 793.2,
  "text": "_,,.-----...___ \nASME BPVC.II.A-2025 SA-941 \nhigh temperature transformation products, and then holding \nit at that temperature until transformation is complete. \naustenitizing, n-forming austenite by heating a steel object \nabove the transformation range. \nbaking, n-heating to a low temperature in order to remove \ngases. \nbatch furnace, n-a heating device within which steel objects \nare held stationary or oscillated during the thermal process­\ning cycle. \nblank carburizing, n-simulating the carburizing operation \nwithout introducing carbon. \nDiscussION-This is usually accomplished by using an inert material \nin place of the carburizing agent, or by applying a suitable protective \ncoating on the object being heat treated. \nblank nitriding, n-simulating the nitriding operation without \nintroducing nitrogen. \nDiscussION-This is usually accomplished by using an inert material \nin place of the nitriding agent, or by applying a suitable protective \ncoating on the object being heat treated. \nbluing, n-subjecting the scale-free surface of a steel object to \nthe action of air, steam, or other agents at a suitable \ntemperature, thereby forming a thin blue film of oxide and \nimproving the object's appearance and corrosion resistance. \nDiscussION-This term is ordinarily applied to sheet, strip, or \nfinished parts. It is used also to denote the heating of springs after \nfabrication in order to improve their properties. \nbox annealing, n-annealing in a sealed container under \nconditions that minimize oxidation. \nDiscussION-The charge is usually heated slowly to a temperature \nbelow the transformation range, but sometimes above or within it, \nand is then cooled slowly. \nbright annealing, n-annealing in a protective medium to \nprevent discoloration of the bright surface. \ncapped steel, n-a rimmed steel in which, during ingot \nsolidification, the rimming action was limited by mechanical \nor chemical means. \ncarbon potential, n-the carbon content at the surface of a \nspecimen of pure iron in equilibrium with the carburizing \nmedium considered, and under the conditions specified. \ncarbon restoration, n-replacing the carbon lost from the \nsurface layer in previous processing by carburizing this layer \nto substantially the original carbon level. \ncarbon steel, n-a steel that conforms to a specification that \nprescribes a maximum limit, by heat analysis in mass \npercent, of not more than: 2.00 for carbon and 1.65 for \nmanganese, but does not prescribe a minimum limit for \nchromium, cobalt, molybdenum, nickel, niobium \n(columbium), tungsten (wolfram), vanadium, or zirconium. \nDiscussION-Except as required above, it is permissible for carbon \nsteel specifications to prescribe limits (minimum or maximum, or both) \nfor each specified alloying element, subject to the following restrictions \nfor the heat analysis limits in mass percent: \n(a) for wrought carbon steel products, the specified maximum limit is \nnot to exceed: 0.10 for aluminum, 0.60 for silicon, and 0.050 for \ntitanium; \n(b) for carbon steel castings, the specified maximum limit is not to \nexceed: 0.10 for aluminum, 1.00 for silicon, and 0.050 for titanium. \n( c) for carbon steels that are required to be rephosphorized, the \nspecified minimum limit for phosphorus is not to be less than 0.040; \n( d) for carbon steels that are required to be resulfurized, the specified \nminimum limit for sulfur is not to be less than 0.060; \n( e) for carbon steels that are not required to be rephosphorized or \nresulfurized, the specified maximum limit is not to exceed: 0.60 for \ncopper, 0.050 for phosphorus, and 0.060 for sulfur; and \n(f) for carbon steels that are required to contain boron, copper, or lead, \nthe specified minimum limit is not to exceed: 0.0005 for boron, 0.35 for \ncopper, and 0.25 for lead. \ncarbonitriding, n-case hardening in which a suitable steel \nobject is heated above Ac 1 in a gaseous atmosphere of such \ncomposition as to cause simultaneous absorption of carbon \nand nitrogen by the surface and, by diffusion, to create a \nconcentration gradient. \ncarburizing, n-a process in which an austenitized steel object \nis brought into contact with a carbonaceous environment of \nsufficient carbon potential to cause absorption of carbon at \nthe surface and, by diffusion, to create a concentration \ngradient. \ncase, n-in case hardening, the outer portion that has been \nmade harder than the core as a result of altered composition \nor microstructure, or both, from treatments such as \ncarburizing, nitriding, and induction hardening. \ncase hardening, n-a generic term covering any of several \nprocesses applicable to steel that change the chemical \ncomposition or microstructure, or both, of the surface layer. \nDiscussION-The processes commonly used are: carburizing and \nquench hardening; nitriding; and carbonitriding. It is preferred that \nthe applicable specific process name be used. \ncast analysis-,-Deprecated term. Use the preferred term heat \nanalysis. \ncementation, n-the introduction of one or more elements into \nthe outer portion of a steel object by means of diffusion at \nhigh temperature. \ncertificate of compliance, n-in manufactured products, a \ndocument that states that the product was manufactured, \nsampled, tested, and inspected in accordance with the \nrequirements of the specification (including year of issue) \nand any other requirements specified in the purchase order or \ncontract, and has been found to meet such requirements. \nDiscussION-A single document, containing test report information \nand certificate of compliance information, may be used. \ncertifying organization, n-in product specifications, the \nentity responsible for the conformance and certification of \nthe product to the specification requirements. \ncheck analysis-Deprecated term. Use the preferred term \nproduct analysis. \ncoarse grain practice, n-a steelmaking practice for other \nthan stainless steel that is intended to produce a killed steel \nin which aluminum, niobium (columbium), titanium, and \nvanadium are residual elements. \n1381 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1443.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6048,
  "bestTextAlphaRatio": 0.7872
}