{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 674,
  "globalPageIndex": 674,
  "width": 615.84,
  "height": 856.2,
  "text": "SA-370 ASME BPVC.II.A-2025 \nPosition 3 \nPosition 2 (core) \nPosition 1 \nFIG. A3.7 Hardness Test Locations \nA4. STEEL ROUND WIRE PRODUCTS \nA4.1 Scope \nA4.1. l This annex contains testing requirements for Round \nWire Products that are specific to the product. The require­\nments contained in this annex are supplementary to those found \nin the general section of this specification. In the case of \nconflict between requirements provided in this annex and those \nfound in the general section of this specification, the require­\nments of this annex shall prevail. In the case of conflict \nbetween requirements provided in this annex and requirements \nfound in product specifications, the requirements found in the \nproduct specification shall prevail. \nA4.2 Apparatus \nA4.2.l Gripping Devices-Giips of either the wedge or \nsnubbing types as shown in Figs. A4.1 and A4.2 shall be used \n(see Note A4.1). When using grips of either type, care shall be \ntaken that the axis of the test specimen is located approxi­\nmately at the center line of the head of the testing machine (see \nNote A4.2). When using wedge grips the liners used behind the \ngrips shall be of the proper thickness. \nNoTE A4.l-Testing machines usually are equipped with wedge grips. \nThese wedge grips, irrespective of the type of testing machine, may be \nrefen-ed to as the \"usual type\" of wedge grips. The use of fine (180 or 240) \ngrit abrasive cloth in the \"usual\" wedge type grips, with the abrasive \ncontacting the wire specimen, cau be helpful in reducing specimen \nSECTION A-A \nFIG. A4.1 Wedge-type Gripping Device \n624 \nFIG. A4.2 Snubbing-type Gripping Device \nslipping aud breakage at the grip edges at tensile loads up to about \n1000 lb. For tests of specimens of wire which are liable to be cut at the \nedges by the \"usual type\" of wedge grips, the snubbing type gripping \ndevice has proved satisfactory. \nFor testing round wire, the use of cylindrical seat in the wedge gripping \ndevice is optional. \nNoTE A4.2-Any defect in a testing machine which may cause nonaxial \napplication of load should be corrected. \nA4.2.2 Pointed Micrometer-A micrometer with a pointed \nspindle and anvil suitable for reading the dimensions of the \nwire specimen at the fractured ends to the nearest 0.001 in. \n(0.025 mm) after breaking the specimen in the testing machine \nshall be used. \nA4.3 Test Specimens \nA4.3.1 Test specimens having the full cross-sectional area \nof the wire they represent shall be used. The standard gauge \nlength of the specimens shall be 10 in. (254 mm). However, if \nthe determination of elongation values is not required, any \nconvenient gauge length is permissible. The total length of the \nspecimens shall be at least equal to the gauge length (10 in.) \nplus twice the length of wire required for the full use of the grip \nemployed. For example, depending upon the type of testing \nmachine and grips used, the minimum total length of specimen \nmay vary from 14 to 24 in. (360 to 610 mm) for a 10-in. gauge \nlength specimen. \nA4.3.2 Any specimen breaking in the grips shall be dis­\ncarded and a new specimen tested. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-0674.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3100,
  "bestTextAlphaRatio": 0.7545
}