{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 335,
  "globalPageIndex": 1133,
  "width": 617.04,
  "height": 795.6,
  "text": "'--..___., \nASME BPVC.II.A-2025 SA-609 /SA-609M \nsimilar grid pattern for guidance in scanning. Grid numbers \nshall be stenciled on the casting for record purposes and \nfor grid area identity. The stenciled grid number shall \nappear in the upper right hand comer of the grid. When \ngrids are laid out on the casting surface and they encompass \ndifferent quality levels, each specific area shall be evaluated \nin accordance with the requirements of the specific quality \nlevel designated for that area. \n16.2 Overlap - Scan over the surface allowing 10% \nminimum overlap of the working diameters of the \nsearch unit. \n16.3 Inspection Requirements - All surfaces specified \nfor ultrasonic (UT) shall be completely inspected from \nboth sides, whenever both sides are accessible. The same \nsearch unit used for calibration shall be used to inspect the \ncasting. \n17. Additional Transducer Evaluation \n17.1 Additional information regarding any ultrasonic \nindication may be obtained through the use of other fre­\nquency, type, and size search unit. \n18. Acceptance Criteria \n18.1 Rejectable Conditions - The locations of all indi­\ncations having amplitudes greater than the 0.5 in. [13 mm] \nline given in 15.3.6, when amplitude three times (machined \nsurfaces) or six times (cast surfaces) shall be marked on \nthe casting surface. The boundary limits of the indication \nshall be determined by marking a sufficient number of \nmarks on the casting surfaces where the ultrasonic signal \nequals one half the reference amplitude, 0.25 in. [6 mm]. \nTo completely delineate the indication, draw a line around \nthe. outer boundary of the center of the number of marks \nto form the indication area. Draw a rectangle or other \nregular shape through the indication in order to form a \npolygon from which the area may be easily computed. \nIt is not necessary that the ultrasonic signal exceed the \namplitude reference line over the entire area. At some \nlocations within the limits of the indication, the signal may \nbe less than the reference line, but nevertheless still present \nsuch that it may be judged as a continuous, signal indica­\ntion. Rejectable conditions are as follows and when any \nof the conditions listed below are found, the indications \nshall be removed and repair welded to the applicable pro­\ncess specification. \n18.2 Linear Indications - A linear indication is defined \nas one having a length equal to or greater than three times \nits width. An amplitude of 1/ 2 in. [13 mm], such as would \nresult from tears or stringer type slag inclusion, shall be \nremoved. \n18.3 Non-Linear Indications: \n18.3.1 Isolated Indications - Isolated indications \nshall not exceed the limits of the quality level designated \nby the customer's purchase order listed in Table 3. An \nisolated indication may be defined as one for which the \ndistance between it and an adjacent indication is greater \nthan the longest dimension of the larger of the adjacent \nindications. \n18.3.2 Clustered Indications - Clustered indica­\ntions shall be defined as two or more indications that are \nconfined in a 1 in. [25 mm] cube. Clustered indications \nshall not exceed the limits of the quality level designated \nby the customer purchase order in Table 4. Where the \ndistance between indications is less than the lowest dimen­\nsion of the largest indication in the group, the cluster shall \nbe repair welded. \n18.3.3 The distance between two clusters must be \ngreater than the lowest dimension of the largest indication \nin either cluster. If they are not, the cluster having the \nlargest single indication shall be removed. \n18.3.4 All indications, regardless of their surface \nareas as indicated by transducer movement on the casting \nsurface and regardless of the quality level required, shall \nnot have a through wall distance greater than 1/ 3 T, where \nTis the wall thickness in the area containing the indication. \n18.3.5 Repair welding of cluster-type indications \nneed only be the extent necessary to meet the applicable \nquality level for that particular area. All other types of \nrejectable indications shall be completely removed. \n18.3.6 Repair welds of castings shall meet the quality \nlevel designated for that particular area of the casting. \n18.3.7 Any location that has a 75% or greater loss \nin back reflection and exceeds the area of the applicable \nquality level, and whose indication amplitudes may or may \nnot exceed the 0.5 in. [13 mm] rejection line, shall be \nrejected unless the reason for the loss in back reflection \ncan be resolved as not being caused by an indication. If \ngain is added and back echo is achieved without indication \npercent amplitude exceeding the 0.5 in. [13 mm] rejection \nline, the area should be accepted. \n19. Records \n19.1 Stenciling - Each casting shall be permanently \nstenciled to locate inspection zones or grid pattern for \nease in locating areas where rejectable indications were \nobserved. \n19.2 Sketch - A report showing the exact depth and \nsurface location in relation to the stencil numbers shall \nbe made for each rejectable indicator found during each \ninspection. \n1039 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1133.json",
  "tabulaTablesCsv": "tables_tabula/page-1133.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-1133.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4978,
  "bestTextAlphaRatio": 0.773,
  "camelotTablesPath": "camelot_tables/page-1133.json",
  "camelotTablesCsv": "camelot_tables/page-1133.csv",
  "camelotTableCount": 3
}