{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 887,
  "globalPageIndex": 1685,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 \ngridlines at 0.1 %, up to 1.2% strain; and for stress, minor \ngridlines at 0.2 ksi (2 MPa) and major gridlines at 2.0 ksi \n(20 MPa). \nIV-1300 FATIGUE DATA \nIf the material is to be used in cyclic service and the \nConstruction Code in which adoption is desired requires \nexplicit consideration of cyclic behavior, fatigue data for \ncharacterized samples shall also be furnished over the \nrange of design temperatures desired, from 10 3 to at least \n10 6 cycles. \nIV-1400 PHYSICAL PROPERTIES \nFor at least one heat meeting the requirements of the \nmaterial specification, the inquirer shall furnish to the \nBoiler and Pressure Vessel Committee on Materials ade­\nquate data necessary to establish values for coefficient \nof thermal expansion, coefficients of thermal conductivity \nand diffusivity, modulus of elasticity, Poisson's ratio, and \ndensity. Test methods shall be as follows: \n(a) ASTM E228, E289, or E831 for thermal expansion \ncoefficients \n(b) ASTM D2766, E1225, and E1461, for thermal con-\nductivity and thermal diffusivity \n(c) ASTM E1875 for modulus of elasticity \n(d) ASTM E1875 or ASTM E132 for Poisson's ratio \nData from other equivalent national or international \ntest standards shall be acceptable in lieu of those listed \nabove. Instantaneous, mean, and linear coefficients of \nthermal expansion shall be reported. Data for all physical \nproperties shall be provided at least over the range of \ntemperatures for which the material is to be used. It is \nrecommended that data be collected at temperature in­\ntervals not greater than 100°F (50°C). If the material is in­\ntended to be used below room temperature, data should \nbe provided for temperatures down to the minimum \nuse temperature. Data provided shall be expressed in \nthe units and to the number of significant figures shown \nin Table IV-800-1. \nIV-1500 DATA REQUIREMENTS FOR WELDS, \nWELDMENTS, AND WELDABILITY \nThe following welding information is required for a \nnew base metal for use in welded construction in an \nASME BPV Construction Code: data on weldability, data \non strength and toughness in the time-independent re­\ngime, data on strength in the time-dependent regime, \nand post-test examination. \nThe data requirements for weldability and for strength \nin the time-independent regime are the responsibility of \nthe BPV IX Standards Committee and are to be found in \nSection II, Part C, Guideline on the Approval of New Weld­\ning and Brazing Material Classifications Under the ASME \nBoiler and Pressure Vessel Code; and in Section IX, Man­\ndatory Appendix J, Guideline for Requesting P-Number \nAssignments for Base Metals Not Listed in Table QW / \nQB-422. The requirements for weld metal and weldment \ntoughness data vary with the class of materials and their \napplication, and are to be found in the Construction Codes \nthat have toughness rules - Sections III, VIII, and XII. \nData for welds and weldments for a new base material \nfor use in the time-dependent regime are the responsibil­\nity of the BPV II and BPV IX Standards Committees, and \nparticularly of their joint Subgroup on Strength of Weld­\nments. The following welding information shall be pro­\nvided by the Inquirer, to support the request for a Code \nCase for, or incorporation of, a new base material for \nuse in elevated temperature service: \n(a) When there is one or more AWS, ASME, or equiva­\nlent consumable specification and classification suitable \nfor use with the new base material, and when such con­\nsumable/process combinations can produce welds and \nweldments that have both good weldability and as high \nor higher strengths as the base metal over the range of ex­\npected service temperatures, no time-dependent test data \nis required. Rather, the inquirer shall submit a tabular or \ngraphical comparison of time-dependent allowable \nstresses for base metals nominally matching the composi­\ntions of such welding consumables against the allowable \nstresses proposed for the new base metal. (Note that \nsince neither ASME nor any other organization publishes \nallowable stresses for all-weld metal or for weldments, it \nis necessary to use, in this comparison, the allowable \nstresses for the base metals equivalent to the welding \nconsumables as a reasonable first approximation.) An ex­\nample of such a comparison appears in Table IV-1500-1. \n(b) When there is no such suitable consumable having \nan AWS, ASME, or equivalent specification and classifica­\ntion, or when it is necessary or desirable to use a new, \nperhaps nominally matching in composition to the base \nmetal, welding consumable, the following information \nshall be provided to the Committee: \n(1) the chemistry ranges for each element specified \nfor the consumable to be used. If the chemistry ranges \nvary for the consumables to be used for different pro­\ncesses, then the chemistry ranges of the consumables ap­\npropriate for each process shall be provided. \n(2) creep-rupture data for weldments made with \none lot of consumables for each process intended to be \nused with the new base material \n(-a) at temperature intervals not greater than \n200°F (100°C). Where there is a possibility of degradation \nof strength related to metallurgical instability, test tem­\nperatures shall be at intervals of 100°F (50°C) or less. \n(-b) over a temperature range spanning the range \nfrom the first rational temperature above the tempera­\nture at which time-dependent properties control the al­\nlowable stresses of the new base material to about \n1631 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1685.json",
  "tabulaTablesCsv": "tables_tabula/page-1685.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1685.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5500,
  "bestTextAlphaRatio": 0.7784
}