{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 588,
  "globalPageIndex": 1386,
  "width": 612.48,
  "height": 792.0,
  "text": "SA·814/SA-814M ASME BPVC.II.A-2025 \nSpecification for \nCold-Worked Welded Austenitic Stainless Steel Pipe \n1. Scope \n1.1 This specification covers two classes of flanged and \ncold-bending quality cold-worked straight-seam single or \ndouble welded austenitic steel pipe intended for high­\ntemperature and general corrosive services. \nNoTE 1-When the impact test criterion for a low-temperature service \nwould be 15 ft,lbf [20 J] energy absorption or 15 mils [0.38 mm] lateral \nexpansion, some of the austenitic stainless steel grades covered by this \nspecification are accepted by certain pressure vessel or piping codes \nwithout the necessity of making the actual test. For example, Grades 304, \n304L, and 347 are accepted by the ASME Pressure Vessel Code, Section \nVIII Division 1, and by the Chemical Plant and Refinery Piping Code, \nANSI 831.3 for service at temperatures as low as -425 °F [-250 °C] \nwithout qualification by impact tests. Other AISI stainless steel grades are \nusually accepted for service temperatures as low as -325 °F [-200 °C] \nwithout impact testing. Impact testing may, under certain circumstances, \nbe required. For example, materials with chromium or nickel content \noutside the AISI ranges, and for material with carbon content exceeding \n0.10 %, are required to be impact tested under the rules of ASME Section \nVIII Division 1 when service temperatures are lower than -50 °F [-45 \noq, \n1.2 Grades TP304H, TP304N, TP316H, TP316N, TP321H, \nTP347H, and TP348H are modifications of Grades TP304, \nTP316, TP321, TP347, and TP348, and are intended for \nhigh-temperature service. \n1.3 Two classes of pipe are covered as follows: \n1.3.1 Class SW-Pipe, single-welded with no addition of \nfiller metal and \n1.3.2 Class DW-Pipe, double-welded with no addition of \nfiller metal. \n1.4 Optional supplementary requirements are provided for \npipe where a greater degree of testing is desired. These \nsupplementary requirements call for additional tests to be made \nand, when desired, one or more of these may be specified in the \norder. \n1.5 Table 1 lists the dimensions of cold-worked single- or \ndouble-welded stainless steel pipe. Pipe having other dimen-\nsions may be furnished provided such pipe complies with all \nother requirements of this specification. \n1.6 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. The inch-pound units shall apply unless the \"M\" \ndesignation of this specification is specified in the order. \n1.7 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA480/ A480M Specification for General Requirements for \nFlat-Rolled Stainless and Heat-Resisting Steel Plate, \nSheet, and Strip \nA999/ A999M Specification for General Requirements for \nAlloy and Stainless Steel Pipe \nE112 Test Methods for Determining Average Grain Size \nE381 Method of Macroetch Testing Steel Bars, Billets, \nBlooms, and Forgings \nE527 Practice for Numbering Metals and Alloys in the \nUnified Numbering System (UNS) \n2.2 ANSI Standards: \nB31.3 Process Piping \n1324 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1386.json",
  "tabulaTablesCsv": "tables_tabula/page-1386.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1386.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3807,
  "bestTextAlphaRatio": 0.7589
}