{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 746,
  "globalPageIndex": 1544,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-999/SA-999M ASME BPVC.II.A-2025 \n17. Repair by Welding \n17 .1 Repair by welding of defects in seamless pipe (includ­\ning centrifugally cast pipe and forged and bored pipe) and of \nplate defects in welded pipe and, if specifically stated by the \napplicable product specification, weld seam defects in welded \npipe shall be permitted subject to the approval of the purchaser \nand with the further understanding that the composition of the \ndeposited filler metal shall be suitable for the composition \nbeing welded. Defects shall be thoroughly chipped or ground \nout before welding and each repaired length shall be reheat \ntreated or stress relieved as required by the applicable product \nspecification. Each length of repaired pipe shall be nondestruc­\ntively tested as required by the applicable product specifica­\ntion. \n17 .2 Repair welding shall be performed using procedures \nand welders or welding operators that have been qualified in \naccordance with the ASME Boiler and Pressure Vessel Code, \nSection IX. \n18. Retests \n18.1 If the results of the qualification tests of any lot do not \nconform to the requirements specified in the applicable product \nspecification, retests are permitted on additional lengths of pipe \nof double the original number from the same lot, each of which \nshall conform to the requirements specified. Only one retest of \nany lot is permitted. Nonconformance of the retest is cause for \nthe rejection of the lot. \n18.2 Any individual length of pipe that meets the test \nrequirements is acceptable. It is permitted to retest individual \nlengths that do not confonn to the test requirements, provided \nthat the reason for nonconformance is established and the \nnonconforming portion is removed. \n19. Retreatment \n19.1 If individual lengths of pipe selected to represent any \nlot fail to conform to the test requirements, the lot represented \nmay be reheat treated and resubmitted for test. The manufac­\nturer may reheat treat the pipe, but not more than twice, except \nwith the approval of the purchaser. \n20. Test Specimens \n20.1 Test specimens shall be taken from the ends of finished \npipe prior to any forming operations, or being cut to length. \n20.2 Specimens cut either longitudinally or transversely \nshall be acceptable for the tension test. \n20.3 If any test specimen shows flaws or defective \nmachining, the specimen may be discarded and another sub­\nstituted. \n21. Flattening Test Requirements \n21.l Seamless and Centrifugally Cast Pipe-A section of \npipe not less than 2½ in. [60 mm] in length shall be flattened \ncold between parallel plates in two steps. During the first step, \nwhich is a test for ductility, no cracks or breaks on the inside, \noutside, or end surfaces, except as allowed by 21.3.4, shall \noccur before the distance between the plates is less than the \nvalue of H calculated as follows: \nH=(l + e)v(e + t/D) \nwhere: \nH = distance between flattening plates, in. [mm], \nt = specified wall thickness, in. [mm], \n(2) \nD = specified outside diameter, outside diameter correspond­\ning to specified ANSI pipe size, or outside diameter \ncalculated by adding 2t (as defined above) to the \nspecified inside diameter in. [mm], and \ne = deformation per unit length (constant for a given grade \nof steel, 0.07 for medium carbon steel (maximum \nspecified carbon 0.19 % or greater), 0.08 for ferritic \nalloy steel, 0.09 for austenitic steel, 0.09 for duplex \n(ferritic/austenitic) stainless steel, and 0.09 for low­\ncarbon steel (maximum specified carbon 0.18 % or \nless)). \nDuring the second step, which is a test for soundness, the \nflattening shall be continued until the specimen breaks or the \nopposite walls of the specimen meet. \n21.2 Welded Pipe-A section of welded pipe not less than 4 \nin. [100 mm] in length shall be flattened cold between parallel \nplates in two steps. The weld shall be placed at 90° from the \ndirection of the applied force (at the point of maximum \nbending). During the first step, which is a test for ductility, no \ncracks or breaks on the inside or outside surfaces, except as \nprovided for in 21.3.4, shall occur before the distance between \nthe plates is less than the value of H calculated by Eq 2. During \nthe second step, which is a test for soundness, the flattening \nshall be continued until the specimen breaks or the opposite \nwalls of the specimen meet. \n21.3 Seamless, Centrifugally Cast, and Welded Pipe: \n21.3.1 Evidence of laminated or defective material or weld \nthat is revealed at any time during the entire flattening test shall \nbe cause for rejection. \n21.3.2 Surface imperfections not evident in the test speci­\nmen before flattening, but revealed during the first step of the \nflattening test, shall be judged in accordance with the finish \nrequirements. \n21.3.3 Superficial ruptures resulting from surface imperfec­\ntions shall not be a cause for rejection. \n21.3.4 When low D-to-t ratio tubular products are tested, \nbecause the strain imposed due to geometry is unreasonably \nhigh on the inside surface at the six and twelve o'clock \nlocations, cracks at these locations shall not be cause for \nrejection if the D-to-t ratio is less than 10. \n22. Nondestructive Test Requirements \n22.1 If required by the applicable product specification or \nthe purchase order, the pipe shall be tested by the hydrostatic \ntest (see 22.2) or by the nondestructive electric test (see 22.3). \n22.2 Hydrostatic Test: \n22.2.1 Except as allowed by 22.2.2 and 22.2.3, each length \nof pipe shall be tested by the manufacturer to a hydrostatic \npressure that will produce in the pipe wall a stress not less than \n60 % of the specified minimum yield strength for ferritic alloy \nsteel and stainless steel pipe, or 50 % of the specified minimum \nyield strength for austenitic alloy and stainless steel pipe and \n1490 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1544.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5803,
  "bestTextAlphaRatio": 0.7618
}