{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 333,
  "globalPageIndex": 1131,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.11.A-2025 SA-609 /SA·609M \n10.2.3 Indications producing a continuous response \nequal to or greater than the DAC with a dimension \nexceeding the maximum length shown for the applicable \nquality level shall be unacceptable. \n10.2.4 Other criteria agreed upon between the pur­\nchaser and the manufacturer. \n10.3 Other means may be used to establish the validity \nof a rejection based on ultrasonic inspection. \nNOTE 4 - The areas for the ultrasonic quality levels in Table 2 of \nPractice A 609 I A 609M refer to the surface area on the casting over \nwhich a continuous indication exceeding the DAC is maintained. \nNOTE 5 - Areas are to be measured from dimensions of the movement \nof the search unit by outlining locations where the amplitude of the \nindication is 100% of the DAC or where the back reflection is reduced \nby 75%, using the center of the search unit as a reference point to establish \nthe outline of the indication area. \nNOTE 6 - In certain castings, because of very long metal path distances \nor curvature of the examination surfaces, the surface area over which a \ngiven discontinuity is detected may be considerably larger or smaller \nthan the actual area of the discontinuity in the casting; in such cases, \nother criteria that incorporate a consideration of beam angles or beam \nspread must be used for realistic evaluation of the discontinuity. \nPROCEDURE B - BACK-WALL REFLECTION \nCALIBRATION PROCEDURE \n11. Apparatus \n11.1 Apparatus shall be kept on a regular six month \nmaintenance cycle during which, as a minimum require­\nment, the vertical and horizontal linearities, sensitivity, \nand resolution shall be established in accordance with the \nrequirements of Practice E 317. \n11.2 Search Units - Ceramic element transducers not \nexceeding 1.25 in. [82 mm] diameter or 1 in. 2 [25 mm 2 ] \nshall be used. \n11.3 Search Units Facing-A soft urethane membrane \nor neoprene sheet, approximately 0.025 in. [0.64 mm] \nthick, may be used to improve coupling and minimize \ntransducer wear caused by casting surface roughness. \n11.4 Calibration/Testing -The same system, includ­\ning the urethane membrane, used for calibration shall be \nused to inspect the casting. \n11.5 Other Inspections - Other frequencies and type \nsearch units may be used for obtaining additional informa­\ntion and pinpointing of individual indications. \n11.6 Couplant - A suitable liquid couplant, such as \nclean SAE 30 motor oil or similar commercial ultrasonic \ncouplant, shall be used to couple the search unit to the test \nsurface. Other couplants may be used when agreed upon \nbetween the purchaser and supplier. \n11.7 Reference Standards - Reference standards in \naccordance with Fig. 3 shall be used to calibrate the instru­\nment for inspecting machined and cast surfaces. Reference \nstandards shall be flaw free and machined within tolerances \nindicated. \n12. Ultrasonic Instrument \n12.1 Type - Pulsed ultrasonic reflection instrument \ncapable of generating, receiving, and amplifying frequen­\ncies of 1 MHz to 5 MHz shall be used for testing. \n12.2 Voltage - Line voltage shall be suitably regulated \nby constant voltage equipment and metal housing must be \ngrounded to prevent electric shock. \n12.3 Linearity - The instrument must provide a linear \npresentation (within ±5%) of at least 1.5 in. [40 mm] sweep \nto peak (S/P). \n12.4 Calibrated Gain Control of Attenuator - The \ninstrument shall contain a calibrated gain control or signal \nattenuator ( accurate within ± 10%) which will allow indica­\ntions beyond the linear range of the instrument to be mea­\nsured. \n12.5 Time-Corrected Gain - The instrument shall be \nequipped to compensate for signal decay with distance. A \nmethod should be available to equalize signal response at \ndifferent depths. \n13. Qualification \n13.1 The requirements for pre-production qualification \nare as follows: \n13.1.1 Personnel - The personnel qualification \nrequirements of SNT-TC- lA are applicable. Other person­\nnel qualification requirement documents may be used when \nagreed upon between the purchaser and the supplier. Rec­\nords of all personnel shall be available to customers upon \nrequest. \n13.1.2 Equipment- The equipment shall be capable \nof meeting the requirements in Section 12. \n14. Preparation \n14.1 Time of Inspection - The final ultrasonic accept­\nance inspection shall be performed after at least an austeni­\ntizing heat treatment and preferably after machining. In \norder to avoid time loss in production, acceptance inspec­\ntion of cast surfaces may be done prior to machining. \nMachined surfaces shall be acceptance inspected as soon \nas possible after machining. Repair welds may be inspected \nbefore the postweld heat treatment. \n1037 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 3,
  "tabulaTablesPath": "tables_tabula/page-1131.json",
  "tabulaTablesCsv": "tables_tabula/page-1131.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1131.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4702,
  "bestTextAlphaRatio": 0.7667
}