{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 729,
  "globalPageIndex": 1527,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 SA-989 /SA-989M \nthe same final heat treatment charge, after hot isostatic­\npressing or after final heat treatment. The microstructure shall \nmeet the requirements of 8.1.3.1. \n8.1.3.3 If the sample fails to meet the requirements for \nacceptance, it is permitted to retest each part in the lot. Each \npart that passes the requirements of 8.1.3.1 shall be accepted. \n8.2 Hydrostatic Tests-After they have been machined, \npressure-containing parts shall be tested to the hydrostatic shell \ntest pressures prescribed in ASME B16.5 for the applicable \nsteel rating for which the part is designed, and shall show no \nleaks. Parts ordered under these specifications for working \npressures other than those listed in the ASME B16.5 ratings \nshall be tested to such pressures as may be agreed upon \nbetween the manufacturer and purchaser. \n8.2.1 No hydrostatic test is required for welding neck or \nother flanges. \n8.2.2 The compact manufacturer is not required to perform \npressure tests on rough parts that are to be finish machined by \nothers. The fabricator of the finished part is not required to \npressure test parts that are designed to be pressure-containing \nonly after assembly by welding into a larger structure. The \nmanufacturer of the compacts, however, shall be responsible as \nrequired in 15.1 for the satisfactory performance of the parts \nunder the final test required in 8.2. \n9. Mechanical Properties \n9 .1 The material shall conform to . the requirements for \nmechanical properties prescribed in Table 3 at room tempera­\nture. \n9.2 Mechanical test samples shall be obtained from the \ncomponent stem, protrusion, or test part made from a single \npowder blend consolidated in the same hot-isostatic press using \nthe same pressure, temperature, and time parameter and \nheat-treated in the same final heat-treatment charge. If repair \nwelding is required (see Section 15), the test specimens prior to \ntesting shall accompany the repaired parts if a post weld heat \ntreatment is done. \n9.3 For normalized and tempered parts, or quenched and \ntempered parts, the central axis of the test specimen shall \ncorrespond to the ¼ T plane or deeper position where Tis the \nmaximum heat treated thickness of the represented part. In \naddition, for quenched and tempered parts, the midlength of the \ntest specimen shall be at least T from any second heat treated \nsurface. When the section thickness does not permit this \npositioning, the test specimen shall be positioned as near as \npossible to the prescribed location, as agreed to by the \npurchaser and the supplier. \n9.3.1 Alternatively, with prior approval of the purchaser, it \nis permitted to take the test specimen for the steel parts at a \ndepth (t) corresponding to the distance from the area of \nsignificant stress to the nearest heat treated surface and at least \ntwice this distance (2t) from any second surface. The test \ndepth, however, shall not be nearer to one treated surface than \n¾ in. [19 mm] and to the second treated surface than 1 ½ in. \n[38 mm]. This method of test specimen location would \nnormally apply to complex parts, or parts with thick cross­\nsectional areas where ¼ T and T testing (see 9.3) is not \npractical. Sketches showing the exact test locations shall be \napproved by the purchaser when this method is used. \n9 .4 For annealed alloy steels the test specimen may be taken \nfrom any convenient location. \n9.5 Tension Test: \n9.5.1 One tension test shall be made for each production lot \nin each heat treatment charge. \n9.5.1.1 When the heat treating cycles are the same and the \nfurnaces ( either batch or continuous type) are controlled within \n±25 °F [±14 °C] and equipped with recording pyrometers so \nthat complete records of heat treatment are available, then only \none tension test from each production lot of each type of part, \nand section size is required instead of one test from each \nproduction lot in each heat-treatment charge. The term \"type,\" \nas used here, designates a characteristic shape of a part, such as \nflange, elbow, tee, and so forth. \n9.5.1.2 The tension test specimen shall be made from \nmaterial accompanying the parts in final heat treatment. \n9.5.2 Testing shall be performed as specified in Specifica­\ntion A961/A961M using the largest feasible of the round \nspecimens. \n9.6 Hardness Tests: \n9.6.1 When two or more parts are produced, a minimum of \ntwo pieces per batch or continuous run as defined in 9.6.2 shall \nbe hardness tested as specified in Specification A961/A961M \nto ensure that the parts are within the hardness limits given for \neach grade in Table 3. When only one part is produced, it shall \nbe hardness tested as required. The purchaser is permitted to \nverify that the requirement has been met by testing at any \nlocation on any part, provided such testing does not render the \npart useless. \n9.6.2 When the reduced number of tension tests permitted \nby 9 .5 .1.1 is applied, additional hardness tests shall be made on \nTABLE 3 Tensile and Hardness Requirements \nTensile Strength, min, ksi Yield Strength, min, ksi Elongation in 2 in. Reduction of Area, Brinell Hardness UNS Designation [MPa] [MPa]A [50 mm] or 4D, min,% Number min,% \nAlloy Steels \nK90941 85 [585] 55 [380] 20.0 40.0 179-217 \nK90901 85 [585] 60 [415] 20.0 40.0 248 max \nK31545 75 [515] 45 [310] 20.0 30.0 156-207 \nK21590 Class 1 60 [415] 30 [205] 20.0 35.0 170 max \nK21590 Class 3 75 [515] 45 [310] 20.0 30.0 156-207 \nA Determined by the 0.2 % offset method. For territic steels only, the 0.5 % extension-under-load method also may be used. \n1473 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1527.json",
  "tabulaTablesCsv": "tables_tabula/page-1527.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1527.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5574,
  "bestTextAlphaRatio": 0.7334
}