{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 127,
  "globalPageIndex": 127,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-20/SA-Z0M \n11.4.4.5 If cooling rate data for the plate and cooling rate \ncontrol devices for the test coupons are available, the test \ncoupons may be heat treated separately in the device, provided \nthat this method is approved by the purchaser. \n11.5 Test Specimen Preparation: \n11.5.1 Tension test specimens for plates¾ in. [20 mm] and \nunder in thickness shall be the full thickness of the plates. The \ntest specimens shall conform to the requirements for either the \n1 ½-in. [ 40-mm] wide or the ½-in. [12.5-mm] wide rectangular \ntension test specimen of Test Methods and Definitions A370. \nThe 1 ½-in. [ 40-mm] wide test specimen may have both edges \nparallel. The ½-in. [12.5-mm] wide specimen may have a \nmaximum nominal thickness of¾ in. [20 mm]. \n11.5.2 For plates up to 4 in. [100 mm], inclusive, in \nthickness, tension test specimens may be the full thickness of \nthe plate and conform to the requirements for the 1 ½-in. \n[ 40-mm] wide rectangular tension test specimen of Test Meth­\nods and Definitions A370 if adequate testing machine capacity \nis available. \n11.5.3 For plates over¾ in. [20 mm] in thickness, except as \npermitted in 11.5.2, tension test specimens shall conform to the \nrequirements for the 0.500-in. [12.5-mm] diameter test speci­\nmen of Test Methods and Definitions A370. For plates between \n3/4 in. [20 mm] and 1-1/2 in. [40 mm] inclusive in thickness, the \naxis of the test specimen shall be located at 1/2 T, the center of \nthe thickness. For plates over 1-1/2 in. [40 mm], the axis of the \ntest specimen shall be located at l/4T, midway between the center \nof the thickness and the top or the bottom surface of the plate. \n11.6 Elongation Requirement Adjustments: \n11.6.1 Due to the specimen geometry effect encountered \nwhen using the rectangular tension test specimen for testing \nthin plate, adjustments in elongation requirements must be \nprovided for thicknesses under 0.312 in. [8 mm]. Accordingly, \nthe following deductions shall be made from the base elonga­\ntion requirements in the applicable product specification: \nElongation \nDeduction,% Plate Nominal Thickness Range, in. [mm] \n0.299-0.311 [7.60-7.89] 0.5 \n0.286-0.298 [7.30-7.59] 1.0 \n0.273-0.285 [7.00-7.29] 1.5 \n0.259-0.272 [6.60-6.99] 2.0 \n0.246-0.258 [6.20-6.59] 2.5 \n0.233-D.245 [5.90-6.19] 3.0 \n0.219-0.232 [5.50-5.89] 3.5 \n0.206-0.218 [5.20-5.49] 4.0 \n0.193-0.205 [4.90-5.19] 4.5 \nless than 0.193 [4.90] 5.0 \n11.6.2 Due to the inherently lower elongation that is obtain­\nable in thicker plate, adjustments in elongation requirements in \n2-in. [50-mm] gage length shall be provided for thicknesses \nover 3.5 in. [90 mm]. Accordingly, the following deductions \nshall be made from the base elongation requirements in 2 in. \n[50 mm] prescribed in the applicable product specification: \nElongation \nDeduction, % Plate Nominal Thickness Range, in. [mm] \n3.501-3.999 [90.00-102.49] 0.5 \n4.000-4.499 [102.50-114.99] 1.0 \n4.500-4.999 [115.00-127.49] 1.5 \n5.000-5.499 [127.50-139.99] 2.0 \n5.500-5.999 [140.0-152.49] 2.5 \n6.000 and thicker [152.50 and thicker] 3.0 \n11.6.3 A characteristic of certain types of alloy steels is a \nlocal disproportionate increase in the degree of necking down \nor contraction of the test specimens during the tension test, \nresulting in a decrease in the percentage of elongation as the \n75 \ngage length is increased. The effect is not so pronounced in \nthicker plates. For such material, if so stated in the applicable \nproduct specification for plates up to¾ in. [20 mm], inclusive, \nin thickness, if the percentage of elongation of an 8-in. \n[200-mm] gage length test specimen falls not more than 3 \npercentage points below the amount prescribed, the elongation \nshall be considered satisfactory if the percentage of elongation \nin 2 in. [50 mm] across the break is not less than 25 %. \n11.6.4 The tensile requirements tables in many of the \nproduct specifications covered by this general requirements \nspecification specify elongation requirements in both 8-in. \n[200-mm] and 2-in. [50-mm] gage lengths. Unless otherwise \nprovided in the applicable product specification, both require­\nments are not required to be applied simultaneously, and the \nelongation need only be determined in the gage length appro­\npriate for the test specimen used. After selection of the \nappropriate gage length, the elongation requirement for the \nalternative gage length shall be deemed not applicable. \n11. 7 This specification does not provide requirements for \nproduct tension testing subsequent to shipment (see 15.1). \nTherefore, the requirements of 11.1 through 11.6 and Section \n16 apply only for tests conducted at the place of manufacture \nprior to shipment. Compliance to Specification A20/20M and \nthe applicable product specification does not preclude the \npossibility that product tension test results may vary outside \nspecified ranges. The tensile properties will vary within the \nsame plate-as-rolled or piece, be it as-rolled, control-rolled, or \nheat-treated. The purchaser should, therefore, be aware that \ntension testing in accordance with the requirements of Speci­\nfication A20/ A20M does not provide assurance that all prod­\nucts of a plate-as-rolled will be identical in tensile properties \nwith the products tested; If the purchaser wishes to have more \nconfidence than that provided by Specification A20/ A20M \ntesting procedures, additional testing or requirements, such as \nSupplementary Requirement S4, should be imposed. \n11.8 Appendix X2 provides additional information on the \nvariability of tensile properties in plates for pressure vessels. \n12. Notch-Toughness Tests \n12.1 Charpy V-Notch Tests: \n12.1.1 Number of Tests-If Charpy V-Notch tests are \nspecified, except for quenched and tempered plates, and except \nas allowed by 12.1.1.1 and 12.1.1.2, one impact test (3 \nspecimens) for each specified orientation (see 12.1.2) shall be \nmade from each plate-as-rolled. For quenched and tempered \nplates, one impact test shall be made from each plate, as heat \ntreated. \n12.1.1.1 Plates Ordered Without the Heat Treatment Speci­\nfied by the Applicable Product Specification-Coupons for \nCharpy V-notch tests shall be taken in accordance with the \nsame requirements as given for tensile test coupons in 11.4.2 \nand 11.4.3. \n12.1.1.2 Plates Produced from Coil-If Charpy V-notch \ntests are specified, the number of impact tests required shall be \nthe same as the number specified for tension tests in 11.1.2 or \n11.1.3, whichever is applicable. The test coupons shall be taken \nfrom the material after decoiling and leveling. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0127.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6593,
  "bestTextAlphaRatio": 0.6948
}