{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 255,
  "globalPageIndex": 255,
  "width": 612.48,
  "height": 792.0,
  "text": "ASME BPVC.II.A-2025 SA-179/SA-179M \n9. Product Analysis \n9.1 When requested on the purchase order, a product analy­\nsis shall be made by the supplier from 1 tube per 250 pieces or \nwhen tubes are identified by heat, one tube per heat shall be \nanalyzed. The chemical composition thus determined shall \nconform to the requirements specified. \n9.2 If the original test for product analysis fails, retests of \ntwo additional billets or tubes shall be made. Both retests, for \nthe elements in question, shall meet the requirements of the \nspecification; otherwise all remaining material in the heat or lot \n(Note 2) shall be rejected or, at the option of the producer, each \nbillet or tube may be individually tested for acceptance. Billets \nor tubes which do not meet the requirements of the specifica­\ntion shall be rejected. \nNOTE 2-A lot consists of 250 tubes. \n10. Hardness Requirements \n10.1 The tubes shall have a hardness number not exceeding \n72 HRBW. \n11. Mechanical Tests Required \n11.1 Flattening Test-One flattening test shall be made on \nspecimens from each of two tubes from each lot (Note 2) or \nfraction thereof. \n11.2 Flaring Test-One flaring test shall be made on speci­\nmens from each of two tubes from each lot (Note 2) or fraction \nthereof. \n11.3 Flange Test-When specified as a substitute for the \nflaring test, for tubes having a wall thickness (actual mean \nwall) less than 10 % of the outside diameter, one test shall be \nmade on specimens from each of two tubes from each lot (Note \n2) or fraction thereof. For tubes other than specified above, the \nflange test shall not be required. \n11.4 Hardness Test-Rockwell hardness tests shall be made \non specimens from two tubes from each lot. The te~ lot \napplies to all tubes, prior to cutting, of the same nominal \ndiameter and wall thickness which are produced from the same \nheat of steel. When final heat treatment is in a batch-type \nfurnace, a lot shall include only those tubes of the same size \nand the same heat which are heat treated in the same furnace \ncharge. When the final heat treatment is in a continuous \nfurnace, a lot shall include all tubes of the same size and heat, \nheat treated in the same furnace at the same temperature, time \nat heat, and furnace speed. \n11.5 Hydrostatic Test-Each tube shall be subjected to the \nhydrostatic test, or, instead of this test, a nondestructive electric \ntest may be used when specified by the purchaser. \n12. Product Marking \n12.1 In addition to the marking prescribed in Specification \nA450/ A450M, the marking shall include the name and order \nnumber of the purchaser. \n13. Keywords \n13.1 cold drawn tube; condenser tubes; heat exchanger \ntubes; low carbon steel; seamless tube \nEXPLANATORY NOTES \nNorn I-For purposes of design, the following tensile properties may \nbe assumed: -\nTensile strength, min, ksi [MPa] \nYield strength, min, ksi [MPa] \nElongation in 2 in. or 50 mm, min, % \n47 [325] \n26 [180] \n35 \n203 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-0255.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2942,
  "bestTextAlphaRatio": 0.7471
}