{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 727,
  "globalPageIndex": 1525,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-989 /SA-989M \n3.1.1 can, n-the container used to encapsulate the powder \nduring the pressure consolidation process that is removed \npartially or fully from the final part. \n3.1.2 compact, n-the consolidated powder from one can \nthat may be used to make one or more parts. \n3.1.3 consolidation, n-the bonding of adjacent powder \nparticles in a compact under pressure by heating to a tempera­\nture below the melting point of the powder. \n3.1.4 fill stem, n-the part of the compact used to fill the can \nthat is not usually integral to the part produced. \n3.1.5 hot isostatic-pressing, n-a process for simultaneously \nheating and forming a compact in which the powder is \ncontained in a sealed formable enclosure, usually made from \nmetal, and the so-contained powder is subjected to equal \npressure from all directions at a temperature high enough to \npermit plastic deformation and consolidation of the powder \nparticles to take place. \n3.1.6 lot, n-a number of parts produced from a single \npowder blend following the same manufacturing conditions. \n3.1.7 part, n-a single item coming from a compact, either \nprior to or after machining. \n3.1.8 powder blend, n-a homogeneous mixture of powder \nfrom one or more heats of the same grade. \n3.1.9 rough part, n-the part prior to final machining. \n4. Ordering Information \n4.1 It is the responsibility of the purchaser to specify in the \npurchase order all requirements that are necessary for material \nordered under this specification. Such requirements may \ninclude, but are not limited to, the following: \n4.1.1 Quantity (weight or number of parts). \n4.1.2 Name of material or UNS number. \n4.1.3 ASTM designation and year of issue. \n4.1.4 Dimensions (tolerances and surface finishes). \n4.1.5 Microstructure examination, if required (5.1.5). \n4.1.6 Inspection (14.1). \n4.1.7 Whether rough part or finished machined part (8.2.2). \n4.1.8 Supplementary requirements, if any. \n4.1.9 Additional requirements (see 7.2.1 and 16.1). \n4.1.10 Requirement, if any, that the manufacturer shall \nsubmit drawings for approval showing the shape of the rough \npart before machining and the exact location of test specimen \nmaterial (see 9.3.1). \n5. Materials and Manufacture \n5.1 Manufacturing Practice: \n5.1.1 Powder should be protected during storage to prevent \nthe detrimental pick-up of oxygen and other contaminants. \n5.1.2 Compacts shall be manufactured by placing a single \npowder blend into a can, evacuating the can, and sealing it. The \ncan material shall be selected to ensure that it has no deleteri­\nous effect on the final product. The entire assembly shall be \nheated and placed under sufficient pressure for a sufficient \nperiod of time to ensure that the final consolidated part meets \nthe density requirements of 8.1.2.1. One or more parts shall be \nmachined from a single compact. \n5 .1.3 The powder shall be prealloyed and made by a melting \nmethod capable of producing the specified chemical \ncomposition, such as but not limited to air or vacuum induction \nmelting, followed by gas atomization. \n5 .1.4 When powder from more than one heat is used to \nmake a blend, the heats shall be mixed thoroughly to ensure \nhomogeneity. \n5 .1.5 The compact shall be sectioned and the microstmcture \nexamined to check for porosity and other internal imperfec­\ntions and shall meet the requirements of 8.1.3. The sample shall \nbe taken from the fill stem or from a location in a part as agreed \nupon by the manufacturer and purchaser. \n5.1.6 Unless otherwise specified in the purchase order, the \nmanufacturer shall remove the can material from the surfaces \nof the consolidated compacts by chemical or mechanical \nmethods, such as by pickling or machining. This removal shall \nbe done before or after heat treatment at the option of the \nmanufacturer (see Note 1). \nNorn I-Often, it is advantageous to leave the can material in place \nnntil after heat treatment or further thermal processing of the consolidated \ncompact. \n5.1.7 Supplementary Requirements S2, S4, S5, and S14 are \nmandatory. \n6. Chemical Composition \n6.1 The steel both as a blend and as a part shall conform to \nthe requirements for chemical composition prescribed in Table \n1. Test Methods, Practices, and Terminology A751 shall apply. \n6.1.1 A representative sample of each blend of powder shall \nbe analyzed by the manufacturer to determine the percentage of \nelements prescribed in Table 1. The blend shall conform to the \nchemical composition requirements prescribed in Table 1. \n6.1.2 When required by the purchaser, the chemical com­\nposition of a sample from one part from each lot of parts shall \nbe determined by the manufacturer. The composition of the \nsample shall conform to the chemical composition require­\nments prescribed in Table 1. \n6.2 Addition of lead, selenium, or other unspecified ele­\nments for the purpose of improving the machinability of the \ncompact shall not be permitted. \n6.3 The steel shall not contain an unspecified element, for \nthe ordered grade, to the extent that the steel conforms to the \nrequirements of another grade for which that element is a \nspecified element having a required minimum content. \n7. Heat Treatment \n7.1 After hot isostatic-pressing, the compacts shall be an­\nnealed prior to heat treating in accordance with the require­\nments of Table 2. At the option of the producer, this anneal \nshall be a separate operation following powder consolidation or \nshall be a part of the consolidation process. \n7.2 The alloy steels shall be heat treated in accordance with \nthe requirements of 7 .1 and Table 2. \n7.2.1 Liquid Quenching-When agreed to by the purchaser, \nliquid quenching followed by tempering shall be permitted \nprovided the temperatures in Table 2 for each grade are \nutilized. \n7.2.1.1 Marking-Parts that are liquid quenched and tem­\npered shall be marked \"QT\". \n1471 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1525.json",
  "tabulaTablesCsv": "tables_tabula/page-1525.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1525.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5867,
  "bestTextAlphaRatio": 0.758,
  "noteOcrPath": "note_ocr/page-1525.txt",
  "noteOcrCount": 1,
  "noteOcrNotes": [
    "Note 1—Often, it is advantageous to leave the can material in place"
  ]
}