{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 744,
  "globalPageIndex": 744,
  "width": 599.4,
  "height": 844.08,
  "text": "SA-414/SA-414M ASME BPVC.II.A-2025 \nSpecification for \nSteel, Sheet, Carbon, and High-Strength, Low-Alloy for \nPressure Vessels \n1. Scope \n1.1 This specification covers hot-rolled carbon steel sheet \nfor pressure vessels involving fusion welding or brazing. \nWelding and brazing technique is of fundamental importance \nand shall be in accordance with commercial practices. \n1.2 The following grades are included in this specification: \nMechanical Requirements \nYield Strength, min Tensile Strength, min \nGrade ksi MPa ksi MPa \nA 25 170 45 310 \nB W ~ W ~ \nC ~ ~ ~ ~ \nD 35 240 60 415 \nE M ~ ~ ~ \nF ~ ~ ro ~ \nG 45 310 75 515 \nH 45 310 75 515 \n1.3 Hot-rolled carbon steel sheet is generally furnished in \ncut lengths and to decimal thickness only. Coils may be \nfurnished, provided tension test specimens are taken to repre­\nsent the middle of the slab as required by 6.1.3. The purchaser \nshould recognize this may require cutting the coils to obtain \ntest samples and results in half-size coils. The sheet is \nfurnished to the following size limits: \nWidth, in. [mm] \nThickness, in. [mm] Over 12 [Over 300] \n0.270 to 0.230 [7.0 to 6.0] sheet (coils only) \nUnder 0.230 to 0.057 [6.0 to 1.5] sheet \n1.4 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system shall \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.5 Tolerances are found in General Requirements Specifi­\ncations A568/ A568M and A635/ A635M. The appropriate Gen­\neral Requirements specification is applied based on the thick­\nness and width of the product ordered. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA568/A568M Specification for Steel, Sheet, Carbon, \nStructural, and High-Strength, Low-Alloy, Hot-Rolled and \nCold-Rolled, General Requirements for \nA635/A635M Specification for Steel, Sheet and Strip, \nHeavy-Thickness Coils, Hot-Rolled, Alloy, Carbon, \nStructural, High-Strength Low-Alloy, and High-Strength \nLow-Alloy with Improved Formability, General Require­\nments for \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \n694 \n3. Terminology \n3.1 Definitions-For definitions of other terms used in this \nspecification refer to Terminology A941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2.I lot, n-all coils of one thickness and width combina­\ntion from one heat and one rolling on the hot mill, up to 100 \ntons [90 tonnes] total mass. \n4. Ordering Information \n4.1 Orders for material under this specification shall include \nthe following information, as required, to describe the material \nadequately: ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0744.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3208,
  "bestTextAlphaRatio": 0.7353
}