{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 781,
  "globalPageIndex": 781,
  "width": 622.44,
  "height": 861.36,
  "text": "ASME BPVC.II.A-2025 SA-449 \n3 .1.4 Type, that is, Type 1, or Type 3 as required, \n3.1.5 ASTM designation and year of issue, and \n3.1.6 Other components such as nuts and washers if re­\nquired. \n3.1.7 Hot-Dip or Mechanically Deposited Zinc Coatings­\nFor hot-dip or mechanically deposited zinc coatings covered by \n5.1 and requiring over-tapped nuts, specify the zinc coating \nprocess required, that is, hot-dip, mechanically deposited, or no \npreference (see 5.1). \n3.1.8 Other Coatings-Specify other protective coating if \nrequired (see 5.2). \n3.1.9 Specify if inspection at point of manufacture is re-\nquired. \n3 .1.10 Test reports if required. \n3.1.11 Supplementary or special requirements. \n3.1.12 For establishment of a part identifying system, see \nASME B18.24. \nNorn 1-A typical ordering description follows: 1000 pieces Vs in. \ndiameter x 4.0 in. long hex cap screw, Type 1, ASTM A449-XX, each \nwith one finished hex nut ASTM A563, Grade DH. Each component \nmechanically zinc coated in accordance with B695, Class 5, Type Il. \n3.2 Suitable Nuts and Washers: \n3.2.1 Suitable nuts are covered in Specification A563. \nUnless otherwise specified, the grade and style of nut shall be \nas follows: \nFastener Size and Surface Finish \n¼ to 1 1 /2 in., plain (or with a coating of insufficient \nthickness to require over-tapped nuts) \nOver 1 ½ to 3 in., plain (or with a coating of insuffi' \ncient thickness to require over-tapped nuts) • \n¼ to 3 in., zinc-coated (or with a coating thickness \nrequiring over-tapped nuts) \n¼ to 3 in., Type 3 \nNut Grade and StyleA \nB, hex \nA, heavy hex \nDH, heavy hex \nC3, DH3, heavy hex \nA Nuts of other grades and styles having specified proof load stresses (Specifica­\ntion A563, Table 3) greater than the specified grade and style of nut are suitable. \n3.2.2 Unless otherwise specified, washers ordered with \nfasteners shall be furnished to the requirements of Specification \nF436, Type 1 or Specification F436, Type 3. Washers for A449 \nType 3 fasteners shall conform to Specification F436 Type 3. \n4. Materials and Manufacture \n4.1 Heat Treatment: \n4.1.1 Type 1 fasteners produced from medium carbon steel \nshall be quenched in a liquid medium from the austenitizing \ntemperature. \n4.1.2 Type 1 fasteners produced from medium carbon steel \nto which chromium, nickel, molybdenum, or boron were \nintentionally added, and Type 3 fasteners, shall be quenched in \noil from the austenitizing temperature. \n4.1.3 Type 1 and Type 3 fasteners, regardless of the steel \nused, shall be tempered by reheating to not less than 800°F. \n4.2 Threading-Threads shall be rolled, cut, or ground. \n4.3 Secondary Processing-If any processing which can \naffect the mechanical properties of the fasteners is performed \nafter the initial testing, the fasteners shall be retested for all \nspecified mechanical properties affected by the reprocessing. \n5. Protective Coatings \n5.1 Zinc, Hot Dip, and Mechanically Deposited Requiring \nOver-tapped Nuts: \n5.1.1 When zinc-coated fasteners are required, the pur­\nchaser shall specify the zinc-coating process, such as, hot-dip, \nmechanically deposited, or no preference. \n5.1.2 When hot dip is specified, the fasteners shall be zinc \ncoated by the hot-dip process in accordance with the require­\nments of Specification F2329. \n5.1.3 When mechanically deposited is specified, the fasten­\ners shall be zinc coated by the mechanical deposition process \nin accordance with the requirements of Class 55 of Specifica­\ntion B695. \n5.1.4 When no preference is specified, the supplier may \nfurnish either a hot-dip zinc coating in accordance with \nSpecification F2329, or a mechanically deposited zinc coating \nin accordance with Specification B695, Class 55. All \nmating components shall be coated by the same zinc \ncoating process, and the suppliers' option shall be limited to \none process per item with no mixed processes in a lot. \nNorn 2-When the intended application requires that assembled \ntension exceeds 50 % of minimum bolt or stud proof load, an anti-galling \nlubricant may be needed. Application of such a lubricant to nuts and a test \nof the lubricant efficiency are provided in Supplementary Requirement S 1 \nof Specification A563 and should be specified when required. \n731 \n5.2 Other Coatings: \n5.2.1 When other coatings are required, the purchaser shall \nspecify the coating specification, including the classification \ncodes or grade numbers to identify the coating material, \nthickness, supplemental treatments, or other requirements to \ndefine the coating. The fasteners shall be coated in accordance \nwith and conform to the specified coating specification. \n5.2.2 When a specification does not apply, the purchaser \nshall specify the desired coating, coating thickness, supplemen­\ntal treatments, or other requirements to define the coating. \n6. Chemical Composition \n6.1 Type 1 fasteners shall be plain carbon steel, carbon \nboron steel, alloy steel, or alloy boron steels, at the manufac­\nturers option, conforming to the requirements in Table 1. \n6.2 Type 3 fasteners shall be weathering steel and shall \nconform to one of the chemical compositions specified in Table \n2. The selection of the chemical composition, A, B, C, D, E or \nF, shall be a the option of the manufacuturer. See Guide G 101 \nfor methods of estimating the atmospheric corrosion resistance \nof low alloy steel. \n6.3 Product analyses made on finished fasteners represent­\ning each lot shall conform to the product analysis requirements \nspecified in Table 1 or Table 2, as applicable. \n6.4 Heats of steel to which bismuth, selenium, tellurium, or \nlead has been intentionally added shall not be permitted for \nbolts. Compliance shall be based on certification that heats of \nsteel having any of the listed elements intentionally added were \nnot used. \n6.5 Chemical analyses shall be performed in accordance \nwith Test Methods, Practices, and Terminology A751. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0781.json",
  "tabulaTablesCsv": "tables_tabula/page-0781.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0781.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5903,
  "bestTextAlphaRatio": 0.7506
}