{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 790,
  "globalPageIndex": 1588,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-1016/SA-1016M ASME BPVC.II.A-2025 \nentire external surface of the tube after holding the pressure for \nnot less than 5 s after the surface of the water has become calm. \nIf any tube shows leakage during the air underwater test, it \nshall be rejected. Any leaking areas may be cut out and the tube \nretested. \n27.2 Air Pressure Test-When agreed to by the purchaser \nand supplier, a pneumatic pressure test in accordance with Test \nMethod A1047/A1047M may be used in lieu of the air \nunderwater test. \nAcceptance criteria shall be as follows: \n:51.5 [:540] \n> 1.5 :52.0 [>40 :550] \n>2.0 :52.5 [>50 :565] \n>2.5 :53.0 [>65 :575] \n>3.0 [>7.5] \n28. Certification and Test Reports \n0.003 [0.076] \n0.004 [0.162] \n0.005 [0, 127] \n0,006 [0, 152] \nBy agreement \n28.1 The producer or supplier shall furnish a certificate of \ncompliance stating that the material was manufactured, \nsampled, tested, and inspected in accordance with the \nspecification, including year date, the supplementary \nrequirements, and any other requirements designated in the \npurchase order or contract, and the results met the requirements \nof that specification, the supplementary requirements and the \nother requirements. A signature or notarization is not required \non the certificate of compliance, but the document shall be \ndated and shall clearly identify the organization submitting the \nreport. Notwithstanding the absence of a signature or \nnotarization, the certifying organization is responsible for the \ncontents of the document. \n28.2 In addition to the certificate of compliance, the manu­\nfacturer shall furnish test reports that include the following \ninformation and test results, where applicable: \n28.2.1 Heat number, \n28.2.2 Heat analysis, \n28.2.3 Product analysis, when specified, \n28.2.4 Tensile prope1ties, \n28.2.5 Width of the gauge length, when longitudinal strip \ntension test specimens are used, \n28.2.6 Flattening test acceptable, \n28.2. 7 Reverse flattening test acceptable, \n28.2.8 Flaring test acceptable, \n28.2.9 Flange test acceptable, \n28.2.10 Hardness test values, \n28.2.11 Hydrostatic test pressure, \n28.2.12 Nondestructive electri.c test method, \n28.2.13 Impact test results, and \n28.2.14 Any other test results or information required to be \nreported by the product specification or the purchase order or \ncontract. \n28.3 The manufacturer shall report, along with the test \nreport or in a separate document, any other information that is \nrequired to be reported by the product specification or .the \npurchase order or contract. \n28.4 The certificate of compliance shall include a statement \nof explanation for the letter added to the specification number \nmarked on the tubes (see 30.3) when all of the requirements of \nthe specification have not been completed. The purchaser must \ncertify that all requirements of the specification have been \ncompleted before the removal of the letter (that is, X, Y, or Z). \n28.5 A test report, certificate of compliance, or similar \ndocument printed from or used in electronic form from an \nelectronic data interchange (EDI) transmission shall be re­\ngarded as having the same validity as a counterpart printed in \nthe certifier's facility. The content of the EDI transmitted \ndocument shall meet the requirements of the invoked ASTM \nstandard(s) and conform to any existing EDI agreement be­\ntween the purchaser and supplier. Notwithstanding the absence \nof a signature, the organization submitting the EDI transmis­\nsion is responsible for the content of the report. \n29. Inspection \n29.1 The manufacturer shall afford the purchaser's inspector \nall reasonable facilities necessary to be satisfied that the \nproduct is being produced and furnished in accordance with the \nordered product specification. Mill inspection by the purchaser \nshall not interfere with the manufacturer's operations. \n30. Rejection \n30.1 Each length of tubing received from the manufacturer \nmay be inspected by the purchaser and, if it does not meet the \nrequirements of the ordered product specification based on the \ninspection and test method as outlined in the ordered product \nspecification, the length shall be rejected and the manufacturer \nshall be notified. Disposition of rejected tubing shall be a \nmatter of agreement between the manufacturer and the pur­\nchaser. \n30.2 Material that fails in any of the forming operations or \nin the process of installation and is found to be defective shall \nbe set aside and the manufacturer shall be notified for mutual \nevaluation of the material's suitability. Disposition of such \nmaterial shall be a matter for agreement. \n31. Product Marking \n31.1 Each length of tube shall be legibly stenciled with the \nmanufacturer's name or brand, the specification number, and \ngrade. The marking need not include the year of issue of the \nspecification. For tubes less than 1 ¼ in. [31. 8 mm] in diameter \nand tubes under 3 ft [l m] in length, the required information \nmay be marked on a tag securely attached to the bundle or box \nin which the tubes are shipped. \n31.2 For austenitic steel pipe, the marking paint or ink shall \nnot contain detrimental amounts of harmful metals, or metal \nsalts, such as zinc, lead, or copper, which cause c01Tosive \nattack on heating. \n31.3 When it is specified that certain requirements of a \nspecification adopted by the ASME Boiler and Pressure Vessel \nCommittee are to be completed by the purchaser upon receipt \nof the material, the manufacturer shall indicate that all require­\nments of the specification have not been completed by a letter \nsuch as X, Y, or Z, immediately following the specification \nnumber. This letter may be removed after completion of all \nrequirements in accordance with the specification. An expla­\nnation of specification requirements to be completed is pro­\nvided in 28.4. \n1534 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1588.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5815,
  "bestTextAlphaRatio": 0.7534
}