{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 532,
  "globalPageIndex": 532,
  "width": 599.4,
  "height": 844.08,
  "text": "SA-325 ASME BPVC.II.A-2025 \ninterfere unnecessarily with the operation of the manufactur­\ner's works or supplier's place of business. \n12. Rejection and Rehearing \n12.1 Disposition of nonconforming bolts shall be in accor­\ndance with the Practice Fl470 section titled \"Disposition of \nNonconforming Lots.\" \n13. Certification \n13 .1 When specified on the purchase order, the manufac­\nturer or supplier, whichever is the responsible party as defined \nin Section 14, shall furnish the purchaser a test reports that \nincludes the following: \n13. l.1 Heat analysis, heat number, and a statement certify­\ning that heats having the elements listed in 5.4 intentionally \nadded were not used to produce the bolts, \n13.1.2 Results of hardness, tensile, and proof load tests, \n13.1.3 Results of rotational capacity tests. This shall include \nthe test method used (solid plate or tension measuring device); \nand the statement \"Nuts lubricated\" for zinc-coated nuts when \nshipped with zinc-coated bolts, \n13.1.4 Zinc coating measured coating weight/thickness for \ncoated bolts, \n13.1.5 Statement of compliance of visual inspection for \nsmface discontinuities (Section 8), \n13.1.6 Statement of compliance with dimensional and \nthread fit requirements, \n13.1.7 Lot number and purchase order number, \n13.1.8 Complete mailing address of responsible party, and \n13.1.9 Title and signature of the individual assigned certi-\nfication responsibility by the company officers. \n13.2 Failure to include all the required information on the \ntest report shall be cause for rejection. \n14. Responsibility \n14.1 The party responsible for the fastener shall be the \norganization that supplies the fastener to the purchaser. \n15. Product Marking \n15.1 Manufacturer's Identification-All Type 1 and 3 bolts \nshall be marked by the manufacturer with a unique identifier to \nidentify the manufacturer. • \n15.2 Grade Identification: \n15.2.1 Type 1 bolts shall be marked \"A325.\" \n15.2.2 Type 3 bolts shall be marked \"A325\" with the \n\"A325\" underlined. The use of additional distinguishing marks \nto indicate that the bolts are weathering steel shall be at the \nmanufacturer's option. \n15.3 Marking Location and Methods-All marking shall be \nlocated on the top of the bolt head and shall be either raised or \ndepressed at the manufacturer's option. \n15.4 A.cceptance Criteria-Bolts which are not marked in \naccordance with these provisions shall be considered noncon­\nforming and subject to rejection. \n15.5 Type and manufacturer's identification shall \nshall be separate and distinct. The two identifications \nshall preferably be in different locations and, when on \nthe same level, shall be separated by at least two spaces. \n16. Packaging and Package Marking \n16.1 Packaging: \n16.1.l Unless otherwise specified, packaging shall be in \naccordance with Practice D395 l. \n16.1.2 When zinc coated nuts are included on the same \norder as zinc coated bolts, the bolts and nuts shall be shipped \nin the same container. \n16.1.3 When special packaging requirements are required, \nthey shall be defined at the time of the inquiry and order. \n16.2 Package Marking: \n16.2. l Each shipping unit shall include or be plainly marked \nwith the following information: \n16.2.1.1 ASTM designation and type, \n16.2.1.2 Size, \n16.2.1.3 Name and brand or trademark of the manufacturer, \n16.2.1.4 Number of pieces, \n16.2.1.5 Lot number; when nuts, washers or direct tension \nindicators, or combination thereof, are ordered with A325 \nheavy hex structural bolts, the shipping unit shall be marked \nwith the lot number in addition to the marking required by the \napplicable product specification, \n16.2.1.6 Purchase order number, and \n16.2.1.7 Country of origin. \n17. Keywords \n17 .1 bolts; carbon steel; steel; structural; weathering steel \nSUPPLEMENTARY REQUIREMENTS \nThe following supplementary requirements shall apply only when specified by the purchaser in the \ncontract or order. Details of these supplementary requirements shall be agreed upon in writing between \nthe manufacturer and purchaser. Supplementary requirements shall in no way negate any requirement \nof the specification itself. \n480 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0532.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4144,
  "bestTextAlphaRatio": 0.75
}