{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 434,
  "globalPageIndex": 434,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-264 ASME BPVC.II.A-2025 \n·t· Test \nqcimen \n. . \nt • (T·a) minus at /qast OM \nFinish Cut on C,;,rbon Stu/ Sidfl \nMint = 2W \n; II i--:---,~ \nJ;, r \nct = 1,'8' Max \nw ; /1/?IJI \n·shq,;,r Blocks/ \nJ\" \n! ' f t \n.L------,----~' \n····- ....... 2 Yz~ ........ . \nShear Blocks shed! bfl !Jolted Firmly To~<Zfher a~.rlnsf \nFi!l2r Piece whlch Providq Spacq 0.005' W/dqr th,m t \nof Specimen \nMetric Equivalents \nin. mm in. mm \n0.005 0.127 25.4 \n1/a 3.18 2½ 64.5 \n¾ 19.1 3 76.2 \nFIG. 1 Test Specimen and Method of Making Shear Test of Clad \nPlate \ncladding thickness for shear testing shall be 0.075 in. (1.9 mm), \nexclusive as ordered. Testing for shear strength for clad plates \nwith minimum cladding thickness of 0.075 in. (1.9 mm) or less \nshall be permitted upon agreement between the purchaser and \nthe manufacturer. \n7.2.2 Bond Strength-As an alternative to the shear strength \ntest provided in 7.2.1, or when agreed upon by the purchaser \nand the manufacturer, or both, three bend tests shall be made \nwith the alloy cladding in compression to determine the quality \nof the bond. These bend tests shall be made in the manner of \nthe tension tests indicated in Fig. 2 and shall be bent through an \nangle of 180° to the bend diameters provided for in either \nr \nPoro/le/ Section \n1 \nrAboul --nofless lhon 9,r- 3\" \nPoro/le/ within 0.010\" \nL-J:~..:'.....,--r- ... 1----_'i_\"_:_t:_= __ ·n--.....1 ~ \n\\ ------------ \"\",, ~ ~ \n1 8\":f.0.0/\"Gogelenglh ''l\"toJ• \nl f'or Measuring Elongation Radius \n1 of\"fer Fracture \nAppro'ximole!y 2• \nMetric Equivalents \nin. mm in. mm \n0.01 0.254 1½ 38.1 \n1/a 3.17 2 50.8 \n¼ 6.35 3 76.2 \n1 25.4 8 203.2 \nNoTE 1-When necessary, it is permissible to use a narrower specimen, \nbut in such a case the reduced portion shall be not less than 1 in. in width. \nNoTE 2-Punch marks for measuring elongation after fracture shall be \nmade on the flat or on the edge of the specimen and within the parallel \nsection; either a set of nine punch marks I in. apart, or one or more sets \nof 8-in. punch marks may be used. \nNoTE 3-The dimension t is the thickness of the test specimen as \nprovided for in the applicable material specifications. \nFIG. 2 Standard Rectangular Tension Test Specimen with 8-in. \nGage Length \nSpecification A6/A6M or Specification A20/A20M, Appendix \nX4 or equivalent, as applicable. At least two of the three tests \nshall show not more than 50 % separation on both edges of the \nbent portion. Greater separation shall be cause for rejection. \n7.3 Methods and practices relating to mechanical testing \nrequired by this specification shall be in accordance with the \nTest Methods and Definitions of A370. \n8. Number of Tests and Retests \n8.1 One or more tension tests, as required by the specifica­\ntions for the base metal and when specified, one shear test or \nthree bond bend tests shall be made, representing each plate as \nrolled. Each specimen shall be in the p.nal condition of heat \ntreatment required for the plate, including any SPWHT if \nrequired. \n8.2 If any test specimen shows defective machining or \ndevelops flaws, it may be discarded and another specimen \nsubstituted. \n9. Test Specimens \n9 .1 The tension test specimens from plate shall conform to \nthe requirements prescribed in the specifications for the base \nmetal. \n9.2 Bend test specimens for the alternative bond strength \ntests, shall be taken at right angles to its longitudinal axis. \n382 \n9.3 When required by the purchaser, the shear test specimen \nshould be taken near a top or bottom corner of the plate as \nrolled, parallel to its longitudinal axis, or other location that is \nrepresentative of the final product. \n9.4 For plates 1 ½ in. (38 mm) and under in thickness, \ntension test specimens shall be the full thickness of the \nmaterial, except as specified in 7 .1.2 and 7.1.3. \n9.5 For plates over 1 ½ in. (38 mm) in thickness, tension \ntests shall be of the form shown in Fig. 3 and shall be of all \nbase steel conforming to the requirements of the specification \nfor the base steel. \n9.6 The bend test specimen used for bond strength determi­\nnation shall be 1 ½ in. (38 mm) wide by not more than ¾ in. \n(19 mm) in thickness and shall be machined to the form and \ndimensions shown in Fig. 2, or may be machined with both \nedges parallel. In reducing the thickness of the specimen, both \nthe alloy cladding and the base steel shall be machined so as to \nmaintain the same ratio of clad metal to base steel as is \nmaintained in the plate, except that the thickness of the clad \nmetal need not be reduced below Vs in. (3.1 mm). The sides of \nthe bend test specimen used for bond strength determination \nmay have the corners rounded to a radius not over 1/16 in. (1.6 \nmm) for plates, 2 in. (50 mm) and under in thickness, and not \nover Vs in. (3.1 mm) for plates over 2 in. (50 mm) in thickness. \n10. Product Analysis \n10.1 Product analysis may be required for the cladding alloy \non finished product. Chemical analysis may be accomplished \nby wet chemical or instrumental procedures. If wet chemical \nprocedures are used, millings may be taken only when the \ncomposite plate thickness is sufficient to permit obtaining ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0434.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4971,
  "bestTextAlphaRatio": 0.733
}