{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 195,
  "globalPageIndex": 195,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-53/SA-53M \ntaken from each end of each length of pipe. The tests from each \nend shall be made alternately with the weld at 0° and at 90° \nfrom the line of direction of force. \n7.3.3.3 For pipe produced in multiple lengths, the flattening \ntest specified in 7.3.3.1 shall be made as follows: \n(1) Test specimens taken from, and representative of, the \nfront end of the first pipe intended to be supplied from each \ncoil, the back end of the last pipe intended to be supplied from \neach coil, and each side of any intermediate weld stop location \nshall be flattened with the weld located at 90° from the line of \ndirection of force. \n(2) Test specimens taken from pipe at any two locations \nintermediate to the front end of the first pipe and the back end \nof the last pipe intended to be supplied from each coil shall be \nflattened with the weld located at 0° from the line of direction \nof force. \n7.3.3.4 For pipe that is to be subsequently reheated through­\nout its cross section and hot formed by a reducing process, the \nmanufacturer shall have the option of obtaining the flattening \ntest specimens required by 7.3.3.2 or 7.3.3.3, whichever is \napplicable, either prior to or after such hot reducing. \n7.3.4 Continuous-Welded Pipe-A test specimen at least 4 \nin. [100 mm] in length shall be flattened cold between parallel \nplates in three steps. The weld shall be located at 90° from the \nline of direction of force. During the first step, which is a test \nfor ductility of the weld, except as allowed by 7.3.5, 7.3.6, and \n7.3.7, no cracks or breaks on the inside, outside, or end \nsurfaces at the weld shall be present before the distance \nbetween tl1e plates is less than three fourths of the specified \noutside diameter of the pipe. As a second step, the flattening \nshall be continued as a test for ductility away from the weld. \nDuring the second step, except as allowed by 7.3.6 and 7.3.7, \nno cracks or breaks on the inside, outside, or end smfaces away \nfrom the weld shall be present before the distance between the \nplates is less than 60 % of the specified outside diameter of the \npipe. During the third step, which is a test for soundness, the \nflattening shall be continued until the test specimen breaks or \nthe opposite walls of the test specimen meet. Evidence of \nlaminated or unsound material or of incomplete weld that is \nrevealed by the flattening test shall be cause for rejection. \n7.3.5 Surface imperfections in the test specimen before \nflattening, but revealed during the first step of the flattening \ntest, shall be judged in accordance with the finish requirements \nin Section 12. \n7.3.6 Superficial ruptures as a result of surface imperfec­\ntions shall not be cause for rejection. \n7.3.7 For pipe with a D-to-t ratio less than 10, because the \nstrain imposed due to geometry is unreasonably high on the \ninside surface at the 6 and 12 o'clock locations, cracks at such \nlocations shall not be cause for rejection. \n8. Hydrostatic Test \n8.1 The hydrostatic test shall be applied, without leakage \nthrough the weld seam or the pipe body. \n8.2 Plain-end pipe shall be hydrostatically tested to the \napplicable pressure given in Table X2.2, and threaded-and­\ncoupled pipe shall be hydrostatically tested to the applicable \npressure given in Table X2.3. It shall be pennissible, at the \ndiscretion of the manufacturer, to perform the hydrostatic test \non pipe with plain ends, with threads only, or with threads and \ncouplings; and it shall also be permissible to test pipe in either \nsingle lengths or multiple lengths. \nNoTE 4-The hydrostatic test pressures given herein are inspection test \npressures, are not intended as a basis for design, and do not have any direct \nrelationship to working pressures. \n8.3 The minimum hydrostatic test pressure required to \nsatisfy the requirements specified in 8.2 need not exceed 2500 \npsi [17 200 kPa] for pipe NPS 3 [DN 80] or smaller or 2800 \npsi [19 300 kPa] for pipe larger than NPS 3 [DN 80]; however, \nthe manufacturer has the option of using higher test pressures. \nFor all sizes of seamless pipe and electric-resistance-welded \npipe, the hydrostatic test pressure shall be maintained for at \nleast 5 s. \n9. Nondestructive Electric Test \n9.1 Type E Pipe: \n_9. l. l Except for pipe produced on a hot-stretch reducing \n111111, the weld seam of each length of electric-resistance­\nwelded pipe NPS 2 [DN 50] or larger shall be tested with a \nnondestructive electric test in accordance with Practices E213 \nE273, E309, or E570. Each length of electric-resistance~ \nwelded pipe NPS 2 [DN 50] or larger and produced on a \nhot-stretch-reducing mill shall be tested with a nondestructive \nelectric test that inpsects the full volume of the pipe in \naccordance with Practices E213, E309, or E570. \n9.1.2 Ultrasonic and Electromagnetic Inspection-Any \nequipment utilizing the ultrasonic or electromagnetic principles \nand capable of continuous and uninterrupted inspection of the \nweld seam shall be used. The equipment shall be checked with \nan applicable reference standard as described in 9.1.3 at least \nonce every working tum or not more than 8 h to demonstrate \nits effectiveness and the inspection procedures. The equipment \nshall be adjusted to produce well-defined indications when the \nreference standard is scanned by the inspection unit in a \nmanner simulating the inspection of the product. \n9.1.3 Reference Standards-The length of the reference \nstandards shall be determined by the pipe manufacturer, and \nthey shall have the same specified diameter and thickness as \nthe product being inspected. Reference standards shall contain \nmachined notches, one on the inside surface and one on the \noutside surface, or a drilled hole, as shown in Fig. 1, at the \noption of the pipe manufacturer. The notches shall be parallel \nto the weld seam, and shall be separated by a distance sufficient \nto produce two separate and distinguishable signals. The 1 /s-in. \n[3.2-mm] hole shall be drilled through the wall and perpen­\ndicular to the surface of the reference standard as shown in Fig. \n1. Care shall be taken in the preparation of the reference \nstandard to ensure freedom from fins or other edge roughness, \nor distortion of the pipe. \nNorn 5-The calibration standards shown in Fig. 1 are convenient \nstandards for calibration of nondestmctive testing equipment. The dimen­\nsions of such standards are not to be construed as the minimum sizes of \nimperfections detectable by such equipment. \n143 \n9 .1.4 Acceptance Limits-Table 3 gives the height of accep­\ntance lilnit signals in percent of the height of signals produced \nby reference standards. Imperfections in the weld seam that ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0195.json",
  "tabulaTablesCsv": "tables_tabula/page-0195.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0195.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6689,
  "bestTextAlphaRatio": 0.7611
}