{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 116,
  "globalPageIndex": 914,
  "width": 613.92,
  "height": 793.2,
  "text": "SA·484/SA-484M ASME BPVC.II.A-2025 \nSpecification for \nGeneral Requirements for Stainless Steel Bars, Billets, and \nForgings \n1. Scope \n1.1 This specification covers general requirements that \nshall apply to wrought stainless steel bars, shapes, forgings, \nand billets or other semi-finished material (except wire) for \nforging, under each of the following specifications issued by \nASTM: Specifications A276/A276M, A314, A458, A477, \nA479/A479M, A564/A564M, A565/A565M, A582/A582M, \nA638/A638M, A705/A705M, and A831/A831M. \n1.2 In the case of conflict between a requirement of a \nproduct specification and a requirement of this specification, \nthe product specification shall prevail. In the case of conflict \nbetween a requirement of the product specification or a \nrequirement of this specification and a more stringent require­\nment of the purchase order, the purchase order shall prevail. \nThe purchase order requirements shall not take precedence if \nthey, in any way, violate the requirements of the product \nspecification or this specification; for example, by waiving a \ntest requirement or by making a test requirement less stringent. \n1.3 The requirements for introduction of new materials in \nspecifications referencing this specification are given in Annex \nAl. \n1.4 General requirements for flat-rolled stainless steel prod­\nucts other than bar are covered in Specification A480/ A480M. \n1.5 General requirements for wire products in coils are \ncovered in Specification A555/A555M. \n1.6 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system are not necessarily exact equivalents; therefore, to \nensure conformance with the standard, each system shall be \nused independently of the other, and values from the two \nsystems shall not be combined \n1.7 Unless the order specifies an \"M\" designation, the \nmaterial shall be furnished to inch-pound units. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA262 Practices for Detecting Susceptibility to Intergranular \nAttack in Austenitic Stainless Steels \nA276/A276M Specification for Stainless Steel Bars and \nShapes \nA314 Specification for Stainless Steel Billets and Bars for \nForging \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \n814 \nA458 Specification for Hot-Worked, Hot-Cold-Worked, and \nCold-Worked Alloy Steel Bars for High Strength at \nElevated Temperatures (Withdrawn 1988) \nA477 Specification for Hot-Worked, Hot-Cold Worked and \nCold-Worked Alloy Steel Forgings and Forging Billets for \nHigh Strength at Elevated Temperatures (Withdrawn \n1988) 4 \nA479/A479M Specification for Stainless Steel Bars and \nShapes for Use in Boilers and Other Pressure Vessels \nA480/ A480M Specification for General Requirements for \nFlat-Rolled Stainless and Heat-Resisting Steel Plate, \nSheet, and Strip \nA555/A555M Specification for General Requirements for \nStainless Steel Wire and Wire Rods \nA564/A564M Specification for Hot-Rolled and Cold­\nFinished Age-Hardening Stainless Steel Bars and Shapes \n'~ ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0914.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3399,
  "bestTextAlphaRatio": 0.7646
}