{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 441,
  "globalPageIndex": 441,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-265 \n9 .3 When required by the purchaser, the shear test specimen \nshall be taken near a top or bottom corner of the plate as rolled, \nparallel to its longitudinal axis, or other location that is \nrepresentative of the final product. \n9.4 For plates 1 ½ in. (38 mm) and under in thickness, \ntension test specimens shall be the full thickness of the \nmaterial, except as specified in 7.1.2 and 7.1.3. \n9.5 For plates over 1 ½ in. (38 mm) in thickness, tension \ntests shall be of the form shown in Fig. 3 and shall be of all \nbase steel conforming to the requirements of the specification \nfor the base steel. \n9.6 The bend test specimen used for bond strength determi­\nnation shall be 1 ½ in. (38 mm) by not more than¾ in. (19 mm) \nin thickness and shall be machined to the form and dimensions \nshown in Fig. 2, or may be machined with both edges parallel. \nIn reducing the thickness of the specimen, both the alloy \ncladding and the base steel shall be machined so as to maintain \nthe same ratio of clad metal to base steel as is maintained in the \nplate, except that the thickness of the clad material need not be \nreduced below 1/s in. (3.1 mm). The sides of the bend test \nspecimen used for bond strength determination may have the \ncorners rounded to a radius not over 1/16 in. (1.6 mm) for plates, \n2 in. (50 mm) and under in thickness, and not over 1/s in. (3.1 \nmm) for plates over 2 in. (50 mm) in thickness. \n10. Product Analysis \n10.1 Product analysis may be required for the cladding alloy \non finished product. Chemical analysis may be accomplished \nby wet chemical or instrumental procedures. If wet chemical \nprocedures are used, millings may be taken only when the \ncomposite plate thickness is sufficient to permit obtaining \nmillings without danger of contamination from the adjacent \nlayer. If spectrometric procedures are used, the sample shall be \nexposed on the center line of the cladding when there is \nin. \n0.003 \n0.005 \n0.01 \n1/s \nMinimum Radius Recommended \n¾ ln, 1 but not leH than t ·in. \nPer milled \n2\"±0.005\" Gaoe Length for \nEiongotlon ofter Fracture \nMetric Equivalents \nmm in. \n0.076 \n0.127 \n0.254 \n3.18 \nmm \n% 9.53 \n0.50 12.7 \n2 50.8 \n2¼ 64.5 \nNoTE 1-The gage length and fillets shall be as shown, but the ends \nmay be of any shape to fit the holders of the testing machine in such a way \nthat the load shall be axial. The reduced section shall have a gradual taper \nfrom the ends toward the center, with the ends 0.003 to 0.005 in. larger in \ndiameter than the center. \nFIG. 3 Standard Round Tension Tests Specimen with 2-in. Gage \nLength \nsufficient cladding thickness available so that there is no \ncontamination from the adjacent base metal. \n10.2 If product analysis is specified by the purchaser for the \ncladding alloy, it shall be made on a sample taken from the \nfinished product or a broken test specimen. For wet chemical \nanalysis, in order to avoid contamination by the base plate \nmetal, millings of cladding samples shall be taken from the test \ncoupon by removal and discard of all the base metal plus 40 % \nof the cladding thiclmess from the bonded side, not to exceed \n1/16 in. (1.6 mm). The material shall be cleaned and sufficient \nmillings taken to represent the full cross-section of the remain­\nder. If there is insufficient cladding thickness available to \nspectrographically expose on the center line of the cladding \nwithout contamination, 50 % of the cladding shall be removed \nand the sample exposed on this surface. \n10.3 The results of the product analysis shall conform to the \nrequirements of standards referenced in Section 2. \n10.4 Methods and practices relating to chemical analysis \nrequired by this specification shall be in accordance with the \nTest Methods, Practices, and Terminology of A751. \n10.5 Results of the product analysis for the backing steel \nwhen required shall conform to the requirements of Section 7 \nof Specification A20/ A20M or A6/ A6M, as applicable. \n11. Permissible Variations \n11.1 Permissible variations except for thickness shall be in \naccordance with Specification A20/ A20M or A6/ A6M as \napplicable based on the backing specification. \n11.2 Minimum thickness of the alloy cladding metal and of \nthe backing steel, or of the total composite plate shall be as \nrequired by purchase order documents when ordered to mini­\nmum thickness. \n11.3 Permissible variation in thickness when ordered to \nnominal thicknesses shall be 0.01 in. (0.3 mm) under each for \nbacking steel or total composite, and 0.03 in. (0.8 mm) under \nfor the alloy cladding. \n11.4 Permissible vadations for excess thickness of the total \ncomposite shall be the greater of 0.125 in. (3 mm) or 10 % of \nthe total composite thickness ordered and may occur in either \nbacking steel, cladding, or both, provided the minimum for \neach is met. \n11.5 More restdctive or less restrictive permissible vada­\ntions may be agreed upon by the purchaser and the manufac­\nturer. \n12. Workmanship Finish, and Appearance \n12.1 The matedal shall be free of injurious defects and shall \nhave a workmanlike appearance. \n389 \n12.2 Unless otherwise specified, the clad surface may be \nsupplied as-rolled, blasted (descaled by means of sand, grit, \nshot or wire followed by pickling), or 100 % conditioned. \n13. Bond Quality \n13.1 The cladding metal shall be integrally and continu­\nously bonded to the base metal. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0441.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 5426,
  "bestTextAlphaRatio": 0.747
}