{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 334,
  "globalPageIndex": 1132,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-609 /SA-609M ASME BPVC.II.A-2025 \n14.2 Suiface Finish: \n14.2.1 Machined Suifaces - Machined surfaces sub­\nject to ultrasonic inspection shall have a finish that will \nproduce an ultrasonic response equivalent to that obtained \nfrom a 250 µin. (6.3 µm) surface. The surface finish shall \nalso permit adequate movement pf search units along the \nsurface. \n14.2.2 Casting Suifaces - Casting surfaces to be \nultrasonically inspected shall be suitable for the intended \ntype and quality level (Tables 3 and 4) of inspection as \njudged acceptable by a qualified individual as specified in \n13.1.1. \n14.2.3 Surface Condition - All surfaces to be \ninspected shall be free of scale, machining or grinding \nparticles, excessive paint thickness, dirt, or other foreign \nmatter that may interfere with the inspection. \n14.3 Position of Casting - The casting shall be posi­\ntioned such that the inspector has free access to the back \nwall for the purpose of verifying change in contour. \n15. Calibration \n15.1 Calibration Blocks - Determine the thickness of \nthe material to be ultrasonically inspected. For material \nthickness of 3 in. [75 mm] or less, use the series of 3 \nblocks, ½, 2, 5 in. [13, 50, 125 mm] (Fig. 3, B dimension) \nfor calibration: For a material thickness greater than 3 in., \nuse the series of 3 blocks, 2, 5, 10 in. [50, 125, 250 mm] \n(Fig. 3, B dimension) for calibration. \n15.2 Calibration of Search Units - For the thickness \nof material to be inspected, as determined in 15.1, use the \nfollowing search units: \n15.2.1 For materials 3 in. [75 mm] or less in thick­\nness, use a 2¾ MHz, ½ in. [13 mm] diameter search unit. \n15.2.2 For material greater than 3 in. [75 mm] in \nthickness, use a 2¾ MHz, 1 in. [25 mm] diameter search \nunit. \n15.3 Calibration Procedure: \n15.3.1 Set the frequency selector as required. Set the \nreject control in the \"OFF\" position. \n15.3.2 Position the search unit on the entrant surface \nof the blockthat completely encompasses the metal thick­\nness to be inspected (Fig. 3) and adjust the sweep control \nsuch that the back reflection signal appears approximately, \nbut not more than three-quarters along the sweep line from \nthe initial pulse signal. \n15.3.3 Position the search unit on the entrant surface \nof the smallest block of the series of 3 blocks selected for \ncalibration and adjust the gain until the back reflection \nsignal height (amplitude) is 1.5 in. [40 mm] sweep to \npeak (SIP). Draw a line on the cathode-ray screen (CRT), \nparallel to the sweep line, through the peak of the 1.5 in. \n(SIP) amplitude. \n15.3.4 Position the search unit on the entrant surface \nof the largest block of the series of 3 blocks selected for \ncalibration, and adjust the distance amplitude control to \nprovide a back reflection signal height of 1.5 in. [40 mm] \n(SIP). \n15.3.5 Position the search unit on the entrant surface \nof the intermediate calibration block of the series of 3 \nblocks being used for calibration and confirm that the back \nreflection signal height is approximately 1.5 in. [40 mm] \n(SIP). If it is not, obtain the best compromise between this \nblock and the largest block of the series of 3 blocks being \nused for calibration. \n15.3.6 Draw a line on the cathode ray tube screen \nparallel to the sweep line at 0.5 in. [13 mm] (SIP) ampli­\ntude. This will be the reference line for reporting disconti­\nnuity amplitudes. \n15.3.7 For tests on machined suifaces, position the \nsearch unit on a machined surface of casting where the \nwalls are reasonably parallel and adjust the gain of the \ninstrument until the back reflection signal height is 1.5 in. \n[40 mm] (SIP). Increase the inspection sensitivity by a \nfactor of three times (10 dB gain) with the calibrated attenu­\nator. Surfaces that do not meet the requirements of 14.2.l \nshall be inspected as specified in 15.3.s: \n15.3.8 For inspections on cast suifaces, position the \nsearch unit on the casting to be inspected at a location \nwhere the walls are reasonably parallel and smooth (inside \nand outside diameter) and the surface condition is represen­\ntative of the surface being inspected. Adjust the gain of \nthe instrument until the back reflection signal height is \n1.5 in. [40 mm] (SIP). Increase the inspection sensitivity \nby a factor of six times (16 dB) by use of the calibrated \ncontrol or attenuator. A significant change in surface finish \nrequires a compensating adjustment to the gain. \n15.3.8.1 Rejectable indications on as-cast surfaces \nmay be reevaluated by surface preparation to 250 µin. \n[6.3 µm] finish or better, and re-inspected in accordance \nwith 15.3.7 of this practice. \n15.3.8.2 It should be noted that some instruments \nare equipped with decibel calibrated gain controls, in which \ncase the decibel required to increase the sensitivity must \nbe added. Other instruments have decibel calibrated attenu­\nators, in which case the required decibel must be removed. \nStill other instruments do not have calibrated gains or \nattenuators. They require external attenuators. \n16. Scanning \n16.1 Grid Pattern - The surface of the casting shall \nbe laid out in a 12 by 12 in. [300 by 300 mm] or any \n1038 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1132.json",
  "tabulaTablesCsv": "tables_tabula/page-1132.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1132.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5142,
  "bestTextAlphaRatio": 0.7273
}