{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 750,
  "globalPageIndex": 750,
  "width": 601.08,
  "height": 845.28,
  "text": "SA-420 /SA-420M ASME BPVC.II.A-2025 \nSpecification for \nPiping Fittings of Wrought Carbon Steel and Alloy Steel for \nLow-Temperature Service \n1. Scope \n1.1 This specification covers wrought carbon steel and \nalloy steel fittings of seamless and welded construction, cov­\nered by the latest revision of ASME B16.9, ASME B16.11, \nMSS SP-79, MSS SP-83, MSS SP-95, and MSS SP-97. \nFittings differing from these ASME and MSS standards shall \nbe furnished in accordance with Supplementary Requirement \nS58 of Specification A960/A960M. These fittings are for use in \npressure piping and pressure vessel service at low tempera­\ntures. \n1.2 Optional supplementary requirements are provided for \nfittings where a greater degree of examination is desired. When \ndesired, one or more of these supplementary requirements shall \nbe specified in the order. \n1.3 This specification is expressed in both inch-pound units \nand in SI units. However, unless the order specifies the \napplicable \"M\" specification designation (SI units), the mate­\nrial shall be furnished to inch-pound units. \n1.4 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n1.5 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n700 \n2. Referenced Documents \n2.1 In addition to those Referenced Documents listed in \nSpecification A960/ A960M, the following list of standards \napply to this specification. \n2.2 ASTM Standards: \nA350/A350M Specification for Carbon and Low-Alloy Steel \nForgings, Requiring Notch Toughness Testing for Piping \nComponents \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA960/ A960M Specification for Common Requirements for \nWrought Steel Piping Fittings \nA1058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \n2.3 ASME Standards: \nB16.9 Factory-Made Wrought Steel Butt-Welding Fittings \nB16.ll Forged Steel Fittings, Socket-Welding Threaded \n2.4 ASME Boiler and Pressure Vessel Code: \nSection III \nSection VIII Division 1, Pressure Vessels \nSection IX \n2.5 MSS Standards: \nMSS SP-25 Standard Marking System for Valves, Fittings, \nFlanges, and Unions \nMSS SP- 79 Socket Welding Reducer Inserts \nMSS SP-83 Steel Pipe Unions, Socket-Welding and \nThreaded \nMSS SP-95 Swage(d) Nipples and Bull Plugs \nMSS SP-97 Integrally Reinforced Forged Branch Outlet \nFittings-Socket Welding, Threaded and Buttwelding \nEnds ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0750.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 2934,
  "bestTextAlphaRatio": 0.7693
}