{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 323,
  "globalPageIndex": 1121,
  "width": 615.48,
  "height": 794.4,
  "text": "ASME BPVC.II.A-2025 SA-587 \n9.3 The reverse flattening test specified in 6.3 shall be made \non 1 length of pipe from each lot of 250 lengths or fraction \nthereof. \n9.4 The flange test as specified in 6.4 shall be made on \nspecimens from 2 lengths of pipe from each lot of 250 lengths \nor fraction thereof. \n10. Retests \n10.1 If the results of the mechanical tests of any heat or lot \ndo not conform to the requirements specified, retests may be \nmade on additional pipe of double the original number from the \nsame heat or lot, each of which shall conform to the require­\nments specified. \n11. Retreatment \n11.1 If a heat or lot fails to conform to the test requirements, \nthat heat or lot may be reheat treated and resubmitted for tests. \nNot more than one reheat treatment shall be permitted. \n12. Test Specimens and Methods of Testing \n12.1 The test specimens and the tests required by this \nspecification shall conform to those described in Test Methods \nand Definitions A370. \n12.2 Test specimens shall be taken from the ends of finished \npipe prior to upsetting, swaging, expanding, or other forming \noperations, or being cut to length. They shall be smooth on the \nends and free from burrs and flaws. \n12.3 If any test specimen shows flaws or defective machin­\ning, it may be discarded and another specimen substituted. \n13. Nondestructive Test \n13.1 The nondestructive test shall be made instead of the \nhydrostatic test. \n13.1.1 The test shall provide a 360° inspection for sizes up \nto and including 3½ in. (88.9 mm) outside diameter. \n13.1.2 For pipe larger than 3½ in. (88.9 mm) outside \ndiameter, nondestructive inspection of the weld and heat \naffected zone is required. \n13.2 Each pipe shall be tested with a nondestructive test in \naccordance with Practices E213, E273, E309, or E570. Except \nas provided in 13.6.2, it is the intent of this test to reject pipe \nwith imperfections that produce test signals equal to or greater \nthan that of the calibration standard. In order to accommodate \nthe various types of nondestructive testing equipment and \ntechniques in use, and manufacturing practices employed, any \none of the following calibration standards may be used, at the \noption of the producer, to establish a minimum sensitivity level \nfor rejection: \n13.3 For eddy-current testing, the calibration pipe shall \ncontain, at the option of the producer, any one of the following \ndiscontinuities to establish a minimum sensitivity level for \nrejection. For welded pipe, they shall be placed in the weld if \nvisible. \n13.3.1 Drilled Hole-A hole not larger than 0.031 in. (0.79 \nmm) in diameter shall be drilled radially and completely \nthrough the pipe wall, taking care to avoid distortion of the \npipe while drilling. \n13.3.2 Transverse Tangential Notch-Using a round tool or \nfile with a ¼-in. 6.4 mm diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the pipe, preferably in the weld area. Said notch \nshall have a depth not exceeding 12½ % of the specified wall \nthickness of the pipe or 0.004 in. (0.10 mm), whichever is \ngreater. \n13.3.3 Longitudinal Notch-A notch 0.031 in. (0.79 mm) or \nless in width shall be machined in a radial plane parallel to the \npipe axis on the outside surface of the pipe, to a depth not \nexceeding 121/2 % of the specified wall thickness of the pipe or \n0.004 in. (0.102 mm), whichever is greater. The length of the \nnotch shall be compatible with the testing method. \n13.4 For ultrasonic testing, the longitudinal calibration ref­\nerence notches shall be at the option of the producer, any one \nof the three common notch shapes shown in Practices E213 or \nE273. The depth of the notch shall not exceed 12½ % of the \nspecified wall thickness of the pipe or 0.004 in. (0.102 mm), \nwhichever is greater. For welded pipe, the notch shall be placed \nin the weld, if visible. \n13.5 For flux leakage testing, each of the longitudinal \ncalibration notches shall be a straight-sided notch not over 12½ \n% of the wall thickness in depth and not over 1.0 in. (25 mm) \nin length. Both outside diameter and inside diameter notches \nshall be placed in the tube located sufficiently apart to enable \nseparation and identification of the signals. \n13.6 Pipe producing a signal equal to or greater than the \ncalibration defect shall be subject to rejection. The area \nproducing the signal may be examined. \n13.6.1 Test signals produced by imperfections that cannot \nbe identified, or produced by cracks or crack-like defects shall \nresult in rejection of the pipe subject to rework and retest. \n13.6.2 Test signals produced by imperfections such as those \nlisted below may be judged as injurious or noninjurious \ndepending on visual observation or their severity or the type of \nsignal they produce on the testing equipment used, or both: \n13.6.2.1 Dinges, \n13.6.2.2 Straightener marks, \n13.6.2.3 Loose inside diameter bead and cutting chips, \n13.6.2.4 Scratches, \n13.6.2.5 Steel die stamps, \n13.6.2.6 Chattered flash him, \n13.6.2.7 Stop marks, or \n13.6.2.8 Tube reducer ripple. \n13.6.3 Any imperfection of the above type exceeding \n0.004 in. (0.102 mm) or 12½ % of the specified wall thickness \n(whichever is greater) in depth shall be considered injurious. \n13.6.3.1 If the imperfection is judged as injurious, the pipe \nshall be rejected but may be reconditioned and retested \nproviding the dimensional requirements are met. \n13.6.3.2 If the imperfection is explored to the extent that it \ncan be identified as noninjurious, the pipe may be accepted \nwithout further test providing the imperfection does not en­\ncroach on the minimum wall thickness. \n14. Inspection \n14.1 The inspector shall have entry at all times while work \non an order is being done to all parts of the manufacturer's \n1027 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1121.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5802,
  "bestTextAlphaRatio": 0.7344
}