{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 164,
  "globalPageIndex": 962,
  "width": 618.6,
  "height": 796.8,
  "text": "SA-513/SA-513M (ASTM A513/A513M) ASME BPVC.II.A-2025 \nTABLE S4.2 Allowance for Surface Imperfections on Inside Diameters of Special Smooth Finish TubesA \nWall Depth Allowance for \nOutside Diameter \nSize, \nin. [mm] \nWall Thickness, \nin. [mm] \nInside Diameter Surface Imperfections, \nin. [mm] \nScores Pits \nUp to 2½ incl [65] 0.065 to 0.109 incl [1.65 to 2. 77] 0.001 [0.03] \n0.001 [0.03] \n0.001 [0.03] \n0.0015 [0.04] \n0.0015 [0.04] \n0.002 [0.05] \n0.0025 [0.06] \n0.003 [0.08] \n0.0015 [0.04] \n0.002 [0.05] \n0.0025 [0.06] \n0.0025 [0.06] \n0.003 [0.08] \n0.004 [0.1 O] \n0.005 [0.13] \n0.006 [0.15] \nOver 2½ to 5½ incl [65 to 140] \nOver 0.109 to 0.250 incl [2.77 to 6.35] \nOver 0.250 to 0.312 incl [6.35 to 7.92] \n0.083 to 0.125 incl [2.11 to 3.18] \nOver 5½ to 7 incl [140 to 180] \nOver 0.125 to 0.187 incl [3.18 to 4.75] \nOver 0.187 to 0.312 incl [4.75 to 7.92] \n0.125 to 0.187 incl [3.18 to 4.75] \nOver 0.187 to 0.312 incl [4.75 to 7.92] \nA If a specific size is desired, these allowances plus normal size tolerances must be considered in calculating size to be ordered. \nsteel and, when heat treated, subjected to the same finishing treatment in \na continuous furnace. When final heat treatment is done in a batch-type \nfurnace, the lot shall include all those tubes which are heat treated in the \nsame furnace charge. \nS5.3 The yield strength corresponding to a permanent offset \nof 0.2 % of the gauge length of the specimen or to a total \nextension of 0.5 % of the gauge length under load shall be \ndetermined. \nS6. Destructive Weld Tests \nS6. l Round tubing and tubing to be formed into other \nshapes when in the round form shall meet the following \ndestructive weld tests. \nS6.2 Flattening Test-A test 4 to 6 in. [100 to 150 mm] in \nlength shall be flattened between parallel plates with the weld \n90° from the direction of applied force (at the point of \nmaximum bending) until opposite walls of the tubing meet. \nExcept as allowed in S6.2.1, no opening in the weld shall take \nplace until the distance between the plates is less than two \nthirds of the original outside diameter of the tubing. No cracks \nor breaks in the base metal shall occur until the distance \nbetween the plates is less than one third of the original outside \ndiameter of the tubing, but in no case less than five times the \nthickness of the tubing wall. Evidence of lamination or burnt \nmaterial shall not develop during the flattening process, and the \nweld shall not show injurious defects. \nS6.2.1 When low D-to-t ratio tubing is tested, because the \nstrain imposed due to geometry is unreasonably high on the \n-inside-surface-ar-the six arnitwelve o'clock-locmions, cracRs at\" \nthese locations shall not be cause for rejection if the D-to-t ratio \nis less than 10. \nS6.3 Flaring Test-A section of tube approximately 4 in. \n[100 mm] in length shall stand being flared with a tool having \na 60° included angle until the tube at the mouth of the flare has \nbeen expanded 15 % of the inside diameter, without cracking \nor showing flaws. \nS6.4 In order to properly evaluate weld quality, the producer \nat his option may normalize the test specimen prior to testing. \nS6.5 Number of tests and retests: \nS6.5.1 Two flattening and two flaring tests shall be made \nfrom each lot as specified. Each tested specimen shall conform \nto the respective requirement (See Note Sl). \nS6.5.2 If the results of the testing do not conform to the \nrequirements, retests shall be made on four additional \nspecimens, each of which shall conform to the respective \nrequirement. \n862 \nS7. Hydrostatic Test Round Tubing \nS7.1 All tubing will be given a hydrostatic test calculated as \nfollows: \nwhere: \n2St P=­ D \nP = minimum hydrostatic test pressure, psi or MPa, \nS = allowable fiber stress of 14 000 psi or 96.5 MPa, \nt = specified wall thickness, in. or mm, and \nD = specified outside diameter, in. or mm. \nS7 .2 The minimum hydrostatic test pressue shall be main­\ntained for not less than 5 s. \nS8. Nondestructive Electric Test \nS8.l Each tube shall be tested with a nondestructive electric \ntest in accordance with Practice E213, Practice E273, Practice \nE309, or Practice E570. It is the intent of this test to reject tubes \ncontaining injurious defects. \nS8.2 For eddy-current testing, the calibration tube shall \ncontain, at the option of the producer, any one of the following \ndiscontinuities to establish a minimum sensitivity level for \nrejection. For welded tubing, they shall be placed in the weld \nif visible. \nS8.2.l Drilled Hole-A hole not larger than 0.031 in. [0.78 \nmm] in diameter shall be drilled radially and completely \nthrough the tube wall, care being taken to avoid distortion of \nthe tube wlille drilling. - -- - -\nS8.2.2 Transverse Tangential Notch-Using a round tool or \nfile with a ¼-in. [6.4-mm] diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the tube. Said notch shall have a depth not \nexceeding 12½ % of the specified wall thickness of the tube or \n0.004 in. [0.101 mm], whichever is greater. \nS8.2.3 Longitudinal Notch-A notch 0.031 in. [0.78 mm] or \nless in width shall be machined in a radial plane parallel to the \ntube axis on the outside surface of the tube, to have a depth not \nexceeding 12½ % of the specified wall thickness of the tube or \n0.004 in. [0.101 mm], whichever is greater. The length of the \nnotch shall be compatible with the testing method. \nS8.3 For ultrasonic testing, the longitudinal calibration ref­\nerence notches shall be at the option of the producer, any one \nof the three common notch shapes shown in Practice E213 or \nPractice E273. The depth of notch shall not exceed 12½ % of \nthe specified wall thickness of the tube or 0.004 in. [0.101 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0962.json",
  "tabulaTablesCsv": "tables_tabula/page-0962.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0962.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5728,
  "bestTextAlphaRatio": 0.681
}