{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 299,
  "globalPageIndex": 1097,
  "width": 627.84,
  "height": 804.24,
  "text": "ASME BPVC.II.A-2025 SA-568/SA-568M (ASTM A568/A568M) \nTABLE A1.17 Flatness Tolerances of Cold-Rolled Sheet Cut \nLength (All Designations)A \nNoTE 1-This table does not apply when product is ordered full hard, \nto a hardness range or \"annealed last\" ( dead soft). \nNOTE 2-This table applies to lengths cut from coils, when adequate \nflattening measures are petformed to remove all undesirable flatness \nconditions, including, but not limited to, coil set. \nSpecified Specified Width, mm Flatness Tolerance, mm Speci-\nfied Yield Point, min, MPa \nThickness, \nUnder 310 310 to 340 mm Over Through MPa MPa 8 \nThrough 1.0 900 10 20 \n900 1500 15 30 \n1500 20 40 \nOver 1.0 900 8 20 \n900 1500 10 20 \n1500 1800 15 30 \n1800 20 40 \nA Maximum deviation from a horizontal flat surface. \n8 Tolerances for high-strength, low-alloy steel with specified minimum yield point in \nexcess of 340 MPa are subject to negotiation. \nAPPENDIXES \n(Nonmandatory Information) \nXl. AGING EFFECTS ON FORMABILITY OF COLD-ROLLED CARBON-STEEL SHEET PRODUCTS \nXl.1 Cold-rolled carbon-steel sheet products exhibit maxi­\nmum formability in the annealed last, or dead-soft, condition. \nHowever, many sheet products are not suitable for exposed \napplications in the dead-soft condition because Luder's lines \n(sometimes referred to as \"stretcher strains\" or \"fluting\") may \ndevelop during subsequent forming. This problem is avoided in \nmost cases by temper rolling the sheet after annealing. After \ntemper rolling, however, some sheet products are susceptible to \naging. Aging refers to a gradual increase in yield strength and \ncorresponding decrease in ductility during storage after temper \nrolling. Aging always has a negative effect on formability and, \nwhen aging leads to the redevelopment of an upper yield point, \nlt in renewed susce tibilit to fluting. \nXl .2 Aging can occur when interstitial solute atoms, carbon \nor nitrogen, are present in the steel. Solute carbon or nitrogen \natoms are those not chemically combined with other elements \nin the steel (as carbides or nitrides, for example). Over time, \nthese carbon or nitrogen interstitial solute atoms diffuse to \ncrystalline imperfections within the steel and, in so doing, give \nrise to aging. The extent to which aging occurs depends on the \ninterstitial solute level and the combination of temperature and \ntime to which the steel is exposed after temper rolling. In \ngeneral, higher interstitial solute levels result in larger strength \nincreases during storage; the rate of aging increases with \nincreasing temperature. As described as follows, the final \ninterstitial solute level and aging characteristics depend on the \nchemical composition of the steel as well as specific sheet­\nprocessing methods used by the steel producer. \nXl .3 Low-Carbon Steels-In conventional aluminum-killed \nlow-carbon steels, the level of interstitial solute is affected \nmainly through the fonnation of aluminum nitride and iron \ncarbides within the steel during processing, which is influenced \nby the manner in which annealing is performed. \nXl.3.1 Many sheet products are annealed in batches of \nlarge, tightly wound coils. During heating, any solute nitrogen \npresent in the full-hard sheet combines with aluminum to form \naluminum nitride. Subsequent cooling is very slow and allows \nessentially all of the carbon to precipitate as iron carbide. Final \ninterstitial solute levels are very low and, as a result, batch­\nannealed low-carbon steels have excellent resistance to aging. \nXl.3.1.1 Dee drawing steel (DDS) sheet typically is batch-\nannealed and has excellent aging resistance. 1 temper \nrolling, DDS sheet is suitable for use in many exposed \napplications with severe forming requirements. \nXl.3.2 Cold-rolled low-carbon steels are sometimes pro­\ncessed in a continuous annealing line, in which the full-hard \nsheet is uncoiled, passed through an annealing furnace, and \nthen rewound in a continuous manner. Heating and cooling \nrates are much higher than those found in batch annealing. The \nfaster cooling, in particular, results in higher levels of intersti­\ntial solute in the product as compared with batch annealing. \nThe manner in which the sheet is cooled can be controlled to \nminimize the solute carbon level, and temper rolling is effec­\ntive for reducing fluting tendencies. However, continuous­\nannealed low-carbon steels are more prone to subsequent aging \nthan batch-annealed steels. \n997 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1097.json",
  "tabulaTablesCsv": "tables_tabula/page-1097.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1097.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4433,
  "bestTextAlphaRatio": 0.7746
}