{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 759,
  "globalPageIndex": 759,
  "width": 602.64,
  "height": 846.48,
  "text": "ASME BPVC.II.A-2025 SA-423/SA-423M \nTABLE 1 Chemical Requirements \nComposition, % \nGrade 1 Grade 2 \nCarbon, max \nManganese \nPhosphorus \nSulfur, max \nSilicon \nCopper \nChromium \nNickel \nMolybdenum \nAntimony \n0.15 \n0.55 max \n0.06-0.16 \n0.060 \n0.10 min \n0.20-0.60 \n0.24-1.31 \n0.20-0.70 \n0.15 \n0.50-1.00 \n0.04 max \n0.05 \n0.30-1.00 \n0.40-1.10 \n0.10 min \nTABLE 3 Tensile Requirements \nTensile strength, min, ksl [MPa] \nYield strength, min, ksi [MPa] \nElongation in 2 in. or 50 mm, \nmin,% \nFor longitudinal strip tests a \ndeduction for each %2 in. \n[0.8 mm] decrease in wall \nthickness below 5 /10 in. [8 mm] \nfrom the basic minimum \nelongation of the following \npercentage points shall be \nmade \nGrades 1 and \n2 \n60 [415] \n37 [255] \n25 \nGrade 3 \n0.06 \n0.70-1.40 \n0.020 max \n0.020 \n0.55 max \n0.25-0.45 \n0.50 max \n0.20 max \n0.05-0.15 \nGrade 3 \n55 [380] \n33 [230] \n35 \nA Calculated elongation requirements shall be rounded to the nearest whole \nnumber. \n6. Chemical Composition \n6.1 The steel shall conform to the requirements as to \nchemical composition prescribed in Table 1. \n7. Product Analysis \n7.1 An analysis of either one billet, one length of flat-rolled \nstock or one tube shall be made from each heat. The chemical \ncomposition thus determined shall conform to the requirements \nspecified. \n7 .2 If the original test for product analysis fails, retests of \ntwo additional billets, lengths of flat-rolled stock, or tubes shall \nbe made. Both retests, for the elements in question shall meet \nthe requirements of the specification; otherwise all remaining \nmaterial in the heat or lot (Note 1) shall be rejected or, at the \noption of the producer, each billet, length of flat-rolled stock or \ntube may be individually tested for acceptance. Billets, lengths \nof flat-rolled stock or tubes which do not meet the requirements \nof the specification shall be rejected. \nNOTE 1-For flattening, flaring, and flange requirements, the term lot \napplies to all tubes prior to cutting of the same nominal size and wall \nthickness that are produced from the same heat of steel. When final heat \ntreatment is in a batch-type furnace, a lot shall include only those tubes of \nthe same size and from the same heat which are heat treated in the same \nfurnace charge. When the final heat treatment is in a continuous furnace \nthe number of tubes of the same size and from the same heat in a lot shall \nbe determined from the size of the tubes as prescribed in Table 2. \nNoTE 2-For tensile and hardness test requirements, the term lot applies \nto all tubes prior to cutting, of the same nominal diameter and wall \nthickness that are produced from the same heat of steel. When final heat \ntreatment is in a batch-type furnace, a lot shall include only those tubes of \nTABLE 2 Number of Tubes In a Lot Heat Treated by the \nContinuous Process \nSize of Tube \n2 in. [50.8 mm] and over in outside diameter and \n0.200 in. [5.1 mm] and over in wall thickness \nLess than 2 in. [50.8 mm] but over 1 in. [25.4 mm] in \noutside diameter or over 1 in. [25.4 mm] in \noutside diameter and under 0.200 in. [5.1 mm] \nin wall thickness \n1 in. [25.4 mm] or less in outside diameter \nSize of Lot \nnot more than 50 \ntubes \nnot more than 75 \ntubes \nnot more than 125 \ntubes \nthe same size and the same heat which are heat treated in the same furnace \ncharge. When the final heat treatment is in a continuous furnace, a lot shall \ninclude all tubes of the same size and heat, heat treated in the same furnace \nat the same temperature, time at heat, and furnace speed. \n8. Tensile Requirements \n8.1 The material shall conform to the requirements as to \ntensile properties prescribed in Table 3. \n9. Hardness Requirements \n9.1 The tubes shall have a hardness number not exceeding \n170 HBW or 87 HRBW. \n10. Forming Operations \n10.1 Tubes when inserted in the boiler shall stand expanding \nand beading without showing cracks or flaws. \n11. Mechanical Tests Required \n11 .1 Tension Test-One tension test shall be made on a \nspecimen for lots of not more than 50 tubes. Tension tests shall \nbe made on specimens from two tubes for lots of more than 50 \ntubes (Note 2). \n11.2 Flattening Test-One flattening test shall be made on \nspecimens from each end of one finished tube, not the one used \nfor the flaring or flanging test, from each lot (Note 1). \n11.3 Flaring Test (Seamless Tubes)-One flaring test shall \nbe made on specimens from each end of one finished tube, not \nthe one used for the flattening test, from each lot (Note 1). \n11.4 Flange Test (Welded Tubes)-One flange test shall be \nmade on specimens from each end of one finished tube, not the \none used for the flattening test, from each lot (Note 1). \n11.5 Hardness Test-Brinell or Rockwell hardness tests \nshall be made on specimens from two tubes from each lot \n(Note 2). \n11.6 Reverse Flattening Test-For welded tubes, one re­\nverse flattening test shall be made on a specimen from each \n1500 ft [460 m] of finished tubing. \n709 \n11.7 Hydrostatic or Nondestructive Electric Test-Each \ntube shall be subjected to the hydrostatic test, or, instead of this \ntest, a nondestructive electric test may be used when specified \nby the purchaser. \n12. General Requirements \n12.1 Material furnished under this specification should con­\nform to the applicable requirements of the current edition of \nSpecification A450/ A450M, unless otherwise provided herein. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-0759.json",
  "tabulaTablesCsv": "tables_tabula/page-0759.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0759.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5369,
  "bestTextAlphaRatio": 0.7102
}