{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 332,
  "globalPageIndex": 1130,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-609 /SA-609M ASME BPVC.II.A-2025 \n6.3 The ultrasonic examination shall be conducted prior \nto machining that prevents an effective examination of the \ncasting. \n7. Test Conditions \n7.1 To assure complete coverage of the specified cast­\ning section, each pass of the search unit shall overlap by \nat least 10% of the width of the transducer. \n7.2 The rate of scanning shall not exceed 6 in.ls \n(150 mm/s). \n7.3 The ultrasonic beam shall be introduced perpendic­\nular to the examination surface. \n8. Procedure \n8.1 Adjust the instrument controls to position the first \nback reflection for the thickness to be tested at least one \nhalf of the distance across the cathode ray tube. \n8.2 Using the set of reference blocks spanning the \nthickness of the casting being inspected, mark the flat­\nbottom hole indication height for each of the applicable \nblocks on the cathode ray tube shield. Draw a curve through \nthese marks on the screen or on suitable graph paper. The \nmaximum signal amplitude for the test blocks used shall \npeak at approximately three-fomths of the screen height \nabove the sweep by use of the attenuator. This curve shall \nbe referred to as the 100% distance amplitude correction \n(DAC) curve. If the attenuation of ultrasound in the casting \nthickness being examined is such that the system's dynamic \nrange is exceeded, segmented DAC curves are permitted. \n8.3 The casting examination surface will normally be \nrougher than that of the test blocks; consequently, employ \na transfer mechanism to provide approximate compensa­\ntion. In order to accomplish this, first select a region of \nthe casting that has parallel walls and a surface condition \nrepresentative of the rest of the casting as a transfer point. \nNext, select the test block whose overall length, C (Fig. \n1), most closely matches the reflection amplitude through \nthe block length. Place the search unit on the casting at \ntl1e transfer point and adjust the instrument gain until the \nback reflection amplitude through the casting matches that \nthrough the test block. Using this transfer technique, the \nexamination sensitivity in the casting may be expected to \nbe within ±30% or less of that given by the test blocks. \n8.4 Do not change those instrument controls and the \ntest frequency set during calibration, except the attenuator, \nor calibrated gain control, during acceptance examination \nof a given thickness of the casting. Make a periodic calibra­\ntion during the inspection by checking the amplitude of \nresponse from the¼ in. (6.4 mm) diameter flat-bottom hole \nin the test block utilized for the transfer. \nNOTE 3 - The attenuator or calibrated gain control may be used to \nchange the signal amplitude during examination to permit small amplitude \nsignals to be more readily detected. Signal evaluation is made by returning \nthe attenuator or calibrated gain control to its original setting. \n8.5 During examination of areas of the casting having \nparallel walls, recheck areas showing 75% or greater loss \nof back reflection to determine whether loss of back reflec­\ntion is due to poor contact, insufficient couplant, misori­\nented discontinuity, etc. If the reason for loss of back \nreflection is not evident, consider the area questionable \nand further investigate. \n9. Report \n9.1 The manufacturer's report of final ultrasonic exami­\nnation shall contain the following data and shall be fur­\nnished to the purchaser: \n9.1.1 The total number, location, amplitude, and area \nwhen possible to delineate boundaries by monitoring the \nmovement of the center of the search unit of all indications \nequal to or greater than 100% of the DAC. \n9.1.2 Questionable areas from 8.5 that, upon fmther \ninvestigation, are determined to be caused by discontinu­\nities. \n9.1.3 The examination frequency, type of instrument, \ntypes of search units employed, couplant, manufacturer's \nidentifying numbers, purchaser's order number, and data \nand authorized signature. \n9.1.4 A sketch showing the physical outline of the \ncasting, including dimensions of all areas not inspected \ndue to geometric configuration, with the location and sizes \nof all indications in accordance with 9.1.1 and 9.1.2. \n10. Acceptance Standards \n10.1 This practice is intended for application to castings \nwith a wide variety of sizes, shapes, compositions, melting \nprocesses, foundry practices, and applications. Therefore, \nit is impractical to specify an ultrasonic quality level that \nwould be universally applicable to such a diversity of prod­\nucts. Ultrasonic acceptance or rejection criteria for individ­\nual castings should be based on a realistic appraisal of \nservice requirements and the quality that can normally be \nobtained in production of the particular type of casting. \n10.2 Acceptance quality levels shall be established \nbetween the purchaser and the manufacturer on the basis \nof one or more of the following criteria: \n10.2.1 No indication equal to or greater than the \nDAC over an area specified for the applicable quality level \nof Table 2. \n10.2.2 No reduction of back reflection of 75% or \ngreater that has been determined to be caused by a disconti­\nnuity over an area specified for the applicable quality level \nof Table 2. \n1036 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "tabulaTablesPath": "tables_tabula/page-1130.json",
  "tabulaTablesCsv": "tables_tabula/page-1130.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1130.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5223,
  "bestTextAlphaRatio": 0.7794
}