{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 206,
  "globalPageIndex": 1004,
  "width": 618.6,
  "height": 796.8,
  "text": "SA-533/SA-533M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, Alloy Steel, Quenched and \nTempered, Manganese-Molybdenum and Manganese­\nMolybdenum-Nickel \n1. Scope \n1.1 This specification covers one type of manganese­\nmolybdenum and four types of manganese-molybdenum­\nnickel alloy steel plates for use in the quenched and tempered \ncondition for the construction of welded pressure vessels. \n1.2 Material under this specification is available in five \ntypes, designated \"A\", \"B\", \"C\", \"D\", and \"E\". The material is \nalso available in three classes having the following strength \nlevels. \nClass Tensile Strength, \nksi [MPa] \n1 80-100 [550 to 690] \n2 90-115 [620 to 795] \n3 100-125 [690 to 860] \n1.3 The maximum thickness of Class 1 and Class 2 plates is \nlimited only by the capacity of the composition to meet the \nspecified mechanical property requirements; however, current \npractice normally limits the maximum thickness to 12 in. [300 \nmm] for Types A through D and to 7 in. [180 mm] for Type E. \n1.4 The maximum thickness of Class 3 plates is 2½ in. [65 \nmm] for Types A through D and 2 in. [50 mm] for Type E. \n1.5 The minimum nominal thickness of plates of all classes \nis 0.25 in. [6.5 mm]. \n1.6 These alloy steel plates in the as-rolled condition are \nsensitive to cracking during transit and handling, particularly in \nthicknesses over about 1 or 2 in. [25 or 50 mm]. They should \nbe shipped in the as-rolled conditions only by mutual agree­\nment of manufacturer and the purchaser. \nproperties may be affected by high levels of radiation. Appen­\ndix Xl provides some information pertinent to this usage. \n1.8 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3.1 Material supplied to this material specification shall \nconform to Specification A20/A20M. These requirements out­\nline the testing and retesting methods and procedures, permit­\nted variations in dimensions, and mass, quality and repair of \ndefects, marking, loading, and ordering information. \n--· - -1-:7 Pla.tescoveredbyffifs-specilica1fon are often usecfrnlhe -- ···3'2-In·-addition-·-to-the-basic----requirements-ot-tlri:s~ \nbeltline region of nuclear reactor vessels where the material specification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/ A20M. \n904 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1004.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3299,
  "bestTextAlphaRatio": 0.7481
}