{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 286,
  "globalPageIndex": 286,
  "width": 597.72,
  "height": 842.88,
  "text": "SA-193/SA-193M ASME BPVC.II.A-2025 \nSpecification for \nAlloy-Steel and Stainless Steel Bolting for High Temperature \nor High Pressure Service and Other Special Purpose \nApplications \n1. Scope \n1.1 This specification covers alloy and stainless steel bolt­\ning materials and bolting components for pressure vessels, \nvalves, flanges, and fittings for high temperature or high \npressure service, or other special purpose applications. See \nSpecification A962/A962M for the definition of bolting. Bars \nand wire shall be hot-wrought and may be further processed by \ncenterless grinding or by cold drawing. Austenitic stainless \nsteel may be carbide solution treated or carbide solution treated \nand strain-hardened. When strain hardened austenitic stainless \nsteel is ordered, the purchaser should take special care to \nensure that Appendix XI is thoroughly understood. \n1.2 Several grades are covered, including ferritic steels and \naustenitic stainless steels designated B5, BS, and so forth. \nSelection will depend upon design, service conditions, me­\nchanical properties, and high temperature characteristics. \n1.3 The following referenced general requirements are in­\ndispensable for application of this specification: Specification \nA962/A962M. \nNorn 1-The committee formulating this specification has included \nseveral steel types that have been rather extensively used for the present \npurpose. Other compositions will be considered for inclusion by the \ncommittee from time to time as the need becomes apparent. \nNorn 2-For grades of alloy-steel bolting suitable for use at the lower \nrange of high temperature applications, reference should be made to \nSpecification A354. \nNorn 3-For grades of alloy-steel bolting suitable for use in low \ntemperature applications, reference should be made to Specification \nA320/A320M. \n1.4 Nuts for use with bolting are covered in Section 13. \n1.5 Supplementary Requirements are provided for use at the \noption of the purchaser. The supplementary requirements shall \napply only when specified in the purchase order or contract. \n1.6 This specification is expressed in both inch-pound units \nand in SI units; however, unless the purchase order or contract \nspecifies the applicable M specification designation (SI units), \nthe inch-pound units shall apply. \n1.7 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem may not be exact equivalents; therefore, each system \nshall be used independently of the other. Combining values \nfrom the two systems may result in non-conformance with the \nstandard. \n1.8 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \n234 \nAl53/Al53M Specification for Zinc Coating (Hot-Dip) on \nIron and Steel Hardware \nA194/A194M Specification for Carbon Steel, Alloy Steel, \nand Stainless Steel Nuts for Bolts for High Pressure or \nHigh Temperature Service, or Both \nA320/A320M Specification for Alloy-Steel and Stainless \nSteel Bolting for Low-Temperature Service \nA354 Specification for Quenched and Tempered Alloy Steel \nBolts, Studs, and Other Externally Threaded Fasteners \nA788/A788M Specification for Steel Forgings, General Re­\nquirements ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0286.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3571,
  "bestTextAlphaRatio": 0.7903
}