{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 197,
  "globalPageIndex": 197,
  "width": 613.92,
  "height": 793.2,
  "text": ".--. \nASME BPVC.II.A-2025 SA-53/SA-53M \n9.2.4 For eddy current testing, the calibration pipe shall \ncontain, at the option of the manufacturer, any one of the \nfollowing calibration standards to establish a minimum sensi­\ntivity level for rejection. \n9.2.4.1 Drilled Hole-The calibration pipe shall contain \nthree holes spaced 120° apart or four holes spaced 90° apart, \nsufficiently separated longitudinally to ensure separately dis­\ntinguishable responses. The holes shall be drilled radially and \ncompletely through the pipe wall, care being taken to avoid \ndistortion of the pipe while drilling. Dependent upon the \nnominal pipe size, the calibration pipe shall contain the \nfollowing hole: \nNPS DN Diameter of Drilled Hole \n:51/2 :,; 15 0.039 In. [1.0 mm] \n> ½ :5 1¼ > 15 :,; 32 0.055 in. [1.4 mm] \n> 1¼:,; 2 >32:550 0.071 in. [1.8 mm] \n> 2:,; 5 > 50:,; 125 0.087 in. [2.2 mm] \n>5 > 125 0.106 in. [2.7 mm] \n9.2.4.2 Transverse Tangential Notch-Using a round tool or \nfile with a ¼ in. [6 mm] diameter, a notch shall be filed or \nmilled tangential to the surface and transverse to the longitu­\ndinal axis of the pipe. The notch shall have a depth not \nexceeding 12.5 % of the specified wall thickness of the pipe or \n0.012 in. [0.3 mm], whichever is the greater. \n9.2.4.3 Longitudinal Notch-A notch 0.031 in. [0.8 mm] or \nless in width shall be machined in a radial plane parallel to the \npipe axis on the outside surface of the pipe, to a depth not \nexceeding 12.5 % of the specified wall thickness of the pipe or \n0.012 in. [0.3 mm], whichever is the greater. The length of the \nnotch shall be compatible with the testing method. \n9.2.4.4 Compatibility-The calibration standards in the cali­\nbration pipe shall be compatible with the testing equipment and \nthe method being used. \n9.2.5 For flux leakage testing, the longitudinal calibration \nreference notches shall be straight-sided notches machined in a \nradial plane parallel to the pipe axis. For specified wall \nthicknesses less than 0.500 in. [12.7 mm], outside and inside \nnotches shall be used. For specified wall thicknesses equal to or \ngreater than 0.500 in. [12.7 mm], only an outside notch shall be \nused. The notch depth shall not exceed 12.5 % of the specified \nwall thickness, or 0.012 in. [0.3 mm], whichever is the greater. \nThe notch length shall not exceed 1 in. [25 mm], and the notch \nwidth shall not exceed the notch depth. Outside diameter and \ninside diameter notches shall be located sufficiently apart to \nallow separation and identification of the signals. \n9.2.6 Pipe containing one or more imperfections that pro­\nduce a signal equal to or greater than the signal produced by the \ncalibration standard shall be rejected or the area producing the \nsignal shall be rejected. \n9.2.6.1 Test signals produced by imperfections that cannot \nbe identified, or produced by cracks or crack-like \nimperfections, shall result in rejection of the pipe, unless it is \nrepaired and retested. To be accepted, the pipe shall pass the \nsame specification test to which it was originally subjected and \nthe remaining wall thickness shall not have been decreased \nbelow that permitted by the specification. It shall be permis­\nsible to reduce the outside diameter at the point of grinding by \nthe amount so removed. \n9.2.6.2 It shall be permissible to evaluate test signals pro­\nduced by visual imperfections in accordance with the provi­\nsions of Section 12. A few examples of such imperfections are \nstraightener marks, cutting chips, scratches, steel die stamps, \nstop marks, or pipe reducer ripple. \n9.2.7 The test methods described in Section 9 are not \nnecessarily capable of inspecting the end portion of pipes. This \ncondition is referred to as end effect. The length of the end \neffect shall be determined by the manufacturer and, if specified \nin the purchase order, reported to the purchaser. \n10. Permissible Variations in Weight (Mass) and \nDimensions \n10.1 Weight (Mass)-The weight (mass) of the pipe shall \nnot vary more than± 10 % from its specified weight (mass), as \nderived by multiplying its measured length by its specified \nweight (mass) per unit length, as given in Table X2.2 or Table \nX2.3, or as calculated using the relevant equation in ASME \nB36.10M. \nNo'!B 6-For pipe NPS 4 [DN 100] or smaller, the weight (mass) \ntolerance is applicable to the weights (masses) of the customary lifts of \npipe as produced for shipment by the mill. For pipe larger than NPS 4 [DN \n100], where individual lengths are weighed, the weight (mass) tolerance is \napplicable to the individual lengths. \n10.2 Diameter-For pipe NPS 1 ½ [DN 40] or smaller, the \noutside diameter at any point shall not vary more than ± 1/64 in. \n[0.4 mm] from the specified outside diameter. For pipe NPS 2 \n[DN 50] or larger, the outside diameter shall not vary more \nthan ± 1 % from the specified outside diameter. \n10.3 Thickness-The minimum wall thickness at any point \nshall be not more than 12.5 % under the specified wall \nthickness. The minimum wall thickness on inspection shall \nconform to the requirements given in Table X2.4. \n11. End Finish \n11.1 If ordered with plain ends, the pipe shall be furnished \nto the following practice, unless otherwise specified. \n11.1.1 NPS 1½ [DN 40] or Smaller-Unless otherwise \nspecified in the purchase order, end finish shall be at the option \nof the manufacturer. \n11.1.2 Larger than NPS l½ [DN 40]: \n11.1.2.1 Pipe of standard-weight or extra-strong weight, or \nin wall thickness less than 0.500 in. [12.7 mm], other than \ndouble extra-strong weight pipe, shall be plain-end beveled \nwith ends beveled to an angle of 30°, +5°, -0°, measured from \na line drawn perpendicular to the axis of the pipe, and with a \nroot face of 1/16 in. ± 1/32 in. [1.6 mm ± 0.8 mm]. \n145 \n11.1.2.2 Pipe with a specified wall thickness greater than \n0.500 in. [12.7 mm], and all double extra-strong weight pipe, \nshall be plain-end square cut. \n11.2 If ordered with threaded ends, the pipe ends shall be \nprovided with a thread in accordance with the gaging practice \nand tolerances of ANSI B 1.20.1. For standard-weight pipe NPS \n6 [DN 150] or smaller, refer to Table X3.l for threading data. \nFor standard-weight pipe NPS 8 [DN 200] or larger and all \nsizes of extra-strong weight pipe and double extra-strong \nweight pipe, refer to Table X3.2 for threading data. Threaded ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0197.json",
  "tabulaTablesCsv": "tables_tabula/page-0197.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0197.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6354,
  "bestTextAlphaRatio": 0.7164
}