{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 480,
  "globalPageIndex": 480,
  "width": 596.16,
  "height": 841.8,
  "text": "SA-285/SA-285M ASME BPVC.II.A-2025 \nStandard Specification for \nPressure Vessel Plates, Carbon Steel, Low- and \nIntermediate-Tensile Strength \n1. Scope \n1.1 This specification covers carbon steel plates of low­\nand intermediate-tensile strengths which may be killed or \nsemi-killed at the producer's option. These plates are intended \nfor fusion-welded pressure vessels. \n1.2 Plates under this specification are available in three \ngrades having different strength levels as follows: \nGrade Tensile Strength, ksi [MPa] \nA 45-65 [310-450] \nB 50-70 [345-485] \nC 55-75 [380-515] \n1.3 The maximum thickness of plates is limited by the \ncapacity of the composition to meet the specified mechanical \nproperty requirements. \nNoTE 1-For killed carbon steels only, refer to the following ASTM \nspecifications: \nA299/A299M Specification for Pressure Vessel Plates, Carbon Steel, \nManganese-Silicon \nA5!5/A515M Specification for Pressure Vessel Plates, Carbon Steel, \nfor Intermediate- and Higher-Temperature Service \nA5 l 6/ A5 l 6M Specification for Pressure Vessel Plates, Carbon Steel, \nfor Moderate- and Lower-Temperature Service \n1.4 For plates produced from coil and furnished without \nheat treatment or with stress relieving only, the additional \nrequirements, including additional testing requirements and the \nreporting of additional test results, of Specification A20/A20M \napply. \n1.5 The values stated in either inch-pound units or SI units \nare to be regarded separately as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \n428 \nsystem are not exact equivalents; therefore, each system must \nbe used independently of the other. Combining values from the \ntwo systems may result in nonconformance with the specifi­\ncation. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA20/ A20M Specification for General Requirements for Steel \nPlates for Pressure Vessels \nA299/ A299M Specification for Pressure Vessel Plates, Car­\nbon Steel, Manganese-Silicon \nA435/A435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA515/A515M Specification for Pressure Vessel Plates, Car­\nbon Steel, for Intermediate- and Higher-Temperature Ser­\nvice \nA516/A516M Specification for Pressure Vessel Plates, Car­\nbon Steel, for Moderate- and Lower-Temperature Service \nA577/A577M Specification for Ultrasonic Angle-Beam Ex­\namination of Steel Plates \nA578/A578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering Information \n3 .1 Material supplied to this material specification shall \nconform to Specification A20/A20M. These requirements out­\nline the testing and retesting methods and procedures, permit­\nted variations in dimensions, and mass, quality and repair of \ndefects, marking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text\\pages\\page-0480.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3386,
  "bestTextAlphaRatio": 0.778
}