{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 879,
  "globalPageIndex": 1677,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 \nMANDATORY APPENDIX Ill \nGUIDELINES ON MULTIPLE MARKING OF MATERIALS \n111-100 BACKGROUND \nA common inquiry topic is the permissibility of using \nmaterial that is identified with two or more specifications \n(or grades, classes, or types), even if they have different \nstrengths, or even if one of them is not permitted for \nuse in the construction code of application. The Commit­\ntee has addressed variants of these questions in several \ninterpretations: 1-89-11, IIA-92-08, VIIl-1-89-269, and \nVIII-1-89-197. \n111-200 GUIDELINES \nThe construction codes individually define what mate­\nrials may be used in boilers, vessels, and components con­\nstructed in compliance to their rules. If a material meets \nall of the requirements for a specification for which it is \nmarked, including documentation, if any, and if it meets \nall requirements for use imposed by the construction \ncode, it may be used. The construction codes, in general, \ndo not address the case of materials marked with more \nthan one specification, grade, class, or type, so these \nguidelines are offered for clarification. \n111-210 ACCEPTABILITY OF MULTIPLE MARKING \nDual or multiple marking is acceptable, as long as the \nmaterial so marked meets all of the requirements of all \nthe specifications, grades, classes, and types with which \nit is marked. \nAll of the measured and controlled attributes of the \nmultiply marked grades or specifications must overlap \n(e.g., chemistry, mechanical properties, dimensions, and \ntolerances) and the material so marked must exhibit val­\nues that fall within the overlaps. Further, the controlled \nbut unmeasured attributes of the specifications or grades \nmust overlap ( e.g., melting practices, heat treatments, and \ninspection). \nMany specifications or grades have significant overlap \nof chemistry ranges or properties. It is common for mate­\nrial manufacturers to produce materials that satisfy more \nthan one specification, grade, class, or type. Examples are \nSA-53 and SA-106 (some grades and classes), SA-213 \nTP304L and TP304, SA-213 TP304 and TP304H, and \nSA-106 B and C. \n111-220 PROHIBITION ON MULTIPLE MARKING \nDual or multiple marking is not acceptable if two or \nmore specifications to which the material is marked have \nmutually exclusive requirements. \nThis prohibition includes more than just chemistry and \nproperty requirements. One example is SA-515 and \nSA-516; the former requires melting to coarse grain prac­\ntice while the latter requires melting to fine grain prac­\ntice. Another example is SA-213 TP304L and TP304H; \nthe carbon content ranges of these grades have no \noverlap. \n111-230 GRADE SUBSTITUTION \nGrade substitution is not permitted. Grade substitution \noccurs when \n(a) the material contains an element (other than nitro­\ngen) that is unspecified for one of the grades marked \n(b) the amount of that element present in the material \nmeets the minimum and maximum composition limits for \nthat element in another grade of a specification contained \nin Section II, Part A or Part B, whether or not it is also so \nmarked \nFor example, a material meets all of the composition \nlimits for SA-240 304, contains 0.06C and 0.02N, but also \ncontains 0.45% Ti. This material cannot be marked or \nprovided as meeting SA-240 304 because the Ti content \nmeets the requirements of SA-240 321 [which is Ti great­\ner than Sx (C + N) but less than 0.70]. \nAnother material, with identical composition, except \n0.35% Ti, may be marked SA-240 304 because the Ti con­\ntent does not meet the minimum requirement for 321. \nThe Ti content is just a residual. \n111-240 MARKING SELECTION \nIf a material is marked with specifications, grades, \nclasses, or types, it may be used with the allowable stress­\nes, design stress intensities, or ratings appropriate for any \nof the markings on the material, as long as the material \nspecification, grade, class, and type is permitted by the \ncode of construction governing the boiler, vessel, or com­\nponent in which the material is to be used. However, once \nthe designer has selected which marking applies (specifi­\ncation, grade, class, type, etc.), the designer must use all \nthe design values appropriate for that selection and \nmay not mix and match values from any other specifica­\ntions, grades, classes, types, etc., with which the material \nmay be marked. \n1623 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1677.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4354,
  "bestTextAlphaRatio": 0.7538
}