{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 226,
  "globalPageIndex": 226,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-106/SA-106M ASME BPVC.II.A-2025 \n16. Dimensions, Mass, and Permissible Variations \n16.1 Mass-The mass of any length of pipe shall not vary \nmore than 10 % over and 3.5 % under that specified. Unless \notherwise agreed upon between the manufacturer and the \npurchaser, pipe in NPS 4 [DN 100] and smaller may be \nweighed in convenient lots; pipe larger than NPS 4 [DN 100] \nshall be weighed separately. \n16.2 Diameter-Except as provided for thin-wall pipe in \nparagraph 12.2 of Specification A530/A530M, the tolerances \nfor diameter shall be in accordance with the following: \n16.2.l Except for pipe ordered as special outside diameter \ntolerance pipe or as inside diameter tolerance pipe, variations \nin outside diameter shall not exceed those given in Table 3. \n16.2.2 For pipe over 10 in. [250 mm] OD ordered as special \noutside diameter tolerance pipe, the outside diameter shall not \nvary more than 1 % over or 1 % under the specified outside \ndiameter. \n16.2.3 For pipe over 10 in. [250 mm] ID ordered as inside \ndiameter tolerance pipe, the inside diameter shall not vary \nmore than 1 % over or l % under the specified inside diameter. \n16.3 Thickness-The minimum wall thickness at any point \nshall not be more than 12.5 % under the specified wall \nthickness. \n17. Lengths \n17 .1 Pipe lengths shall be in accordance with the following \nregular practice: \n17 .1.1 The lengths required shall be specified in the order, \nand \n17 .1.2 No jointers are permitted unless otherwise specified. \n17 .1.3 If definite lengths are not required, pipe may be \nordered in single random lengths or in double random lengths \nmeeting the following requirements: \n17.1.3.1 Single random lengths shall be 16 to 22 ft [4.8 to \n6.7 m] in length, except that 5 % shall be permitted to be less \nthan 16 ft [4.8 m] and none shall be less than 12 ft [3.7 m]. \n17.1.3.2 Double random lengths shall have a minimum \naverage length of 35 ft [10.7 m] and shall have a minimum \nlength of 22 ft [6.7 m], except that 5 % shall be permitted to be \nless than 22 ft [6.7 m] and none shall be less than 16 ft [4.8 m]. \nTABLE 3 Variations in Outside Diameter \nPermissible Variations in \nOutside Diameter \nNPS [DN Designator] Over Under \n• in. mm in. mm \n1/s to 1 ½ [6 to 40], incl 1/54 (0.015) 0.4 1/s• (0.015) 0.4 \nOver 1½ to 4 [40 to 1/s2 (0.031) 0.8 1/s2 (0.031) 0.8 \n100], incl \nOver 4 to 8 [100 to 1/16 (0.062) 1.6 1/s2 (0.031) 0.8 \n200], incl \nOver 8 to 18 [200 to %2(0.093) 2.4 1/s2 (0.031) 0.8 \n450], incl \nOver 18 to 26 [450 to 1/s (0.125) 3.2 1/s2 (0.031) 0.8 \n650], incl \nOver 26 to 34 [650 to %2 (0.156) 4.0 1/s2 (0.031) 0.8 \n850], incl \nOver 34 to 48 [850 to o/16 (0.187) 4.8 1/s2 (0.031) 0.8 \n1200], incl \n18. Workmanship, Finish and Appearance \n18.1 The pipe manufacturer shall explore a sufficient num­\nber of visual surface imperfections to provide reasonable \nassurance that they have been properly evaluated with respect \nto depth. Exploration of all surface imperfections is not \nrequired but consideration should be given to the necessity of \nexploring all surface imperfections to assure compliance with \n18.2. \n18.2 Surface imperfections that penetrate more than 12½ % \nof the nominal wall thickness or encroach on the minimum \nwall thickness shall be considered defects. Pipe with such \ndefects shall be given one of the following dispositions: \n18.2.1 The defect shall be removed by grinding, provided \nthat the remaining wall thickness is within the limits specified \nin 16.3. \n18.2.2 Repaired in accordance with the repair welding \nprovisions of 18.6. \n18.2.3 The section of pipe containing the defect may be cut \noff within the limits of requirements on length. \n18.2.4 Rejected. \n18.3 To provide a workmanlike finish and basis for evalu­\nating conformance with 18.2 the pipe manufacturer shall \nremove by grinding the following noninjurious imperfections: \n18.3.1 Mechanical marks and abrasions-such as cable \nmarks, dinges, guide marks, roll marks, ball scratches, scores, \nand die marks-and pits, any of which imperfections are \ndeeper than 1/16 in. [l.6 mm]. \n174 \n18.3.2 Visual imperfections commonly referred to as scabs, \nseams, laps, tears, or slivers found by exploration in accor­\ndance with 18.1 to be deeper than 5 % of the nominal wall \nthickness. \n18.4 At the purchaser's discretion, pipe shall be subjected to \nrejection if surface imperfections acceptable under 18.2 are not \nscattered, but appear over a large area in excess of what is \nconsidered a workmanlike finish. Disposition of such pipe shall \nbe a matter of agreement between the manufacturer and the \npurchaser. \n18.5 When imperfections or defects are removed by \ngrinding, a smooth curved surface shall be maintained, and the \nwall thickness shall not be decreased below that permitted by \nthis specification. The outside diamet()r at the point of grinding \nis permitted to be reduced by the amount so removed. \n18.5.1 Wall thickness measurements shall be made with a \nmechanical caliper or with a properly calibrated nondestructive \ntesting device of appropriate accuracy. In case of dispute, the \nmeasurement determined by use of the mechanical caliper shall \ngovern. \n18.6 Weld repair shall be permitted only subject to the \napproval of the purchaser and in accordance with Specification \nA530/A530M. \n18.7 The finished pipe shall be reasonably straight. \n19. End Finish \n19.1 The Pipe shall be furnished to the following practice, \nunless otherwise specified. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0226.json",
  "tabulaTablesCsv": "tables_tabula/page-0226.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0226.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5437,
  "bestTextAlphaRatio": 0.6895
}