{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 238,
  "globalPageIndex": 238,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-135/SA-135M (ASTM A135/A135M) ASME BPVC.II.A-2025 \na Designation: A135/A135M -21 \n~ull \nINTERNATIONAL \nStandard Specification for \nElectric-Resistance-Welded Steel Pipe 1 \nThis standard is issued uuder the fixed designation A135/A135M; the number immediately following the designation indicates the year \nof original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval. \nA superscript epsilon (e) indicates an editorial change since the last revision or reapproval. \n1. Scope* \n1.1 This specification 2 covers two grades of electric­\nresistance-welded steel pipe in NPS 2 to NPS 30 [DN 50 to DN \n750] inclusive, with nominal (average) wall thickness up to \n0.500 in. [12.70 mm], inclusive, and in nominal sizes NPS \n¾ to NPS 5 [DN 20 to DN 125] inclusive with nominal \n(average) wall thickness 0.083 in. [2.11 mm] to 0.134 in. [3.40 \nmm], depending on size. Pipe having other dimensions (Note \n1) may be furnished provided such pipe complies with all other \nrequirements of this specification. The pipe is intended for \nconveying gas, vapor, water or other liquid; only Grade A is \nadapted for flanging and bending (Note 2). The suitability of \npipe for various purposes is somewhat dependent upon its \ndimensions, properties, and conditions of service, so that the \npurpose for which the pipe is intended should be stated in the \norder. The pipe may be furnished either nonexpanded or cold \nexpanded at the option of the manufacturer. When pipe is cold \nexpanded, the amount of expansion shall not exceed 1.5 % of \nthe outside diameter pipe size. \nNOTE 1-A comprehensive listing of standardized pipe dimensions is \ncontained in ASME B36.lOM. \nNOTE 2-This provision is not intended to prohibit the cold bending of \nGrade B pipe. \n1.2 The values stated in either SI units or inch-pound units \nare to be regarded separately as standard. The values stated in \neach system may not be exact equivalents; therefore, each \nsystem shall be used independently of the other. Combining \nvalues from the two systems may result in non-conformance \nwith the standard. \n1.3 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n1 This specification is uuder the jµr:isdiction of ASTM Committee A0l on Steel, \nStainless Steel and Related Alloys and is the direct responsibility of Subcommittee \nA0l.09 on Carbon Steel Tubular Products. \nCurrent edition approved March 1, 2021. Published March 2021. Originally \napproved in 1931. Last previous edition approved in 2020 as A135/Al35M-20. \nDOI: 10.1520/A0135_A0135M-21. \n2 For ASME Boiler and Pressure Vessel Code applications, see related Specifi­\ncation SA-135 in Section II of that Code. \n2. Referenced Documents \n2.1 ASTM Standards: 3 \nA370 Test Methods and Definitions for Mechanical Testing \nof Steel Products \nA 700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA751 Test Methods and Practices for Chemical Analysis of \nSteel Products \nA865/ A865M Specification for Threaded Couplings, Steel, \nBlack or Zinc-Coated (Galvanized) Welded or Seamless, \nfor Use in Steel Pipe Joints \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nE6 Terminology Relating to Methods of Mechanical Testing \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE213 Practice for Ultrasonic Testing of Metal Pipe and \nTubing \nE273 Practice for Ultrasonic Testing of the Weld Zone of \nWelded Pipe and Tubing \nE309 Practice for Eddy Current Examination of Steel Tubu­\nlar Products Using Magnetic Saturation \nE570 Practice for Flux Leakage Examination of Ferromag-\nnetic Steel Tubular Products \n2.2 ASME Standard: \nB 1.20.1 Pipe Threads, General Purpose 4 \nB36.10M Welded and Seamless Wrought Steel Pipe 4 '5 \n2.3 Federal Standards: \nFed. STD No. 123 Marking for Shipments (Civi1Agencies)6 \n2.4 Military Standards: \nMIL-STD-129 Marking for Shipment and Storage 7 \n3 For referenced ASTM standards, visit the ASTM website, www.astrn.org, or \ncontact ASTM Customer Service at service@astrn.org. For Annual Book of ASTM \nStandards volume information, refer to the standard's Docnment Summary page on \nthe ASTM website. \n4 Available from American National Standards Institute (ANSI), 25 W. 43rd St., \n4th Floor, New York, NY 10036, http://www.ansi.org. \n5 Available from American Society of Mechanical Engineers (ASME), ASME \nInternational Headquarters, Two Park Ave., New York, NY 10016-5990, http:// \nwww.asme.org. \n6 Available from General Service Administration, Washington, DC 20405. \n7 Available from Standardization Documents Order Desk, Bldg. 4 Section D, 700 \nRobbins Ave., Philadelphia, PA 19111-5094. Attn.: NOPD. \n* A Summary of Changes section appears at the end of this standard \n186 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 2,
  "bestTextPath": "best_text/pages/page-0238.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5082,
  "bestTextAlphaRatio": 0.7448
}