{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 496,
  "globalPageIndex": 1294,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-749/SA-749M ASME BPVC.II.A-2025 \nSPECIFICATION FOR STEEL, STRIP, CARBON \nAND HIGH-STRENGTH, LOW-ALLOY, HOT-ROLLED, \nGENERAL REQUIREMENTS FOR \nSA-749/SA-749M 0 \nINTERNATIONAL \nStandards Worldwide \n[Identical with AS1M Specification A 749/A 749M-97(2002).] \n1. Scope \n1.1 This specification covers the general requirements \nfor hot-rolled steel strip in coils and cut lengths. It applies \nto carbon steel and high-strength, low-alloy steel furnished \nas hot-rolled. \n1.2 This specification is not applicable to hot-rolled \nheavy-thickness carbon sheet and strip coils (ASTM Speci­\nfication A 635 / A 635M), cold-rolled carbon steel strip \n(ASTM Specification A 109 or A 109M), high-strength, \nlow-alloy coldrolled steel (ASTM Specifications A 606 and \nA 607) or cold-rolled carbon spring steel (ASTM Specifi­\ncation A 682 or A 682M). \n1.3 In case of any conflict in requirements, the require­\nments of the individual material specification shall prevail \nover those of this general specification. \n1.4 For the purposes of determining conformance with \nthis and the appropriate product specification referenced \nunder 2.1, values shall be rounded to the nearest unit in \nthe right hand place of figures used in expressing the lim­\niting values in accordance with the rounding method of \nPractice E 29. \n1.5 Annex Al lists permissible variations in dimensions \nand mass (Note 1) in S.I. [metric] units. The values listed \nare not exact conversions of the values listed in the inch­\npound tables, but instead are rounded or rationalized val­\nues. Conformance to Annex Al is mandatory when the \n\"M\" specification is used. \nNOTE 1 - The tenn \"weight\" is used when inch-pound units are the \nstandard; however, under S.I., the preferred tennis \"mass.\" \n1.6 The values stated in either inch-pound units or SI \nunits are to be regarded as standard. Within the text, the \nSI units are shown in brackets. The values stated in each \nsystem are not exact equivalents; therefore, each system \nmust be used independently of the other. Combining values \nfrom the two systems may result in nonconformance with \nthe specification. \n1.7 This specification and the applicable material speci­\nfications are expressed in both inch-pound units and SI \nunits. However, unless the order specifies the applicable \n\"M\" specification designation (SI units), the material shall \nbe furnished to inch-pound units. \n2. Referenced Documents \n2.1 ASTM Standards: \nA 109 Specification for Steel, Strip, Carbon, Cold-Rolled \nA 109M Specification for Steel, Strip, Carbon, Cold-Rolled \n(Metric) \nA 370 Test Methods and Definitions for Mechanical Test­\ning of Steel Products \nA 606 Specification for Steel, Sheet and Strip, High­\nStrength, Low-Alloy, Hot-Rolled and Cold-Rolled, with \nImproved Atmospheric Corrosion Resistance \nA 607 Specification for Steel, Sheet and Strip, High­\nStrength, Low-Alloy, Columbium or Vanadium, or \nBoth, Hot-Rolled and Cold-Rolled \nA 635/A 635M Specification for Steel, Sheet and Strip, \nHeavy-Thickness Coils, Carbon, Hot-Rolled \nA 682 Specification for Steel, Strip, High-Carbon, Cold­\nRolled, Spring Quality, General Requirements For \nA 682M Specification for Steel, Strip, High-Carbon, Cold­\nRolled, Spring Quality, General Requirements For \n(Metric) \nA 700 Practices for Packaging, Marking, and Loading \nMethods for Steel Products for Domestic Shipment \nA 751 Test Methods, Practices, and Terminology for \nChemical Analysis of Steel Products \nE 11 Specification for Wire-Cloth Sieves for Testing Pur­\nposes \nE 29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \n1222 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 1,
  "bestTextPath": "best_text/pages/page-1294.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3617,
  "bestTextAlphaRatio": 0.7553
}