{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 96,
  "globalPageIndex": 894,
  "width": 617.04,
  "height": 795.6,
  "text": "SA-480/SA-480M (ASTM A480/A480M) ASME BPVC.II.A-2025 \nincluding 2 in. [50.8 mm] nominal size shall be capable of \npassing the intergranular corrosion test in the as shipped \ncondition. In the case of heavier plates of types other than \n304L, 304LN, 309Cb, 310Cb, 316Cb, 316L, 316LN, 316Ti, \n317L, 321, 347, 348, S31725, S31726, and S31740, the \napplicability of this test shall be a matter for negotiation \nbetween the seller and the purchaser. \n18.2.2 The H types are not normally subject to intergranular \ncorrosion tests. However, it is permitted to specify Practice E \nof Practices A262 for 'fype 321H when intergranular corrosion \nis of concern. In this case, the purchaser shall inform the seller \nand agree upon the requirements and these requirements shall \nbe so stated on the purchase order. \n18.2.3 Austenitic chromium-manganese-nickel types (201, \n202, XM-17, XM-18, XM-19, XM-29, XM-31, S20400, \nS21640, and S21800) are to be heat treated for intergranular \ncorrosion resistance. When intergranular corrosion tests are \nrequired, they shall be as agreed upon between the seller and \nthe purchaser. \n18.2.4 N08800 shall be heat treated for intergranular corro­\nsion resistance. When intergranular corrosion tests are \nrequired, they shall be as agreed upon between the seller and \npurchaser. \n18.2.5 Corrosion tests are not normally required for the 400 \nseries types. Lower-carbon corrosion-resistant types (S44400, \nS44635, S44660, S44700, S44800, S44735, XM-27, and XM-\n33) are heat treated for resistance to corrosion. For S44400, \nS44635, S44660, S44700, S44800, S44735, XM-27, and XM-\n33, intergranular corrosion testing of Practices A763, Practice \nX, Y, or Z shall be specified as agreed upon between the seller \nand the purchaser. \n18.3 Detrimental Intermetallic Phases in Duplex Stainless \nSteels-The tests for detrimental intermetallic phases in \nwrought duplex stainless steels, Methods A, B, or C of Test \nMethods A923 or A1084, are not required unless it is specified \non the purchase order. All duplex (austenitic-ferritic) types that \nare listed in Test Methods A923 or A1084 are expected to be \ncapable of passing these tests. However, it is not necessary to \nactually run the tests unless specified on the purchase. order. \nThe applicability of these tests to duplex stainless steels not \nlisted in Test Methods A923 or A1084 shall be a matter for \nnegotiation between the seller and the purchaser. \n19. Test Methods \n19.1 The properties enumerated in applicable specifications \nshall be determined in accordance with the following ASTM \nstandards. \n19.1.1 Tension Tests-Test Methods and Definitions A370. \n19.1.2 Brinell Tests-Test Methods and Definitions A370. \n19.1.3 Rockwell Hardness-Test Methods and Definitions \nA370. \n19.1.4 Hardness Equivalents-Tables B140. \n19.1.5 Intergranular Corrosion (When Specified)-Practices \nA262, Practices A763. \n19.1.6 Permeability Test (When Required)-Test Methods \nA342/ A342M. \n19.1.7 Charpy Impact Testing (When Required)-Test \nMethods and Definitions A370. \n19.1.8 lntermetallic Phases (When Specified)-Test Meth­\nods A923 or A1084. \n20. Retests and Retreatment \n20.1 Retests are permitted in accordance with the provisions \nof Test Methods and Definitions A370. \n20.2 If any test specimen shows defective machining or \ndevelops flaws, it is permitted to discard the flawed specimen \nand substitute another specimen. \n20.2.1 If the percentage of elongation of any tension speci­\nmen is less than that specified and any part of the fracture is \nmore than¾ in. [19.1 mm] from the center of the gauge length \nof the 2 in. [50.8 mm] specimen or is outside the middle half \nof the gauge length of an 8 in. [203.2 mm] specimen, as \nindicated by scribe marks placed on the specimen before \ntesting, a retest shall be allowed. \n20.3 If a bend test specimen fails, due to conditions of \nbending more severe than required by the specification, a retest \nshall be permitted, either on a duplicate specimen or on a \nremaining portion of the failed specimen. \n20.4 If the results of any test lot are not in conformance with \nthe requirements of the applicable material specification, the \nproducer is permitted the option of retreating such lots. The \nmaterial shall be accepted if the results of retests on retreated \nmaterial are within the specified requirements. \n20.5 If any specimens selected to represent any heat fail to \nmeet any of the test requirements as specified in the applicable \nmaterial specification, it is permitted to reheat treat the material \nrepresented and resubmit it for testing. \n20.6 If the product analysis fails to conform to the specified \nlimits, analysis shall be made on a new sample. The results of \nthis retest shall be within the specified requirements. \n792 \n21. Repair of Plate by Welding \n21.1 Repair of surface defects of plate, by welding, is \npermitted unless prohibited by other specifications or purchase \norder requirements. \n21.2 Defect depth shall not exceed ½ of the nominal \nthickness, and the total area shall not exceed 1 % of the plate \nsurface area, unless prior approval from the purchaser is \nobtained. \n21.3 Unacceptable imperfections shall be suitably prepared \nfor welding by grinding or machining. Open clean defects, \nsuch as pits or impressions, will not necessarily require \npreparation. \n21.4 The welding procedure and the welders or welding \noperators shall be qualified in accordance with Section IX of \nthe ASME Boiler and Pressure Vessel Code. \n21.5 The welding consumables shall be suitable with the \nplate. \n21.6 After repair welding, the welded area shall be ground \nsmooth and blended uniformly to the surrounding surface. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0894.json",
  "tabulaTablesCsv": "tables_tabula/page-0894.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0894.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5656,
  "bestTextAlphaRatio": 0.7261
}