{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 699,
  "globalPageIndex": 699,
  "width": 599.4,
  "height": 844.08,
  "text": "ASME BPVC.II.A-2025 SA-387 /SA-387M \nA5.29/A5.29M Low-Alloy Steel Electrodes for Flux Cored \nArc Welding \n3. General Requirements and Ordering Information \n3.1 Material supplied to this material specification shall \nconform to Specification A20/A20M. These requirements out­\nline the testing and retesting methods and procedures, pennis­\nsible variations in dimensions and weight, quality and repair of \ndefects, marking, loading, and ordering information. \n3.2 In addition to the basic requirements of this \nspecification, certain supplementary requirements are available \nwhen additional control, testing, or examination is required to \nmeet end use requirements. The purchaser is referred to the \nlisted supplementary requirements in this specification and to \nthe detailed requirements in Specification A20/ A20M. \n3.3 If the requirements of this specification are in conflict \nwith the requirements of Specification A20/A20M, the require­\nments of thi.s specification shall prevail. \n4. Manufacture \n4.1 Steelmaking Practice-The steel shall be killed. \n5. Heat Treatment \n5.1 Except for Grade 91, all plates shall be thermally treated \neither by annealing, normalizing and tempering, or, when \npermitted by the purchaser, accelerated cooling from the \naustenitizing temperature by air blasting or liquid quenching, \nfollowed by tempering. Minimum tempering temperatures \nshall be as follows: \nGrade Temperature, 'F ['CJ \n2, 12, and 11 1150 [620] \n22, 21, and 9 1250 [675] \n5 1300 [705] \n5 .1.1 Grade 91 plates shall be thermally treated, either by \nnormalizing and tempering or by accelerated cooling from the \naustenitizing temperature by air blasting or liquid quenching, \nfollowed by tempering. Grade 91 plates shall be austenitized at \n1900 to 1975°F [1040 to 1080°C] and shall be tempered at \n1350 to 1470°F [730 to 800°C]. \n5.2 Grade 5, 9, 21, 22, and 91 plates ordered without the \nheat treatment required by 5.1 shall be furnished in either the \nstress relieved or the annealed condition. \n5.3 For plates ordered without the heat treatment required \nby 5.I, heat treatment of the plates to conform to 5.1 and to \nTable 2 or Table 3, as applicable, shall be the responsibility of \nthe purchaser. \n6. Chemical Requirements \n6.1 The steel shall conform to the requirements as to \nchemical composition shown in Table l unless otherwise \nmodified in accordance with Supplementary Requirement S 17, \nVacuum Carbon-Deoxidized Steel, in Specification A20/A20M \nfor grades other than Grade 11. \n7. Metallurgical Structure \n7.1 Austenitic Grain Size-Grade 2 material shall have a \ncoarse austenitic grain size. \n8. Mechanical Requirements \n8.1 Tension Test Requirements: \n8.1.1 The material as represented by the tension test speci­\nmens shall confom1 to the applicable requirements of Table 2 \nor Table 3, as specified on the order. \n8.1.2 Adjustment of the percentage elongation requirements \nis permitted in accordance with Specification A20/ A20M for \nplates up to¾ in. [20 mm] inclusive, in thickness when an 8-in. \n[200-mm] gage length is used. \n9. Repair Welding \n9.1 Repair welding shall be permitted only with the ap­\nproval of the purchaser. Repair welds shall meet the require­\nments of the construction code specified by the purchaser. \n9.2 All repair welds in Grade 91 shall be made with one of \nthe following welding • processes and consumables: SMAW, \nA5.5/A5.5M E90XX-B9; SAW, A5.23/A5.23M EB9 + neutral \nflux; GTAW, A5.28/A5.28M ER90S-B9; and FCAW A5.29/ \nA5.29M E91Tl-B9. In addition, the sum of the Ni+Mn content \nof all welding consumables used to weld repair Grade 91 plate \nshall not exceed 1.0 %. \n10. Marking \n10.1 In addition to the marking required in Specification \nA20/A20M, each plate shall be legibly stamped or stenciled, \ndepending upon the ordered thickness, with the letter A for \nannealed, N for nonnalized and tempered, and Q for acceler­\nated cooled and tempered, as applicable. Grade 91 plates shall \nbe marked with the appropriate type. Plates ordered to, and \nconforming to, Type 2 may be marked Type 1 as well. \n11. Keywords \n649 \n11.1 alloy steel; alloy steel plate; creep resistance; elevated \ntemperature; pressure containing parts; pressure vessel steels; \nsteel plates; steel plates for pressure vessels ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0699.json",
  "tabulaTablesCsv": "tables_tabula/page-0699.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0699.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4253,
  "bestTextAlphaRatio": 0.7324
}