{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 238,
  "globalPageIndex": 1036,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-543 /SA-543M ASME BPVC.II.A-2025 \nSPECIFICATION FOR PRESSURE VESSEL PLATES, \nALLOY STEEL, QUENCHED AND TEMPERED, NICKEL­\nCHROMIUM-MOLYBDENUM \nSA-543/SA-543M cO \nINTERNATIONAL \nStandards Worldwide \n[Identical with ASTM Specification A 543/A 543M-09(2014).] \n1. Scope \n1.1 This specification covers nickel-chromium-molyb­\ndenum alloy steel plates for use in the quenched and tem­\npered condition, intended for the fabrication of welded \npressure vessels and other pressure equipment. These alloy \ncompositions are normally considered for construction \ninvolving plate thicknesses of 2 in. [50 mm] or greater. \n1.2 Material under this specification is available in two \ntypes, B and C. The material is also available in three \nclasses as follows: \nClass \n2 \n3 \nMinimum Tensile \nStrength, \nksi [MPa] \n105 [725] \n115 [795] \n90 [620] \nvalues from the two systems may result in nonconformance \nwith the specification. \n2. Referenced Documents \n2.1 ASTM Standards: \nA 20/ A 20M Specification for General Requirements for \nSteel Plates for Pressure Vessels \nA 435/ A 435M Specification for Straight-Beam Ultrasonic \nExamination of Steel Plates \nA 577 I A 577M Specification for Ultrasonic Angle-Beam \nExamination of Steel Plates \nA 578/ A 578M Specification for Straight-Beam Ultrasonic \nExamination of Rolled Steel Plates for Special Applica­\ntions \n3. General Requirements and Ordering \nInformation \n3.1 Material supplied to this material specification shall \n1.3 The maximum thickness of plates is limited only conform to Specification A 20 I A 20M. These requirements \nby the capacity of the chemical composition to meet the outline the testing and retesting methods and procedures, \nspecified mechanical property requirements. permitted variations in dimensions, and mass, quality and \n--- --- --~repair of defects, marking, loading, and ordering infor-1.4 The minimum plate thickness is 3/i 6 in. [5 mm]. \n1.5 These alloy steel plates in the as-rolled condition \nare sensitive to cracking during flame cutting, transit, and \nhandling. They should be shipped in the as-rolled condition \nonly with the mutual agreement of the manufacturer and \nthe purchaser or fabricator. \n1.6 The values stated in either inch-pound units or SI \nunits are to be regarded separately as standard. Within the \ntext, the SI units are shown in brackets. The values stated \nin each system are not exact equivalents; therefore, each \nsystem must be used independently of the other. Combining \n936 \nmation. \n3.2 In addition to the basic requirements of this specifi­\ncation, certain supplementary requirements are available \nwhen additional control, testing, or examination is required \nto meet end use requirements. The purchaser is referred \nto the listed supplementary requirements in this specifica­\ntion and to the detailed requirements in Specification \nA20/A20M. \n3.3 If the requirements of this specification are in con­\nflict with the requirements of Specification A 20/ A 20M, \nthe requirements of this specification shall prevail. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1036.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3016,
  "bestTextAlphaRatio": 0.7586
}