{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 612,
  "globalPageIndex": 612,
  "width": 643.8,
  "height": 878.28,
  "text": "SA-354 ASME BPVC.II.A-2025 \nTABLE 1 Chemical Requirements \nAlloy Steel \nElement Heat Analysis, % \nCarbon: \nFor sizes through 0.30 to 0.53 \n1½ in. \nFor sizes larger than 0.35 to 0.53 \n1½ in. \nManganese, min 0.60 \nPhosphorus, max 0.035 \nSulfur, max 0.040 \nAlloying Elements A \nAlloy Steel with Boron Addition \nElement Heat \nAnalysis,% \nCarbon \nFor sizes through 0.30-0.48 \n1 ½in. \nFor sizes larger than 0.35-0.53 \n1 ½ in. \nManganese, min 0.60 \nPhosphorus, max 0.040 \nSulfur, max 0.040 \nBoron 0.0005-0.003 \nAlloying Elements A \nProduct \nAnalysis,% \n0.28 to 0.55 \n0.33 to 0.55 \n0.57 \n0.040 \n0.045 \nA \nProduct \nAnalysis,% \n0.28-0.50 \n0.35-0.55 \n0.57 \n0.045 \n0.045 \n0.0005-0.003 \nA \nAsteel, as defined by the American Iron and Steel Institute, shall be considered to \nbe alloy when the maximum of the range given for the content of alloying elements \nexceeds one or more of the following limits: Manganese, 1.65 %; silicon, 0.60 %; \ncopper, 0.60 % or in which a definite range or a definite minimum quantity of any \nof the following elements is specified or required within the limits of the recognized \nfield of constructional alloy steels: aluminum, chromium up to 3.99 %, cobalt, \ncolumbium, molybdenum, nickel, titanium, tungsten, vanadium, zirconium, or any \nother alloying elements added to obtain a desired alloying effect. \nTABLE 2 Hardness Requirements for Full-Size Fasteners \nHardness \nSize, in. Grade Brinell Rockwell C \nMinimum Maximum Minimum Maximum \n¼to2¼ BC 255 331 26 36 \nOver 2½ BC 235 311 22 33 \n¼to2¼ BD 311 363 33 39 \nOver 2½ BD 293 363 31 39 \nvalues not less than the minimum nor more than the maximum \nhardness limits required in Table 2, as hardness is the only \nrequirement. \n6.2 Fasteners 1 3/s in. in diameter or less for Grade BC and \n1 ¼ in. in diameter or less for Grade BD, other than those \nexcepted in 6.1, shall be tested full size and shall conform to \nthe tensile strength and either the proof load or the yield \nstrength requirements in accordance with Table 3. \n6.3 Fasteners larger than 1 3/s in. in diameter for Grade BC \nand fasteners larger than 1 ¼ in. in diameter for Grade BD, \nother than those excepted in 6.1, shall preferably be tested full \nsize and when so tested, shall conform to the tensile strength \nand either the proof load or yield strength requirements in \naccordance with Table 3. When equipment of sufficient capac­\nity for full-size testing is not available, or when the length of \nthe fastener makes full-size testing impractical, machined \nspecimens shall be tested and shall conform to the require­\nments in accordance with Table 4. In the event that fasteners \nare tested by both full-size and by the machined test specimen \nmethods, the full-size test shall govern if a controversy \nbetween the two methods exists. \n6.4 For fasteners on which both hardness and tension tests \nare performed, acceptance based on tensile requirements shall \ntake precedence in the event that there is controversy over low \nreadings of hardness tests. \n7. Dimensions \n7.1 Bolts-Unless otherwise specified, the bolts shall be \nHex Head with dimensions conforming to the latest issue of \nASME Bl8.2.l. \n560 \n7 .2 Studs-Studs shall have dimensions conforming to those \nspecified by the purchaser. \n7.3 Threads: \n7.3.1 Unless otherwise specified, threads shall be the Uni­\nfied National Coarse Thread Series as specified in Bl.I, and \nshall have Class 2 A tolerances. \n7.3.2 When specified, threads shall be the Unified National \nFine Thread Series, 8-Pitch Thread Series for sizes over 1 in. or \n14-Pitch UNS on 1 in. size as specified in ANSI B 1.1 and shall \nhave Class 2A tolerances. \n7.3.3 Unless otherwise specified, bolts and studs to be used \nwith nuts or tapped holes that have been tapped oversize, in \naccordance with Specification A563, shall have Class 2A \nthreads before hot dip or mechanically deposited zinc coating. \nAfter zinc coating, the maximum limit of pitch and major \ndiameter may exceed the Class 2A limit by the following \namount: \n¼ \n5/rn, 3/s \n7 /16, ½ \nDiameter, in. \n9/16 to ¾, incl \n7/a \n1.0 to 1¼, incl \n1%, 1½ \n1¾ to 4.0, incl \nOversize Limit, in. (mm)A \n0.016 \n0.017 \n0.018 \n0.020 \n0.022 \n0.024 \n0.027 \n0.050 \nA These values are the same as the overlapping required for zinc-coated nuts in \nSpecification A563. \n8. Workmanship \n8.1 Surface discontinuity limits shall be in accordance with \nSpecification F788/F788M. \n9. Number of Tests \n9.1 Testing Responsibility: \n9.1.1 Each lot shall be tested by the manufacturer prior to \nshipment in accordance with the lot identification control \nquality assurance plan in 9.2 through 9.6. \n9.1.2 When fasteners are furnished by a source other than \nthe manufacturer, the responsible party as defined in 12.1 shall \nbe responsible for ensuring that all tests have been performed \nand the fasteners comply with the requirements of this speci­\nfication. \n9.2 Purpose of Lot Inspection-The purpose of a lot inspec­\ntion program is to ensure that each lot conforms to the \nrequirements of this specification. For such a plan to be fully ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0612.json",
  "tabulaTablesCsv": "tables_tabula/page-0612.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-0612.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5044,
  "bestTextAlphaRatio": 0.702
}