{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 188,
  "globalPageIndex": 986,
  "width": 626.4,
  "height": 803.04,
  "text": "SA-524/SA-524M ASME BPVC.II.A-2025 \nSpecification for \nSeamless Carbon Steel Pipe for Atmospheric and Lower \nTemperatures \n1. Scope \n1.1 This specification covers seamless carbon steel pipe \nintended primarily for service at atmospheric and lower \ntemperatures, NPS 1/s to 26 [DN 6 to 650] inclusive, with \nnominal (average) wall thickness as given in ANSI B36.10. \nPipe having other dimensions may be furnished, provided such \npipe complies with all other requirements of this specification. \nPipe ordered to this specification shall be suitable both for \nwelding, and for bending, flanging, and similar forming opera­\ntions. \n1.2 The product is available in two grades (Tables 1 and 2). \n1.3 Product may be either of hot finished or cold drawn \nmanufacture (see 5.1.4 and 5.1.5). \n1.4 Units-This specification is expressed in both inch­\npound units and in SI units; however, unless the purchase order \nor contract specifies the applicable M specification designation \n(SI units), the inch-pound units shall apply. The values stated in \neither inch-pound units or SI units are to be regarded separately \nas standard. Within the text, the SI units are shown in brackets. \nThe values stated in each system may not be exact equivalents; \ntherefore, each system shall be used independently of the other. \nCombining values from the two systems may result in noncon­\nformance with the standard. The values stated in inch-pound \nunits are to be regarded as standard. The values given in \nparentheses are mathematical conversions to SI units that are \nprovided for information only and are not considered standard. \nNoTE 1-The dimensionless designator NPS (nominal pipe size) has \nbeen substituted in this standard for such traditional terms as \"nominal \ndiameter,\" \"size,\" and \"nominal size.\" \nestablish appropriate safety, health, and environmental prac­\ntices and determine the applicability of regulatory limitations \nprior to use. \n1.6 This international standard was developed in accor­\ndance with internationally recognized principles on standard­\nization established in the Decision on Principles for the \nDevelopment of International Standards, Guides and Recom­\nmendations issued by the World Trade Organization Technical \nBarriers to Trade (TBT) Committee. \n2. Referenced Documents \n2.1 ASTM Standards: \nA530/ A530M Specification for General Requirements for \nSpecialized Carbon and Alloy Steel Pipe \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \n2.2 American National Standards Institute Standard: \nB36.10 Welded and Seamless Wrought Steel Pipe \n3. Ordering Information \n3.1 Orders for material under this specification should \ninclude the following, as required, to describe the desired \nmaterial adequately: \n3.1.1 Quantity (feet, meters, or number of lengths), \n3.1.2 Name of material (seamless carbon steel pipe), \n3.1.3 Grade (Table 1 and Table 2), \n3.1.4 Manufacture (hot finished or cold drawn (see 5.1.4 and \n5.1.5)), \n3.1.5 Size (either nominal NPS [DN] wall thickness and \nweight class or schedule number, or both, or outside diameter \n1.5 The following hazard caveat applies to the test methods and nominal wall thickness, ANSI B36.10), \nportion, Section 16, only. This standard does not purport to 3.1.6 Length (Section 17), i:--\n---------£tdtir.f:rttlf---of-t-he-safety-.:onITrns, if any, associated wz-th~zt-s ~~3-;--1--;9'-6pti01ral.;_=re=q=u\"'-rr=em~e:;nts=-c(rcsr.ce-=:cti.,_o:::::n:-n8-an===d.---\"S~ec:::.:ti-::• o:--::n----..11.-------:-o-;;-f -----~, \nuse. It is the responsibility of the user of this standard to Specification A530/A530M), \n886 \n3.1.8 Test report required (Material Test Report Section of \nSpecification A530/ A530M), ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0986.json",
  "tabulaTablesCsv": "tables_tabula/page-0986.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text\\pages\\page-0986.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 3645,
  "bestTextAlphaRatio": 0.743
}