{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 782,
  "globalPageIndex": 782,
  "width": 617.52,
  "height": 857.4,
  "text": "SA-449 ASME BPVC.II.A-2025 \nTABLE 1 Chemical Requirements for Type 1 Fasteners \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nBoron \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nAlloying Elements \nElement \nCarbon \nManganese, min \nPhosphorus, max \nSulfur, max \nSilicon \nBoron \nAlloying Elements \nCarbon Steel \nHeat Analysis Product Analysis \n0.30-0.52 \n0.60 \n0.040 \n0.050 \n0.15-0.30 \nBoron Steel \n0.28-0.55 \n0.57 \n0.048 \n0.058 \n0.13-0.32 \nHeat Analysis Product Analysis \n0.30-0.52 0.28-0.55 \n0.60 0.57 \n0.040 0.048 \n0.050 0.058 \n0.10-0.30 0.08-0.32 \n0.0005-0.003 0.0005-0.003 \nAlloy Steel \nHeat Analysis Product Analysis \n0.30-0.52 0.28-0.55 \n0.60 0.57 \n0.035 0.040 \n0.040 0.045 \n0.15-0.35 0.13-0.37 \nA A \nAlloy Boron Steel \nHeat Analysis Product Analysis \n0.30-0.52 0.28-0.55 \n0.60 0.57 \n0.035 0.040 \n0.040 0.045 \n0.15-0.35 0.13-0.37 \n0.0005-0.003 0.0005-0.003 \nA A \nA Steel, as defined by the American Iron and Steel Institute, shall be considered to \nbe alloy when the maximum of the range given for the content of alloying elements \nexceeds one or more of the following limits: manganese, 1.65 %; silicon, 0.60 %; \ncopper, 0.60 % or in which a definite range or a definite minimum quantity of any \nof the following elements is specified or required within the limits of the recognized \nfield of constructional alloy steels: aluminum, chromium up to 3.99 %, cobalt, \ncolumbium, molybdenum, nickel, titanium, tungsten, vanadium, zirconium, or any \nother alloying elements added to obtain a desired alloying effect. \n7. Mechanical Properties \n7.1 Hardness-The fasteners shall conform to the hardness \nspecified in Table 3. See Table 3, Note A. \n7.2 Tensile Properties: \n7.2.1 Except as permitted in 7.2.2 for long fasteners and \n7.2.3 for short fasteners, hex cap screws and hex and square \nhead bolts in sizes 1.00 in. and smaller having a length of 2¼ \nD and longer and sizes 1 1/s to 1 ½ in. inclusive having a length \nof 3D and longer shall be wedge tested full size. Bolts with \nheads other than hex or square shall be axially tested. Both \nwedge and axially tested hex cap screws and bolts shall \nconform to the proof load or alternative proof load, and \nminimum wedge tensile load in Tables 4 and 5, as applicable. \nThe load applied during proof load testing shall be equal to or \ngreater than the proof load in Table 4 or Table 5 as applicable. \n7.2.2 Hex cap screws and square head bolts larger than 1 ½ \nin. diameter, other than those excepted in 7 .2.3, shall preferably \nbe tested full size and when so tested shall conform to the \ntensile strength and either the specified proof load or yield \nstrength requirements in Tables 4 and 5, as applicable. When \nequipment of sufficient capacity for full size testing is not \navailable, or when the length of the bolt makes full size testing \n732 \nimpractical, machined specimens shall be tested and shall \nconform to the requirements of Table 6. \n7.2.3 Sizes 1.00 in. and smaller having a length shorter than \n2¼ D down to 2D inclusive, which cannot be wedge tensile \ntested shall be axially tension tested full size and shall conform \nto the minimum tensile load and proof load or alternate proof \nload specified in Tables 4 and 5. Sizes 1.00 in. and smaller \nhaving a length shorter than 2D which cannot be axially tensile \ntested shall be qualified on the basis of hardness. \n7.2.4 Studs 3D and longer shall be axially tension tested full \nsize and shall conform to the tensile and proof load or alternate \nproof load specified in Table 4 and Table 5, as applicable. \nWhen equipment for full size testing is not available, or when \nthe studs are too long for full size testing, machined specimens \nshall be tested and shall conform to the tensile requirements in \nTable 6. \n7 .2.5 If fasteners are subjected to both hardness and tensile \ntests, the tensile test results shall take precedence in the event \nof low hardness test results. \n7.2.6 If fasteners are subjected to both full size and ma­\nchined specimen tests, the full size test results shall take \nprecedence if the results of the two methods differ. \n8. Dimensions \n8.1 Head and Body: \n8.1.1 Hex Cap Screws-Unless otherwise specified, hex cap \nscrews shall be furnished with dimensions conforming to \nASME Bl8.2.l. \n8.1.2 Bolts-When styles other than specified in 8.1.1 are \nrequired, they shall have dimensions conforming to those \nspecified by the purchaser. \n8.1.3 Studs-Studs shall have dimensions conforming to \nthose specified by the purchaser. \n8.2 Threads: \n8.2.1 Uncoated-Unless otherwise specified, uncoated \nthreads shall be the Unified Coarse Thread Series as specified \nin the latest issue of ASME Bl.I, and shall have Class 2A \ntolerances. \n8.2.2 Coated-Unless otherwise specified, zinc-coated \nbolts, to be used with zinc-coated nuts or tapped holes, which \nare tapped oversize in accordance with Specification A563, \nshall have UNC Class 2A threads before hot-dip or mechani­\ncally deposited zinc-coating. After zinc coating, the pitch \ndiameter and major diameter shall not exceed the Class 2A \nlimits by more than the following amounts: \nNominal Diameter, in. \n¼ \nS/15, 3/s \n7/16, ½ \n9/16, 5/a,¾ \n7/a \n1.0to 1¼ \n1%,1½ \n1¾ to 3.0, incl \nOversize Limit, in.A \nHot-Dip Zinc \n0.016 \n0.017 \n0.018 \n0.020 \n0.022 \n0.024 \n0.027 \n0.050 \nMechanical Zinc \n0.012 \n0.012 \n0.012 \n0.013 \n0.015 \n0.016 \n0.018 \n0.033 \nA Hot-dip zinc nuts are tapped oversize alter coating and mechanical zinc coated \nnuts are tapped oversize before coating. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0782.json",
  "tabulaTablesCsv": "tables_tabula/page-0782.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0782.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5588,
  "bestTextAlphaRatio": 0.6854
}