{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 675,
  "globalPageIndex": 1473,
  "width": 615.48,
  "height": 794.4,
  "text": "~ \nASME BPVC.II.A-2025 SA-962/SA-962M \nsuch as electroslag remelting or vacuum remelting. If second­\nary melting is employed, the heat shall be defined as all of the \ningot remelted from a single primary heat. \n5.5 Steel may be cast in ingots or may be continuously cast. \nWhen steel of different grades is continuously cast identifica­\ntion of the resultant transition material is required. The steel \nproducer shall remove the transition material by an established \nprocedure that positively separates the grades. Should the \npurchaser deem it necessary to have the transition zone of two \nheats of the same grade which are continuously cast discarded, \nthe purchaser shall invoke Supplementary Requirement S53. \n5.6 Quality-The steel producer quality control procedures \nshall provide sufficient testing of carbon and alloy steels in \naccordance with Method E381 or other suitable method as \nagreed upon between the purchaser and the producer to assure \nthe internal quality of the product. \n5.6. l Ingot Cast Product-Visual examination of transverse \nsections shall show no imperfections worse than the macro­\ngraphs of Method E381 S2-R2-C3 or equivalent as agreed \nupon. \n5.6.2 Strand Cast Product-Visual examination of traverse \nsections in accordance with Method E381 shall reveal none of \nthe conditions shown in macrographs 1-5, 7, 12-18 of Plate III. \nConditions 6, 8-11 shall not be present to a degree greater than \nthe macrographs of Plates I and II, S2-R2-C3. \n6. Materials and Manufacture \n6.1 Bars shall be produced in accordance with Specifica­\ntions A29/A29M or A484/A484M as applicable. Finish (hot \nrolled or cold drawn, rough turned, extruded, ground, or \npolished) shall be at the option of the manufacturer unless \notherwise specified. \n6.1.1 A sufficient discard shall be made from each ingot to \nensure bars do not contain piping or segregation that precludes \nuse of the product to manufacture bolting meeting the require­\nments of the individual product specifications. \n6.2 Bolting components shall be produced in accordance \nwith the product specification. \n7. Chemical Composition \n7 .1 Chemical Analysis-Heat or product chemical analysis \nshall be in accordance with Test Methods, Practices, and \nTerminology A751. \n7 .2 Heat Analysis-An analysis of each heat of steel shall be \nmade by the steel manufacturer to determine the percentages of \nthose elements specified in the individual product specification. \nIf secondary melting processes are employed, the heat analysis \nshall be obtained from one remelted ingot or the product of one \nremelted ingot of each primary melt. The chemical analysis \nthus determined shall conform to the requirements of the \nindividual product specification. Product analysis (check \nanalysis) tolerances shall not be applied to heat analysis \nrequirements. \n7.3 Product Analysis-When performed, by manufacturer, \npurchaser, end user, and so forth, samples for analysis shall be \ntaken from midway between center and surface of solid parts, \nmidway between inner and outer surfaces of hollow parts, \nmidway between center and surface of full-size prolongations \nor from broken mechanical test specimens. The chemical \ncomposition thus determined shall conform to the limits of the \nproduct specification, within the permissible tolerances found \nin Tables 5 and 6 of Specification A29/A29M and Table 1 of \nSpecification A484/A484M as appropriate for the grade being \nsupplied. When multiple samples are taken from the same lot \nfor product analysis, individual elements shall not vary both \nabove and below the specified range. \n7.4 For continuous cast materials the requirements of 8.2 or \n8.3, as appropriate, of Specification A 788/ A 788M shall be met. \n7 .5 Steels with intentional additions of lead, bismuth, or \ntellurium shall not be supplied or used. Steels with intentional \nadditions of selenium may only be supplied or used when \nspecifically called out in the product specification. \n7.6 The starting material shall not contain any unspecified \nelements, other than nitrogen in austenitic stainless steels, for \nthe ordered grade( s) to the extent that it then conforms to the \nrequirements of another grade for which that element is a \nspecified element having a required minimum content. \n8. Mechanical Properties \n8.1 Method of Mechanical Tests-All tests shall be con­\nducted in accordance with Test Methods and Definitions A370 \nif the inch-pound units are specified or Test Methods A1058 if \nthe M suffix (SI units) is specified, unless otherwise specified. \n8.2 For the purpose of determining conformance to the \nproduct specification requirements, specimens shall be ob­\ntained from the production material, or, in the case of forgings, \nfrom separately forged test blanks prepared from the stock used \nto make the finished product. Heat treatment shall be com­\npleted prior to removal of material for mechanical testing. \n8.3 If separately forged test blanks are used, they shall be of \nthe same heat of steel, be subjected to substantially the same \nreduction and working as the production forging they \nrepresent, be heat treated in the same furnace charge and under \nthe same conditions as the production forging, and be of the \nsame nominal thickness as the maximum heat treated thickness \nof the production forging. \n8.4 Bars-Tension and impact tests representing bar stock \nshall be taken in accordance with the requirements of Annex \nAl of Test Methods and Definitions A370. Impact tests are not \nrequired on bars ½ in. and under in diameter. \n8.5 Components, Machined from Heat Treated Bar­\nMechanical properties of bolting components machined from \nheat treated bar shall be represented by the tests conducted on \nthe bar in accordance with 8.4. \n8.6 Components, All Classes-Produced by other \nmethods-When bolting components have been produced by \nupsetting or forging (hot or cold), when they have been \nsubjected to heat treatment, or when the nominal thread size \nfalls into a different diameter range than that of the starting bar \nas shown in the applicable specifications, then tests shall be \nconducted on material taken from those components. \n8.6.1 Tension test specimens taken from finished compo­\nnents shall be machined to the form and dimensions and from \n1415 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1473.json",
  "tabulaTablesCsv": "tables_tabula/page-1473.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1473.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6268,
  "bestTextAlphaRatio": 0.7835
}