{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 521,
  "globalPageIndex": 521,
  "width": 601.08,
  "height": 845.28,
  "text": "ASME BPVC.II.A-2025 SA-320/SA-320M \n6.1.2.2 For studs, bolts, screws, etc., one tension test and \none set of three impact specimens shall be made for each \ndiameter of each heat involved in the lot. Each lot shall consist \nof the following: \nDiameter, in. (mm] Lot Size, lb [kg] \n11/s [30] and under 1500 (680] or fraction thereof \nOver 11/s (30] to 1 ¾ [ 45], 4500 (2040] or fraction \nincl thereof \nOver 1¾ (45] to 2½ (65], 6000 [2700] or fraction \nincl thereof \nOver 2½ (65] 100 pieces or fraction thereof \n6.1.2.3 Full Size Specimens, Headed Bolting Components­\nHeaded bolts or screws 1 ½ in. in body diameter and smaller, \nwith body length three times the diameter or longer, and that \nare produced by upsetting or forging (hot or cold) shall be \nsubjected to full size testing in accordance with 6.1.3. This \ntesting shall be in addition to tensile testing as specified in \n6.1.1. Wedge tensile testing shall be limited to product with \nsocket head cap screw, hexagon, square, hex flange, or twelve \npoint flange heads. The lot size shall be shown in 6.1.2.2. \nFailure shall occur in the body or threaded section with no \nfailure, or indications of failure, such as cracks, at the junction \nof the head and shank. Wedge tensile testing is not required for \nflat countersunk head or socket button products. \n6.1.3 Full Size Bolting Components, Wedge Tensile \nTesting-When applicable, see 6.1.2.3. Headed components \nshall be wedge tested full size. The minimum full size load \napplied (lbf or kN) for individual sizes shall be as follows: \nW= T., XA, (1) \nwhere: \nw \nTs \nA1 \n= \n= \n= \nminimum wedge tensile load without fracture, \ntensile strength specified in ksi or MPa in Tables 2 and \n3, and \nstress area of the thread section, square inches or square \nmillimetres, as shown in the Cone Proof Load Tables in \nSpecification A962/A962M. \n6.2 Impact Properties: \n6.2.1 Requirements: \n6.2.1.1 Impact tests are required for the grades shown in \nTable 3. Class 1, lA, and 2 austenitic steels for temperatures \nabove -325 °F [-200 °C]; Class 1 and IA austenitic Grades BS, \nBSA, BSP, BSPA, BSC, BSCA, BSLN, and BSLNA above \n-425 °F [-255 °C]; and ferritic or austenitic bolting½ in. [12.5 \nmm] and smaller, are exempt from impact testing, unless \nSupplementary Requirement Sl is specified in the purchase \norder (see 1.4). All other material furnished under this speci­\nfication shall be tested. Material of Grades L 7, L 7 A, L 7B, L 7C, \nL7M, L43, L70, L71, L72, and L73 shall show a minimum \nimpact energy absorption of 20 ft • lbf [27 J] and of Grade LI \na minimum impact energy absorption of 40 ft - lbf [54 J] at the \nspecified test temperature. \n6.2.1.2 The temperature of the coolant used for chilling the \ntest specimens shall be controlled within ±2 °F [l 0 C]. Test \ntemperatures for ferritic grades are listed in Table 2. Excep­\ntions to this requirement are permissible, and the impact tests \nmay be made at specified temperatures different than those \nshown in Table 2, provided the test temperature is at least as \nlow as the intended service temperature and the bolting is \nsuitably marked to identify the reported test temperature. When \nimpact testing is required for austenitic grades, test criteria \nshall be agreed upon between the supplier and purchaser. \n6.2.1.3 The impact test requirements for standard and sub­\nsize Charpy V-notch (CVN) test specimens are prescribed in \nTable 2. If the material is impact tested at a temperature lower \nthan the specified test temperature with impact energy absorp­\ntion results equal to or greater than the specified required \nimpact energy absorption for that product, the material can be \nconsidered suitable for the specified test temperature. \nNoTE 2-As an example, the purchase order or contract requires an \nL-g:rade bolt to have an average 15 ft-lbs at -50 °F. If the Charpy V-notch \ntesting indicates that the bolting material passes at -100 °F and if it also \nmeets other mechanical property or other environmental resistance \nrequirements, it is permissible or suitable for use if that specified \ntemperature reflects the rninimum anticipated temperature range to which \nthat the product or application will be subjected. \n6.2.2 Number of Tests: \n6.2.2.1 The test requirements for heat-treated bars are given \nin 6.1.2.1. \n6.2.2.2 For test requirements on studs, bolts, screws, etc., \nsee 6.1.2.2. \n6.2.2.3 Impact tests are not required to be made on heat­\ntreated bars, bolts, screws, studs, and stud bolts ½ in. [12.5 \nmm] and under in diameter. \n469 \n6.2.3 Test Specimens-For sections 1 in. [25 mm] or less in \ndiameter, test specimens shall be taken at the axis; for sections \nover 1 in. [25 mm] in diameter, midway between the axis and \nthe surface. \n6.3 Hardness Requirements: \n6.3.1 The hardness shall conform to the requirements pre­\nscribed in Table 1. Hardness testing shall be performed in \naccordance with either Specification A962/A962M or with Test \nMethods F606/F606M. \n6.3.2 The maximum hardness of Grade L7M shall be 235 \nHBW or 99 HRB. Minimum hardness shall not be less than 200 \nHBW or 93 HRB. Conformance to this hardness shall be \nensured by testing each bolt or stud by Brinell or Rockwell B \nmethods in accordance with 6.3.1. \n6.3.2.1 The use of 100 % electromagnetic testing for hard­\nness as an alternative to 100 % indentation hardness testing is \npermissible when qualified by sampling using indentation \nhardness testing. Each lot tested for hardness electromagneti­\ncally shall be 100 % examined in accordance with Practice \nE566. Following electromagnetic testing for hardness, a ran­\ndom sample of a minimum of 100 pieces in each purchase lot \n(as defined in 6.1.2.2) shall be tested by indentation hardness \nmethods. All samples must meet hardness requirements to \npermit acceptance of the lot. If any one sample is outside of the \nspecified maximum or minimum hardness, the lot shall be \nrejected and either reprocessed and resampled, or tested 100 % \nby indentation hardness methods. \n6.3.2.2 In the event a controversy exists relative to mini­\nmum strength, tension tests shall prevail over hardness read­\nings. Products which have been tested and found acceptable \nshall have a line under the grade symbol. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0521.json",
  "tabulaTablesCsv": "tables_tabula/page-0521.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0521.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6215,
  "bestTextAlphaRatio": 0.7255
}