{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 146,
  "globalPageIndex": 146,
  "width": 615.48,
  "height": 794.4,
  "text": "SA-20/SA-20M ASME BPVC.II.A-2025 \nTABLE A2.8 Permissible Camber for Carbon Steel, High-Strength \nLow-Alloy Steel, and Alloy Steel Universal Mill Plates and High­\nStrength Low-Alloy Steel and Alloy Steel Sheared or Gas-Cut \nRectangular Plates \nNorn I-Camber, as it relates to plates, is the horizontal edge curvature \nin the length, measured over the entire length of the plate in the flat \nposition. \nWidth, mm \nTo 750, incl \nOver 750 to 1500 \nCamber for Width Given, mm \nLength/300 \nLength/250 \nTABLE A2.9 Permissible Variations from Flatness for Carbon Steel Plates \nNorn !-Flatness Variations for Length-The longer dimension specified is considered the length, and variation in flatness along the length shall not \nexceed the tabular amount for the specified width in plates up to 4000 mm in length, or in any 4000 mm of longer plates. \nNorn 2-Flatness Variations for Width-The flatness variation across the width shall not exceed the tabular amount for the specified width. \nNorn 3-When the longer dimension is under 900 mm, the variation in flatness along the length and across the width shall not exceed 6 mm in each \ndirection. When the longer dimension is from 900 to 1800 mm, inclusive, the flatness variation shall not exceed 75 % of the tabular amount for the \nspecified width, but in no case less than 6 mm. \nNorn 4--The tolerances given in this table apply to plates that have a minimum specified tensile strength not over 415 MPa or comparable chemistry \nor hardness. For plates specified to a higher minimum tensile strength or comparable chemistry or hardness, the limits given in the table are increased \nto 1 V2 times the amounts in the above table. \nNorn 5-This table and notes cover the flatness tolerances of circular and sketch plates, based on the maximum dimensions of those plates. \nNorn 6-Plates shall be in a horizontal position on a flat surface when flatness is measured. \nSpecified Thickness, Permissible Variations from a Flat Surface for Specified Widths, mm \nmm To 900, 900 to 1200 to 1500 to 1800 to 2100 to 2400 to 2700 to 3000 to 3600 to 4200 and \nexcl \nTo 6, excl 14 \n6 to 10, excl 13 \n10 to 12, excl 13 \n12 to 20, excl 11 \n20 to 25, excl 11 \n25 to 50, excl 10 \n50 to 100, excl 8 \n100 to 150, excl 10 \n150 to 200, excl 11 \n200 to 250, excl 13 \n250 to 300, excl 13 \n300 to 400, incl 16 \n1200 1500 1800 2100 2400 2700 3000 \n19 24 32 35 38 41 44 \n16 19 24 29 32 35 38 \n14 16 16 19 22 25 29 \n13 14 16 16 19 25 25 \n13 14 16 16 16 19 22 \n13 13 14 14 16 16 16 \n10 11 13 13 13 13 14 \n11 13 13 14 14 16 19 \n13 13 16 18 19 22 22 \n13 16 18 19 21 22 24 \n16 19 21 22 24 25 25 \n19 21 22 24 25 25 25 \nTABLE A2.1 O Permissible Variations in Width and Length for \nRectangular Alloy Steel Plates when Gas Cutting is Specified or \nRequired \nNorn !-These variations may be taken all under or divided over and \nunder, if so specified. \nNorn 2-Plates with universal rolled edges will be gas cut to length \nonly. \nSpecified Thickness, mm \nTo 50, excl \n50 to 100, excl \n100 to 150, excl \n150 to 200, excl \n200 to 400, incl \n94 \nVariations Over for All Specified \nWidths and Lengths, mm \n19 \n25 \n29 \n33 \n38 \n3600 4200 Over \n48 \n41 \n32 48 54 \n29 38 51 \n25 35 44 \n18 29 38 \n16 22 29 \n22 22 25 \n25 25 25 \n25 25 25 \n25 25 25 \n25 25 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0146.json",
  "tabulaTablesCsv": "tables_tabula/page-0146.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-0146.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3240,
  "bestTextAlphaRatio": 0.6083
}