{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 327,
  "globalPageIndex": 1125,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-592/SA-592M \n4. Materials and Manufacture \n4.1 Melting Process -The steel shall be made in accor­\ndance with the Melting Process Section of Specification \nA 788. \n4.2 Grain Size - The steel shall be fully killed, fine \ngrained (ASTM No. 5 or finer), as determined in accor­\ndance with Test Methods E 112, Plate IV. \n4.3 Discard - Sufficient discard shall be made from \neach ingot to ensure freedom from piping and excessive \nsegregation. \n4.4 The finished product shall be a hot-worked forging \nas defined by Specification A 788, and shall be forged as \nclose as practicable to the finished shape and size. \n5. Heat Treatment \n5.1 After forging and before reheating, the forgings \nshall be cooled to provide substantially complete transfor­\nmation of austenite. Heat treatment for properties shall \nconsist of heating the forgings to not less than 1650°F \n[900°C], quenching in a liquid medium, and tempering at \n1150°F [620°C] minimum, with a holding time of 1 h/in. \n[l h/25 mm] minimum, but in no case less than½ h. \n6. Chemical Requirements \n6.1 Heat Analysis - The heat analysis obtained from \nsampling in accordance with Specification A 788 shall \ncomply with Table 1. \n6.2 Product Analysis - The purchaser may use the \nproduct analysis provision of Specification A 788 to obtain \na product analysis from a forging representing each heat \nor multiple heat. \n7. Mechanical Requirements \n7.1 The forgings as represented by tension tests shall \nconform to the requirements prescribed in Table 2, and to \nTable 3 for lateral expansion opposite the notch in Charpy \nV-notch impact tests. In addition, for the Charpy impact \ntest, the values of energy absorption in foot-pounds [or \njoules] and the fracture appearance in percent shear shall \nbe recorded and reported for information. \n7.2 Sampling: \n7.2.1 Samples for mechanical test specimens shall be \nremoved after the quenching and tempering heat treatment. \nThe purchaser shall specify any additional thermal treat­\nments that shall be given to the heat treated test specimens. \n(This is intended to simulate subsequent thermal treatments \nwhich may be perfonned by the fabricator.) \n7 .2.2 Samples shall be removed so that the test speci­\nmens will have their major axes parallel to the direction \nof major working of the forging. \n7.2.3 Test specimens may be machined from a pro­\nduction forging, or prolongation thereof, or from special \nforged blocks suitably worked and heat treated with the \nproduction forgings. Such special blocks shall be obtained \nfrom an ingot, slab, or billet from the same heat as the \nforgings they represent and shall be reduced by forging in \na manner similar to that for the products to be represented. \nThe forging reduction for a special test block shall not \nexceed the minimum forging reduction of the forgings \nrepresented, and its thickness shall not be less than the \nmaximum thickness of the forgings represented. If a forg­\ning is tested, the tests must represent the maximum section \nthickness in the lot. All test specimens shall be located at \nthe mid-plane of the thickness and, the mid length position \nof the gauge length ffoor tension test specimens, or the \nnotch of the Charpy V-notch impact test specimens shall \nbe at least T from any second surface of the production \nforging or test block, where T equals the maximum heat \ntreated thickness of the forging. \n7.3 Number of Tests and Retests: \n7.3.1 Number of Tests, and Test Temperature: \n7.3.1.1 One room-temperature tension test and one \nset of three Charpy V-notch specimens shall be made to \nrepresent the maximum section from each heat in each \nheat-treatment charge. Impact tests shall be conducted at \nthe temperature specified on the order, but no higher than \n32°F [0°C]. \n7 .3.1.2 One grain size test shall be made from \neach heat. \n7 .3.2 Retests of Tension Specimens - If the results of \ntension tests do not conform to the requirements specified, \nretests are permitted, as outlined in Test Method A 370 \nand Specification A 788. \n7.3.3 Retests of Impact Specimens: \n7.3.3.1 If the lateral expansion value for one speci­\nmen is below 0.015 in. [0.38 mm] but not below 0.010 in. \n[0.25 mm] and the average equals or exceeds 0,015 in. \n[0.38 mm], a retest of three additional specimens may be \nmade. Each of the three retest specimens must equal or \nexceed the specified minimum value of 0.015 in. \n[0.38 mm]. \n7.4 Test Methods - Tension and impact tests shall be \nmade in accordance with the latest issue of Test Methods \nand Definitions A 370. \n1031 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1125.json",
  "tabulaTablesCsv": "tables_tabula/page-1125.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1125.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4547,
  "bestTextAlphaRatio": 0.7491
}