{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 750,
  "globalPageIndex": 1548,
  "width": 615.48,
  "height": 794.4,
  "text": "SA 0 999 /SA-999M ASME BPVC.II.A-2025 \n28.2 Pipe shall be ordered to nominal pipe size (NPS) and \nschedule. Nominal pipe shall be as specified in ANSI B36.10 or \nB36.19. \n28.3 Responsibility for Inspection-Unless otherwise speci­\nfied in the contract or purchase order, the manufacturer is \nresponsible for the performance of all inspection and test \nrequirements specified. The absence of any inspection require­\nments in the specification shall not relieve the contractor of the \nresponsibility for ensuring that all products or supplies submit­\nted to the government for acceptance comply with all require­\nments of the contract or purchase order. Sampling inspection, \nas part of the manufacturing operations, is an acceptable \npractice to asceiiain conformance to requirements; however, \nthis does not authorize submission of known defective \nmaterial, either indicated or actual, nor does it commit the \ngovernment to accept the material. Except as otherwise speci­\nfied in the contract or purchase order, the manufacturer may \nuse its own or any other suitable facilities for the performance \nof the inspection and test requirements unless disapproved by \nthe purchaser at the time the order is placed. The purchaser \nshall have the right to perform any of the inspections and tests \nset forth if such inspections and tests are deemed necessary to \nensure that the products confonn to the prescribed require­\nments. \n28.4 Sampling for Flattening and Flaring Test and for \nVisual and Dimensional Examination-Minimum sampling for \nflattening and flaring tests and visual and dimensional exami­\nnation shall be as follows: \nLot Size (Pieces per Lot) Sample Size \n2 to 8 Entire Lot \n9 to 90 8 \n91 to 150 12 \n151 to 280 19 \n281 to 500 21 \n501 to 1200 27 \n1201 to 3200 35 \n3201 to 1 O 000 38 \n10 001 to 35 000 46 \nIn alI cases, the acceptance number is zero and the rejection \nnumber is one. Rejected lots may be screened and resubmitted \nfor visual and dimensional examination. All defective items \nshall be replaced with acceptable items prior to lot acceptance. \n28.5 Sampling for Chemical Analysis-One sample for \nchemical analysis shall be selected from each two pipes chosen \nfrom each lot. A lot shall be all material poured from one heat. \n28.6 Sampling for Tension and Bend Test-One sample shall \nbe taken from each lot. A lot shall consist of all pipe of the \nsante outside diameter and wall thickness manufactured during \nan 8-h shift from the same heat of steel, and heat treated under \nthe same conditions of temperature and time in a single charge \nin a batch-type furnace, or heat treated under the same \ncondition in a continuous furnace, and presented for inspection \nat the same time. \n28.7 Hydrostatic and Ultrasonic Tests-Each pipe shall be \ntested by the ultrasonic (if specified) and hydrostatic tests. \n28.8 Pipe shall be free from heavy oxide or scale. The \ninternal surface of hot finished ferritic steel pipe shall be \npickled or blast cleaned to a free of scale condition equivalent \nto the CSa2 visual standard in SSPC-SP6. Cleaning shall be \nperformed in accordance with a written procedure that has been \nshown to be effective. This procedure shall be available for \naudit. \n28.9 In addition to the marking required by this \nspecification, each length of pipe NPS ¼ or larger shall be \nmarked, in accordance with FED-STD-183 and MIL-STD- 792, \nwith the nominal pipe size, schedule number, length, and heat \nnumber or lot identification number. \n28.10 Pipe shall be straight to within the tolerance given in \nTable 2. \n28.11 If specified, each pipe shall be ultrasonically exam­\nined in accordance with MIL-STD-271, except that the notch \ndepth in the reference standard shall be 5 % of the wall \nthickness or 0.005 in. [0.1 mm], whichever is the greater. Any \npipe that produces an indication equal to or greater than 100 % \nof the indication from the reference discontinuity shall be \nrejected. \n28.12 The pipe shall be free from repair welds, welded \njoints, laps, laminations, seams, visible cracks, tears, grooves, \nslivers, pits, and other imperfections detrimental to the pipe as \ndetermined by visual and ultrasonic examination, or alternate \ntests, as specified. \n28.13 Pipe shall be uniform in quality and condition and \nhave a finish conforming to the best practice for standard \nquality pipe. Surface imperfections such as handling marks, \nstraightening marks, light mandrel and die marks, shallow pits, \nand scale pattern will not be considered defects if the imper­\nfections are removable within the tolerances specified for wall \nthickness or 0.005 in. [0.1 mm], whichever is the greater. The \nbottom of imperfections shall be visible and the profile shall be \nrounded and faired-in. \n28.14 No weld repair by the manufacturer is permitted. \n28.15 Preservation shall be level A or commercial, and \npacking shall be level A, B, or commercial, as specified. Level \nA preservation and level A or B packing shall be in accordance \nwith MIL-STD-163 and commercial preservation and packing \nshall be in accordance with Practices A700 or Practice D3951. \n29. Keywords \n29.l alloy steel pipe; austenitic stainless steel; duplex stain­\nless steel; ferritic/austenitic stainless steel; seamless steel pipe; \nstainless steel pipe; steel pipe; welded steel pipe \nTABLE 2 Straightness Tolerances \nSpecified OD, in.A \nUp to 5.0, incl. \nOver 5.0 to 8.0, incl. \nSpecified Wall \nThickness, in.A \nOver 3% OD to \n0.5, incl. \nOver 4 % OD to \n0.75 incl. \nOver 8.0 to 12.75, incl. Over 4 % OD to \n1.0, incl. \nA 1 in. = 25.4 mm. \nMaximum \nCurvature in \nany 3 ft, in.A \n0.030 \n0.045 \n0.060 \nMaximum Curvature \nin Total Length, in.A \n0.01 o x length, ft \n0.015 x length, ft \n0.020 x length, ft \n1494 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1548.json",
  "tabulaTablesCsv": "tables_tabula/page-1548.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1548.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5719,
  "bestTextAlphaRatio": 0.7428
}