{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 463,
  "globalPageIndex": 1261,
  "width": 617.04,
  "height": 795.6,
  "text": "ASME BPVC.II.A-2025 SA-723/SA-723M \n4.3 Heat Treatment: \n4.3.1 Forgings shall be rough-machined prior to final heat \ntreatment if it is necessary to reduce the mass to ensure full \nhardening or to meet the requirements of 6.2. The risk of \ncracking during heat treatment with high-hardenability steels \nof the type covered by this specification should be borne in \nmind when deciding on the degree of surface preparation \nbefore heat treatment. \n4.3.2 Heat Treatment for Mechanical Properties-Heat \ntreatment shall consist of normalizing (which may be part of \nthe preliminary treatment), reaustenitization, liquid quenching, \nand tempering. The forgings shall be quenched in a suitable \nliquid medium by spraying or immersion. Quenching shall be \nfollowed by tempering at a minimum temperature of 1000°F \n[540°C]. The minimum time at tempering temperature shall be \n½ h/in. [½ h/25 mm] of maximum section thickness, unless \notherwise agreed between supplier and purchaser. \n5. Chemical Composition \n5.1 Heat Analysis-The heat analysis obtained from sam­\npling in accordance with Specification A788/A788M shall \ncomply with Table 1. \n5.1.1 Temper Embrittlement Control-The purchaser's at­\ntention is drawn to Supplementary Requirement S24 in Speci­\nfication A788/A788M for application of the J Factor which \nmay be of assistance in the control of temper embrittlement in \nforgings produced to Specification A 723/ A 723M. \n5.2 Product Analysis-The manufacturer shall use the prod­\nuct analysis provision of Specification A788/A788M to obtain \na product analysis from a forging representing each heat or \nmultiple heat. The purchaser may also make this determination \nin accordance with Specification A788/A788M. \n6. Mechanical Properties \n6.1 General Requirements-The forging shall conform to \nthe requirements of Table 2 and Table 3. The largest obtainable \ntension test specimen as specified in Test Methods and Defi­\nnitions A370 (that is, standard round 0.500-in. [12.5-mm] \ndiameter specimen) shall be used. Charpy V-notch Type A \nimpact specimens, as shown in Test Methods and Definitions \nA370, shall be used. \n6.2 Sampling-The mid-point of the gage length of tension \ntest specimens and the area under the notch of impact speci­\nmens shall be located in accordance with one of the following \nmethods as specified by the purchaser, or suggested by the \nCarbon, max \nManganese, max \nPhosphorus, max \nSulfur, max \nSilicon, max \nNickel \nChromium \nMolybdenum \nVanadium, max \nTABLE 1 Chemical Requirements \nGrade 1 \n0.35 \n0.90 \n0.015 \n0.015 \n0.35 \n1.5 to 2.25 \n0.80 to 2.00 \n0.20 to 0.40 \n0.20 \nComposition, % \nGrade 2 \n0.40 \n0.90 \n0.015 \n0.015 \n0.35 \n2.3 to 3.3 \n0.80 to 2.00 \n0.30 to 0.50 \n0.20 \nGrade 3 \n0.40 \n0.90 \n0.015 \n0.015 \n0.35 \n3.3 to 4.5. \n0.80 to 2.00 \n0.40 to 0.80 \n0.20 \nsupplier and approved by the purchaser. Wherever practical, all \ntesting shall be from integral prolongations of the forging. \n6.2.1 Method I-This method shall always be used when \nthe maximum quenched thickness does not exceed 4 in. [100 \nmm]. Datum points of the specimens, as described in 6.2, shall \nbe located in the forging or test forging (6.2.4) at mid-thickness \nand at least 1/3 T (Tis the maximum heat-treated thickness) \nfrom the quenched end surface or nearest adjacent surfaces. \n6.2.2 Method 2-t by 2t, where t is the distance from the \narea of significant loading (3.1) to the nearest quenched \nsurface. However, the datum points of the specimens as \ndescribed in 6.2 shall not be nearer to one quenched surface \nthan¾ in. [20 mm] and to the second quenched surface than 1 \n½ in. [40 mm]. When this method of testing is employed, \nforgings are usually manufactured in accordance with a \npurchaser-approved drawing showing prequenched dimensions \nand the location of mechanical test specimens. It is commonly \nused for disk-type forgings such as tube sheets and covers. \n6.2.3 Method 3-For maximum quenched thicknesses in \nexcess of 4 in. [100 mm] as heat treated. Where this method of \ntesting is employed, the datum points of the test specimen, as \ndescribed in 6.2, shall be removed ¼ T from the nearest \nquenched surface and 2 /2 T from the quenched end surface or \nnearest adjacent surface. \n6.2.4 Method 4-Test specimens shall be taken from a \nrepresentative separate test forging made from the same heat of \nsteel, which shall receive substantially the same reduction and \ntype of hot working, and have a cross section not less than the \nproduction forgings which it represents. It shall be heat treated \nin the same furnace charge and under the same conditions as \nthe production forgings. The test specimen shall be removed \nusing the Method 3 procedure. \n6.3 Thermal Buffers: \n6.3.1 Thermal buffer rings, at least Thy Tin cross section or \nsections of such a ring at least 3 Tin length, shall be welded to \nthe test end(s) of a forging prior to heat treatment for \nmechanical properties. The buffer material may be any weld­\nable carbon or low-alloy steel and shall be joined to the forging \nwith a partial penetration-type weld which completely seals the \nbuffered surface. The test coupons shall be removed from the \nforging in the region buffered by the ring or ring segments. If \nthe latter are used, the test coupons shall be removed from the \nforging in the area under the center ½ of the buffer ring \nsegment length. In either case, the test specimens shall be \nlocated at a minimum distance of ½ in. [13 mm] from the \nbuffered surface of the forging and at least ¼ T from a \nquenched surface of the forging. Buffered weld areas must be \nat least 1 in. [25 mm] from any finished machining surface of \nthe complete forging. \n6.3.2 Bearing in mind the characteristics of the base mate­\nrials included in this specification, precautions should be taken, \nsuch as the use of pre- and post-weld heating and austenitic \nweld metal, to minimize the occurrence of crack-like defects. \n6.3.3 Approval of the purchaser should be obtained for the \nuse of this method. \n6.4 Samples shall be removed from the forgings after \nquenching and tempering. \n1177 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1261.json",
  "tabulaTablesCsv": "tables_tabula/page-1261.csv",
  "tabulaTableCount": 2,
  "bestTextPath": "best_text/pages/page-1261.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 6063,
  "bestTextAlphaRatio": 0.7331
}