{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 586,
  "globalPageIndex": 586,
  "width": 599.4,
  "height": 844.08,
  "text": "SA-350/SA-350M (ASTM A350/A350M) ASME BPVC.II.A-2025 \n\"T DIMENSION \nSURFACES\" \nFIG. 4 Separately Forged Test Bar for Forgings with T > 2 in. [50 mm] and WIT Ratio < 2 and Quenched and Tempered or Quenched \nand Precipitation-Heat Treated \nmanufacturer only when Supplementary Requirement S57 of \nSpecification A961/A961M is specified. \n9. Surface Finish, Appearance, and Corrosion Protection \n9.1 Forgings and finished parts shall conform to the require­\nments of Specification A961/A961M. \n10. Retests \n10.1 If any test specimen shows flaws or defective \nmachining, it may be discarded and another specimen substi­\ntuted. \n11. Rework and Retreatment \n11.1 If the results of the mechanical tests do not conform to \nthe requirements specified, the manufacturer may reheat treat \nthe forgings represented, and shall retest to the applicable \nrequirements. \n11.2 Individually tested forgings meeting all requirements \nshall be acceptable. \n11.3 Repair by Welding-Weld repairs shall be permitted \n(see Supplementary Requirement S58 of Specification A961/ \nA961M) at the discretion of the manufacturer with the follow­\ning limitations and requirements: \n11.3.1 Repair by welding shall be made using welding \nprocedures and welders qualified in accordance with ASME \nSection IX of the Code. The weld procedure qualification test \nshall also include impact tests of the weld metal and heat­\naffected zone. All impact test specimens shall have the longi­\ntudinal axis transverse to the weld and the base of the notch \n534 \nnormal to the weld surface. Weld specimens shall have the \nnotch in weld metal and heat-affected zone specimens shall \nhave the notch in the heat-affected zone. The specimens shall \nbe as large as permitted by the weldment thickness. Where \nfull-size specimens can be obtained and where there is suffi­\ncient weldment thickness, the weld specimen shall be taken \nwith one side of the specimen within 1/16 in. [l.6 mm] of the \nweld surface. Heat-affected zone impact test specimens shall \nbe taken at the same depth and locations applicable to the \nforging in 7.1.3.1 and 7.1.3.2. When forgings are thermally \ntreated after repair welding, the weld procedure test plate shall \nbe subjected to the same thermal treatment. The mechanical \nproperties of the weld procedure qualification test shall con­\nform to Section 7. \n11.3.2 Defects shall be completely removed by chipping or \ngrinding to sound metal as verified by magnetic particle, or \nliquid penetrant inspection prior to welding. \n11.3.3 For Grade LFl forgings, and LF2 forgings that are to \nbe only stress-relieved after repair welding, the weld metal \nshall be deposited using carbon steel electrodes E 7015, E \n7016, or E 7018, complying with AWS A 5.1. For Grade LF2 \nforgings in all other conditions of post-weld heat treatment, the \nweld metal shall be deposited using low-alloy steel electrodes \nE 7015-Al; E 7016-Al, or E 7018-Al complying with AWS \n5.5; for Grade LF3 forgings the weld metal shall be deposited \nusing low-alloy steel electrodes E 8016-C2 or E 8018-C2 \ncomplying with AWS A 5.5; for Grades LF5, LF9, and LF787 \nforgings, the weld metal shall be deposited using low-alloy \nsteel electrodes E 8016-C 1 or E 8018-C 1 complying with AWS ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0586.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3228,
  "bestTextAlphaRatio": 0.7469
}