{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 624,
  "globalPageIndex": 624,
  "width": 620.76,
  "height": 859.92,
  "text": "SA-358/SA-358M ASME BPVC.II.A-2025 \nwith their centers parallel to the material surface and not over \n1 in. [25 mm] apart. The centers of the specimens adjacent to \nmaterial surfaces shall not exceed 5/s in. [16 mm] from the \nsurface. \n14.4 The test specimens shall not be cut from the pipe or test \nplate until after final heat treatment. \n15. Mechanical Tests Required \n15.1 For the purposes of the tension and bend test \nrequirements, the term \"lot\" shall mean all pipe of the same \ngrade, permitted to include more than one heat of steel, within \na 3/16-in [4.7-mm] range of thickness and welded to the same \nweld procedure, and when heat treated, done so to the same \nheat-treating procedure and in the same furnace. The maximum \nlot size shall be 200 linear ft [60 m] of pipe. \n15.1.1 Transverse Tension Test-One test shall be made to \nrepresent each lot of finished pipe. \n15.1.2 Transverse Guided-Bend Weld Test-One test (two \nspecimens) shall be made to represent each lot of finished pipe. \n15.2 Hydrostatic Test-Each length of pipe shall be sub­\njected to a hydrostatic test in accordance with Specification \nA999/A999M, unless specifically exempted under the provi­\nsion of 15.3. Pressure shall be held for a sufficient time to \npermit the inspector to examine the entire length of the welded \nseam. \n15.3 The purchaser, with the agreement of the manufacturer, \nis permitted to complete the hydrostatic test requirement with \nthe system pressure test, performed at a pressure either lower \nor higher than the specification test pressure, but in no case \nshall the test pressure be lower than the system design pressure. \nEach length of pipe furnished without the completed manufac­\nturer's hydrostatic test shall include with the mandatory \nmarking the letters \"NH.\" \n16. Radiographic Examination \n16.1 For Classes 1, 3, and 4 pipe, all welded joints shall be \ncompletely examined by radiography. \n16.2 For Class 5 pipe, the welded joints shall be spot \nradiographed to the extent of not less than 12 in. [300 mm] of \nradiograph per 50 ft [15 m] of weld. \n16.3 For Classes 1, 3, and 4 pipe, radiographic examination \nshall be in accordance with the requirements of the ASME \nBoiler and Pressure Vessel Code, Section VIII, latest edition, \nParagraph UW-51. \n16.4 For Class 5 pipe, radiographic examination shall be in \naccordance with the requirements of the ASME Boiler and \nPressure Vessel Code, Section VIII, Division 1, latest edition, \nParagraph UW-52. \n16.5 Radiographic examination is permitted to be per­\nformed prior to heat treatment. \n17. Lengths \n17 .1 Circumferentially welded joints of the same quality as \nthe longitudinal joints shall be permitted by agreement between \nthe manufacturer and the purchaser. \n18. Product Marking \n18.1 In addition to the marking prescribed in Specification \nA999/A999M, the markings on each length of pipe shall \ninclude the plate material designations as shown in Table 1, the \nmarking requirements of 6.3 and 15.3, and Class 1, 2, 3, or 4, \nas appropriate (see 1.3). \n18.2 Bar Coding-In addition to the requirements in 18.1, \nbar coding is acceptable as a supplementary identification \nmethod. Bar coding should be consistent with the Automotive \nIndustry Action Group (AIAG) standard prepared by the \nPrimary Metals Subcommittee of the AIAG Bar Code Project \nTeam. \n19. Keywords \n19 .1 arc welded steel pipe; austenitic stainless steel; \nchromium-nickel steel; fusion welded steel pipe; high tempera­\nture application; steel pipe; temperature service applications; \nhigh; welded steel pipe \nSUPPLEMENTARY REQUIREMENTS \nOne or more of the following supplementary requirements shall apply only when specified in the \npurchase order. The purchaser is permitted to specify a different frequency of test or analysis than is \nprovided in the supplementary requirement. Subject to agreement between the purchaser and \nmanufacturer, it is permitted to modify the retest and retreatment provisions of these supplementary \nrequirements. \nSl. Product Analysis \nS 1.1 Product analysis shall be made on each length of pipe. \nIndividual lengths failing to conform to the chemical compo­\nsition requirements shall be rejected. \nS2. Tension and Bend Tests \nS2.1 Tension tests (Section 12) and bend tests (Section 13) \nshall be made on specimens to represent each length of pipe. \nFailure of any test specimen to meet the requirements shall be \ncause for the rejection of the pipe length represented. \n572 \nS3. Penetrant Oil and Powder Examination \nS3.1 All welded joints shall be subjected to examination by \na penetrant oil and powder method. The details of the method \nand the disposition of flaws detected shall be a matter for \nagreement between the purchaser and the manufacturer. \nS4. Ferrite Control in Weld Deposits \nS4.1 The ferrite content of the deposited weld metal in any \nlength of pipe shall be determined. The procedural details \npertaining to this subject (that is, welding; plate and weld ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0624.json",
  "tabulaTablesCsv": "tables_tabula/page-0624.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text\\pages\\page-0624.txt",
  "bestTextSource": "full_ocr_highdpi",
  "bestTextLength": 4930,
  "bestTextAlphaRatio": 0.766,
  "camelotTablesPath": "camelot_tables/page-0624.json",
  "camelotTablesCsv": "camelot_tables/page-0624.csv",
  "camelotTableCount": 2
}