{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 723,
  "globalPageIndex": 1521,
  "width": 621.72,
  "height": 799.2,
  "text": "ASME BPVC.II.A-2025 SA-988/SA-988M \nS7. Ultrasonic Testing \nS7.1 Austenitic-Ferritic stainless steel parts made of S32505 \nshall be 100 % ultrasonic tested with straight and angle beam \nprobes in accordance with Practice A745/A745M. Acceptance \nlimits shall be agreed upon between the manufacturer and the \npurchaser. \nS8. Repair Welding \nS8.1 No repair welding shall be permitted without prior \napproval of the purchaser. If permitted, the restrictions of \nSection 14 shall apply. \nS9. Heat Treatment Details \nS9.1 The manufacturer shall furnish a detailed test report \ncontaining the information required in 17 .1 and shall include \nall pertinent details of the heat treating cycle given the parts. \nS10. Material for Optimum Resistance to Stress-Corrosion \nCracking \nSlO.l Austenitic stainless steel parts shall be furnished in \nthe solution-annealed condition as a final operation with no \nsubsequent cold working permitted unless specifically permit­\nted by the purchaser. \nSll. Intergranular Corrosion Tests \nSll.1 Intergranular corrosion tests shall be performed on \nspecimens of austenitic stainless steel in accordance with \nPractices A262. \nSll.2 For the austenitic stainless steels, details concerning \nthe number of specimens and their source and location are to be \na matter of agreement between the manufacturer and the \npurchaser. \nS12. Pitting and Crevice Corrosion Test \nSl2.1 The stainless steels in the final heat treated condition \nshall be tested in accordance with Test Method G4S. Test \nprocedures and acceptance criteria shall be a matter of agree­\nment between the manufacturer and purchaser. \nS13. Detrimental Intermetallic Phase Test \nSl3.l The austenitic-ferritic stainless steels shall be tested \nin accordance with the test methods given in Test Methods \nA923. Acceptance criteria, if not specified in Test Methods \nA923, shall be a matter of agreement between the manufacturer \nand the purchaser. \nS14. Special Filler Metal \nS14.1 In repair welded S31600, S31603, S31609, and \nS31651 parts, the deposited weld metal shall conform to E 308 \ncomposition wire. Parts repair welded with E 308 weld metal \nshall be marked S_W308. \nSIS. Hardness Test \nS 15 .1 Each part shall be hardness tested and shall meet the \nrequirements of Table 3. \nS16. Heat Treatment of Austenitic Stainless Parts \nS 16.1 The purchaser shall specify the heat treatment method \nin 7 .1 that shall be employed. \nS16.2 The manufacturer shall provide a test report contain­\ning the information required in 17 .1 and shall include a \nstatement of the heat treatment method employed. \nS17. Grain Size for Austenitic Stainless Steels \nS 17 .1 Hot isostatically-pressed parts made from austenitic \nstainless steel grades other than H grades shall be tested for \naverage grain size by Test Methods El12. Details of the test \nshall be agreed upon between the manufacturer and the \npurchaser. \nS18. Fatigue Acceptance Test \nS 18 .1 For austenitic stainless steel components intended for \nservice above 1000 °F [540 °C], a uniaxial fatigue test shall be \nperformed. \nSl8.2 The fatigue test shall be performed in air at 1100 °F \n[595 °C] at an axial strain range of 1.0 % with a one hour hold \nperiod at the maximum positive strain point in each cycle. Test \nspecimen location and orientation shall be as specified in \nSpecification A961/A961M and the applicable product speci­\nfications. Testing shall be conducted in accord with Practice \nE606/E606M. The test shall exceed 200 cycles without fracture \nor a 20 % drop in the load range. \nS18.3 Failure to meet this requirement shall be cause for \nrejection of all parts from that blend. \nS18.4 Test frequency shall be the same as for tension tests \n(See 9.5). Retesting is permitted. For a retest, two additional \nspecimens produced from the same blend shall be tested and \nboth specimens must pass the cyclic life requirement. Further \nretests are not permitted. \nS19. Powder Size \nS19.l The maximum allowable powder size is 0.020 in. [0.5 \nmm], and the powder shall be produced by the gas atomization \nprocess. \nS20. Powder Shielding \nS20. l Immediately following atomization, the powder shall \nremain shielded by an inert gas until the powder is below a \ntemperature of 105 °F [ 40 °C] to ensure that the detrimental \nabsorption of oxygen and other deleterious contaminants is no \nlonger possible. Powder should be protected during storage to \nprevent the detrimental pick-up of oxygen and other \ncontaminants. \nS21. Chemical Analysis \nS21.1 The chemical composition of a sample from one part \nfrom each lot of parts shall be determined by the manufacturer. \nThe composition of the sample shall conform to the chemical \nrequirements prescribed in Table 1. \nS22. Manufacturer's Certification \nS22.1 A manufacturer's certification shall be furnished to \nthe purchaser stating that material has been manufactured, \ntested, and inspected in accordance with this specification, and \nthat the test results on representative samples meet specifica­\ntion requirements. A report of the test results shall be furnished. \n1467 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1521.json",
  "tabulaTablesCsv": "tables_tabula/page-1521.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1521.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5059,
  "bestTextAlphaRatio": 0.7604,
  "camelotTablesPath": "camelot_tables/page-1521.json",
  "camelotTablesCsv": "camelot_tables/page-1521.csv",
  "camelotTableCount": 2
}