{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 194,
  "globalPageIndex": 194,
  "width": 613.92,
  "height": 793.2,
  "text": "SA-53/SA-53M ASME BPVC.II.A-2025 \nTABLE 1 Chemical Requirements \nComeosition, max, % \nCarbon Manganese Phosehorus Sulfur Coeeer< NickelA ChromiumA MolybdenumA VanadiumA \nTyee S (seamless eiee) \nGrade A 0.25 8 0.95 0.05 0.045 0.40 0.40 0.40 0.15 0.08 \nGrade B 0.30G 1.20 0.05 0.045 0.40 0.40 0.40 0.15 0.08 \nTyee E (electric-resistance-welded) \nGrade A 0.25 8 0.95 0.05 0.045 0.40 0.40 0.40 0.15 0.08 \nGrade B 0.30G 1.20 0.05 0.045 0.40 0.40 0.40 0.15 0.08 \nTyee F (furnace-welded eiee) \nGrade A 0.30 8 1.20 0.05 0.045 0.40 0.40 0.40 0.15 0.08 \nA The total composition for these five elements shall not exceed 1.00 %. \n8For each reduction of 0.D1 % below the specified carbon maximum, an increase of 0.06 % manganese above the specified maximum will be permitted up to a maximum \nof 1.35%. \ncFor each reduction of 0.01 % below the specified carbon maximum, an increase of 0.06 % manganese above the specified maximum will be permitted up to a maximum \nof 1.65%. \n6.2 If the analysis of either pipe does not conform to the \nrequirements given in Table 1, analyses shall be made on \nadditional pipes of double the original number from the same \nlot, each of which shall conform to the specified requirements. \n7. Mechanical Properties \n7.1 Tension Test: \n7 .1.1 For tension tests other than transverse weld tension \ntests, the yield strength corresponding to a permanent offset of \n0.2 % of the gage length or to an extension of 0.5 % of the gage \nlength under load, the tensile strength, and the elongation in 2 \nin. or 50 mm shall be determined, and the tension test results \nshall conform to the applicable tensile property requirements \ngiven in Table 2. \n7.1.2 For transverse weld tension tests, the tensile strength \nshall be determined, and the tension test results shall conform \nto the applicable tensile strength requirement given in Table 2. \n7.1.3 Electric-resistance-welded pipe NPS 8 [DN 200] or \nlarger shall be tested using two transverse test specimens, one \ntaken across the weld and one taken opposite the weld. \n7 .1.4 Transverse tension test specimens shall be approxi­\nmately 1 V2 in. [38 mm] wide in the gage length and shall \nrepresent the full wall thickness of the pipe from which the test \nspecimens were cut. \nTABLE 2 Tensile Requirements \nGrade A Grade B \nTensile strength, min, psi [MPa] 48 000 [330] 60 000 [415] \nYield strength, min, psi [MPa] 30 000 [205] 35 000 [240] \nElongation in 2 in. or 50 mm A,a A,a \nA The minimum elongation in 2 in. [50 mm] shall be that determined by the \nfollowing equation: \ne = 625000 [ 1940 J A°• 2 1 u 0 ·• \nwhere: \ne minimum elongation in 2 in. or 50 mm in percent, rounded to the nearest \npercent, \nA the lesser of. 0.75 in. 2 [500 mm 2 ] and the cross-sectional area of the \ntension test specimen, calculated using the specified outside diameter of \nthe pipe, or the nominal width of the tension test specimen and the \nspecified wall thickness of the pipe, with the calculated value \nrounded to the nearest 0.01 in. 2 [1 mm 2 ], and \nU = specified minimum tensile strength, psi [MPa]. \n8 See Table X4.1 or Table X4.2, whichever is applicable, for the minimum \nelongation values that are required for various combinations of tension test \nspecimen size and specified minimum tensile strength. \n7 .2 Bend Test: \n7.2.1 For pipe NPS 2 [DN 50] or smaller, a sufficient length \nof pipe shall be capable of being bent cold through 90° around \na cylindrical mandrel, the diameter of which is twelve times the \nspecified outside diameter of the pipe, without developing \ncracks at any portion and without opening the weld. \n7.2.2 If ordered for close coiling, the pipe shall stand being \nbent cold through 180° around a cylindrical mandrel, the \ndiameter of which is eight times the specified outside diameter \nof the pipe, without failure. \n7.2.3 Double-extra-strong pipe over NPS 1 V4 [DN 32] need \nnot be subjected to the bend test. \n7 .3 Flattening Test: \n7.3.1 The flattening test shall be made on welded pipe over \nNPS 2 [DN 50] in extra-strong weight or lighter. \n7.3.2 Seamless Pipe: \n7.3.2.1 Although testing is not required, pipe shall be \ncapable of meeting the flattening test requirements of Supple­\nmentary Requirement S 1, if tested. \n7.3.3 Electric-Resistance-Welded Pipe: \n7.3.3.1 A test specimen at least 4 in. [100 mm] in length \nshall be flattened cold between parallel plates in three steps, \nwith the weld located either 0° or 90° from the line of direction \nof force as required by 7.3.3.2 or 7.3.3.3, whichever is \napplicable. During the first step, which is a test for ductility of \nthe weld, except as allowed by 7.3.5, 7.3.6, and 7.3.7, no cracks \nor breaks on the inside or outside surface at the weld shall be \npresent before the distance between the plates is less than two \nthirds of the specified outside diameter of the pipe. As a second \nstep, the flattening shall be continued as a test for ductility \naway from the weld. During the second step, except as allowed \nby 7.3.6 and 7.3.7, no cracks or breaks on the inside or outside \nsurface away from the weld shall be present before the distance \nbetween the plates is less than one third of the specified outside \ndiameter of the pipe but is not less than five times the specified \nwall thickness of the pipe. During the third step, which is a test \nfor soundness, the flattening shall be continued until the test \nspecimen breaks or the opposite walls of the test specimen \nmeet. Evidence of laminated or unsound material or of incom­\nplete weld that is revealed by the flattening test shall be cause \nfor rejection. \n142 \n7.3.3.2 For pipe produced in single lengths, the flattening \ntest specified in 7.3.3.1 shall be made using a test specimen ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0194.json",
  "tabulaTablesCsv": "tables_tabula/page-0194.csv",
  "tabulaTableCount": 3,
  "bestTextPath": "best_text/pages/page-0194.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5688,
  "bestTextAlphaRatio": 0.6973
}