{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 870,
  "globalPageIndex": 1668,
  "width": 613.92,
  "height": 793.2,
  "text": "ASME BPVC.II.A-2025 \nTable 11-200-1 \nFerrous Material Specifications Acceptable for BPVC Construction (Including Acceptable ASTM \nEditions) (Cont'd) \nLatest \nASME Material Adopted All Acceptable Editions \nSpecification [Note {ll] Description [Note (2)) [Note (3l], (Note (4)] \nSA-268/SA-268M 20 Identical 88b through 20 \nSA-276/SA-276M 17 Identical 02 through 17 \nSA-278/SA-278M 01(2015) Identical except for an editorial change to 5.1.1 and a change to 16.1 making 85 through 01(2015) \ncertification mandatory. \nSA-283/SA-283M 18 Identical 88 through 18 \nSA-285/SA-285M 17 Identical 82(R87) through 17 \nSA-299 /SA-299M 17 Identical 82(R87) through 17 \nSA-302/SA-302M 17 Identical. ASTM editions prior to 12 are acceptable provided that any 82 through 17 \naccelerated cooling of plates as permitted in 5.3 is followed by tempering. \nSA-307 10 Identical except for the deletion of the term \"private label distributor'' and \"as 00 through 10 \nappropriate\" in para. 13.1.1. \nSA-311/SA-311M 04(2015) Identical except for the deletion of 5.1.11, revision of Table 1 footnote A, and 90b through 04(2015) \neditorial change to 5.1.9, and 11.1 revised to make certification mandatory. \nSA-312/SA-312M 24 Identical except for the revision to para. 6.2 to add \"H\" grade heat treatment 14b through 24 \nrequirements. For UNS S31035, the acceptable ASTM editions are limited to \n18a and later. \nSA-320/SA-320M 22 Identical 21 through 22 \nSA-325 10 Identical except for the deletion of the term \"private label distributor\" in 15.1 86a through 10 \nand 15.5 \nSA-333/SA-333M 16 Identical. For Grade 6, acceptable ASTM editions are limited to 11 and later. 94 through 16 \nSA-334/SA-334M 04a(2016) Identical 88' 1 through 04a(2016) \nSA-335/SA-335M 24 Identical except Supplementary Requirement S9 is mandatory and editorial 18a through 24 \ncorrection to 13.1. For Grade P91, Type 2, acceptable ASTM editions are \nlimited to 23 and later with Supplementary Requirement S9 made \nmandatory. \nSA-336/SA-336M 23 Identical except Supplementary Requirement S10 is mandatory. ASTM editions 06a through 23 \nprior to 15 are acceptable provided the term \"hubbed flanges\" is replaced \nwith \"hubbed flat heads\" in 3.4. For Grade F5a, ASTM editions prior to 15 are \nacceptable provided the minimum temperature is 1,250°F. \nSA-350/SA-350M 23 Identical except for the deletion of footnote Din Table 1 and revision to 14.1.5. 12 through 23 \nSA-351/SA-351M 18' 1 Identical. For Grades CK3MCuN and CN3MN, acceptable ASTM editions are 86 through 18' 1 \nlimited to 13a and later. \nSA-352/SA-352M 06(2012) Identical 88 through 06(2012) \nSA-353/SA-353M 17 Identical 87 through 17 \nSA-354 11 Identical except for the deletion of the term \"private label distributor\" in 15.1 86 through 11 \nand 15.3.5. \nSA-358/SA-358M 19 Identical except for the deletion of 6.3.2.2 for HT-0 pipe and 6.3.2.3 for HT-SO 88 through 19 \npipe. For products ordered to Section III and Section VIII, Division 1 of the \nASME Boiler and Pressure Vessel Code, Supplementary Requirement SB is \nmandatory. \nSA-369 /SA-369M 23 Identical except Supplementary Requirement S7 is mandatory and editorial 88 through 23 \ncorrection to Supplementary Requirement S7. For Grade FP91 Type 2, \nacceptable ASTM edition is limited to 23 with Supplementary Requirement \nS7 made mandatory. \n1614 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1668.json",
  "tabulaTablesCsv": "tables_tabula/page-1668.csv",
  "tabulaTableCount": 1,
  "bestTextPath": "best_text/pages/page-1668.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3307,
  "bestTextAlphaRatio": 0.6501
}