{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 789,
  "globalPageIndex": 789,
  "width": 643.8,
  "height": 878.28,
  "text": "ASME BPVC.II.A-2025 SA-450 /SA-450M \nA 700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA751 Test Methods and Practices for Chemical Analysis of \nSteel Products \nA822/A822M Specification for Seamless Cold-Drawn Car­\nbon Steel Tubing for Hydraulic System Service \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA1047/A1047M Test Method for Pneumatic Leak Testing of \nTubing \nA1058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nD3951 Practice for Commercial Packaging \nE92 Test Methods for Vickers Hardness and Knoop Hard­\nness of Metallic Materials \nE213 Practice for Ultrasonic Testing of Metal Pipe and \nTubing \nE273 Practice for Ultrasonic Testing of the Weld Zone of \nWelded Pipe and Tubing \nE309 Practice for Eddy Current Examination of Steel Tubu­\nlar Products Using Magnetic Saturation \nE426 Practice for Electromagnetic (Eddy Current) Examina­\ntion of Seamless and Welded Tubular Products, Titanium, \nAustenitic Stainless Steel and Similar Alloys \nE570 Practice for Flux Leakage Examination of Fetromag­\nnetic Steel Tubular Products \n2.2 SAE Aerospace Material Specifications: \nSAE-AMS2806 Identification Bars, Wire, Mechanical \nTubing, and Extrusions, Carbon and Alloy Steels and \nCorrosion and Heat-Resistant Steels and Alloys \n2.3 Military Standards: \nMIL-STD- 792 Identification Marking Requirements for \nSpecial Purpose Equipment \nNAVSEA T9074-AS-GIB-010/271 Requirements for Non-\ndestructive Testing Methods \n2.4 ASME Boiler and Pressure Vessel Code: \nSection IX \n2.5 Steel Structures Painting Council: \nSSPC-SP 6 Surface Preparation Specification No. 6 Com­\nmercial Blast Cleaning \n2.6 Other Document: \nSNT-TC-lA Recommended Practice for Nondestructive \nPersonnel Qualification and Certification. \n3. Terminology \n3.1 Definitions of Terms Specific to This Standard: \n3.1.1 remelted heat-in secondary melting, all of the ingots \nremelted from a single primary heat. \n3.1.2 thin-wall tube-a tube meeting the specified outside \ndiameter and specified wall thickness set forth as follows: \nSpecified Outside Specified Wall Thickness \nDiameter \n2 in. [50.8 mm] or less 2 % or less of specified outside diameter \nGreater than 2 in. [50.8 mm] 3 % or less of specified outside diameter \nAny 0.020 in. [0.5 mm] or less \n3.2 Other defined terms-The definitions in Test Methods \nand Definitions A370, Test Methods, Practices, and Terminol­\nogy A751, and Terminology A941 are applicable to this \nspecification and to those listed in 1. 1. \n4. Ordering Information \n4.1 It is the purchaser's responsibility to specify in the \npurchase order all ordering information necessary to purchase \nthe needed material. Examples of such infonnation include, but \nare not limited to, the following: \n4.1.1 Quantity (feet, metres, or number of lengths), \n4.1.2 Specificiation number with grade or class, or both, as \napplicable and year date, \n4.1.3 Manufacture (hot-finished or cold-finished), \n4.1.4 Size (outside diameter and minimum wall thickness), \n4.1.5 Length (specific or random), \n4.1.6 Choice of testing track from the options listed in Test \nMethods A1058 when material is ordered to an M suffix (SI \nunits) product standard. If the choice of test track is not \nspecified in the order, then the default ASTM test track shall be \nused as noted in Test Methods A1058. \n4.1.7 Supplementary Requirements, and \n4.1.8 Additional requirements. \n5. Process \n5.1 The steel may be made by any process. \n5.2 If a specific type of melting is required by the purchaser, \nit shall be as stated on the purchase order. \n739 \n5.3 The primary melting may incorporate separate degas­\nsing or refining and may be followed by secondary melting, \nsuch as electroslag remelting or vacuum-arc remelting. \n5.4 Steel may be cast in ingots or may be strand cast. When \nsteel of different grades is sequentially strand cast, identifica­\ntion of the resultant transition material is required. The \nproducer shall remove the transition material by an established \nprocedure that positively separates the grades. \n6. Chemical Composition \n6.1 Samples for chemical analysis, and method of analysis \nshall be in accordance with Test Methods, Practices, and \nTerminology A751. \n6.2 Heat Analysis-If the heat analysis reported by the steel \nproducer is not sufficiently complete for conformance with the \nheat analysis requirements of the applicable product specifica­\ntion to be fully assessed, the manufacturer may complete the \nassessment of conformance with such heat analysis require­\nments by using a product analysis for the specified elements \nthat were not reported by the steel producer, provided that \nproduct analysis tolerances are not applied and the heat \nanalysis is not altered. ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0789.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4758,
  "bestTextAlphaRatio": 0.7612
}