{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 612,
  "globalPageIndex": 1410,
  "width": 612.48,
  "height": 792.0,
  "text": "SA-834 ASME BPVC.II.A-2025 \n9.3 When agreed upon between manufacturer and pur­\nchaser, test specimens or unbroken test bars from the same lot \nshall be saved for a period of 3 months after date of the test \nreport. \n9.4 When unbroken test bars are reprocessed with castings \nfor rehearing, test specimens from these bars shall be saved, as \ndescribed in 9.3. \n9.5 The purchaser reserves the right to perform any inspec­\ntions set forth in the specification where such inspections are \ndeemed necessary to assure that supplies and services conform \nto the prescribed requirements. \n10. Repair \n10.1 Any repair shall be made in accordance with the \nrequirements of the individual specification using procedures \nqualified by the manufacturer for the type of repair involved. \n11. Rejection and Rehearing \n11.1 Castings which fail to conform to the requirements \nspecified when inspected or tested by the purchaser or his agent \nmay be rejected. Rejection shall be reported to the manufac­\nturer or supplier promptly and in writing. In case of dissatis­\nfaction with the test results, the manufacturer or supplier may \nmake claim for a rehearing. \n12. Packaging and Package Marking \n12.1 Unless otherwise specified in the contract or purchase \norder, cleaning, preservation, and packaging of castings shall \nbe in accordance with the manufacturer's commercial practice. \nPacking and marking shall also be adequate to identify the \ncontents and to ensure acceptance and safe delivery by the \ncarrier for the mode of transportation employed. \n12.2 Government Procurement-When specified in the con­\ntract or purchase order, marking for shipment shall be in \naccordance with the requirements of Fed. Std. No. 123 for civil \nagencies and MIL-STD-129 for military activities. \n13. Quality Assurance \n13.1 The surface of the casting shall be free of adhering \nsand, scale, cracks, and hot tears as determined by visual \nexamination. Other surface discontinuities shall meet the visual \nacceptance standards specified in the order. Visual Practice \nA802/ A802M or other visual standards may be used to define \nacceptable surface discontinuities and finish. Unacceptable \nvisual surface discontinuities shall be removed and their \nremoval verified by visual examination of the resultant cavi­\nties. \n13.2 When additional inspection is desired, Supplementary \nRequirements Sl, S2, or S3 may be specified. \n14. Keywords \n14.1 chemical composition; common requirements; gen­\neral industry; inspection; iron castings; ordering information; \npackaging; quality assurance; repair; sampling; tensile require­\nments; terminology; workmanship \nSUPPLEMENTARY REQUIREMENTS \nSupplementary requirements shall be applied only when specified by the purchaser. Details of the \nsupplementary requirements shall be agreed upon by the manufacturer and purchaser. The specified \ntests shall be performed by the manufacturer prior to shipment of the castings. \nSl. Magnetic Particle Examination \nS 1. 1 Castings shall be examined for surface discontinuities \nby magnetic particle examination. The examination shall be in \naccordance with Practice B709. The extent of examination and \nthe basis for acceptance shall be agreed upon between the \nmanufacturer and purchaser. \nS2. Radiographic Examination \nS2.1 Castings shall be examined for internal defects by \nmeans of X-rays or gamma rays. The procedure shall be in \naccordance with Guide B94, and types and degrees of discon­\ntinuities considered shall be judged by Reference Radiographs \nB689 and B802. The extent of examination and basis for \nacceptance shall be agreed upon between the manufacturer and \npurchaser. \nS3. Liquid Penetrant Examination \nS3.1 Castings shall be examined for surface discontinuities \nby means of liquid penetrant examination. The examination \nshall be in accordance with Practice B165. Areas to be \ninspected, methods and types of liquid penetrants to be used, \ndeveloping procedure, and basis for acceptance shall be agreed \nupon between the manufacturer and purchaser. \nS4. Certification \nS4.1 The manufacturer's certification shall be furnished to \nthe purchaser stating that the material was manufactured, \nsampled, tested, and inspected in accordance with the material \nspecification, including the year date, and was found to meet \nthe requirements. Additionally, the certification shall include \nfor each lot the results of all tests required by the material \nspecification and any supplementary or additional requirements \nimposed by the purchase order. \nS4.2 A signature is not required on the certification or test \nreport. However, the document shall clearly identify the \norganization submitting the certification and the authorized \nagent of the manufacturer who certified the test results. \nNotwithstanding the absence of a signature, the organization \nsubmitting the certification is responsible for its content. \nS4.3 The test report shall be furnished within 5 working \ndays of shipment of the castings. \n1348 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-1410.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 4975,
  "bestTextAlphaRatio": 0.7938
}