{
  "sourcePdf": "2025 OCR SECT II PART A BEGINNING TO SA-450.pdf",
  "sourcePageNumber": 637,
  "globalPageIndex": 637,
  "width": 607.56,
  "height": 850.08,
  "text": "ASME BPVC.II.A-2025 SA-370 \n2. Referenced Documents \n2. l ASTM Standards: \nA623 Specification for Tin Mill Products, General Require­\nments \nA623M Specification for Tin Mill Products, General Re­\nquirements [Metric] \nA833 Test Method for Indentation Hardness of Metallic \nMaterials by Comparison Hardness Testers \nA941 Terminology Relating to Steel, Stainless Steel, Related \nAlloys, and Ferroalloys \nA956/A956M Test Method for Leeb Hardness Testing of \nSteel Products \nAl038 Test Method for Portable Hardness Testing by the \nUltrasonic Contact Impedance Method \nAl058 Test Methods for Mechanical Testing of Steel \nProducts-Metric \nAl061/Al061M Test Methods for Testing Multi-Wire Steel \nPrestressing Strand \nE4 Practices for Force Calibration and Verification of Test­\ning Machines \nE6 Terminology Relating to Methods of Mechanical Testing \nE8/E8M Test Methods for Tension Testing of Metallic Ma­\nterials \nElO Test Method for Brinell Hardness of Metallic Materials \nE18 Test Methods for Rockwell Hardness of Metallic Ma­\nterials \nE23 Test Methods for Notched Bar Impact Testing of Me­\ntallic Materials \nE29 Practice for Using Significant Digits in Test Data to \nDetermine Conformance with Specifications \nE83 Practice for Verification and Classification of Exten­\nsometer Systems \nEll0 Test Method for Rockwell and Brinell Hardness of \nMetallic Materials by Portable Hardness Testers \nE190 Test Method for Guided Bend Test for Ductility of \nWelds \nE290 Test Methods for Bend Testing of Material for Ductil­\nity \n2.2 ASME Document: \nASME Boiler and Pressure Vessel Code, Section VIII, \nDivision I, Part UG-8 \n2.3 ISO Standard: \nISO/IEC 17025 General Requirements for the Competence \nof Testing and Calibration Laboratories \n3. Terminology \n3.l Definitions: \n3.1.1 For definitions of terms pertaining to mechanical \ntesting of steel products not otherwise listed in this section, \nreference should be made to Terminology E6 and Terminology \nA941. \n3.2 Definitions of Terms Specific to This Standard: \n3.2. l longitudinal test, n-unless specifically defined \notherwise, signifies that the lengthwise axis of the specimen is \nparallel to the direction of the greatest extension of the steel \nduring rolling or forging. \n3.2.1.1 Discussion-The stress applied to a longitudinal \ntension test specimen is in the direction of the greatest \nextension, and the axis of the fold of a longitudinal bend test \nspecimen is at right angles to the direction of greatest extension \n(see Fig. 1, Fig. 2a, and Fig. 2b). \n3.2.2 radial test, n-unless specifically defined otherwise, \nsignifies that the lengthwise axis of the specimen is perpen­\ndicular to the axis of the product and coincident with one of the \nradii of a circle drawn with a point on the axis of the product \nas a center (see Fig. 2a). \n3.2.3 tangential test, n-unless specifically defined \notherwise, signifies that the lengthwise axis of the specimen \nperpendicular to a plane containing the axis of the product and \ntangent to a circle drawn with a point on the axis of the \nproductas a center (see Fig. 2a, Fig. 2b, Fig. 2c, and Fig. 2d). \n3.2.4 transition temperature, n-for specification purposes, \nthe transition temperature is the temperature at which the \ndesignated material test value equals or exceeds a specified \nminimum test value. \n3.2.4.1 Discussion-Some of the many definitions of tran­\nsition temperature currently being used are: ( 1) the lowest \ntemperature at which the specimen exhibits 100 % fibrous \nfracture, (2) the tei;nperature where the fracture shows a 50 % \ncrystalline and a 50 % fibrous appearance, ( 3) the temperature \ncorresponding to the energy value 50 % of the difference \n585 \nFIG. 1 Relation of Test Coupons and Test Specimens to Rolling \nDirection or Extension (Applicable to General Wrought Products) ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0637.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3794,
  "bestTextAlphaRatio": 0.7667
}