{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 117,
  "globalPageIndex": 915,
  "width": 618.6,
  "height": 796.8,
  "text": "ASME BPVC.II.A-2025 SA-484/SA-484M \nA565/ A565M Specification for Martensitic Stainless Steel \nBars for High-Temperature Service \nA582/A582M Specification for Free-Machining Stainless \nSteel Bars \nA638/A638M Specification for Precipitation Hardening Iron \nBase Superalloy Bars, Forgings, and Forging Stock for \nHigh-Temperature Service \nA 700 Guide for Packaging, Marking, and Loading Methods \nfor Steel Products for Shipment \nA 705/ A 705M Specification for Age-Hardening Stainless \nSteel Forgings \nA751 Test Methods and Practices for Chemical Analysis of \nSteel Products \nA83 l/ A831M Specification for Austenitic and Martensitic \nStainless Steel Bars, Billets, and Forgings for Liquid \nMetal Cooled Reactor Core Components (Withdrawn \n2005) \nE112 Test Methods for Determining Average Grain Size \nE139 Test Methods for Conducting Creep, Creep-Rupture, \nand Stress-Rupture Tests of Metallic Materials \n2.2 Federal Standards: \nFed Std. No. 123 Marking for Shipment (Civil Agencies) \nFed Std. No. 183 Continuous Marking of Iron and Steel \nProducts \n2.3 Military Standards: \nMIL-STD-129 Marking for Shipment and Storage \nMIL-STD-163 Preservation of Steel Products for Shipment \n(Storage and Overseas Shipment) \n2.4 Other Standard: \nPrimary Metals Bar Code Standard \n3. Terminology \n3.1 Definitions of Terms Specific to This Standard: \n3.1.1 bars, n-straight lengths that are produced by process­\ning that includes hot deformation, such as rolling, forging, or \nextrusion; the permitted cross-sections include round, \nrectangular, and complex shapes; shall include shapes with all \ndimensions under 5 in. [125 mm]; shall include hot-rolled flats \nwith width of 10 in. [250 mm] or less, and with thickness \n0.125 in. [3.00 mm] or greater; shall include flats with width of \n10 in. [250 mm] or less, and with thickness 0.125 in. [3.00 mm] \nor greater, cut from strip or plate provided that the long \ndirection of the cut bar is parallel to the final rolling direction \nof the strip or plate. \n3.1.1.1 Discussion-All cold-reduced flat material with \nthickness less than 0.1875 in. [5.00 mm] and width 0.375 in. \n[9.50 mm] and over is classified as strip. \n3.1.2 billets, n-semi-finished products, typically produced \nby rolling, forging, or continuous casting, that require subse­\nquent hot working by rolling, forging, or extrusion; typically \nhave a cross-section area of 36 in. 2 [230 cm 2 ] or less and shape \nthat is square or rectangular with width less than twice the \nthickness; rectangular cross sections with width equal to or \ngreater than twice the thickness are classified as slabs or sheet \nbars. \n3.1.3 blooms, n-semi-finished products, typically produced \nby rolling or continuous casting, that require subsequent hot \nworking by rolling or forging; typically have a cross section \narea of greater than 36 in.2 [230 cm 2 ] and shape that is square \nor rectangular with width less than twice the thickness; \nrectangular cross sections with width equal to or greater than \ntwice the thickness are classified as slabs or sheet bars. \n3.1.4 condition, n-identification of the final step or steps \nthermomechanical processing as required to describe the met­\nallurgical state of the material as delivered (examples include \nhot-worked; hot-worked and annealed; hot-worked, annealed, \nand cold-worked for increased mechanical properties; and \nhot-worked, quenched, and tempered). \n3.1.5 dead lengths or exact lengths, n-bars, typically \nhot-sheared, hot-sawed, or machine-cut after machine­\nstraightening, meeting the permitted variations in length as \nlisted in the tolerance tables of this specification. \n3.1.6 finish, n-description of the surface finish and appli­\ncable dimensional tolerances of the product as delivered, most \ntypically by identification of the process applied to the product, \nand identification of the applicable category of product dimen­\nsional tolerances; examples of finishing operations include \nblasting, pickling, rough turning, machine straightening, cen­\nterless grinding, polishing, and light cold drawing for surface \nfinish but not for increased mechanical properties; see also \n8.1.1 for hot-finished bars and 8.1.3 for cold~finished bars. \n815 \n3.1.7 forgings, n-parts, including bars, billets, semi­\nfinished products, or complex shapes, produced by hot me­\nchanical working using hammers, presses, or forging ma­\nchines. \n3.1.8 multiple lengths, n-lengths that are specified as \ncontaining a predetermined number of units of length associ­\nated with production of a particular part, commonly including \nan allowance of 1/4 in. [6.5 mm] per unit for cutting to insure \nobtaining the required number of pieces. \n3.1.9 random lengths, n-a length range not less than 24 in. \n[1 m]; for example, 10 to 12 ft [3 to 4 m], 14 to 17 ft [4 to 5 rn], \nor 15 to 20 ft [5 to 6 m]. \n3.1.10 shapes, n-bar having a cross section other than \ncircular, rectangular, or hexagonal. \n3.1.11 slabs or sheet bars, n-products, typically produced \nby blooming, slabbing, or sheet bar mills or by continuous \ncasting, that are shipped without further hot working to be \nfurther processed into plate, sheet, or strip; it is permitted to \nheat treat, cut to shape, or surface condition a slab or sheet bar. \n4. Ordering Information \n4.1 It is the responsibility of the purchaser to specify all \nrequirements that are necessary for material ordered under this \nspecification. Such requirements to be considered include, but \nare not limited to, the following: \n4.1.1 Quantity (weight or number of pieces), ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "bestTextPath": "best_text/pages/page-0915.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5522,
  "bestTextAlphaRatio": 0.7466
}