{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 81,
  "globalPageIndex": 879,
  "width": 620.16,
  "height": 798.0,
  "text": "ASME BPVC.II.A-2025 SA-479/SA-479M \nA484M shall apply. Failure to comply with the general \nrequirements of Specification A484/A484M constitutes non­\nconformance with this specification. \n5. Chemical Composition \n5.1 Chemical composition shall be reported to the \npurchaser, or his representative, and shall conform to the \nrequirements specified in Table 1. \n5 .2 When a product analysis is performed or requested by \nthe purchaser, the tolerance limits as described in Specification \nA484/A484M apply unless Supplementary Requirement S3 is \ninvoked. \n5.3 Methods and practices relating to chemical analysis \nrequired by this specification shall be in accordance with Test \nMethods, Practices, and Terminology A751. \n6. Grain Size for Austenitic Grades \n6.1 All austenitic grades shall be tested for average grain \nsize by Test Methods Ell2. \n6.2 The H grades shall conform to an average grain size as \nfollows: \n6.2.1 ASTM No. 6 or coarser for Types 304H, 309H, 310H, \nand 316H, and \n6.2.2 ASTM No. 7 or coarser for Types 321H, 347H, and \n348H. \n6.3 For S32615, the grain size as determined in accordance \nwith Test Methods Ell2, comparison method, Plate 11, shall be \nNo. 3 or finer. \n6.4 For N08810 and N08811, the average grain size as \ndetermined in accordance with Test Methods Ell2 shall be \nNo. 5 or coarser. \n6.5 Supplementary Requirement Sl shall be invoked when \nnon-H grade austenitic stainless steels are ordered for ASME \nCode applications for service above 1000 °F [540 °C]. \n7. Mechanical Properties Requirements \n7 .1 The material shall conform to the mechanical property \nrequirements specified in Table 2 for the grade ordered. At least \none room-temperature test shall be performed by the manufac­\nturer on a sample from at least one bar or shape from each lot \nof material. \n7 .2 The yield strength shall be determined by the offset \n(0.2 % ) method as prescribed in Test Methods and Definitions \nA370. \n7 .3 Martensitic material supplied in the annealed condition \nshall be capable of meeting the hardened and tempered \nmechanical properties when heat treated. \n7.4 Hardness measurements, when required, shall be made \nat a location midway between the surface and the center of the \ncross section. \n7 .5 Martensitic grades shall be capable of meeting the \nhardness requirements after heat treating as specified in Table \n3. \n8. Testing for Intermetallic Compounds \n8.1 When specified by the purchaser in the purchase order, \nthe manufacturer shall test the austenitic or austenitic-ferritic \n(duplex) stainless steel material in its final condition in \naccordance with supplementary test requirements S6. \nNoTB 2-Many, if not all, duplex stainless steels and some austenitic \nstainless steels will form intermetallic phases or compounds such as \nsigma, chi, and laves phases when exposed to temperatures below the \nspecified annealing temperature or cooled slowly from a higher tempera­\nture during casting, welding, or annealing. These phases can have a \nnegative effect on mechanical properties and co1Tosion resistance. These \nphases can typically be removed by correct annealing and cooling \npractices. The presence of these phases can be demonstrated by tests, \ntypically involving metallography, impact toughness, or corrosion \nresistance, although the testing requirements may be different for different \nalloy grades. Such testing may or may not be routinely performed by the \nmanufacturer. \n9. Certification \n9.1 The material manufacturer's certificate of compliance \ncertifying that the material was manufactured and tested in \naccordance with this specification, together with a report of the \nresults required by this specification and the purchase order, \nshall be furnished at the time of shipment. The certification \nshall be positively relatable to the lot of material represented. \n10. Product Marking \n10.1 In addition· to the marking requirements of Specifica­\ntion A484/A484M, materials that have been heat treated or \nhave been strain hardened shall be identified by placement of \nthe following symbols after the grade designation: \n10.1.1 Austenitic Grades: \n10.1.1.1 All grades in the annealed condition-A, \n10.1.1.2 Strain hardened Type 316, Level 1--Sl, \n10.1.1.3 Strain hardened Type 316, Level 2-S2, \n10.1.1.4 Hot-rolled Type XM-19-H, \n10.1.1.5 Strain hardened Type XM-19-S, and \n10.1.1.6 Material meeting Supplementary Requirement \nSl-ELT (unnecessary for H grades). \n10.1.1.7 In addition to all other marking requirements of \nthis specification, when S 1 is invoked, all grades in the direct \nquenched condition shall be marked \"D.\" \n10.1.2 Austenitic-Ferritic Grades-All grades in the an­\nnealed condition-A. \n10.1.3 Ferritic Grades-All grades in the annealed \ncondition-A. \n10.1 .4 Martensitic Grades: \n777 \n10.1.4.1 All grades in the annealed condition-A. \n10.1.4.2 Types403 and410-COND 1, COND 2, orCOND \n3 as appropriate for the tempering temperature employed. \n10.1.4.3 Type 414, S41500, and Type XM-30 tempered \nmaterials-T. \n11. Keywords \n11.1 austenitic stainless steel; austenitic-ferritic duplex \nstainless steel; ferritic stainless steel; high temperature service \napplications; martensitic stainless steel; pressure vessel ser­\nvice; pressure-containing parts; stainless steel bars; stainless \nsteel shapes ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-0879.json",
  "tabulaTablesCsv": "tables_tabula/page-0879.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-0879.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 5271,
  "bestTextAlphaRatio": 0.7462
}