{
  "sourcePdf": "2025 OCR ASME SECT II MATERIALS PART A SA-451 TO END.pdf",
  "sourcePageNumber": 842,
  "globalPageIndex": 1640,
  "width": 612.48,
  "height": 792.0,
  "text": "SA/EN 10088-3 ASME BPVC.II.A-2025 \nSPECIFICATION FOR STAINLESS STEEL \nPart 3: Technical Delivery Conditions for Semi-Finished \nProducts, Bars, Rods, Wire, Sections, and Bright Products of \nCorrosion Resisting Steels for General Purposes \nSA/EN 10088-3 \n(Identical with International Specification EN 10088-3:2014 with these additional requirements.) \n1. Additional Requirements \n1.1 Marking: \nIn addition to the marking requirements of this spec­\nification, all products required to be marked and material \nidentification used on all documentation required by this \nspecification are to be identified by this SA/EN specifica­\ntion designation. \nProducts shall be marked by the party performing the \nheat treatment with the letters designating the applicable \nheat treatment condition in Tables of Annex A of EN \n10088-3 following the marked steel name or number. \nProducts that are not heat treated but are qualified on \nthe basis of heat treated specimens per para. 6.5.1 shall be \nmarked with letter \"G\" following the marked specification \ndesignation. \n1.2 Dimensions: \n1.2.1 Product thickness or diameter as applicable, \nshall not be greater than the dimension shown in the \ntables of mechanical properties at room temperature. \n1.2.2 Diameter of bright bars delivered in conditions \n2H, 28, 2G, or 2P, shall be equal to or greater than 5 mm. \n1.2.3 Thickness or diameter of bright bars of Grade \nX2CrNiMoCuN25-6-3 delivered in conditions 2H, 28, 2G, \nor 2P, shall be greater than 16 mm. \n1.3 Tests and Inspection: \n1.3.1 Reports: \n1.3.1.1 A Material Test Report shall be provided \nand, if required by the referencing Code Section or \nPurchase Order, a Certificate of Conformance shall be \nsupplied in addition to any test reports or inspection certi-\nficates described in para. 7.2. Certified Material Test \nReports shall be provided when applicable. \n1.3.1.2 Results of the mandatory tests marked by \n\"m\" in Table 21, second column, shall be reported. \n1.3.1.3 The designation of this SA/EN specification \nshall include the edition year. \n1.3.1.4 Copies of the original manufacturer's test \nreport shall be included with any subsequent test report. \n1.3.2 For tension tests, impact tests, hardness tests, \nand intergranular corrosion tests of round and rectan­\ngular cross-section products greater than 1 in. (25 \nmm), specimens shall be taken at a location corresponding \nto the % T-plane or deeper. \n1.4 Repair by Welding: \nRepair by welding is acceptable only by agreement with \nthe purchaser, and the following additional requirements \nshall apply: \n[ a J Preparation for repair welding shall include inspec­\ntion to assure complete removal of the defect. \n[b J Repairs shall be made utilizing welding procedures \nqualified in accordance with ASME Section IX, and repair \nwelding shall be done by welders or welding operators \nmeeting the qualification requirements of ASME \nSection IX. \n1.5 Heat Treatment: \nAustenitic stainless steel material shall be supplied in \nthe solution annealed condition. \n1.6 Surface Quality: \nIn Table 1 - Maximum depth of acceptable disconti­\nnuities for bars, rods and sections, the permissible depth \nof discontinuities and the maximum% of delivered weight \nin excess of permissible depth of discontinuities for \n1586 ",
  "words": [],
  "tableCount": 0,
  "noteCount": 0,
  "tabulaTablesPath": "tables_tabula/page-1640.json",
  "tabulaTablesCsv": "tables_tabula/page-1640.csv",
  "tabulaTableCount": 0,
  "bestTextPath": "best_text/pages/page-1640.txt",
  "bestTextSource": "pass1",
  "bestTextLength": 3261,
  "bestTextAlphaRatio": 0.7593
}