[
  {
    "rows": [
      [
        "",
        "Latest",
        "",
        ""
      ],
      [
        "ASME  Material",
        "Adopted",
        "",
        "All Acceptable Editions"
      ],
      [
        "Specifications",
        "[Note  [1])",
        "Description [Note (2)]",
        "[Note  (3)], [Note  (4)1"
      ],
      [
        "SA/JIS  G3118",
        "2017",
        "Identical except for marking, trace elements, plates produced by TMCP,",
        "2000  through 2017"
      ],
      [
        "",
        "",
        "steelmaking process,  test reports,  mechanical properties, repair",
        ""
      ],
      [
        "",
        "",
        "welding,  and inspection as shown in the specification. Annex,",
        ""
      ],
      [
        "",
        "",
        "supplementary quality requirements, does  not apply.",
        ""
      ],
      [
        "SA/JIS  G4303",
        "2012",
        "Identical except for  marking,  dimensions,  mechanical  properties, test",
        "1998 through 2012"
      ],
      [
        "",
        "",
        "reports, and mechanical testing as  shown in the specification.",
        ""
      ],
      [
        "SA/JIS  G5504",
        "2005",
        "Identical except for  marking, mechanical properties, test reports, and",
        ""
      ],
      [
        "",
        "",
        "repairs as  shown in the specification.",
        ""
      ],
      [
        "",
        "GENERAL NOTE:  The source standards for specifications listed in this table are produced by standards organizations from around",
        "",
        ""
      ],
      [
        "the world with the exclusion of ASTM.  The  date of publication of the European standards considered in this table is the year of",
        "",
        "",
        ""
      ],
      [
        "",
        "approval of the standard by CEN.  This  date appears in the body of the standard on the page starting with EN;  dates appearing",
        "",
        ""
      ],
      [
        "",
        "on the front page of an XX EN standard ( e.g., XX= BS or NF or DIN) correspond only to the date of adoption by each member country.",
        "",
        ""
      ],
      [
        "NOTES:",
        "",
        "",
        ""
      ],
      [
        "",
        "(1)  This refers to the edition of the source standard currently adopted by BPV  II.  The source standards for ASME  material speci",
        "",
        ""
      ],
      [
        "",
        "fications  listed in this table are ones from  standards organizations other than ASTM  International.",
        "",
        ""
      ],
      [
        "",
        "(2)  This  refers to  differences  between the ASME  material specification and the source standard.",
        "",
        ""
      ],
      [
        "",
        "(3)  This refers to acceptable editions of the corresponding non-ASTM specifications. Ellipses in this column indicate that there are",
        "",
        ""
      ],
      [
        "",
        "not any other acceptable editions.",
        "",
        ""
      ],
      [
        "",
        "( 4)  BPVC II Committee has taken the position that a reapproval is technically and substantively identical to the base edition. There",
        "",
        ""
      ],
      [
        "",
        "fore,  for the purposes of ASME  construction, a reapproval shall be considered acceptable for use, even if the edition is beyond",
        "",
        ""
      ]
    ]
  }
]