[
  {
    "rows": [
      [
        "",
        "TABLE  X3.1  Typical  Hardness  Values",
        ""
      ],
      [
        "",
        "Norn  1-The hardness  values  shown  are  at  the  time  of shipment.",
        ""
      ],
      [
        "",
        "Norn 2-Tests for hardness shall be  conducted in  accordance  with the",
        ""
      ],
      [
        "requirements  of Test Methods  EIS.",
        "",
        ""
      ],
      [
        "",
        "Norn  3-The hardness  values  are  Rockwell  B  scale  as  measured  or",
        ""
      ],
      [
        "",
        "converted from  the  appropriate Rockwell  scales.",
        ""
      ],
      [
        "",
        "Norn  4-The typical  hardness  values  apply  to  the  full  range  of steel •",
        ""
      ],
      [
        "",
        "sheet  thickness.  Hardness  tends  to  increase  as  the  steel  sheet  thickness",
        ""
      ],
      [
        "decreases.",
        "",
        ""
      ],
      [
        "",
        "Norn  5-Hardness  testing  is  commonly  nsed",
        "to  assess \nthe  relative"
      ],
      [
        "",
        "fmmability  of various  designations  of uncoated  steel  sheet.  This  assess",
        ""
      ],
      [
        "",
        "ment done by many users is recognized to be only an approximation of the",
        ""
      ],
      [
        "relative",
        "formability  and",
        "therefore  cannot  be  used  as \na  specification"
      ],
      [
        "requirement.",
        "",
        ""
      ],
      [
        "",
        "Designation",
        "Hardness-Rockwell  B Scale"
      ]
    ]
  },
  {
    "rows": [
      [
        "(2) Relabeled Footnote J of Table  1 and Footnote G of Table 2 \n( 1) Removed  titanium  equation  from  Footnote  C  of Tables  1"
      ],
      [
        "as  Footnote C in Tables  1 and  2."
      ],
      [
        "ASTM International takes no position respecting  the  validity of any patent rights  asserted in connection  with  any item mentioned"
      ],
      [
        "in  this standard.  Users of this standard are expressly advised that determination of the validity of any such patent rights,  and the risk"
      ],
      [
        "of infringement of such rights,  are entirely their own  responsibility."
      ],
      [
        "This standard is subject to revision at any time by the responsible technical committee and must be reviewed every five years and"
      ],
      [
        "if not revised,  either reapproved or withdrawn.  Your comments are invited either for revision of this standard or for additional standards"
      ],
      [
        "and should be addressed to ASTM International Headquarters.  Your comments will receive careful consideration at a meeting of the"
      ],
      [
        "responsible  technical committee,  which you may attend.  If you feel that your comments have not received a fair hearing you should"
      ],
      [
        "make your views  known  to  the ASTM Committee  on  Standards,  at the  address shown below."
      ],
      [
        "This standard is copyrighted by ASTM International,  100 Barr Harbor Drive,  PO Box C700,  West Conshohocken,  PA  19428-2959,"
      ],
      [
        "United  States. \nIndividual  reprints  (single  or multiple  copies)  of this  standard  may be  obtained by contacting ASTM at the  above"
      ],
      [
        "address  or  at  610-832-9585 \n(phone), \n610-832-9555 \n(fax),  or  service@astm.org \n(e-mail);  or \nthrough \nthe  ASTM  website"
      ],
      [
        "(www.astm.org).  Permission  rights \nto  photocopy  the  standard  may  also  be  secured  from \nthe  Copyright  Clearance  Center,  222"
      ],
      [
        "Rosewood Drive,  Danvers,  MA  01923,  Tel:  (978)  646-2600;  http://www.copyright.com/"
      ]
    ]
  }
]