[
  {
    "rows": [
      [
        "ASME  BPVC.II.A-2025 \nSA-358/SA-358M"
      ],
      [
        "with their centers parallel to  the  material  surface  and not over \n16.2  For  Class  5  pipe, \nthe  welded  joints  shall  be  spot"
      ],
      [
        "1 in.  [25  mm]  apart.  The centers  of the  specimens  adjacent to \nradiographed to  the extent of not less  than  12 in.  [300 mm]  of"
      ],
      [
        "material  surfaces  shall  not  exceed  5/s  in.  [16  mm]  from  the \nradiograph per 50  ft  [15  m]  of weld."
      ],
      [
        "surface."
      ],
      [
        "16.3  For Classes  1,  3,  and 4 pipe, radiographic examination"
      ],
      [
        "14.4  The test specimens shall not be cut from the pipe or test \nshall  be  in  accordance  with  the  requirements  of the  ASME"
      ],
      [
        "plate until  after final  heat  treatment. \nBoiler  and  Pressure  Vessel  Code,  Section  VIII,  latest  edition,"
      ],
      [
        "Paragraph UW-51."
      ],
      [
        "15.  Mechanical Tests  Required"
      ],
      [
        "16.4  For Class 5 pipe,  radiographic examination shall be in"
      ],
      [
        "15.1  For \nthe  purposes  of \nthe \ntension \nand  bend \ntest"
      ],
      [
        "accordance  with  the  requirements  of  the  ASME  Boiler  and"
      ],
      [
        "requirements,  the  term  \"lot\"  shall  mean  all  pipe  of the  same"
      ],
      [
        "Pressure Vessel  Code,  Section VIII,  Division  1,  latest edition,"
      ],
      [
        "grade,  permitted to include more than one heat of steel, within"
      ],
      [
        "Paragraph UW-52."
      ],
      [
        "a  3/16-in  [4.7-mm]  range  of thickness  and  welded to  the  same"
      ],
      [
        "16.5  Radiographic \nexamination \nis  permitted \nto  be  per"
      ],
      [
        "weld  procedure,  and  when  heat  treated,  done  so  to  the  same"
      ],
      [
        "formed  prior to  heat treatment."
      ],
      [
        "heat-treating procedure and in the same furnace. The maximum"
      ],
      [
        "lot size  shall be 200 linear ft  [60  m]  of pipe."
      ],
      [
        "17.  Lengths"
      ],
      [
        "15.1.1  Transverse  Tension  Test-One  test  shall  be  made to"
      ],
      [
        "17 .1  Circumferentially welded joints of the same quality as"
      ],
      [
        "represent each  lot of finished  pipe."
      ],
      [
        "the longitudinal joints shall be permitted by agreement between"
      ],
      [
        "15.1.2  Transverse  Guided-Bend  Weld  Test-One  test  (two"
      ],
      [
        "the  manufacturer  and  the purchaser."
      ],
      [
        "specimens) shall be made to represent each lot of finished pipe."
      ],
      [
        "18.  Product Marking"
      ],
      [
        "15.2  Hydrostatic  Test-Each  length  of pipe  shall  be  sub"
      ],
      [
        "jected  to  a  hydrostatic  test  in  accordance  with  Specification \n18.1 \nIn addition  to  the  marking  prescribed in  Specification"
      ],
      [
        "A999/A999M,  unless  specifically  exempted  under  the  provi \nA999/A999M, \nthe  markings  on  each \nlength  of  pipe  shall"
      ],
      [
        "sion  of  15.3.  Pressure  shall  be  held  for  a  sufficient  time  to \ninclude the plate material designations as shown in Table 1, the"
      ],
      [
        "permit the inspector to examine the entire length of the welded \nmarking requirements of 6.3  and  15.3,  and Class  1,  2,  3,  or 4,"
      ],
      [
        "seam. \nas  appropriate  (see  1.3)."
      ],
      [
        "15.3  The purchaser, with the agreement of the manufacturer, \n18.2 \nBar Coding-In addition to the requirements in 18.1,"
      ],
      [
        "is  permitted to  complete the hydrostatic test requirement with \nbar  coding \nis  acceptable  as  a  supplementary \nidentification"
      ],
      [
        "the  system pressure test,  performed  at  a pressure  either lower \nmethod.  Bar coding should be consistent with the Automotive"
      ],
      [
        "or  higher  than  the  specification  test  pressure,  but  in  no  case \nIndustry  Action  Group \n(AIAG) \nstandard  prepared  by \nthe"
      ],
      [
        "shall the test pressure be lower than the system design pressure. \nPrimary Metals  Subcommittee of the AIAG Bar Code Project"
      ],
      [
        "Each length of pipe furnished without the completed manufac \nTeam."
      ],
      [
        "turer's  hydrostatic \ntest \nshall \ninclude  with \nthe  mandatory"
      ],
      [
        "19.  Keywords"
      ],
      [
        "marking  the letters  \"NH.\""
      ],
      [
        "19 .1 \narc  welded \nsteel  pipe; \naustenitic \nstainless \nsteel;"
      ],
      [
        "16.  Radiographic Examination"
      ],
      [
        "chromium-nickel steel; fusion welded steel pipe; high tempera"
      ],
      [
        "16.1  For Classes  1,  3,  and 4 pipe,  all welded joints shall be \nture  application;  steel  pipe;  temperature  service  applications;"
      ],
      [
        "completely examined by radiography. \nhigh;  welded  steel pipe"
      ]
    ]
  },
  {
    "rows": [
      [
        "Sl.  Product Analysis",
        "S3.  Penetrant  Oil  and  Powder Examination"
      ],
      [
        "S 1.1  Product analysis shall be made on each length of pipe.",
        "S3.1  All welded joints shall be subjected to examination by"
      ],
      [
        "Individual lengths  failing  to  conform to  the  chemical  compo",
        "a penetrant oil and powder method.  The details  of the  method"
      ],
      [
        "sition requirements  shall be rejected.",
        "and  the  disposition  of  flaws  detected  shall  be  a  matter  for"
      ],
      [
        "",
        "agreement between the purchaser and  the  manufacturer."
      ],
      [
        "S2.  Tension  and Bend Tests",
        ""
      ],
      [
        "",
        "S4.  Ferrite Control in Weld  Deposits"
      ],
      [
        "S2.1  Tension tests  (Section  12)  and bend tests  (Section  13)",
        ""
      ],
      [
        "shall be  made  on specimens  to  represent each length of pipe.",
        "S4.1  The ferrite  content of the deposited weld metal in  any"
      ],
      [
        "Failure of any  test specimen to  meet the requirements shall be",
        "length  of  pipe  shall  be  determined.  The  procedural  details"
      ],
      [
        "cause for  the rejection of the  pipe  length represented.",
        "pertaining  to \nthis  subject  (that  is,  welding;  plate  and  weld"
      ]
    ]
  }
]