[
  {
    "rows": [
      [
        "11.  Mechanical Tests  Required",
        "final  heat  treatment  is  in  a  continuous  furnace,  a  lot  shall"
      ],
      [
        "",
        "include all tubes  of the  same size and heat,  heat treated in the"
      ],
      [
        "11.1  Flattening  Test:",
        ""
      ],
      [
        "",
        "same  furnace,  at \nthe  same \ntemperature, \ntime  at  heat,  and"
      ],
      [
        "11.1.1  For  Grade  A,  one  flattening  test  shall  be  made  on",
        ""
      ],
      [
        "",
        "furnace  speed."
      ],
      [
        "specimens  from  each of two  tubes  from  each lot  (Note  2)  or",
        ""
      ],
      [
        "fraction  thereof,  and  from  each  2000  ft  [600  m]  or  fraction",
        "test \n11.5  Reverse  Flattening  Test-One  reverse  flattening"
      ],
      [
        "thereof of safe-end material.",
        "shall be made on  each  1500 ft  [450  m]  of finished  tubing."
      ],
      [
        "11.1.2  For Grades C and D, one flattening test shall be made",
        ""
      ],
      [
        "",
        "11.6  Hydrostatic  or  Nondestructive  Electric  Test-Each"
      ],
      [
        "on specimens from each of two tubes from each lot (Note 2) or",
        ""
      ],
      [
        "",
        "tube  shall be subjected to  either the hydrostatic or the  nonde"
      ],
      [
        "fraction  thereof.",
        ""
      ],
      [
        "",
        "structive electric test. The purchaser may  specify which test is"
      ],
      [
        "11.2  Flange  Test:",
        "to  be  used."
      ],
      [
        "11.2.1  For  Grade  A,  one \nflange \ntest  shall  be  made  on",
        ""
      ],
      [
        "",
        "12.  Forming Operations"
      ],
      [
        "specimens  from  each of two  tubes  from:  each lot  (Note  2)  or",
        ""
      ],
      [
        "",
        "12.1  When \ninserted \nin \nthe  boiler, \ntubes  shall  withstand"
      ],
      [
        "fraction  thereof,  and  from  each  2000  ft  [600  m]  or  fraction",
        ""
      ],
      [
        "",
        "expanding  and  beading  without  showing  cracks  or  flaws,  or"
      ],
      [
        "thereof of safe-end material.",
        ""
      ],
      [
        "",
        "opening at the weld.  When properly manipulated,  superheater"
      ],
      [
        "11.2.2  For Grades C and D, one flange test shall be made on",
        ""
      ],
      [
        "",
        "tubes  shall withstand all forging,  welding,  and bending opera"
      ],
      [
        "specimens  from  each of two  tubes  from  each  lot (Note  2)  or",
        ""
      ],
      [
        "",
        "tions  necessary for  application without developing  defects."
      ],
      [
        "fraction  thereof. The width of the flange  shall not be less than",
        ""
      ],
      [
        "75 % of that specified in Specification A450/A450M.",
        ""
      ],
      [
        "",
        "13.  Product Marking"
      ],
      [
        "required  by \nthe \n11.3  Crush  Test-For  Grade  A,  when",
        "13.1  In  addition  to  the  marking prescribed in Specification"
      ],
      [
        "purchaser,  one  crush  test  shall  be  made  on  specimens  from",
        "A450/ A450M,  the letters \"ERW''  shall be legibly stenciled on"
      ],
      [
        "each of two  tubes  from  each lot (Note 2)  or fraction  thereof,",
        "each tube, or marked on a tag attached to the bundle or box in"
      ],
      [
        "and from each 2000  ft  [600 m]  or fraction thereof of safe-end",
        "which the tubes  are  shipped."
      ],
      [
        "material.",
        ""
      ],
      [
        "",
        "13.2  The  manufacturer's  name  or  symbol  may  be  placed"
      ],
      [
        "11.4  Tension  Test-For  Grades  C  and  D,  one  tension  test",
        "permanently on  each tube  by  rolling  or light stamping  before"
      ],
      [
        "shall be made on specimens from each of two tubes from each",
        "normalizing.  If a single  stamp  is  placed on  the  tube by hand,"
      ],
      [
        "lot.  The  term  lot  for  tension  test  requirements  applies  to  all",
        "this mark should not be less than 8 in.  [200 mm]  from one end"
      ],
      [
        "tubes  prior to  cutting,  of the same nominal diameter  and  wall",
        "of the  tube."
      ],
      [
        "thickness,  which  are  produced  from  the  same  heat  of steel.",
        ""
      ],
      [
        "",
        "14.  Keywords"
      ],
      [
        "When final heat treatment is in a batch-type furnace,  a lot shall",
        ""
      ],
      [
        "include  only  those  tubes  of the  same  size  and  the  same  heat",
        "14.1  boiler  tube;  resistance  welded  steel  tube;  steel  tube,"
      ],
      [
        "which  are  heat treated in  the  same furnace  charge.  When  the",
        "carbon;  welded steel tube"
      ]
    ]
  }
]