[
  {
    "rows": [
      [
        "SA-524/SA-524M \nASME  BPVC.II.A-2025"
      ],
      [
        "16.  Test  Specimens  and  Methods  of Testing \n14.2.1  The  defect  may  be  removed  by  grinding  provided"
      ],
      [
        "that  the  remaining  wall  thickness  is  within  specified limits."
      ],
      [
        "16.1  Specimens  cut  either \nlongitudinally  or \ntransversely"
      ],
      [
        "14.2.2  Repaired \nin  accordance  with \nthe \nrepair  welding"
      ],
      [
        "shall  be  acceptable for  the  tension  test."
      ],
      [
        "provisions  of 14.6."
      ],
      [
        "16.2  Test specimens for the bend test specified in 9.2 and for"
      ],
      [
        "14.2.3  The section of pipe containing the defect may be cut"
      ],
      [
        "the  flattening \ntests  specified  in  Section  10  shall  consist  of"
      ],
      [
        "off within the  limits  of requirements  on length."
      ],
      [
        "sections cut from a pipe. Specimens for flattening tests shall be"
      ],
      [
        "14.2.4  Rejected."
      ],
      [
        "smooth on the ends and free from burrs, except when made on"
      ],
      [
        "14.3  To  provide  a  workmanlike  finish  and  basis  for  evalu"
      ],
      [
        "crop  ends."
      ],
      [
        "ating  conformance  with  14.2, \nthe  pipe  manufacturer  shall"
      ],
      [
        "16.3  Test specimens for the bend test specified in 9.2.2 shall"
      ],
      [
        "remove by grinding the following  noninjurious imperfections:"
      ],
      [
        "be cut from one end of the pipe and, unless otherwise specified,"
      ],
      [
        "14.3.1  Mechanical marks,  abrasions  (Note 5),  and  pits,  any"
      ],
      [
        "shall be taken in a transverse direction. One test specimen shall"
      ],
      [
        "of which imperfections  are  deeper than  1/16  in.  (1.58  mm)."
      ],
      [
        "be  taken as  close  to  the  outer  surface  as  possible  and  another"
      ],
      [
        "NoTE 5-Marks and abrasions are defined as cable marks, dinges, guide"
      ],
      [
        "from  as  close to  the  inner surface  as  possible.  The  specimens"
      ],
      [
        "marks,  roll  marks,  ball  scratches,  scores,  die  marks,  and the  like."
      ],
      [
        "shall be either  ½ by  ½ in.  [12.7  mm]  in section or  1 by  ½ in."
      ],
      [
        "14.3.2  Visual imperfections, commonly refetTed to  as  scabs, \n[25.4  by  12.7  mm]  in  section  with  the  corners  rounded  to  a"
      ],
      [
        "seams,  laps,  tears,  or  slivers,  found  by  exploration  in  accor"
      ],
      [
        "radius  not  over  1/16  in.  [1.6  mm]  and  need  not  exceed  6  in."
      ],
      [
        "dance  with  14.1  to  be  deeper  than  5 %  of the  nominal  wall \n[152 mm]  in  length. The side of the  samples placed in tension"
      ],
      [
        "thickness. \nduring the bend shall be  the side closest to the inner and outer"
      ],
      [
        "surface  of the pipe respectively. \n14.4  At the  purchaser's  discretion,  pipe  shall  be  subject to"
      ],
      [
        "rejection if surface imperfections acceptable under 14.2 are not"
      ],
      [
        "17.  Lengths \nscattered,  but  appear  over  a  large  area  in  excess  of  what  is"
      ],
      [
        "considered a workmanlike finish.  Disposition of such pipe shall"
      ],
      [
        "17 .1  Pipe lengths  shall be in accordance with the  following"
      ],
      [
        "be  a  matter  of agreement  between  the  manufacturer  and  the"
      ],
      [
        "regular practice:"
      ],
      [
        "purchaser."
      ],
      [
        "17 .1.1  The lengths required  shall  be  specified in  the  order,"
      ],
      [
        "and \n14.5  When \nimperfections  or  defects \nare \nremoved  by"
      ],
      [
        "17 .1.2  No jointers are permitted unless  otherwise specified. \ngiinding,  a smooth curved surface shall be maintained, and the"
      ],
      [
        "wall  thickness  shall  not be  decreased below that permitted by"
      ],
      [
        "17.2  If  definite \nlengths  are  not \nrequired,  pipe  may  be"
      ],
      [
        "this specification. The outside diameter at the point of grinding"
      ],
      [
        "ordered in single random lengths  of 16  to  22 ft  [4.9 to  6.7  m],"
      ],
      [
        "may  be reduced  by  the  amount so  removed."
      ],
      [
        "with 5 % 12 to  16 ft [3.7 to 4.9 m], or in double random lengths"
      ],
      [
        "14.5.1  Wall  thickness  measurements  shall  be  made  with  a"
      ],
      [
        "with  a  minimum  average  of  35  ft  [10.7  m]  and  a  minimum"
      ],
      [
        "mechanical  caliper  or  with  a  properly  calibrated  nondestruc"
      ],
      [
        "length of 22  ft  [6.7  m]  with 5 % 16  to  22  ft  [4.9  to  6.7  m]."
      ],
      [
        "tive testing device of appropriate  accuracy.  In  case of dispute,"
      ],
      [
        "the measurement determined by use  of the  mechanical caliper \n18.  Rejection"
      ],
      [
        "shall  govern."
      ],
      [
        "18.1  Each  length  of  pipe  that  develops  injurious  defects"
      ],
      [
        "14.6  Weld  repair  shall  be  permitted  only  subject  to \nthe \nduring shop working or application operations will be rejected,"
      ],
      [
        "approval of the purchaser and in accordance with Specification \nand the manufacturer shall be notified. No rejections under this"
      ],
      [
        "A530/A530M. \nor  any  other  specifications  shall  be  marked  as  specified  in"
      ],
      [
        "14.7  The  finished  pipe  shall be reasonably  straight. \nSection  19  for  sale under this  specification except where  such"
      ],
      [
        "~ - - - - - - - - - - - - - - -__ ___ __________  _:]2i]2e  fails  to  comply  with  the  weight  requirements  alone,  in"
      ],
      [
        "15.  Number of Tests  and  Retests \nwhich case it may  be sold under the weiglit speclficafions with---"
      ],
      [
        "15.1  One of either of the tests  specified in 9.1  shall be made \nwhich  it does  comply."
      ],
      [
        "on one length  of pipe from  each lot (Note 2)."
      ],
      [
        "19.  Product Marking"
      ],
      [
        "15.2  For  pipe  NPS  2  [DN  50)  and  under, \nthe  bend  test"
      ],
      [
        "19.1 \nIn  addition  to  the  marking  prescdbed in  Specification \nspecified in 9.2 shall be made on one pipe from each lot (Note"
      ],
      [
        "A530/A530M,  the  marking  shall  include  the  hydrostatic  test \n2).  The bend tests  specified in 9.2.2  shall be made on  one  end"
      ],
      [
        "pressure  when  tested or the  letters  \"NH\"  when not tested,  the \nof each pipe."
      ],
      [
        "length  and  schedule  number,  and  on  pipe  sizes  larger  than"
      ],
      [
        "15.3  The  flattening \ntest  specified  in  Section  10  shall  be"
      ],
      [
        "NPS  4  [DN  100]  the  weight  shall  be  given.  Length  shall  be"
      ],
      [
        "made  on  one length  of pipe from each lot (Note  2)."
      ],
      [
        "marked in feet  and  tenths  of a foot,  or metres  to  two  decimal"
      ],
      [
        "15.4  Retests \nshall  be \nin  accordance  with  Specification"
      ],
      [
        "places,  depending  on \nthe  units \nto  which  the  material  was"
      ],
      [
        "A530/A530M  and  as  provided in  15.5  and  15.6."
      ],
      [
        "ordered,  or other marking  subject to  agreement."
      ],
      [
        "15.5  If a  specimen  breaks  in  an  inside  or  outside  snrface"
      ],
      [
        "19.2  Bar  Coding-In addition  to  the  requirements  in  19.1,"
      ],
      [
        "flaw,  a retest shall  be  allowed."
      ],
      [
        "bar  coding \nis \nacceptable  as \na  supplemental \nidentification"
      ],
      [
        "method.  The purchaser may  specify in the  order a specific bar \n15.6  Should  a  crop  end  of  a  finished  pipe  fail \nin \nthe"
      ],
      [
        "coding  system to  be used. \nflattening  test,  one retest  may be made  from  the  broken end."
      ]
    ]
  }
]