[
  {
    "rows": [
      [
        "ASME  BPVC.II.A-2025 \nSA-249 /SA-249M"
      ],
      [
        "13.7  Grain  Size-Grain  size  determinations  on  grades \nA1016M. Wall thickness tolerances shall be ±10 % ofnominal"
      ],
      [
        "TP309H, TP309HCb,  TP310H  and TP310HCb  shall be made \nwall for  all tubing  sizes."
      ],
      [
        "on  the  same  number  of tubes  as  prescribed for  the  flattening"
      ],
      [
        "14.2  The  wall  thickness  of the  weld  shall  not  exceed  the"
      ],
      [
        "test."
      ],
      [
        "wall thickness measured 90°  from the weld by more than 6 %"
      ],
      [
        "of the  specified wall  thickness  or 0.004 in.  [0.1  mm],  which \n13.8  Heavily cold worked tubes (HCW) shall be capable of"
      ],
      [
        "ever is  greater. \npassing the -weld decay test listed in Supplementary S7  with a"
      ],
      [
        "14.2.1  Requirements of 14.2 are not applicable when any of \nweld metal to  base metal loss ratio  of 0.90 to  1.10. The test is"
      ],
      [
        "the following  apply: \nnot required unless  S7  is  specified in the  purchase  order."
      ],
      [
        "14.2.1.1  When the specified wall thickness exceeds 12 % of"
      ],
      [
        "13.9  Lot Definitions:"
      ],
      [
        "the  specified outside  diameter;"
      ],
      [
        "13.9.1  For flattening  and  flange  requirements,  the  term lot"
      ],
      [
        "14.2.1.2  When  the  specified  wall  thickness  exceeds  0.165"
      ],
      [
        "applies  to  all  tubes  prior to  cutting  of the  same  nominal  size"
      ],
      [
        "in.  [4.2  mm];"
      ],
      [
        "and wall thickness  which are produced from  the  same heat of"
      ],
      [
        "14.2.1.3  When the specified OD exceeds 3 in.  [76.2 mm]; or"
      ],
      [
        "steel. When final heat treatment is in a batch-type furnace,  a lot"
      ],
      [
        "14.2.1.4  When the  specified minimum yield strength given"
      ],
      [
        "shall  include  only those  tubes  of the  same  size  and  from  the"
      ],
      [
        "in Table 3 for the specified grade is 35 ksi [240 MPa] or greater."
      ],
      [
        "same heat which are  heat treated in the  same furnace  charge."
      ],
      [
        "When  the  final  heat treatment is  in  a continuous  furnace,  the \n15.  Workmanship,  Finish, and Appearance"
      ],
      [
        "number of tubes  of the  same size and from the same heat in a"
      ],
      [
        "15.1  Finished tubes shall have smooth ends free of burrs and"
      ],
      [
        "lot shall be determined from the size of the tubes as prescribed"
      ],
      [
        "shall not deviate from straightness by more than 0.030 in.  [0.8"
      ],
      [
        "in Table  4."
      ],
      [
        "mm]  in 3 ft  [900  mm]  of length."
      ],
      [
        "13.9.2  For tension and hardness test requirements, the term"
      ],
      [
        "16.  Surface  Condition \nlot  applies  to  all  tubes  prior  to  cutting,  of the  same  nominal"
      ],
      [
        "diameter and wall thickness which are produced from the same \n16.1  The  tubes,  after  final  heat  treatment,  shall  be  chemi"
      ],
      [
        "heat  of  steel.  When  final  heat  treatment  is \nin  a  batch-type \ncally descaled or pickled free of scale.  When bright annealing"
      ],
      [
        "furnace,  a  lot  shall include  only  those  tubes  of the  same  size \nis used,  pickling  or chemical descaling is  not necessary."
      ],
      [
        "and the  same heat which  are heat treated in the  same furnace"
      ],
      [
        "17.  Forming Operations"
      ],
      [
        "charge.  When \nthe \nfinal  heat  treatment \nis \nin  a  continuous"
      ],
      [
        "17 .1  Tubes when inserted in the boiler shall stand expanding \nfurnace,  a lot shall include all tubes of the same size and heat,"
      ],
      [
        "and beading without showing cracks or flaws.  All tubes,  when \nannealed in the same furnace at the same temperature,  time at"
      ],
      [
        "properly  manipulated,  shall  be  able  to  stand  expanding  and \nheat,  and furnace  speed."
      ],
      [
        "beading without showing cracks and flaws,  and also shall stand"
      ],
      [
        "14.  Permissible Variations in Dimensions \nall  forging,  welding,  and  bending  operations  necessary  for"
      ],
      [
        "application without developing  defects."
      ],
      [
        "14.1  Dimensional  tolerances  other than  wall  thickness  tol"
      ],
      [
        "erances  shall  be \nin  accordance  with  Specification  A1016/"
      ],
      [
        "18.  Product Marking"
      ],
      [
        "18.1  In addition to  the  marking  prescribed in  Specification"
      ],
      [
        "Al016/Al016M,  the  marking  for  Grades  TP304H,  TP309H,"
      ],
      [
        "TABLE  4 Number of Tubes  in a Lot Heat Treated  by the"
      ],
      [
        "Continuous Process \nTP309HCb, TP310H, TP310HCb, TP316H, TP321H, TP347H,"
      ],
      [
        "TP348H,  N08810,  and  N08811 \nshall  also \ninclude  the  heat \nSize of Tube \nSize of Lot"
      ],
      [
        "number and the  heat-treatment lot identification. \n2 in.  [50.8 mm] and  over in  outside \nnot more than  50 tubes"
      ],
      [
        "diameter and  0.200 in.  [5.1  mm]  and  over"
      ],
      [
        "19.  Keywords \nin wall thickness"
      ],
      [
        "Less than  2 in.  [50.8  mm] but over 1 in. \nnot more than  75 tubes"
      ],
      [
        "19.1  austenitic  stainless  steel; boiler tubes;  condenser tube;"
      ],
      [
        "[25.4 mm]  in  outside diameter or over 1 in."
      ],
      [
        "[25.4 mm] in  outside diameter and  under \nheat exchanger tube;  high  temperature  applications;  N08800;"
      ],
      [
        "0.200 In.  [5.1  mm]  in wall thickness"
      ],
      [
        "N08810;  N08811;  steel  tube;  superheater  tubes;  temperature"
      ],
      [
        "1 In.  [25.4 mm] or less in  outside diameter \nnot more than  125"
      ],
      [
        "service  applications,  high;  welded  steel tube  and heavily cold \ntubes"
      ]
    ]
  }
]