[
  {
    "rows": [
      [
        "requirements shall be cause for rejection.",
        "rejected tubing shall be a matter of agreement between the"
      ],
      [
        "NoIB 1-Ferritic stainless steels may be expanded by other methods but",
        "manufacturer and the purchaser."
      ],
      [
        "the user should exercise precautions when using methods other than roll",
        ""
      ],
      [
        "expansion as these grades have a higher ductile-brittle transition",
        "17 .2 Material that fails in any of the fanning operations or"
      ],
      [
        "temperature, are more strain rate sensitive, and have lower ductility than",
        "in the process of installation and is found to be defective, shall"
      ],
      [
        "austenitic grades.",
        "be set aside, and the manufacturer shall be notified. Disposition"
      ],
      [
        "13.2 The residual chloride salt contamination of the inside",
        "of such material shall be a matter for agreement between the"
      ],
      [
        "and outside surface of the tubing at the time of packing for",
        "manufacturer and the purchaser."
      ],
      [
        "shipment from the mill shall not exceed a concentration of l",
        ""
      ],
      [
        "mg/ft2 [10.7 mg/m2] of tube surface. One tube in each 500",
        "18. Certification"
      ],
      [
        "pieces shall be checked immediately prior to packing for",
        ""
      ],
      [
        "shipment for chloride salt contamination by a procedure agreed",
        "18.1 A test report, signed by an authorized employee or"
      ],
      [
        "to between the manufacturer and purchaser.",
        "representative of the manufacturer, shall be furnished to the"
      ],
      [
        "",
        "purchaser to indicate the specification and grade, seamless or"
      ],
      [
        "14. Surface Condition",
        "welded, the results of the heat analysis, hardness, and tensile"
      ],
      [
        "14.1 The straight tubes, after final annealing, shall be",
        "properties. Product analysis will be repmted only when re­"
      ],
      [
        "pickled using a solution of nitric and hydrofluoric acids",
        "quested on the purchase order as provided in 9 .1.1."
      ],
      [
        "followed by flushing and rinsing in water. If bright-annealing is",
        ""
      ],
      [
        "performed, this requirement does not apply.",
        "19. Product Marking"
      ],
      [
        "14.1.1 All tubes shall be free of excessive mill scale,",
        "19 .1 All tubes shall be marked with the heat number."
      ],
      [
        "suitable for inspection. A slight amount of oxidation will not be",
        ""
      ],
      [
        "considered as scale. Any special finish requirements shall be",
        "19.2 Containers and packages shall be marked or tagged to"
      ],
      [
        "subject to agreement between the manufacturer and the pur­",
        "show the purchaser's order number, the manufacturer's order"
      ],
      [
        "chaser.",
        "number, specification, seamless or welded, grade, size and wall"
      ],
      [
        "",
        "thickness, minimum or average, number of pieces contained in"
      ],
      [
        "14.2 A light oxide scale on the outside surface of U-bend",
        ""
      ],
      [
        "",
        "the package, and item number (if appropriate)."
      ],
      [
        "area shall be pennitted for tubes that have been electric­",
        ""
      ],
      [
        "resistan.ce heat treated after bending.",
        ""
      ],
      [
        "",
        "20. Packaging"
      ],
      [
        "15. Nondestructive Test (Electric Test)",
        "20.1 All tubing shall be packaged and blocked in such a"
      ],
      [
        "15.1 Each straight tube shall be tested after the finish heat",
        "manner as to prevent damage in ordinary handling and trans­"
      ],
      [
        "treatment by passing it through a nondestructive tester capable",
        "portation. The boxes shall be constructed in such a manner that"
      ],
      [
        "of detecting defects on the entire cross section of the tube in",
        "no nails, staples, screws, or similar fasteners are required to"
      ],
      [
        "accordance with Specification A1016/A1016M.",
        "close and secure the box after the tubes have been placed in the"
      ],
      [
        "",
        "box. The box shall be lined with plastic sheet or vapor barrier"
      ],
      [
        "16. Inspection",
        "materials so as to prevent chloride contamination of the tube"
      ],
      [
        "16.l The inspector representing the purchaser shall have",
        "during handling, transportation, and storage."
      ],
      [
        "entry, at all times, to those areas where inspection and testing",
        ""
      ],
      [
        "",
        "20.2 The U-bent tubes shall be arranged in boxes so that the"
      ],
      [
        "is being performed on the purchaser's ordered material. The",
        ""
      ],
      [
        "",
        "smaller radius bends may be removed without disturbing larger"
      ],
      [
        "manufacturer shall afford the inspector all reasonable facilities",
        ""
      ],
      [
        "",
        "radius bends. Tubes for an item number shall be boxed"
      ],
      [
        "to satisfy the inspector that the material is being furnished in",
        ""
      ],
      [
        "",
        "together."
      ],
      [
        "accordance with this specification. All required tests and",
        ""
      ],
      [
        "inspections shall be made at the place of manufacture prior to",
        ""
      ],
      [
        "",
        "21. Keywords"
      ],
      [
        "shipment, unless otherwise specified, and shall be conducted so",
        ""
      ],
      [
        "as not to interfere unnecessarily with the operation of the",
        "21.1 feedwater heater tubes; ferritic stainless steel; seamless"
      ]
    ]
  }
]