[
  {
    "rows": [
      [
        "fine grain practice and includes microalloying elements such as rolled, or annealed last) (see 4.3).",
        "",
        "",
        "",
        ""
      ],
      [
        "columbium, vanadium, zirconium, and so forth. The steel shall 5.1.4 Finish (see 9.1).",
        "",
        "",
        "",
        ""
      ],
      [
        "be treated to achieve inclusion control. 5.1.5 Oiled or not oiled, as required (see 9.2).",
        "",
        "",
        "",
        ""
      ],
      [
        "4.1.12 Solution Hardened Steel (SHS). 5.1.6 Dimensions (thickness, width, and whether cut lengths",
        "",
        "",
        "",
        ""
      ],
      [
        "or coils). 4.1.13 Bake Hardenable Steel (BHS).",
        "",
        "",
        "",
        ""
      ],
      [
        "4.1.14 Required Hardness Steel (RHS). Norn 1-Not all producers are capable of meeting all the limitations of",
        "",
        "",
        "",
        ""
      ],
      [
        "4.1.15 Full Hard Steel (FHS). the thickness tolerance tables in Specification A568/A568M. The pur­",
        "",
        "",
        "",
        ""
      ],
      [
        "chaser should contact the producer regarding possible limitations prior to",
        "",
        "",
        "",
        ""
      ],
      [
        "4.2 When required for HSLAS and HSLAS-F steels, limi­ placing an order.",
        "",
        "",
        "",
        ""
      ],
      [
        "tations on the use of one or more of the microalloy elements 5.1.7 Coil size (must",
        "include",
        "inside",
        "diameter,",
        "outside"
      ],
      [
        "shall be specified on the order. diameter, and maximum weight).",
        "",
        "",
        "",
        ""
      ],
      [
        "4.3 Cold-rolled steel sheet is supplied for either exposed or 5.1.8 Copper bearing steel (if required).",
        "",
        "",
        "",
        ""
      ],
      [
        "unexposed applications. Within the latter category, cold-rolled 5.1.9 Quantity.",
        "",
        "",
        "",
        ""
      ],
      [
        "sheet is specified either \"temper rolled\" or \"annealed last\" or 5.1.10 Application (part identification and description).",
        "",
        "",
        "",
        ""
      ],
      [
        "\"full hard.\" For details on processing, attributes and 5.1.11 A report of",
        "heat analysis",
        "will",
        "be supplied,",
        "if"
      ],
      [
        "limitations, and inspection standards, refer to Specification requested, for CS, DS, DDS, EDDS, SFS, RHS, and FHS. For",
        "",
        "",
        "",
        ""
      ],
      [
        "A568/A 568M. materials with required mechanical properties,",
        "",
        "",
        "SS, HSLAS,",
        ""
      ],
      [
        "HSLAS-F, SHS, and BHS, a report is required of heat analysis",
        "",
        "",
        "",
        ""
      ],
      [
        "5. Ordering Information and mechanical properties as determined by the tension test.",
        "",
        "",
        "",
        ""
      ],
      [
        "5.1.12 Special requirements (if any).",
        "",
        "",
        "",
        ""
      ],
      [
        "5.1 It is the purchaser's responsibility to specify in the 5. 1.12.1 When the purchaser requires thickness tolerances",
        "",
        "",
        "",
        ""
      ],
      [
        "purchase order all ordering information necessary to describe for 3/s in. [10 mm] minimum edge distance (see Supplementary",
        "",
        "",
        "",
        ""
      ],
      [
        "the required material. Examples of such information include, Requirement in Specification A568/A568M), this requirement",
        "",
        "",
        "",
        ""
      ],
      [
        "but are not limited to, the following: shall be specified in the purchase order or contract.",
        "",
        "",
        "",
        ""
      ],
      [
        "5.1.1 ASTM specification number and year of issue. 5.1.12.2 Tighter requirements can be specified based on",
        "",
        "",
        "",
        ""
      ],
      [
        "5.1.2 Name of material and designation (cold-rolled steel agreement between seller and purchaser.",
        "",
        "",
        "",
        ""
      ],
      [
        "sheet) (include grade, type, and class, as appropriate, for CS,",
        "",
        "",
        "",
        ""
      ],
      [
        "Norn 2-A typical ordering description is as follows:",
        "",
        "",
        "",
        ""
      ],
      [
        "DS, DDS, EDDS, SFS, SS, HSLAS, HSLAS-F, RHS, FHS,",
        "",
        "",
        "",
        ""
      ],
      [
        "ASTM Al008-XX, cold rolled steel sheet, CS Type A, exposed, matte",
        "",
        "",
        "",
        ""
      ],
      [
        "SHS, or BHS) (see 4.1). finish, oiled, 0.035 in. by 30 in. by coil, ID 24 in., OD 48 in., max weight",
        "",
        "",
        "",
        ""
      ],
      [
        "5.1.2.1 When a Chemistry grade is specified in accordance 15 000 lbs, 100 000 lb, for part No. 4560, Door Panel; or",
        "",
        "",
        "",
        ""
      ],
      [
        "with Specification A568/A568M Table X2.3, the grade shall be ASTM A 1008M-XX,",
        "cold-rolled",
        "steel",
        "sheet, SS Grade",
        "275,"
      ]
    ]
  }
]