[
  {
    "rows": [
      [
        "Grades 2 Class 1 and 3 Class 1 8 in. [205 mm], max",
        "",
        "notch shall be normal to the nearest heat-treated surface of the"
      ],
      [
        "Grade 4N Class 2 and 5 Class 2 16 in. [405 mm], max",
        "",
        ""
      ],
      [
        "Grade 4N Class 1 and 5 Class 1 30 in. [760 mm], max",
        "",
        "forging. When Supplementary Requirement S 10 is specified"
      ],
      [
        "Grade 4N Class 3 40 in. [1015 mm], max",
        "",
        "the orientation shall be governed by NB, NC, ND, NE, NF, or"
      ],
      [
        "Grades 3V and 3VCb 20 in. [510 mm], max",
        "",
        ""
      ],
      [
        "",
        "",
        "NG 2300."
      ],
      [
        "Grade 22 Class 3 20 in. [510 mm], max",
        "",
        ""
      ],
      [
        "Grade 22 Classes 4, 5, 6, and 7 12 in. [305 mm], max",
        "",
        "7.2.2 Impact specimens shall be Charpy V-notch as shown"
      ],
      [
        "in Test Methods and Definitions A370. 7.1.6.3 Method 3-Test specimens shall be taken from",
        "a",
        ""
      ],
      [
        "representative separate test forging made from the same heat of",
        "",
        ""
      ],
      [
        "steel and shall receive substantially the same reduction and",
        "",
        "8. Workmanship and Quality Level Requirements"
      ],
      [
        "type of hot working as the production forgings that it represents",
        "",
        "8.1 See requirements in 9.1, 9.2.2, 9.3.1.1, and 9.3.2.2."
      ],
      [
        "and shall have the same Tc as the as-quenched production",
        "",
        ""
      ],
      [
        "forgings. The separate test forging shall be heat treated in the",
        "",
        "9. Nondestructive Inspection Requirements"
      ],
      [
        "same furnace charge and under the same conditions as the",
        "",
        ""
      ],
      [
        "",
        "",
        "9.1 General Requirements-Dimensional and visual"
      ],
      [
        "production forgings. Test specimens shall be removed from the",
        "",
        ""
      ],
      [
        "",
        "",
        "inspections, and magnetic particle and ultrasonic inspection"
      ],
      [
        "region midway between the mid-thickness and the surface, and",
        "",
        ""
      ],
      [
        "",
        "",
        "shall be conducted by the manufacturer. Forgings shall be free"
      ],
      [
        "not closer than Tc to a second heat treated surface with the",
        "",
        ""
      ],
      [
        "",
        "",
        "of cracks, thermal ruptures, or other injurious indications."
      ],
      [
        "same limitation on forging thickness as in 7.1.6.2.",
        "",
        ""
      ],
      [
        "Alternatively, an extra production forging of the same configu­",
        "",
        "9.2 Magnetic Particle Inspection:"
      ],
      [
        "ration (right and left handed configurations being considered",
        "",
        "9.2.1 Following final machining by the manufacturer all"
      ],
      [
        "equivalent) as that ordered, may be tested as described in",
        "",
        "accessible surfaces of each forging shall be examined by the"
      ],
      [
        "Method 2.",
        "",
        "continuous current magnetic particle method. This examination"
      ],
      [
        "7.1.6.4 Method 4-A thermal buffer ring, at least Tc by Tc",
        "",
        "shall be in accordance with Practice A275/A275M unless the"
      ],
      [
        "in cross section, or segments of such a ring at least 3 Tc in",
        "",
        "purchaser has required the use of the AC yoke in accordance"
      ],
      [
        "length, shall be welded to the test\"end of a forging prior to heat",
        "",
        "with Practice A966/A966M instead (see 4.3.1)."
      ],
      [
        "treatment for mechanical properties. The buffer material may",
        "",
        "9.2.2 The following conditions are subject to rejection or"
      ],
      [
        "be any weldable carbon or low-alloy steel and shall be joined",
        "",
        "removal:"
      ],
      [
        "to the forging with a partial-penetration type weld which",
        "",
        "9.2.2.1 Indications with major dimension exceeding 3/16 in."
      ],
      [
        "completely seals the buffered surface. The test coupons shall be",
        "",
        "[4.8 mm]."
      ],
      [
        "removed from the forging in the region buffered by the ring or",
        "",
        "9.2.2.2 Four or more indications exceeding V!6 in. [1.6 mm]"
      ],
      [
        "ring segments. If ring segments are used, the test coupons shall",
        "",
        "in major dimensions that are aligned and separated by V16 in."
      ],
      [
        "be removed from the forging in the area under the buffer ring",
        "",
        "[1.6 mm] or less end to end."
      ],
      [
        "segment at a minimum distance of Tc from each end of that",
        "",
        "9.2.2.3 Ten or more indications exceeding V16 in. [1.6 mm]"
      ],
      [
        "2segment. In either case, the test specimens shall be located at",
        "",
        "in major dimensions contained in any 6 in.2 [39 cm ] of"
      ],
      [
        "a minimum distance of V2 in. [13 mm] from the buffered",
        "",
        "surface, with the major dimension of this area not to exceed"
      ],
      [
        "surface of the forging, and at least V4 Tc from a quenched",
        "",
        "6 in. [150 mm]. The area shall be taken in the most unfavorable"
      ],
      [
        "surface of the forging. Where this method of testing",
        "is",
        "location relative to the indications being evaluated."
      ],
      [
        "employed, the limitations for Tc given in 7.1.6.2 shall gener­",
        "",
        "9.3 Ultrasonic Inspection-Forgings shall be ultrasonically"
      ],
      [
        "ally apply.",
        "",
        "inspected in accordance with the procedures of Practice A388/"
      ]
    ]
  }
]