[
  {
    "rows": [
      [
        "by cutting prior to any subsequent cold work or sizing. specification, retests may be made on additional tubes of"
      ],
      [
        "double the original number from the same group or lot, each of"
      ],
      [
        "12.2 For tubes over 2 in. [50.8 mm] in outside diameter, or"
      ],
      [
        "which shall conform to the requirements specified."
      ],
      [
        "over 0.135 in. [3.44 mm] in wall thickness, the flash on the"
      ],
      [
        "inside of the tubes shall be mechanically removed by cutting to"
      ],
      [
        "16. Retreatment"
      ],
      [
        "a maximum height of 0.010 in. [0.25 mm] at any point on the"
      ],
      [
        "tube. 16.1 If the individual tubes or the tubes selected to represent"
      ],
      [
        "any group or lot fail to conform to the test requirements, the"
      ],
      [
        "12.3 For tubes 2 in. [50.8 mm] and under in outside"
      ],
      [
        "individual tubes or the group or lot represented may be"
      ],
      [
        "diameter and 0.135 in. [3.4 mm] and under in wall thickness,"
      ],
      [
        "retreated and resubmitted for test. Not more than two reheat the flash on the inside of the tube shall be mechanically"
      ],
      [
        "treatments shall be permitted."
      ],
      [
        "removed by cutting to a maximum height of 0.006 in. [0.15"
      ],
      [
        "mm] at any point on the tube."
      ],
      [
        "17. Test Specimens"
      ],
      [
        "13. Straightness and Finish 17 .1 Test specimens shall be taken from the ends of finished"
      ],
      [
        "13.1 Finished tubes shall be reasonably straight and have tubes prior to upsetting, swaging, expanding, or other forming"
      ],
      [
        "smooth ends free of burrs. They shall have a workmanlike operations, or being cut to length. They shall be smooth on the"
      ],
      [
        "finish. Surface imperfections (see Note 1) may be removed by ends and free of burrs and flaws."
      ],
      [
        "grinding, provided that a smooth curved surface is maintained, 17 .2 If any test specimen shows flaws or defective"
      ],
      [
        "and the wall thickness is not decreased to less than that machining, it may be discarded and another specimen substi­"
      ],
      [
        "permitted by this or the product specification. The outside tuted."
      ],
      [
        "diameter at the point of grinding may be reduced by the amount"
      ],
      [
        "so removed. 18. Method of Mechanical Testing"
      ],
      [
        "NoTE 1-An imperfection is any discontinuity or irregularity found in 18.1 The specimens and mechanical tests required shall be"
      ],
      [
        "the tube."
      ],
      [
        "made in accordance with Annex A2 of Test Methods and"
      ],
      [
        "Definitions A370 if inch-pound units are specified or to the 14. Repair by Welding"
      ],
      [
        "requirements described in the applicable track of Test Methods"
      ],
      [
        "14.1 Repair welding of base metal defects in tubing is A1058 if SI units are specified."
      ],
      [
        "permissible only with the approval of the purchaser and with"
      ],
      [
        "the further understanding that the tube shall be marked \"WR\" 18.2 Specimens shall be tested at room temperature."
      ],
      [
        "and the composition of the deposited filler metal shall be 18.3 Small or subsize specimens as described in Test"
      ],
      [
        "suitable for the composition being welded. Defects shall be Methods and Definitions A370 or Test Methods A1058 may be"
      ],
      [
        "thoroughly chipped or ground out before welding and each used only when there is insufficient material to prepare one of"
      ],
      [
        "repaired length shall be reheat treated or stress relieved as the standard specimens. When using small or subsize"
      ],
      [
        "required by the applicable specification. Each length of re­ specimens, the largest one possible shall be used."
      ],
      [
        "paired tube shall be tested hydrostatically as required by the"
      ],
      [
        "product specification. 19. Flattening Test"
      ],
      [
        "19.1 A section of tube not less than 2 1⁄2 in. [63 mm] in"
      ],
      [
        "length for seamless and not less than 4 in. [100 mm] in length"
      ],
      [
        "TABLE 4 Permissible Variations in LengthA"
      ],
      [
        "for welded shall be flattened cold between parallel plates in two"
      ],
      [
        "Method of Outside Cut Length,"
      ],
      [
        "steps. For welded tubes, the weld shall be placed 90° from the"
      ],
      [
        "Manufacture Diameter, in.[mm]"
      ],
      [
        "in.[mm] direction of the applied force (at a point of maximum bending)."
      ],
      [
        "Over Under"
      ],
      [
        "During the first step, which is a test for ductility, no cracks or"
      ],
      [
        "Seamless, hot-finished All sizes 3/,a [5] 0 [OJ"
      ],
      [
        "Seamless, cold- Under 2 [50.8] 1/a [3] 0 [OJ breaks, except as provided for in 19.4, on the inside, outside, or"
      ],
      [
        "finished 2 [50.8] and over 3/,a [5] 0 [OJ end surfaces shall occur in seamless tubes, or on the inside or"
      ]
    ]
  }
]