[
  {
    "rows": [
      [
        "be made from the plate test material to establish a transition",
        "",
        "are applicable, as specified in the purchase order."
      ],
      [
        "curve. The test temperature range shall be wide enough to",
        "",
        ""
      ],
      [
        "establish the upper and lower shelf energies, with sufficient",
        "",
        "S20. Maximum Carbon Equivalent for Weldability"
      ],
      [
        "testing at intermediate temperatures to permit plotting a rea­",
        "",
        "S20.1 Plates shall be supplied with a specific maximum"
      ],
      [
        "sonable smooth curve. A plot of the data is not required. The",
        "",
        "carbon equivalent value. This value shall be based upon the"
      ],
      [
        "manufacturer shall report the specimen orientation, test",
        "",
        "heat analysis. The required chemical analysis as well as the"
      ],
      [
        "temperature, and absorbed energy for each specimen tested.",
        "",
        "carbon equivalent shall be reported."
      ],
      [
        "Lateral expansion and percent shear shall also be reported",
        "",
        "S20.2 The carbon equivalent shall be calculated using the"
      ],
      [
        "when specified in the purchase order. The number of plates",
        "",
        "following formula:"
      ],
      [
        "tested and the specimen orientation shall be the same as in 12.1",
        "",
        ""
      ],
      [
        "",
        "",
        "CE= C+Mn/6+(Cr+Mo+V)/5+(Ni+Cu)/15"
      ],
      [
        "unless otherwise specified in the purchase order.",
        "",
        ""
      ],
      [
        "",
        "",
        "S20.3 The maximum value of the carbon equivalent for"
      ],
      [
        "Sll. Ultrasonic Examination in Accordance with A577/",
        "",
        "carbon steels (including C-Mn, C-Mn-Si, C-Mn-Si-Al steels),"
      ],
      [
        "A577M",
        "",
        "are given in Table S20.1."
      ],
      [
        "Sll.1 All plates shall be ultrasonically examined in accor­",
        "",
        ""
      ],
      [
        "dance with the requirements of Specification A577 IA 577M.",
        "",
        "S21. Restricted Limits on Elements"
      ],
      [
        "",
        "",
        "For each heat, based upon the heat analysis, the content shall"
      ],
      [
        "S12. Ultrasonic Examination in Accordance with A578/",
        "",
        ""
      ],
      [
        "",
        "",
        "not exceed 0.35 % for copper, 0.25 % for nickel, 0.25 % for"
      ],
      [
        "A578M",
        "",
        ""
      ],
      [
        "",
        "",
        "chromium, 0.08 % for molybdenum, or 0.70 % for the sum of"
      ],
      [
        "Sl2.1 All plates shall be ultrasonically examined in accor­",
        "",
        "those four elements."
      ],
      [
        "dance with the requirements of Specification A578/A578M.",
        "",
        ""
      ],
      [
        "The acceptance level shall be as specified in the RUrchase order.",
        "",
        "S22. Through-Thickness Tension Tests"
      ],
      [
        "S13. NDT Temperature Determination",
        "",
        "S22.l Through-thickness tension tests shall be made in"
      ],
      [
        "",
        "",
        "accordance with the requirements of Specification A7 70/"
      ],
      [
        "S13.1 The NDT temperature shall be established in accor­",
        "",
        ""
      ],
      [
        "",
        "",
        "A770M. (See Ordering Information in Specification A770/"
      ],
      [
        "dance with Test Method E208 using coupons from a single",
        "",
        ""
      ],
      [
        "",
        "",
        "A770M for the additional information that may be needed.)"
      ],
      [
        "plate. The number of plates to be so tested shall be subject to",
        "",
        ""
      ],
      [
        "agreement between the purchaser and the manufacturer or",
        "",
        "S24. Strain Age Test"
      ],
      [
        "processor.",
        "",
        ""
      ],
      [
        "",
        "",
        "S24.1 Test coupons shall be given a strain age treatment"
      ],
      [
        "Sl5. Reduction of Area Measurement",
        "",
        "designated by the purchaser. Charpy V-notch tests shall be"
      ],
      [
        "",
        "",
        "conducted on the strain aged specimens. Heat treatment, strain"
      ],
      [
        "S 15 .1 A reduction of area measurement shall be taken while",
        "",
        ""
      ],
      [
        "",
        "",
        "aging, test temperature, and acceptance criteria shall be as"
      ],
      [
        "making the required tension test. Reduction of area shall be",
        "",
        ""
      ],
      [
        "",
        "",
        "agreed upon between the manufacturer or processor and the"
      ],
      [
        "determined only-on the 0.500-in. [12.5-mm] round specimen as",
        "",
        ""
      ],
      [
        "",
        "",
        "purchaser."
      ],
      [
        "shown in Fig. 5 of Test Methods and Definitions A370. The",
        "",
        ""
      ],
      [
        "minimum acceptance limit shall be 40 %.",
        "",
        ""
      ],
      [
        "",
        "",
        "S25. Weldability"
      ],
      [
        "S16. Thermal Stress Relief of Mechanical Test Coupons",
        "",
        "S25.l Weldability tests shall"
      ],
      [
        "S16.1 Test coupons representing the plates shall be ther­",
        "",
        "be conducted. The type of test and the acceptance criteria"
      ],
      [
        "mally stress relieved by gradually and uniformly heating them",
        "",
        "shall be as agreed upon between the manufacturer or processor"
      ]
    ]
  }
]