[
  {
    "rows": [
      [
        "shaped parts up to, and including, NPS 4 can be machined from",
        "those elements specified in the individual product specification."
      ],
      [
        "bar provided that the axial length of the part is approximately",
        "If secondary melting processes are employed, the heat analysis"
      ],
      [
        "parallel to the metal flow lines of the starting stock.",
        "shall be obtained from one remelted ingot, or the product of"
      ],
      [
        "6.1.2 Wrought Seamless Pipe and Tubing-Flanges shall not",
        "one remelted ingot, from each primary melt. The chemical"
      ],
      [
        "be machined directly from seamless pipe or tubing. Other",
        "analysis thus determined shall conform to the requirements of"
      ],
      [
        "hollow cylindrical shaped parts can be machined from seam­",
        "the individual product specification. Note that the product"
      ],
      [
        "less pipe and tubing provided that the axial length of the pa.it",
        "analysis (check analysis) tolerances are not to be applied to the"
      ],
      [
        "is approximately parallel to the metal flow lines of the staiting",
        "Heat Analysis requirements."
      ],
      [
        "stock.",
        "8.3 Product Analysis-If a product analysis is performed it"
      ],
      [
        "",
        "shall be in accordance with Test Methods, Practices, and"
      ],
      [
        "7. Heat Treatment",
        "Terminology A751. Sainples for analysis shall be taken from"
      ],
      [
        "7.1 Material requiring heat treatment shall be treated as",
        "midway between center and surface of solid parts, midway"
      ],
      [
        "specified in the individual product specification using the",
        "between inner and outer surfaces of hollow parts, midway"
      ],
      [
        "following procedures that are defined in more detail in Termi­",
        "between center and surface of full-size prolongations or from"
      ],
      [
        "nology A94 l.",
        "broken mechanical test specimens. The chemical composition"
      ],
      [
        "7.1.1 Annealing-Material shall be uniformly reheated to a",
        "thus determined shall conform to the limits of the product"
      ],
      [
        "temperature above the transformation range and, after holding",
        "specification, within the permissible variations of Table 1 of"
      ],
      [
        "for a sufficient time at this temperature, cooled slowly to a",
        "this specification."
      ],
      [
        "temperature below the transformation range.",
        "8.3.1 Limits on formula calculations involving elemental"
      ],
      [
        "7.1.2 Solution Annealing (or Solution Treat or Treatment)­",
        "contents shall apply only to the heat analysis, unless agreed"
      ],
      [
        "Material shall be heated to a temperature that causes the",
        "upon between supplier and purchaser. Where limits on formula"
      ],
      [
        "chromium cai·bides to go into solution, and then, quenched in",
        "calculations involving elemental contents apply to product"
      ],
      [
        "water or rapidly cooled by other means to prevent re­",
        "analysis by such agreement, permissible variations in the"
      ],
      [
        "precipitation.",
        "formula calculation results beyond the limits for the heat"
      ],
      [
        "7.1.3 Isothermal Annealing-Isothermal annealing shall",
        "analysis shall also be agreed upon between supplier and"
      ],
      [
        "consist of austenitizing a ferrous alloy, and then, cooling to and",
        "purchaser. Examples of such formula calculations include, but"
      ],
      [
        "holding within the range of temperature at which the austenite",
        "are not limited to, the following: carbon equivalent CE = C +"
      ],
      [
        "transfonns to a relatively soft ferrite-carbide aggregate.",
        "Mn/ 6 + (Cr+ Mo + V) / 5 + (Ni + Cu) / 15; J factor= (Mn"
      ],
      [
        "7.1.4 Normalizing-Material shall be uniformly reheated to",
        "+ Si) x (P + Sn) x 104; or requirements for specific elemental"
      ],
      [
        "a temperature above the transformation range, and",
        "balance or sufficiency, typically related to Ti, Nb, or Al and"
      ],
      [
        "subsequently, cooled in air at room temperature.",
        "interstitials C and N, such as Nb = 5 x C minimum."
      ],
      [
        "7.1.5 Tempering and Post-Weld Heat Treatment-Material",
        ""
      ],
      [
        "",
        "9. Mechanical Requirements"
      ],
      [
        "shall be reheated to the prescribed temperature below the",
        ""
      ],
      [
        "transformation range, held at temperature for the greater of 30",
        "9.l Method of Mechanical Tests-All tests shall be con­"
      ],
      [
        "min or 1 h/in. [25 .4 mm] of thickness at the thickest section and",
        "ducted in accordance with Test Methods and Definitions A370"
      ],
      [
        "cooled in still air.",
        "if the inch-pound units are specified or Test Methods A1058 if"
      ],
      [
        "7.1.6 Stress Relieving-Material shall be uniformly heated",
        "the M suffix (SI units) is specified."
      ],
      [
        "to the selected stress relieving temperature, held long enough",
        "9.2 For the purpose of determining conformance to the"
      ],
      [
        "to reduce stresses and then cooled at a rate that will result in the",
        "product specification requirements, specimens shall be ob­"
      ],
      [
        "properties required for the material grade and minimize the",
        "tained from the production forgings, or from separately forged"
      ],
      [
        "development of new residual stresses. The temperature shall",
        "test blanks prepared from the stock used to make the finished"
      ],
      [
        "not vary from the selected temperature by more than :±: 25 °F",
        "product. In either case, mechanical test specimens shall not be"
      ]
    ]
  }
]