[
  {
    "rows": [
      [
        "the following processes: electric-furnace, basic-oxygen, or any",
        "",
        "of which is eight times the nominal diameter of the pipe,"
      ],
      [
        "other commercially viable process.",
        "",
        "without failure."
      ],
      [
        "5.1.2 The steel shall be made to fine grain practice.",
        "",
        "9.2.2 For pipe whose diameter exceeds 25 in. [635 mm] and"
      ],
      [
        "5.1.3 Steel may be cast in ingots or may be strand cast.",
        "",
        "whose diameter to wall thickness ratio is 7.0 or less, bend test"
      ],
      [
        "When steel of different grades are sequentially strand cast,",
        "",
        "specimens shall be bent at room temperature through 180°"
      ],
      [
        "identification of the resultant transition material is required.",
        "",
        "without cracking on the outside of the bent portion. The inside"
      ],
      [
        "The producer shall remove the transition material by any",
        "",
        "diameter of the bend shall be 1 in. [25 .4 mm]. This test shall be"
      ],
      [
        "established procedure that positively separates the grades.",
        "",
        "in place of Section 10."
      ],
      [
        "5.1.4 Pipe NPS 11⁄2  [DN 40] and under may be either hot",
        "",
        "Norn 3-Diameter to wall thickness ratio = specified outside diameter/"
      ],
      [
        "finished or cold drawn.",
        "",
        "nominal wall thickness."
      ],
      [
        "5.1.5 Unless otherwise specified, pipe NPS 2 [DN 50] and",
        "",
        "Example: For 28 in. [710 mm] diameter 5.000 in. [125 mm] thick pipe the"
      ],
      [
        "over shall be furnished hot finished. When agreed upon",
        "",
        "diameter to wall thickness ratio = 28/5 = 5.6."
      ],
      [
        "between the manufacturer and purchaser, cold-drawn pipe may",
        "",
        ""
      ],
      [
        "",
        "",
        "10. Flattening Test Requirements"
      ],
      [
        "be furnished.",
        "",
        ""
      ],
      [
        "",
        "",
        "10.1 For pipe over NPS 2 [DN 50], a section of pipe not less"
      ],
      [
        "5.2 Heat Treatment-All hot-finished and cold-drawn pipe",
        "",
        ""
      ],
      [
        "",
        "",
        "than 21⁄2 in. [63.5 mm] in length shall be flattened cold between"
      ],
      [
        "shall be reheated to a temperature above 1550°F [845°C] and",
        "",
        ""
      ],
      [
        "",
        "",
        "parallel plates until the opposite walls of the pipe meet."
      ],
      [
        "followed by cooling in air or in the cooling chamber of a",
        "",
        ""
      ],
      [
        "",
        "",
        "Flattening tests shall be in accordance with Specification"
      ],
      [
        "controlled atmosphere furnace.",
        "",
        ""
      ],
      [
        "",
        "",
        "A530/A530M, except that in the equation used to calculate the"
      ],
      [
        "6. Chemical Composition",
        "",
        "H~valu8,th?-foll~wing~ constants shall be used:"
      ],
      [
        "",
        "",
        "0.07 for Grade I"
      ],
      [
        "6.1 The steel shall conform to the chemical requirements",
        "",
        ""
      ],
      [
        "",
        "",
        "0.08 for Grade II"
      ],
      [
        "prescribed in Table 1.",
        "",
        ""
      ],
      [
        "",
        "",
        "10.2 When low D-to-t ratio tubulars are tested, because the"
      ],
      [
        "7. Heat Analysis",
        "",
        "strain imposed due to geometry is unreasonably high on the"
      ],
      [
        "",
        "",
        "inside smface at the 6 and 12 o'clock locations, cracks at these"
      ],
      [
        "7.1 An analysis of each heat of steel shall be made by the",
        "",
        "locations shall not be cause for rejection if the D-to-t ratio is"
      ],
      [
        "steel manufacturer to determine the percentages of the ele­",
        "",
        "less than ten."
      ],
      [
        "ments specified in Section 6. The chemical composition thus",
        "",
        ""
      ],
      [
        "determined, or that determined from a product analysis made",
        "",
        "11. Hydrostatic Test Requirements"
      ],
      [
        "by the manufacturer, if the latter has not manufactured the",
        "",
        ""
      ],
      [
        "",
        "",
        "11.1 Each length of pipe shall be subjected to the hydro­"
      ],
      [
        "steel, shall be reported to the purchaser or the purchaser's",
        "",
        ""
      ],
      [
        "",
        "",
        "static pressure, except as provided in 11.2."
      ],
      [
        "representative, and shall conform to the requirements specified",
        "",
        ""
      ],
      [
        "in Section 6.",
        "",
        "11.2 When specified in the order, pipe may be furnished"
      ]
    ]
  }
]