[
  {
    "rows": [
      [
        "Table S 1.1. See also Fig. S LI.",
        "procedure outlined in Supplementary Requirement SI, except",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "S 1.5 All tubing shall meet this specification. The instrument",
        "for the notch standards, which shall be as indicated in Table",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "calibration shall be verified at the start of testing, after any shut",
        "S2.1.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "down of the test equipment, after any test equipment",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "adjustment, or at least every V2 h of continuous production",
        "S3. Report",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "testing, or both. Tubes generating a signal above the outside­",
        "S3.1 A report",
        "shall be furnished",
        "",
        "by",
        "the",
        "manufacturer to",
        "",
        ""
      ],
      [
        "diameter calibration standard sensitivity level shall be rejected.",
        "include a record of all tests performed to qualify material to",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "S 1.6 Tubes may be reconditioned and retested provided",
        "this specification. This record shall include numbers of tests",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    ]
  },
  {
    "rows": [
      [
        "the entire cross section of the tube. Suitable instrumentation",
        "[15.9 to",
        "[0.71] and",
        "of specified average",
        "[9.52]",
        "but not greater"
      ],
      [
        "",
        "25.4]",
        "heavier",
        "wall (when average",
        "",
        "than 0.062 in."
      ],
      [
        "shall be used to clearly distinguish the artificial defects. The",
        "incl",
        "",
        "wall is ordered), or",
        "",
        "[1.6 mm]"
      ],
      [
        "outside and inside surfaces of the tubes shall be free of loose",
        "",
        "",
        "11.8 % of specified",
        "",
        ""
      ],
      [
        "scale, metallic particles, or other material that would tend to",
        "",
        "",
        "minimum wall (when",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "minimum wall is",
        "",
        ""
      ],
      [
        "restrict signals or create electrical noise. The tubing shall be",
        "",
        "",
        "ordered), whichever is",
        "",
        ""
      ]
    ]
  }
]