[
  {
    "rows": [
      [
        "but when applied, heat treatment shall consist of tempering,",
        "",
        "to weld repair special parts made to the purchaser's require­"
      ],
      [
        "annealing, normalizing, or normalizing and tempering.",
        "",
        "ments."
      ],
      [
        "",
        "",
        "10.3 The composition of the weld deposits shall be"
      ],
      [
        "5. Chemical Composition",
        "",
        "similar to the base metal and in accordance with the proce­"
      ],
      [
        "5.1 An analysis of each heat shall be made by the",
        "",
        "dure qualification for the applicable material. Welding shall"
      ],
      [
        "manufacturer to determine the percentages of the elements",
        "",
        "be accomplished with a weld procedure designed to pro­"
      ],
      [
        "specified in Table 1. The chemical composition thus deter­",
        "",
        "duce low hydrogen in the weldment. Short-circuit gas metal"
      ],
      [
        "mined shall conform to the requirements in Table 1.",
        "",
        "arc welding is permissible only with the approval of the"
      ],
      [
        "",
        "",
        "purchaser."
      ],
      [
        "6. Mechanical Properties",
        "",
        ""
      ],
      [
        "6.1 The material shall conform to the requirements as",
        "",
        ""
      ],
      [
        "to tensile properties prescribed in Table 2.",
        "",
        "11. Marking of Forgings"
      ],
      [
        "",
        "",
        "11.1 Identification marks consisting of the manufactur­"
      ],
      [
        "",
        "",
        "er's symbol or name, designation of service rating, Speci­"
      ],
      [
        "7. Number of Tests",
        "",
        ""
      ],
      [
        "",
        "",
        "fication number, class, and size shall be legibly forged or"
      ],
      [
        "7 .1 One tension test shall be made from each heat.",
        "",
        ""
      ],
      [
        "",
        "",
        "stamped on each forging, and in such a position as not to"
      ],
      [
        "7.2 If any test specimen is defectively machined, it",
        "",
        "injure the usefulness of the forgings."
      ],
      [
        "may be discarded and another specimen substituted.",
        "",
        ""
      ],
      [
        "",
        "",
        "11.2 Bar Coding - In addition to the requirements in"
      ],
      [
        "",
        "",
        "11.1, bar coding is acceptable as a supplementary identifi­"
      ],
      [
        "8. Retests",
        "",
        "cation method. The purchaser may specify in the order a"
      ],
      [
        "8.1 When one or more representative 'test specimens",
        "",
        "specific bar coding system to be used. The bar coding"
      ],
      [
        "do not conform to specification requirements for the tested",
        "",
        "system, if applied at the discretion of the supplier, should"
      ],
      [
        "characteristic, only a single retest for each nonconforming",
        "",
        "be consistent with one of the published industry standards"
      ],
      [
        "characteristic may be performed to establish product",
        "",
        "for bar coding. If used on small parts the bar code may be"
      ],
      [
        "acceptability. Retests shall be performed on twice the num­",
        "",
        "applied to the box or a substantially applied tag."
      ],
      [
        "ber of representative specimens that were originally non­",
        "",
        ""
      ],
      [
        "conforming. When any retest specimen does not conform",
        "",
        ""
      ],
      [
        "to specification requirements for the characteristic in ques­",
        "",
        ""
      ],
      [
        "",
        "",
        "12. Certificate of Compliance"
      ],
      [
        "tion, the lot represented by that specimen shall be rejected,",
        "",
        ""
      ],
      [
        "heat-treated or reheat-treated in accordance with 4.5, and",
        "",
        "12.1 When specified in the purchase order or contract,"
      ],
      [
        "tested in accordance with Sections 6 and 7.",
        "",
        "a producer's or supplier's certification shall be furnished to"
      ],
      [
        "",
        "",
        "the purchaser that the material was manufactured, sampled,"
      ],
      [
        "",
        "",
        "tested, and inspected in accordance with this specification"
      ],
      [
        "9. Reports of Testing",
        "",
        ""
      ],
      [
        "",
        "",
        "and has been found to meet the requirements. The specifi­"
      ],
      [
        "9.1 Upon request of the purchaser in the contract or",
        "",
        "cation designation included on certificates of compliance"
      ],
      [
        "order, a report of the test results and chemical analyses",
        "",
        "shall include year of issue and revision letter, if any."
      ],
      [
        "shall be furnished. The specification designation included",
        "",
        ""
      ],
      [
        "on reports of testing shall include year of issue and revision",
        "",
        "12.2 When specified in the purchase order or contract,"
      ]
    ]
  }
]