[
  {
    "rows": [
      [
        "identification and separation of the transition material is",
        "edges, thin edges (feather), and damaged edges due to handling"
      ],
      [
        "required.",
        "or processing and which should not extend in beyond the"
      ],
      [
        "",
        "ordered width. These edge conditions are detrimental where"
      ],
      [
        "8. Dimensions, Tolerances, and Allowances",
        "joining of the mill edges by welding is practiced. When the"
      ],
      [
        "8.1 Dimensions, tolerances, and allowances applicable to",
        "purchaser intends to shear or to blank, a sufficient width"
      ],
      [
        "products covered by this specification are contained in Tables",
        "allowance should be made when purchasing to ensure obtain­"
      ],
      [
        "3-20 [Annex Al, Tables Al.l-Al.17]. The appropriate toler­",
        "ing the desired contour and size of the pattern sheet. The"
      ],
      [
        "ance tables shall be identified in each individual specification.",
        "manufacturer may be consulted for guidance. Cut edges are the"
      ],
      [
        "",
        "normal edges which result from the shearing, slitting, or"
      ],
      [
        "8.2 The appropriate thickness tolerance tables for measure­",
        ""
      ],
      [
        "",
        "trimming of mill-edge sheet."
      ],
      [
        "ments taken 3/s in. [10 mm] from the edge are found in Section",
        ""
      ],
      [
        "S 1 of the Supplementary Requirements in this specification.",
        "9.1.1.1 The ends of plain hot-rolled mill-edge coils are"
      ],
      [
        "See the appropriate product specification for instructions on",
        "irregular in shape and are referred to as uncropped ends. Where"
      ],
      [
        "how to specify.",
        "such ends are not acceptable, the purchaser's order should so"
      ],
      [
        "",
        "specify. Processed coils such as pickled or blast cleaned are"
      ],
      [
        "8.3 When thickness is measured using hand held microm­",
        "supplied with square-cut ends."
      ],
      [
        "eters refer to Practice A1073/A1073M.",
        ""
      ],
      [
        "",
        "9.2 Cold-rolled carbon sheet (exposed) is intended for those"
      ],
      [
        "8.4 Flatness Tolerances:",
        ""
      ],
      [
        "",
        "applications where surface appearance is of primary impor­"
      ],
      [
        "8.4.1 Standard flatness tolerances are contained in Tables 13",
        ""
      ],
      [
        "",
        "tance. This class will meet requirements for controlled surface"
      ],
      [
        "and 14 for hot-rolled sheet and Table 20 for cold-rolled sheet.",
        ""
      ],
      [
        "",
        "texture, surface quality, and flatness. It is normally processed"
      ],
      [
        "8.4.2 Measurement techniques for flatness characteristics",
        ""
      ],
      [
        "",
        "by the manufacturer to be free of stretcher strain and fluting."
      ],
      [
        "are described in Practice A1030/Al030M.",
        ""
      ],
      [
        "",
        "Subsequent user roller leveling immediately before fabrication"
      ],
      [
        "8.4.3 Two alternative methods for flatness determination are",
        ""
      ],
      [
        "",
        "will minimize strain resulting from aging."
      ],
      [
        "the use of I-units and percent steepness. A description of these",
        ""
      ],
      [
        "two alternative methods is contained in Practice A1030/",
        "9.2.1 Cold-rolled carbon sheet, when ordered for exposed"
      ],
      [
        "A1030M, as well as Appendix X5.",
        "applications, can be supplied in the following finishes:"
      ],
      [
        "8.4.3.1 The use of I-units or percent steepness as a flatness",
        "9.2.1.1 Matte finish is a dull finish, without luster, produced"
      ],
      [
        "standard is subject to negotiation between the purchaser and",
        "by rolling on rolls that have been roughened by mechanical or"
      ],
      [
        "the producer.",
        "chemical means to various degrees of surface texture depend­"
      ],
      [
        "8.4.3.2 Measurement techniques for I-units, percent",
        "ing upon application. With some surface preparation matte"
      ],
      [
        "steepness, and rejection limits are subject to negotiation",
        "finish is suitable for decorative painting. It is not generally"
      ],
      [
        "between the purchaser and the producer.",
        "recommended for bright plating."
      ],
      [
        "",
        "9 .2.1.2 Commercial bright finish is a relatively bright finish"
      ],
      [
        "9. Finish and Condition",
        "having a surface texture intermediate between that of matte and"
      ],
      [
        "9.1 Hot-rolled sheet has a surface with an oxide or scale",
        "luster finish. With some surface preparation commercial bright"
      ],
      [
        "resulting from the hot-rolling operation. The oxide or scale can",
        "finish is suitable for decorative painting or certain plating"
      ],
      [
        "be removed by piclding or blast cleaning when required for",
        "applications. If sheet is deformed in fabrication the surface"
      ],
      [
        "press-work operations or welding. Hot-rolled and hot-rolled",
        "may roughen to some degree and areas so affected will require"
      ],
      [
        "descaled sheet is not generally used for exposed parts where",
        "surface preparation to restore surface texture to that of the"
      ]
    ]
  },
  {
    "rows": [
      [
        "Camber tolerances",
        "10",
        "A1.7",
        "10, 19",
        "A1.7, A1.16"
      ],
      [
        "Diameter tolerances of sheared circles",
        "9",
        "A1.6",
        "9",
        "A1.6"
      ],
      [
        "Flatness tolerances",
        "13, 14",
        "A1.10, A1.11",
        "20",
        "A1.17"
      ],
      [
        "Length tolerances",
        "8",
        "A1.5",
        "16, 17",
        "A1.13, A1.14"
      ],
      [
        "Out-of-square tolerances",
        "11",
        "A1.8",
        "11",
        "A1.8"
      ],
      [
        "Restricted squareness tolerances",
        "12",
        "A1.9",
        "12",
        "A1.9"
      ],
      [
        "Thickness tolerances",
        "4, 5, S1.1, S1.2",
        "A1.1, A1.2, S1.4, S1.5",
        "15,S1.3",
        "A1.12, S1.6"
      ],
      [
        "Width tolerances of cut edge",
        "7",
        "A1.4",
        "7, 18",
        "A1.4,A1.15"
      ],
      [
        "Width tolerances of mill edge",
        "6",
        "A1.3",
        "",
        ""
      ]
    ]
  }
]