[
  {
    "rows": [
      [
        "end shall be made alternately with the weld at 0° and at 90° on pipe with plain ends, with threads only, or with threads and"
      ],
      [
        "from the line of direction of force. couplings; and it shall also be permissible to test pipe in either"
      ],
      [
        "7.3.3.3 For pipe produced in multiple lengths, the flattening single lengths or multiple lengths."
      ],
      [
        "test specified in 7.3.3.1 shall be made as follows:"
      ],
      [
        "NoTE 4-The hydrostatic test pressures given herein are inspection test"
      ],
      [
        "(1) Test specimens taken from, and representative of, the pressures, are not intended as a basis for design, and do not have any direct"
      ],
      [
        "front end of the first pipe intended to be supplied from each relationship to working pressures."
      ],
      [
        "coil, the back end of the last pipe intended to be supplied from 8.3 The minimum hydrostatic test pressure required to"
      ],
      [
        "each coil, and each side of any intermediate weld stop location satisfy the requirements specified in 8.2 need not exceed 2500"
      ],
      [
        "shall be flattened with the weld located at 90° from the line of psi [17 200 kPa] for pipe NPS 3 [DN 80] or smaller or 2800"
      ],
      [
        "direction of force. psi [19 300 kPa] for pipe larger than NPS 3 [DN 80]; however,"
      ],
      [
        "(2) Test specimens taken from pipe at any two locations the manufacturer has the option of using higher test pressures."
      ],
      [
        "intermediate to the front end of the first pipe and the back end For all sizes of seamless pipe and electric-resistance-welded"
      ],
      [
        "of the last pipe intended to be supplied from each coil shall be"
      ],
      [
        "pipe, the hydrostatic test pressure shall be maintained for at"
      ],
      [
        "flattened with the weld located at 0° from the line of direction least 5 s."
      ],
      [
        "of force."
      ],
      [
        "7.3.3.4 For pipe that is to be subsequently reheated through­ 9. Nondestructive Electric Test"
      ],
      [
        "out its cross section and hot formed by a reducing process, the"
      ],
      [
        "manufacturer shall have the option of obtaining the flattening"
      ],
      [
        "9.1 Type E Pipe:"
      ],
      [
        "test specimens required by 7.3.3.2 or 7.3.3.3, whichever is _9. l. l Except for pipe produced on a hot-stretch reducing"
      ],
      [
        "of electric-resistance­applicable, either prior to or after such hot reducing. 111111, the weld seam of each length"
      ],
      [
        "7.3.4 Continuous-Welded Pipe-A test specimen at least 4 welded pipe NPS 2 [DN 50] or larger shall be tested with a"
      ],
      [
        "in. [100 mm] in length shall be flattened cold between parallel nondestructive electric test in accordance with Practices E213"
      ],
      [
        "electric-resistance~ plates in three steps. The weld shall be located at 90° from the E273, E309, or E570. Each length of"
      ],
      [
        "line of direction of force. During the first step, which is a test welded pipe NPS 2 [DN 50] or larger and produced on a"
      ],
      [
        "hot-stretch-reducing mill shall be tested with a nondestructive for ductility of the weld, except as allowed by 7.3.5, 7.3.6, and"
      ],
      [
        "7.3.7, no cracks or breaks on the inside, outside, or end electric test that inpsects the full volume of the pipe in"
      ],
      [
        "surfaces at the weld shall be present before the distance accordance with Practices E213, E309, or E570."
      ],
      [
        "Inspection-Any between tl1e plates is less than three fourths of the specified 9.1.2 Ultrasonic and Electromagnetic"
      ],
      [
        "equipment utilizing the ultrasonic or electromagnetic principles outside diameter of the pipe. As a second step, the flattening"
      ],
      [
        "shall be continued as a test for ductility away from the weld. and capable of continuous and uninterrupted inspection of the"
      ],
      [
        "weld seam shall be used. The equipment shall be checked with During the second step, except as allowed by 7.3.6 and 7.3.7,"
      ],
      [
        "no cracks or breaks on the inside, outside, or end smfaces away an applicable reference standard as described in 9.1.3 at least"
      ],
      [
        "from the weld shall be present before the distance between the once every working tum or not more than 8 h to demonstrate"
      ],
      [
        "its effectiveness and the inspection procedures. The equipment plates is less than 60 % of the specified outside diameter of the"
      ],
      [
        "pipe. During the third step, which is a test for soundness, the shall be adjusted to produce well-defined indications when the"
      ],
      [
        "a flattening shall be continued until the test specimen breaks or reference standard is scanned by the inspection unit in"
      ],
      [
        "manner simulating the inspection of the product. the opposite walls of the test specimen meet. Evidence of"
      ],
      [
        "laminated or unsound material or of incomplete weld that is 9.1.3 Reference Standards-The length of the reference"
      ],
      [
        "revealed by the flattening test shall be cause for rejection. standards shall be determined by the pipe manufacturer, and"
      ],
      [
        "they shall have the same specified diameter and thickness as 7.3.5 Surface imperfections in the test specimen before"
      ],
      [
        "the product being inspected. Reference standards shall contain flattening, but revealed during the first step of the flattening"
      ],
      [
        "machined notches, one on the inside surface and one on the test, shall be judged in accordance with the finish requirements"
      ],
      [
        "outside surface, or a drilled hole, as shown in Fig. 1, at the"
      ],
      [
        "in Section 12."
      ],
      [
        "option of the pipe manufacturer. The notches shall be parallel"
      ],
      [
        "7.3.6 Superficial ruptures as a result of surface imperfec­"
      ],
      [
        "to the weld seam, and shall be separated by a distance sufficient"
      ],
      [
        "tions shall not be cause for rejection."
      ],
      [
        "to produce two separate and distinguishable signals. The 1 /s-in."
      ],
      [
        "7.3.7 For pipe with a D-to-t ratio less than 10, because the"
      ],
      [
        "[3.2-mm] hole shall be drilled through the wall and perpen­"
      ],
      [
        "strain imposed due to geometry is unreasonably high on the"
      ],
      [
        "dicular to the surface of the reference standard as shown in Fig."
      ],
      [
        "inside surface at the 6 and 12 o'clock locations, cracks at such"
      ],
      [
        "1. Care shall be taken in the preparation of the reference"
      ],
      [
        "locations shall not be cause for rejection."
      ],
      [
        "standard to ensure freedom from fins or other edge roughness,"
      ],
      [
        "or distortion of the pipe."
      ],
      [
        "8. Hydrostatic Test"
      ],
      [
        "convenient 8.1 The hydrostatic test shall be applied, without leakage Norn 5-The calibration standards shown in Fig. 1 are"
      ]
    ]
  }
]