[
  {
    "rows": [
      [
        "shall have its ends closed. The length of test rings that will be",
        "purpose, 10 % of the furnace production shall be sampled and",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "liquid quenched shall be at least 24 in. [610 mm]. The ends of",
        "shall meet the minimum hardness specified in Table 2 for the",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "such test rings may be vented to prevent pressure buildup",
        "type and shall also be within 20 Brinell points of the hardness",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "during heat treating.",
        "of the forging from which the tensile test was taken.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.4.2 Test specimens representing vessel covers or similar",
        "6.6.2 In the event that the test sample does not meet these",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "components may be taken from a full-section prolongation of",
        "criteria, the remainder",
        "",
        "of",
        "that",
        "production",
        "group",
        "shall",
        "be"
      ],
      [
        "the cover, a representative forging, or an integral prolongation",
        "hardness tested and all of those forgings that fall outside these",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "when the part is contour machined before heat treatment.",
        "limits shall be retempered or reheat-treated at the manufactur­",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.4.2.1 Test specimens taken from full size prolongations or",
        "er's option and retested.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "representative forgings shall be located at a position midway",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "7. Magnetic Particle Examination",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "between the center and the surface.",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.4.2.2 When forgings are contour machined before heat",
        "7.1 All quenched and tempered forgings shall be subject to",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "treatment so that highly stressed surfaces are exposed, the test",
        "magnetic particle examination after heat treatment. The meth­",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "specimens may be taken at an equal distance (t) from the",
        "ods used shall be in accordance with Practice A275/A275M.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "nearest quenched surface as the highly stressed area but not",
        "7.2 Only direct current or rectified alternating (full or half",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "less than 3⁄4 in. [20 mm]. The location of the specimens from a",
        "wave) current shall be used as the electric power source for any",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "second surface shall be at least the greater of 11⁄2  in. [40 mm]",
        "of the magnetizing methods.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "or 2t.",
        "7.3 The forgings",
        "shall",
        "be",
        "",
        "free from",
        "linear indications",
        "",
        ""
      ],
      [
        "6.5 Number of Tests:",
        "indicative of cracks. In case of doubt as to the type of condition",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.5.1 Up to 200 like forgings, each with a heat-treated",
        "giving rise to linear magnetic particle indications, they may be",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "weight of less than 1000 lb [450 kg] when heat treated in a",
        "inspected for Type",
        "II indications",
        "",
        "",
        "referenced",
        "in Reference",
        "",
        ""
      ],
      [
        "single-batch furnace charge, shall have one tension test taken in",
        "Photographs E433",
        "when",
        "inspected",
        "",
        "by the",
        "liquid",
        "penetrant",
        ""
      ],
      [
        "accordance with 6.4.1 or 6.4.2 to represent each heat. In",
        "method in accordance",
        "",
        "",
        "with",
        "Practice",
        "E165/E165M.",
        "",
        ""
      ],
      [
        "addition, for hollow or bored forgings, one bend or flattening",
        "Alternatively, some other suitable method for classifying the",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "test shall be taken in accordance with 6.3.",
        "indications may be used as agreed upon between the manufac­",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.5.2 Like forgings, weighing less than 1000 lb [450 kg]",
        "turer and the purchaser.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "each when heat treated in a continuous furnace, shall have one",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "8. Workmanship",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "tensile test taken to represent each heat and not more than 200",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "forgings in any continuous period up to 4 h duration. In",
        "8.1 If the thickness of a portion of the wall of a forging is",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "addition, bored or hollow forgings shall have one bend or",
        "less than that specified, the forgings may be accepted by the",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "flattening test talcen per heat per 200 forgings in any continuous",
        "purchaser, provided",
        "that",
        "such",
        "",
        "irregularity",
        "will not",
        "require",
        ""
      ],
      [
        "period up to 4 h duration in accordance with 6.3.",
        "lowering the allowable working pressure below that for which",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.5.3 For heat-treated forgings weighing 1000 lb [4 50 kg] or",
        "the forging was designed.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "more, one tension test shall be taken in accordance with 6.4.1",
        "9. Repair Welding",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "or 6.4.2 to represent each heat and not more than ten forgings",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "9.1 Repair welding shall be permitted when mutually agreed",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "in a heat-treat lot. In addition, hollow or bored forgings shall",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "upon between the purchaser and the manufacturer and shall be",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "have one bend or flattening test, taken in accordance with 6.3,",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "performed in accordance",
        "",
        "with",
        "",
        "all the requirements",
        "",
        "of the",
        ""
      ],
      [
        "to represent each ten or fewer forgings from the same heat and",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "applicable code or rules of construction.",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "heat-treatment lot.",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.6 Hardness Testing:",
        "10. Keywords",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "6.6.1 Forgings under 1000 lb [4 50 kg] in weight, heat",
        "10.1 alloy steel forgings; carbon steel forgings; gas bottles;",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ]
    ]
  }
]