[
  {
    "rows": [
      [
        "",
        "specified in the purchase order.",
        "",
        ""
      ],
      [
        "15.2 The notched-bar impact test shall be made in",
        "",
        "",
        ""
      ],
      [
        "accordance with the procedure for the simple beam,",
        "",
        "",
        ""
      ],
      [
        "Charpy-type of test of Test Methods E 23.",
        "",
        "",
        ""
      ],
      [
        "",
        "17. Product Marking",
        "",
        ""
      ],
      [
        "15.3 Impact tests specified for temperatures lower than",
        "17.1 Except as modified in 16.1.1, in addition to the",
        "",
        ""
      ],
      [
        "+ 70°F [20°C] should be made with the following precau­",
        "marking prescribed in Specification A 1016/ A 1016M, the",
        "",
        ""
      ]
    ]
  },
  {
    "rows": [
      [
        "diameter and thickness does not pennit obtaining trans­",
        "be lower than the minimum temperature shown in Table"
      ],
      [
        "verse specimens, longitudinal specimens in accordance",
        "6 for the respective grade. Under these circumstances the"
      ],
      [
        "with 14.2 shall be obtained. The bottom of the notch shall",
        "temperature reduction values shall be by an amount equal"
      ],
      [
        "be located at the weld joint.",
        "to the difference (as shown in Table 7) between the temper­"
      ],
      [
        "",
        "ature reduction corresponding to the actual material thick­"
      ],
      [
        "",
        "ness and the temperature reduction corresponding to"
      ],
      [
        "15. Impact Test",
        "Charpy specimen width actually tested. The appendix"
      ],
      [
        "15.1 Except when the size of the finished tube is insuf­",
        "shows some examples of how the temperature reductions"
      ],
      [
        "ficient to pennit obtaining subsize impact specimens, all",
        "are detennined."
      ],
      [
        "material furnished under this specification and marked in",
        ""
      ],
      [
        "accordance with Section 17 shall be tested for impact resist­",
        ""
      ],
      [
        "ance at the temperature for the respective grades as pre­",
        "16. Hydrostatic or Nondestructive Electric Test"
      ],
      [
        "scribed in Table 6.",
        "16.1 Each tube shall be subjected to the nondestructive"
      ],
      [
        "15.1.1 Special impact tests on individual lots of",
        "electric test or the hydrostatic test in accordance with Speci­"
      ],
      [
        "material may be made at other temperatures if agreed upon",
        "fication A 1016/ A 1016M. The type oftest to be used shall"
      ]
    ]
  },
  {
    "rows": [
      [
        "so that both reach the desired temperature. The temperature",
        "temperature at which the impact tests were made, except"
      ],
      [
        "shall be measured with thermocouples, thermometers, or",
        "when a lower test temperature is required because of"
      ],
      [
        "any other suitable devices and shall be controlled within",
        "reduced specimen size, in which case, the higher impact"
      ],
      [
        "±3°F [2°C]. The specimens shall be quickly transferred",
        "test temperature applicable to a full-size specimen should"
      ]
    ]
  }
]