[
  {
    "rows": [
      [
        "made to a fine grain practice. In the event of controversy",
        "",
        "",
        "",
        "",
        "",
        "requirements for screws that are shorter than three times"
      ],
      [
        "over grain size, referee tests on finished screws conducted",
        "",
        "",
        "",
        "",
        "",
        "the diameter or that have insufficient threads for tension"
      ],
      [
        "in accordance with Test Methods E 112 shall prevail.",
        "",
        "",
        "",
        "",
        "",
        "testing."
      ],
      [
        "5.3 Unless otherwise specified, the heads of screws",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "7.2 Screws, other than those exempted in 7.1 and 7.3,"
      ],
      [
        "through 1.500 in. diameter shall be fabricated by hot or",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "shall meet the proof load and tensile requirements in Table"
      ],
      [
        "cold forging. Over 1.500 in. diameter, the heads may be",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "2 and Table 3. The screws shall be tension tested with a"
      ],
      [
        "fabricated by hot or cold forging or by machining. Sockets",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "wedge of the angle specified in Table 4 under the head."
      ],
      [
        "may be forged or machined.",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "To meet the requirements of the wedge test, there must be"
      ],
      [
        "5.4 Unless otherwise specified, threads of screws shall",
        "",
        "",
        "",
        "",
        "",
        "a tensile failure in the body or thread section. For the."
      ],
      [
        "be rolled for diameters through 0.625 in. and for screw",
        "",
        "",
        "",
        "",
        "",
        "purpose of this test, failure means separation into two"
      ],
      [
        "lengths through 4 in. For diameters and lengths other than",
        "",
        "",
        "",
        "",
        "",
        "pieces. Screws threaded to the head shall pass the require­"
      ],
      [
        "this, threads may be rolled, cut, or ground.",
        "",
        "",
        "",
        "",
        "",
        "ments for this test if the fracture that caused failure origi­"
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "nated in the thread area, even though it may have"
      ],
      [
        "5.5 The screws shall be heat treated by oil quenching",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "propagated into the fillet area or the head before separation."
      ],
      [
        "from above the transformation temperature and then tem­",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "pering at a temperature not lower than 650°F.",
        "",
        "",
        "",
        "",
        "",
        "7 .3 Screws having a diameter larger than 1.500 in."
      ],
      [
        "5.6 Standard Finishes -",
        "",
        "Unless otherwise specified,",
        "",
        "",
        "",
        "shall be preferably tested in full size and shall meet the"
      ],
      [
        "the screws shall be furnished with one of the following",
        "",
        "",
        "",
        "",
        "",
        "requirements of Table 2 and Table 3. When equipment of"
      ]
    ]
  }
]