[
  {
    "rows": [
      [
        "",
        "",
        "cation of Plugs in Specimen and of Specimen in Heads of Test­"
      ],
      [
        "A2.2.1 Full-size Longitudinal Test Specimens:",
        "",
        "ing Machine"
      ],
      [
        "A2.2.1.1 As an alternative to the use of longitudinal strip",
        "",
        ""
      ],
      [
        "test specimens or longitudinal round test specimens, tension",
        "",
        ""
      ],
      [
        "",
        "",
        "diameter to be used when elongation comparable to that"
      ],
      [
        "test specimens of full-size tubular sections are used, provided",
        "",
        ""
      ],
      [
        "",
        "",
        "obtainable with larger test specimens is required."
      ],
      [
        "that the testing equipment has sufficient capacity. Snug-fitting",
        "",
        ""
      ],
      [
        "",
        "",
        "A2.2.1.3 To determine the cross-sectional area of the full­"
      ],
      [
        "metal plugs should be inserted far enough in the end of such",
        "",
        ""
      ],
      [
        "",
        "",
        "section specimen, measurements shall be recorded as the"
      ],
      [
        "tubular specimens to permit the testing machine jaws to grip",
        "",
        ""
      ],
      [
        "",
        "",
        "average or mean between the greatest and least measurements"
      ],
      [
        "the specimens properly without crushing. A design that may be",
        "",
        ""
      ],
      [
        "",
        "",
        "of the outside diameter and the average or mean wall thickness,"
      ],
      [
        "used for such plugs is shown in Fig. A2.1. The plugs shall not",
        "",
        ""
      ],
      [
        "",
        "",
        "to the nearest 0.001 in. (0.025 mm) and the cross-sectional area"
      ],
      [
        "extend into that part of the specimen on which the elongation",
        "",
        ""
      ],
      [
        "",
        "",
        "is determined by the following equation:"
      ],
      [
        "is measured (see Fig. A2.l). Care should be exercised to see",
        "",
        ""
      ],
      [
        "that insofar as practicable, the load in such cases is applied",
        "",
        "A= 3.1416t (D t) (A2. l)"
      ]
    ]
  }
]