[
  {
    "rows": [
      [
        "shear) as the ordinate versus the corresponding test temperature",
        "",
        "",
        "",
        "Vessel Code, Table UG-84.2, or both. Greater energies or lower"
      ],
      [
        "as the abscissa and construct a best-fit curve through the plotted",
        "",
        "",
        "",
        "test temperatures may be agreed upon by purchaser and"
      ],
      [
        "data points.",
        "",
        "",
        "",
        "supplier."
      ],
      [
        "27 .2.1.3 If transition temperature is",
        "",
        "specified as",
        "the tem­",
        ""
      ],
      [
        "perature at which a",
        "test value",
        "is achieved,",
        "determine the",
        "28. Records"
      ],
      [
        "temperature at which the plotted curve intersects the specified",
        "",
        "",
        "",
        ""
      ],
      [
        "test value by graphical",
        "interpolation",
        "(e xtrapolation",
        "is not",
        "28.1 The test record should contain the following informa­"
      ],
      [
        "permitted). Record this transition temperature to the nearest",
        "",
        "",
        "",
        "tion as appropriate:"
      ],
      [
        "5 °F (3 °C). If the",
        "tabulated test results",
        "",
        "clearly indicate a",
        "28.1.1 Full description of material tested (that is, specifica­"
      ],
      [
        "transition temperature lower than specified, it is not necessary",
        "",
        "",
        "",
        "tion number, grade, class or type, size, heat number)."
      ],
      [
        "to plot the data. Report the lowest test temperature for which",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "28.1.2 Specimen orientation with respect to the material"
      ],
      [
        "test value exceeds the specified value.",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "axis."
      ],
      [
        "27.2.1.4 Accept the test result if the determined transition",
        "",
        "",
        "",
        ""
      ],
      [
        "Specimen size. temperature is equal to or lower than the specified value.",
        "",
        "",
        "",
        "28.1.3"
      ],
      [
        "27.2.1.5 If the determined transition temperature is higher",
        "",
        "",
        "",
        "28.1.4 Test temperature and individual test value for each"
      ],
      [
        "than the specified value, but not more than 20 °F (12 °C) higher",
        "",
        "",
        "",
        "specimen broken, including initial tests and retests."
      ],
      [
        "than the specified value, test sufficient samples in accordance",
        "",
        "",
        "",
        "28.1.5 Test results."
      ],
      [
        "with Section 26 to plot two additional curves. Accept the test",
        "",
        "",
        "",
        "28.1.6 Transition temperature and criterion for its"
      ]
    ]
  }
]