[
  {
    "rows": [
      [
        "of the search unit by outlining locations where the amplitude of the",
        "",
        ""
      ],
      [
        "",
        "",
        "grounded to prevent electric shock."
      ],
      [
        "indication is 100% of the DAC or where the back reflection is reduced",
        "",
        ""
      ],
      [
        "by 75%, using the center of the search unit as a reference point to establish",
        "",
        "12.3 Linearity - The instrument must provide a linear"
      ],
      [
        "the outline of the indication area.",
        "",
        ""
      ],
      [
        "",
        "",
        "presentation (within ±5%) of at least 1.5 in. [40 mm] sweep"
      ],
      [
        "NOTE 6 - In certain castings, because of very long metal path distances",
        "",
        "to peak (S/P)."
      ],
      [
        "or curvature of the examination surfaces, the surface area over which a",
        "",
        ""
      ],
      [
        "given discontinuity is detected may be considerably larger or smaller",
        "",
        "12.4 Calibrated Gain Control of Attenuator - The"
      ],
      [
        "than the actual area of the discontinuity in the casting; in such cases,",
        "",
        "instrument shall contain a calibrated gain control or signal"
      ],
      [
        "other criteria that incorporate a consideration of beam angles or beam",
        "",
        "attenuator (a ccurate within ± 10%) which will allow indica­"
      ],
      [
        "spread must be used for realistic evaluation of the discontinuity.",
        "",
        "tions beyond the linear range of the instrument to be mea­"
      ],
      [
        "",
        "",
        "sured."
      ],
      [
        "PROCEDURE B - BACK-WALL REFLECTION",
        "",
        "12.5 Time-Corrected Gain - The instrument shall be"
      ],
      [
        "CALIBRATION PROCEDURE",
        "",
        "equipped to compensate for signal decay with distance. A"
      ],
      [
        "",
        "",
        "method should be available to equalize signal response at"
      ],
      [
        "11. Apparatus",
        "",
        "different depths."
      ],
      [
        "11.1 Apparatus shall be kept on a regular six month",
        "",
        ""
      ],
      [
        "maintenance cycle during which, as a minimum require­",
        "",
        ""
      ],
      [
        "ment, the vertical and horizontal linearities, sensitivity,",
        "",
        "13. Qualification"
      ],
      [
        "and resolution shall be established in accordance with the",
        "",
        ""
      ],
      [
        "",
        "",
        "13.1 The requirements for pre-production qualification"
      ],
      [
        "requirements of Practice E 317.",
        "",
        ""
      ],
      [
        "",
        "",
        "are as follows:"
      ],
      [
        "11.2 Search Units - Ceramic element transducers not",
        "",
        "13.1.1 Personnel - The personnel qualification"
      ],
      [
        "exceeding 1.25 in. [82 mm] diameter or 1 in. 2 [25 mm2]",
        "",
        "requirements of SNT-TC- lA are applicable. Other person­"
      ],
      [
        "shall be used.",
        "",
        "nel qualification requirement documents may be used when"
      ],
      [
        "11.3 Search Units Facing-A soft urethane membrane",
        "",
        "agreed upon between the purchaser and the supplier. Rec­"
      ],
      [
        "or neoprene sheet, approximately 0.025 in. [0.64 mm]",
        "",
        "ords of all personnel shall be available to customers upon"
      ],
      [
        "thick, may be used to improve coupling and minimize",
        "",
        "request."
      ],
      [
        "transducer wear caused by casting surface roughness.",
        "",
        "13.1.2 Equipment- The equipment shall be capable"
      ],
      [
        "",
        "",
        "of meeting the requirements in Section 12."
      ],
      [
        "11.4 Calibration/Testing -The same system, includ­",
        "",
        ""
      ],
      [
        "ing the urethane membrane, used for calibration shall be",
        "",
        ""
      ],
      [
        "used to inspect the casting.",
        "",
        ""
      ],
      [
        "",
        "",
        "14. Preparation"
      ],
      [
        "11.5 Other Inspections - Other frequencies and type",
        "",
        ""
      ],
      [
        "",
        "",
        "14.1 Time of Inspection - The final ultrasonic accept­"
      ],
      [
        "search units may be used for obtaining additional informa­",
        "",
        ""
      ],
      [
        "",
        "",
        "ance inspection shall be performed after at least an austeni­"
      ],
      [
        "tion and pinpointing of individual indications.",
        "",
        ""
      ],
      [
        "",
        "",
        "tizing heat treatment and preferably after machining. In"
      ],
      [
        "11.6 Couplant - A suitable liquid couplant, such as",
        "",
        "order to avoid time loss in production, acceptance inspec­"
      ],
      [
        "clean SAE 30 motor oil or similar commercial ultrasonic",
        "",
        "tion of cast surfaces may be done prior to machining."
      ],
      [
        "couplant, shall be used to couple the search unit to the test",
        "",
        "Machined surfaces shall be acceptance inspected as soon"
      ],
      [
        "surface. Other couplants may be used when agreed upon",
        "",
        "as possible after machining. Repair welds may be inspected"
      ]
    ]
  }
]