[
  {
    "rows": [
      [
        "procedure that positively separates the grades. Should the",
        "for product analysis, individual elements shall not vary both"
      ],
      [
        "purchaser deem it necessary to have the transition zone of two",
        "above and below the specified range."
      ],
      [
        "heats of the same grade which are continuously cast discarded,",
        "7.4 For continuous cast materials the requirements of 8.2 or"
      ],
      [
        "the purchaser shall invoke Supplementary Requirement S53.",
        "8.3, as appropriate, of Specification A 788/A 7 88M shall be met."
      ],
      [
        "5.6 Quality-The steel producer quality control procedures",
        "7 .5 Steels with intentional additions of lead, bismuth, or"
      ],
      [
        "shall provide sufficient testing of carbon and alloy steels in",
        "tellurium shall not be supplied or used. Steels with intentional"
      ],
      [
        "accordance with Method E381 or other suitable method as",
        "additions of selenium may only be supplied or used when"
      ],
      [
        "agreed upon between the purchaser and the producer to assure",
        "specifically called out in the product specification."
      ],
      [
        "the internal quality of the product.",
        ""
      ],
      [
        "",
        "7.6 The starting material shall not contain any unspecified"
      ],
      [
        "5.6. l Ingot Cast Product-Visual examination of transverse",
        "elements, other than nitrogen in austenitic stainless steels, for"
      ],
      [
        "sections shall show no imperfections worse than the macro­",
        "the ordered grade( s) to the extent that it then conforms to the"
      ],
      [
        "graphs of Method E381 S2-R2-C3 or equivalent as agreed",
        ""
      ],
      [
        "",
        "requirements of another grade for which that element is a"
      ],
      [
        "upon.",
        "specified element having a required minimum content."
      ],
      [
        "5.6.2 Strand Cast Product-Visual examination of traverse",
        ""
      ],
      [
        "sections in accordance with Method E381 shall reveal none of",
        "8. Mechanical Properties"
      ],
      [
        "the conditions shown in macrographs 1-5, 7, 12-18 of Plate III.",
        ""
      ],
      [
        "",
        "8.1 Method of Mechanical Tests-All tests shall be con­"
      ],
      [
        "Conditions 6, 8-11 shall not be present to a degree greater than",
        ""
      ],
      [
        "",
        "ducted in accordance with Test Methods and Definitions A370"
      ],
      [
        "the macrographs of Plates I and II, S2-R2-C3.",
        ""
      ],
      [
        "",
        "if the inch-pound units are specified or Test Methods A1058 if"
      ],
      [
        "6. Materials and Manufacture",
        "the M suffix (SI units) is specified, unless otherwise specified."
      ],
      [
        "6.1 Bars shall be produced in accordance with Specifica­",
        "8.2 For the purpose of determining conformance to the"
      ],
      [
        "tions A29/A29M or A484/A484M as applicable. Finish (hot",
        "product specification requirements, specimens shall be ob­"
      ],
      [
        "rolled or cold drawn, rough turned, extruded, ground, or",
        "tained from the production material, or, in the case of forgings,"
      ],
      [
        "polished) shall be at the option of the manufacturer unless",
        "from separately forged test blanks prepared from the stock used"
      ],
      [
        "otherwise specified.",
        "to make the finished product. Heat treatment shall be com­"
      ],
      [
        "6.1.1 A sufficient discard shall be made from each ingot to",
        "pleted prior to removal of material for mechanical testing."
      ],
      [
        "ensure bars do not contain piping or segregation that precludes",
        "8.3 If separately forged test blanks are used, they shall be of"
      ],
      [
        "use of the product to manufacture bolting meeting the require­",
        "the same heat of steel, be subjected to substantially the same"
      ],
      [
        "ments of the individual product specifications.",
        "reduction and working as the production forging they"
      ],
      [
        "6.2 Bolting components shall be produced in accordance",
        "represent, be heat treated in the same furnace charge and under"
      ],
      [
        "with the product specification.",
        "the same conditions as the production forging, and be of the"
      ],
      [
        "",
        "same nominal thickness as the maximum heat treated thickness"
      ],
      [
        "7. Chemical Composition",
        "of the production forging."
      ],
      [
        "7 .1 Chemical Analysis-Heat or product chemical analysis",
        "8.4 Bars-Tension and impact tests representing bar stock"
      ],
      [
        "shall be in accordance with Test Methods, Practices, and",
        "shall be taken in accordance with the requirements of Annex"
      ],
      [
        "Terminology A751.",
        "Al of Test Methods and Definitions A370. Impact tests are not"
      ],
      [
        "7 .2 Heat Analysis-An analysis of each heat of steel shall be",
        "required on bars 1⁄2 in. and under in diameter."
      ],
      [
        "made by the steel manufacturer to determine the percentages of",
        "8.5 Components, Machined from Heat Treated Bar­"
      ],
      [
        "those elements specified in the individual product specification.",
        "Mechanical properties of bolting components machined from"
      ],
      [
        "If secondary melting processes are employed, the heat analysis",
        "heat treated bar shall be represented by the tests conducted on"
      ],
      [
        "shall be obtained from one remelted ingot or the product of one",
        "the bar in accordance with 8.4."
      ],
      [
        "remelted ingot of each primary melt. The chemical analysis",
        "8.6 Components, All Classes-Produced by other"
      ],
      [
        "thus determined shall conform to the requirements of the",
        "methods-When bolting components have been produced by"
      ]
    ]
  }
]