[
  {
    "rows": [
      [
        "4.1.1 A sufficient discard shall be made to secure freedom",
        "",
        "pling in accordance with Specification A788/A788M and shall"
      ],
      [
        "from injurious pipe and undue segregation.",
        "",
        "comply with Table 2."
      ],
      [
        "5. Machining",
        "",
        "7.2 Product Analysis-The manufacturer shall use the prod­"
      ],
      [
        "",
        "",
        "uct analysis provision of Specification A788/A788M to obtain"
      ],
      [
        "5.1 Forged pressure vessels for steam power service shall",
        "",
        "a product analysis from a forging representing each heat or"
      ],
      [
        "have the inner surface machined or ground. Unfired pressure",
        "",
        "multiple heat. The product analysis for columbium and calcium"
      ],
      [
        "vessels shall have the inner surfaces sufficiently free of scale to",
        "",
        "for Grade F22V shall conform to the requirements of Table 2"
      ],
      [
        "permit inspection.",
        "",
        "of this specification. Boron is not subject to product analysis."
      ],
      [
        "5.2 Unless otherwise specified by the purchaser, when",
        "",
        "The purchaser may also make this determination in accordance"
      ],
      [
        "rough machining is performed, it may be done either before or",
        "",
        "with Specification A788/A788M."
      ],
      [
        "after heat treatment at the manufacturer's option.",
        "",
        ""
      ],
      [
        "",
        "",
        "8. Mechanical Properties"
      ],
      [
        "6. Heat Treatment",
        "",
        ""
      ],
      [
        "",
        "",
        "8.1 General Requirements-The material shall conform to"
      ],
      [
        "6.1 Except as permitted in 6.1.1 for Grade F22V, and in",
        "",
        ""
      ],
      [
        "",
        "",
        "the requirements for mechanical properties prescribed in Table"
      ],
      [
        "6.1.2 for Grade F91 Type 1 and Type 2 and Grade F92, the steel",
        "",
        ""
      ],
      [
        "",
        "",
        "1. The largest obtainable tension test specimen as specified in"
      ],
      [
        "forgings shall be annealed or normalized and tempered but",
        "",
        ""
      ],
      [
        "",
        "",
        "Test Methods and Definitions A370 shall be used."
      ],
      [
        "alternatively may be liquid quenched and tempered when",
        "",
        ""
      ],
      [
        "mutually agreed upon between the manufacturer and the",
        "",
        "8.2 Sampling-The mid-point of the gauge length of tension"
      ]
    ]
  }
]