[
  {
    "rows": [
      [
        "shall be weighed separately. exploring all surface imperfections to assure compliance with"
      ],
      [
        "16.2 Diameter-Except as provided for thin-wall pipe in 18.2."
      ],
      [
        "paragraph 12.2 of Specification A530/A530M, the tolerances 18.2 Surface imperfections that penetrate more than 121⁄2 %"
      ],
      [
        "for diameter shall be in accordance with the following: of the nominal wall thickness or encroach on the minimum"
      ],
      [
        "16.2.l Except for pipe ordered as special outside diameter wall thickness shall be considered defects. Pipe with such"
      ],
      [
        "tolerance pipe or as inside diameter tolerance pipe, variations defects shall be given one of the following dispositions:"
      ],
      [
        "in outside diameter shall not exceed those given in Table 3. 18.2.1 The defect shall be removed by grinding, provided"
      ],
      [
        "16.2.2 For pipe over 10 in. [250 mm] OD ordered as special that the remaining wall thickness is within the limits specified"
      ],
      [
        "outside diameter tolerance pipe, the outside diameter shall not in 16.3."
      ],
      [
        "vary more than 1 % over or 1 % under the specified outside 18.2.2 Repaired in accordance with the repair welding"
      ],
      [
        "diameter. provisions of 18.6."
      ],
      [
        "16.2.3 For pipe over 10 in. [250 mm] ID ordered as inside 18.2.3 The section of pipe containing the defect may be cut"
      ],
      [
        "diameter tolerance pipe, the inside diameter shall not vary off within the limits of requirements on length."
      ],
      [
        "more than 1 % over or l % under the specified inside diameter."
      ],
      [
        "18.2.4 Rejected."
      ],
      [
        "16.3 Thickness-The minimum wall thickness at any point"
      ],
      [
        "18.3 To provide a workmanlike finish and basis for evalu­"
      ],
      [
        "shall not be more than 12.5 % under the specified wall"
      ],
      [
        "ating conformance with 18.2 the pipe manufacturer shall"
      ],
      [
        "thickness."
      ],
      [
        "remove by grinding the following noninjurious imperfections:"
      ],
      [
        "17. Lengths 18.3.1 Mechanical marks and abrasions-such as cable"
      ],
      [
        "marks, dinges, guide marks, roll marks, ball scratches, scores,"
      ],
      [
        "17 .1 Pipe lengths shall be in accordance with the following and die marks-and pits, any of which imperfections are"
      ],
      [
        "regular practice: deeper than 1/16 in. [l.6 mm]."
      ],
      [
        "17 .1.1 The lengths required shall be specified in the order,"
      ],
      [
        "18.3.2 Visual imperfections commonly referred to as scabs,"
      ],
      [
        "and"
      ],
      [
        "seams, laps, tears, or slivers found by exploration in accor­"
      ],
      [
        "17 .1.2 No jointers are permitted unless otherwise specified."
      ],
      [
        "dance with 18.1 to be deeper than 5 % of the nominal wall"
      ],
      [
        "17 .1.3 If definite lengths are not required, pipe may be"
      ],
      [
        "thickness."
      ],
      [
        "ordered in single random lengths or in double random lengths"
      ],
      [
        "meeting the following requirements: 18.4 At the purchaser's discretion, pipe shall be subjected to"
      ],
      [
        "17.1.3.1 Single random lengths shall be 16 to 22 ft [4.8 to rejection if surface imperfections acceptable under 18.2 are not"
      ],
      [
        "6.7 m] in length, except that 5 % shall be permitted to be less scattered, but appear over a large area in excess of what is"
      ],
      [
        "than 16 ft [4.8 m] and none shall be less than 12 ft [3.7 m]. considered a workmanlike finish. Disposition of such pipe shall"
      ],
      [
        "17.1.3.2 Double random lengths shall have a minimum be a matter of agreement between the manufacturer and the"
      ],
      [
        "average length of 35 ft [10.7 m] and shall have a minimum purchaser."
      ],
      [
        "length of 22 ft [6.7 m], except that 5 % shall be permitted to be 18.5 When imperfections or defects are removed by"
      ],
      [
        "less than 22 ft [6.7 m] and none shall be less than 16 ft [4.8 m]. grinding, a smooth curved surface shall be maintained, and the"
      ],
      [
        "wall thickness shall not be decreased below that permitted by"
      ],
      [
        "this specification. The outside diamet()r at the point of grinding"
      ],
      [
        "TABLE 3 Variations in Outside Diameter is permitted to be reduced by the amount so removed."
      ],
      [
        "Permissible Variations in 18.5.1 Wall thickness measurements shall be made with a"
      ],
      [
        "Outside Diameter"
      ],
      [
        "mechanical caliper or with a properly calibrated nondestructive NPS [DN Designator]"
      ],
      [
        "Over Under"
      ],
      [
        "testing device of appropriate accuracy. In case of dispute, the"
      ],
      [
        "• in. mm in. mm"
      ],
      [
        "measurement determined by use of the mechanical caliper shall"
      ],
      [
        "1/s to 1 1⁄2 [6 to 40], incl 1/54 (0.015) 0.4 1/s• (0.015) 0.4"
      ],
      [
        "govern."
      ],
      [
        "Over 11⁄2 to 4 [40 to 1/s2 (0.031) 0.8 1/s2 (0.031) 0.8"
      ],
      [
        "100], incl 18.6 Weld repair shall be permitted only subject to the"
      ],
      [
        "Over 4 to 8 [100 to 1/16 (0.062) 1.6 1/s2 (0.031) 0.8"
      ],
      [
        "200], incl approval of the purchaser and in accordance with Specification"
      ],
      [
        "Over 8 to 18 [200 to %2(0.093) 2.4 1/s2 (0.031) 0.8 A530/A530M."
      ],
      [
        "450], incl"
      ],
      [
        "Over 18 to 26 [450 to 1/s (0.125) 3.2 1/s2 (0.031) 0.8 18.7 The finished pipe shall be reasonably straight."
      ],
      [
        "650], incl"
      ],
      [
        "Over 26 to 34 [650 to %2 (0.156) 4.0 1/s2 (0.031) 0.8"
      ],
      [
        "850], incl 19. End Finish"
      ],
      [
        "Over 34 to 48 [850 to o/16 (0.187) 4.8 1/s2 (0.031) 0.8"
      ]
    ]
  }
]