[
  {
    "rows": [
      [
        "cavities prepared for weld repair. The weld repair documenta­",
        "in the etched structures."
      ],
      [
        "tion shall be submitted to the purchaser at the completion of the",
        "S23.4 Castings represented by etched structures exhibiting a"
      ],
      [
        "order.",
        "network rating in excess of Severity Level 4 shall be consid­"
      ],
      [
        "",
        "ered unacceptable until further evaluations are completed. The"
      ],
      [
        "S21. Heat Treatment Furnace Record",
        ""
      ],
      [
        "",
        "acceptability of individual castings may be determined by"
      ],
      [
        "S21.1 A heat treatment chart showing time and temperature",
        "etching sections of each casting to ascertain the network"
      ],
      [
        "shall be prepared and be available for inspection by the",
        "severity ,level. Disposition of unacceptable castings shall be a"
      ],
      [
        "purchaser.",
        "matter of agreement between the manufacturer and purchaser."
      ],
      [
        "",
        "Those castings exhibiting etched severity levels greater than"
      ],
      [
        "S22. Heat Treatment",
        "four may be further evaluated by any of the following"
      ],
      [
        "S22.1 Test specimens shall be heat treated together with the",
        "agreed-upon methods:"
      ],
      [
        "castings they represent. Heat-treated specimens shall be tested",
        "S23.4.1 Fracture testing to determine the amount of \"rock"
      ],
      [
        "and shall meet the tensile and impact properties specified.",
        "candy\" structure."
      ],
      [
        "S22.2 The remaining test specimens from Supplementary",
        "S23.4.2 Mechanical testing (bend, tensile, and so forth) to"
      ],
      [
        "Requirement S22.1 representing the casting shall be treated",
        "determine the ductility characteristics."
      ],
      [
        "thermally after the final (foundry) heat treatment to simulate",
        ""
      ],
      [
        "",
        "S23.4.3 Weld testing to determine crack susceptibility in the"
      ],
      [
        "heat treatments below the critical temperature that the casting",
        ""
      ],
      [
        "",
        "heat-affected zone of a circular groove welded with cellulose"
      ],
      [
        "may receive during fabrication, and then tested for mechanical",
        ""
      ],
      [
        "",
        "coated electrodes."
      ],
      [
        "properties. Time, temperature, and cooling rate shall be as",
        ""
      ],
      [
        "stated in the order. In the case of post-weld heat treatment, the",
        "S23.5 Alternatively, by agreement, it is permissible to"
      ],
      [
        "total time at temperature or temperatures for the test material",
        "subject castings from an unacceptable heat to a high­"
      ],
      [
        "shall be at least 80 % of the total time at temperature or",
        "temperature homogenizing cycle prior to the normal produc­"
      ],
      [
        "temperatures during actual post-weld heat treatment of the",
        "tion heat treatment and subsequently macroetch test each"
      ],
      [
        "fabrication of which the casting or castings are a part. The total",
        "casting."
      ],
      [
        "time at temperature or temperatures for the test material may be",
        "S23.6 Heavy section castings (3) whose configurations are"
      ],
      [
        "performed in a single cycle. When this supplementary require­",
        "amenable to the attachment of test coupons representative of"
      ],
      [
        "ment is specified, the welding qualification test metal must be",
        "the section thickness involved and from which standard 0.505-"
      ],
      [
        "processed in the same manner.",
        "in. [12.827-mrn] diameter tension specimens may be machined"
      ],
      [
        "",
        "are exempt from this macroetch test if the results of the tension"
      ],
      [
        "S23. Macroetch Test",
        "test on the coupon after heat treatment of the casting meet the"
      ],
      [
        "S23.l Apply Supplementary Requirement SI for the spec­",
        "minimum requirements specified for the grade of steel in­"
      ],
      [
        "trographic determination and reporting of the total residual",
        "volved."
      ],
      [
        "aluminum content of all heats of ferritic and martensitic steels",
        "NoTE S23.2-For purposes of this supplementary requirement, a heavy"
      ],
      [
        "subjected to this macroetch test.",
        "section casting is defined as one having a wall thickness of 11⁄2  in."
      ],
      [
        "S23.2 When the heat analysis indicates a total residual",
        "[37 mm] or greater in combination with a casting weight of at least"
      ],
      [
        "",
        "1000 lb [455 kg]."
      ],
      [
        "aluminum content in excess of 0.08 %, the manufacturer shall",
        ""
      ],
      [
        "etch a cross section of the casting with the heaviest section for",
        ""
      ],
      [
        "",
        "S24. Specified Ferrite Content Range"
      ],
      [
        "which this supplementary requirement is invoked, or a coupon",
        ""
      ],
      [
        "attached to that heaviest section or an area directly under a riser",
        "S24.1 The chemical composition of the heat shall be con­"
      ],
      [
        "(Note S23.l). Cross sections, from a separately cast test block",
        "trolled such that the ferrite content, as determined by the"
      ],
      [
        "from the same heat and of a thickness representative of the",
        "chemical composition procedure of Practice A800/ A800M,"
      ],
      [
        "heaviest section of castings purchased under this supplemen­",
        "shall be in accordance with the specified ferrite content range."
      ],
      [
        "tary requirement, may also be used for macroetch testing. The",
        "S24.2 The specified ferrite content range shall be as agreed"
      ],
      [
        "etching shall be performed on the selected section after its heat",
        "upon between the manufacturer and the purchaser. The mini­"
      ],
      [
        "treatment, that is, after heat treatment as defined in the product",
        "mum specified ferrite content range shall be 10 %, with the"
      ],
      [
        "specification.",
        "minimum ferrite content being no lower than the percent"
      ],
      [
        "NoTE S23.1-High-strength martensitic castings, in particular, may be",
        "necessary to achieve the minimum mechanical properties"
      ]
    ]
  }
]