[
  {
    "rows": [
      [
        "applies only to pipe NPS 8 and larger in nominal size.",
        "coupons representing finished pipe made of nonmolybdenum­"
      ],
      [
        "S2.2 If a specimen from any length fails to conform to the",
        "bearing material (0.50 % and less molybdenum) shall meet the"
      ],
      [
        "tensile properties specified, that length shall be rejected.",
        "requirements Practice C of Practices A262. The condition of"
      ],
      [
        "",
        "the test specimens and the corrosion rates are as follows: Types"
      ],
      [
        "S3. Flattening Test",
        ""
      ],
      [
        "",
        "304L, 304LN, 347, and Type 348 shall be tested in the"
      ],
      [
        "S3.1 The flattening test of Specification A999/A999M shall",
        "sensitized condition (heated for 1 hat 1240 °F [670 °C]) and"
      ],
      [
        "be made on a specimen from one or both ends of each pipe.",
        "the rate of penetration shall not exceed 0.0020 in."
      ],
      [
        "Crop ends may be used. If this supplementary requirement is",
        "[0.05 mm]/2nonth. All other nonmolybdenum-bearing types,"
      ],
      [
        "specified, the number of tests per pipe shall also be specified.",
        "except for Grade TP 321, shown in Table 2 shall be tested in the"
      ],
      [
        "If a specimen from any length fails because of ductility prior to",
        "annealed and unsensitized condition and the rate of penetration"
      ],
      [
        "satisfactory completion of the first step of the flattening test",
        "when solution tested in accordance with Practice C shall not"
      ],
      [
        "requirement, that pipe shall be rejected subject to retreatment",
        "exceed 0.0015 in./month [0.038 mm/month]."
      ],
      [
        "in accordance with Specification A999/A 999M and satisfac­",
        "S7.2 Acidified Copper Sulfate Test-Coupons representing"
      ],
      [
        "tory retest. If a specimen from any length of pipe fails because",
        "finished pipe made of molybdenum-bearing material (over"
      ]
    ]
  },
  {
    "rows": []
  }
]