[
  {
    "rows": [
      [
        "ASME B18.24.",
        "in accordance with Specification B695, Class 55. All"
      ],
      [
        "",
        "mating components shall be coated by the same zinc"
      ],
      [
        "Norn 1-A typical ordering description follows: 1000 pieces Vs in.",
        ""
      ],
      [
        "",
        "coating process, and the suppliers' option shall be limited to"
      ],
      [
        "diameter x 4.0 in. long hex cap screw, Type 1, ASTM A449-XX, each",
        ""
      ],
      [
        "with one finished hex nut ASTM A563, Grade DH. Each component",
        "one process per item with no mixed processes in a lot."
      ],
      [
        "mechanically zinc coated in accordance with B695, Class 5, Type Il.",
        ""
      ],
      [
        "",
        "Norn 2-When the intended application requires that assembled"
      ],
      [
        "3.2 Suitable Nuts and Washers:",
        "tension exceeds 50 % of minimum bolt or stud proof load, an anti-galling"
      ],
      [
        "lubricant may be needed. Application of such a lubricant to nuts and a test 3.2.1 Suitable nuts are covered in Specification A563.",
        ""
      ],
      [
        "",
        "of the lubricant efficiency are provided in Supplementary Requirement S 1"
      ],
      [
        "Unless otherwise specified, the grade and style of nut shall be",
        ""
      ],
      [
        "",
        "of Specification A563 and should be specified when required."
      ],
      [
        "as follows:",
        ""
      ],
      [
        "",
        "5.2 Other Coatings:"
      ],
      [
        "Fastener Size and Surface Finish Nut Grade and StyleA",
        ""
      ],
      [
        "",
        "5.2.1 When other coatings are required, the purchaser shall"
      ],
      [
        "1⁄4 to 11 /2 in., plain (or with a coating of insufficient B, hex",
        "specify the coating specification, including the classification"
      ],
      [
        "thickness to require over-tapped nuts)",
        "codes or grade numbers to identify the coating material,"
      ],
      [
        "Over 11⁄2  to 3 in., plain (or with a coating of insuffi' A, heavy hex",
        ""
      ],
      [
        "cient thickness to require over-tapped nuts) •",
        "thickness, supplemental treatments, or other requirements to"
      ],
      [
        "1⁄4 to 3 in., zinc-coated (or with a coating thickness DH, heavy hex",
        "define the coating. The fasteners shall be coated in accordance"
      ],
      [
        "requiring over-tapped nuts)",
        "with and conform to the specified coating specification."
      ],
      [
        "1⁄4 to 3 in., Type 3 C3, DH3, heavy hex",
        ""
      ],
      [
        "",
        "5.2.2 When a specification does not apply, the purchaser"
      ],
      [
        "A Nuts of other grades and styles having specified proof load stresses (Specifica­",
        "shall specify the desired coating, coating thickness, supplemen­"
      ],
      [
        "tion A563, Table 3) greater than the specified grade and style of nut are suitable.",
        "tal treatments, or other requirements to define the coating."
      ],
      [
        "3.2.2 Unless otherwise specified, washers ordered with",
        ""
      ],
      [
        "Chemical Composition fasteners shall be furnished to the requirements of Specification",
        "6."
      ],
      [
        "F436, Type 1 or Specification F436, Type 3. Washers for A449",
        "6.1 Type 1 fasteners shall be plain carbon steel, carbon"
      ],
      [
        "Type 3 fasteners shall conform to Specification F436 Type 3.",
        "boron steel, alloy steel, or alloy boron steels, at the manufac­"
      ],
      [
        "",
        "turers option, conforming to the requirements in Table 1."
      ],
      [
        "4. Materials and Manufacture",
        ""
      ],
      [
        "",
        "6.2 Type 3 fasteners shall be weathering steel and shall"
      ],
      [
        "4.1 Heat Treatment:",
        "conform to one of the chemical compositions specified in Table"
      ],
      [
        "4.1.1 Type 1 fasteners produced from medium carbon steel",
        "2. The selection of the chemical composition, A, B, C, D, E or"
      ],
      [
        "shall be quenched in a liquid medium from the austenitizing",
        "F, shall be a the option of the manufacuturer. See Guide G 101"
      ],
      [
        "temperature.",
        "for methods of estimating the atmospheric corrosion resistance"
      ],
      [
        "4.1.2 Type 1 fasteners produced from medium carbon steel",
        "of low alloy steel."
      ],
      [
        "to which chromium, nickel, molybdenum, or boron were",
        "6.3 Product analyses made on finished fasteners represent­"
      ],
      [
        "intentionally added, and Type 3 fasteners, shall be quenched in",
        "ing each lot shall conform to the product analysis requirements"
      ],
      [
        "oil from the austenitizing temperature.",
        "specified in Table 1 or Table 2, as applicable."
      ]
    ]
  }
]