[
  {
    "rows": [
      [
        "mens. The results of product analysis shall conform to the"
      ],
      [
        "S6.1 When specified, material shall pass intergranular cor­"
      ],
      [
        "requirements in Table 1 and shall be reported to the purchaser."
      ],
      [
        "rosion tests conducted by the manufacturer in accordance with"
      ],
      [
        "S2. Radiographic Examination Practices A262, Practice E."
      ],
      [
        "S2.1 Weld soundness shall be determined through radio­ NoTE S6.1-Practice E requires testing on the sensitized condition for"
      ],
      [
        "graphic examination made in accordance with requirements as low carbon or stabilized grades, and on the as-shipped condition for other"
      ],
      [
        "grades."
      ],
      [
        "agreed upon between the pipe manufacturer and purchaser."
      ],
      [
        "S6.2 A stabilization heat treatment in accordance with"
      ],
      [
        "S3. Corrosion Requirements"
      ],
      [
        "Supplementary Requirement S5 may be necessary and is"
      ],
      [
        "S3.l Boiling Nitric Acid Test-Except for Grade TP321, permitted in order to meet this requirement for the grades"
      ],
      [
        "coupons representing finished pipe made of nonmolybdenum­"
      ],
      [
        "containing titanium or columbium."
      ],
      [
        "bearing material (0.50 % and less molybdenum) shall meet the"
      ],
      [
        "requirement of the boiling nitric acid test conducted according"
      ],
      [
        "S7. ASME Section III or Section VIII, Division 1, Code"
      ],
      [
        "to Practice C of Practices A262. The condition of the test"
      ],
      [
        "Construction"
      ],
      [
        "specimens and the corrosion rates are as follows: Type 347 and"
      ],
      [
        "Type 348 shall be tested in the sensitized condition (heated for S7 .1 All products furnished under this SA specification are"
      ],
      [
        "1 h at 1240 °F [675 °C]) and the rate of penetration shall not intended for application under the rules of Section III or for"
      ],
      [
        "exceed 0.0020 in. [0.05 mm]/month. All other application under the rules of Section VIII-1. Furnishing of"
      ],
      [
        "nonmolybdenum-bearing types, except for Grade TP321, such products is limited to manufacturers who hold the"
      ],
      [
        "shown in Table 1 shall be tested in the annealed and unsensi­ appropriate ASME Certification Mark. Weld procedures,"
      ],
      [
        "tized condition and the rate of penetration shall not exceed welders, and welding machine operators shall be qualified in"
      ],
      [
        "0.0015 in. [0.04 mm]/month. accordance with ASME Boiler and Pressure Vessel Code,"
      ],
      [
        "S3.2 Acidified Copper Sulfate Test-Coupons representing Section IX."
      ],
      [
        "finished pipe made of molybdenum-bearing material and Type"
      ],
      [
        "S7 .2 The product shall meet all applicable requirements of"
      ],
      [
        "321 (over 0.50 % molybdenum) shall meet the requirements of"
      ],
      [
        "Section III or Section VIII, Division 1, if applicable, including the copper-copper sulfate-sulfuric acid test (intergranular cor­"
      ],
      [
        "rosion test) conducted in accordance with Practice E of those requirements pertaining to heat treatment and butt welds."
      ],
      [
        "Practices A262. The condition of the test specimen is as Authorized inspection at the point of manufacture and appli­"
      ],
      [
        "follows: All molybdenum-bearing types shown in Table 1 shall cation of the appropriate Certification Mark is required."
      ],
      [
        "be tested in the annealed and unsensitized condition. Type 321 S7.3 The applicable ASME partial data report form, signed"
      ],
      [
        "shall be tested in the sensitized condition (heated for 1 h at by an authorized inspector, and a ce1tified mill test report shall"
      ],
      [
        "1240 °F [675 °C]). All specimens shall meet the requirements be furnished for each lot of pipe. The term \"lot\" applies to all"
      ],
      [
        "of the prescribed bend test. pipe of the same mill heat of material and wall thickness which"
      ],
      [
        "is heat treated in one furnace charge. For pipe which is not heat"
      ],
      [
        "S4. Ferrite Control of Weld Deposits"
      ],
      [
        "treated or which is heat treated in a continuous furnace, a lot"
      ],
      [
        "S4.l The ferrite content of the deposited weld metal in any shall consist of each 200 ft [61 m] or fraction thereof of all pipe"
      ],
      [
        "length of pipe may be determined. The procedural details"
      ],
      [
        "of the same null heat of material and wall thickness, subjected"
      ],
      [
        "pertaining to this subject (that is, welding, plate and weld"
      ],
      [
        "to the same heat treatment. For pipe which is heat treated in a"
      ],
      [
        "deposit chemistry, testing equipment and method, number and"
      ],
      [
        "batch-type furnace which is automatically controlled within a"
      ],
      [
        "location of test sites, and ferrite control limits) shall be a matter"
      ],
      [
        "50 °F range and is equipped with recording pyrometer so that"
      ],
      [
        "for agreement between the purchaser and the manufacturer."
      ],
      [
        "the heating records are available, a lot may be defined the same"
      ],
      [
        "SS. Stabilizing Heat Treatment as for continuous furnaces."
      ],
      [
        "S5.1 Subsequent to the heat treatment required in 5.3, S7.4 Each length of pipe shall be marked in such a manner"
      ]
    ]
  }
]